Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/*-vscode.js-debug.xlf
Languages: uk

# node.launch.useWSL.deprecation
source: 'useWSL' is deprecated and support for it will be dropped. Use the 'Remote - WSL' extension instead.
uk: 'useWSL' застарілий, і підтримка його буде припинена. Замість цього використовуйте розширення 'Remote - WSL'.

# base.cascadeTerminateToConfigurations.label
source: A list of debug sessions which, when this debug session is terminated, will also be stopped.
uk: Список сеансів налагодження, які, коли цей сеанс налагодження буде завершено, також будуть зупинені.

# browser.vueComponentPaths
source: A list of file glob patterns to find `*.vue` components. By default, searches the entire workspace. This needs to be specified due to extra lookups that Vue's sourcemaps require in Vue CLI 4. You can disable this special handling by setting this to an empty array.
uk: Список шаблонів глобусів файлів для знаходження `*.vue` компонентів. За замовчуванням, здійснює пошук по всьому робочому простору. Це потрібно вказати через додаткові запити, які потребують мапи джерел Vue в Vue CLI 4. Ви можете вимкнути це спеціальне оброблення, встановивши це в порожній масив.

# node.resolveSourceMapLocations.description
source: A list of minimatch patterns for locations (folders and URLs) in which source maps can be used to resolve local files. This can be used to avoid incorrectly breaking in external source mapped code. Patterns can be prefixed with "!" to exclude them. May be set to an empty array or null to avoid restriction.
uk: Список патернів minimatch для місць (папок та URL), в яких карти джерел можуть бути використані для вирішення локальних файлів. Це можна використовувати, щоб уникнути неправильного розриву в зовнішньому коді з картами джерел. Патерни можуть бути префіксовані знаком "!", щоб виключити їх. Може бути встановлено на порожній масив або null, щоб уникнути обмежень.

# node.launch.runtimeSourcemapPausePatterns
source: A list of patterns at which to manually insert entrypoint breakpoints. This can be useful to give the debugger an opportunity to set breakpoints when using sourcemaps that don't exist or can't be detected before launch, such as [with the Serverless framework](https://github.com/microsoft/vscode-js-debug/issues/492).
uk: Список шаблонів, за якими можна вручну вставити точки зупинки вхідної точки. Це може бути корисно, щоб надати відладчику можливість встановити точки зупинки при використанні sourcemaps, які не існують або не можуть бути виявлені до запуску, наприклад, [з фреймворком Serverless](https://github.com/microsoft/vscode-js-debug/issues/492).

# browser.file.description
source: A local html file to open in the browser
uk: Локальний html файл для відкриття в браузері

# browser.pathMapping.description
source: A mapping of URLs/paths to local folders, to resolve scripts in the Browser to scripts on disk
uk: Відображення URL/шляхів на локальні папки, щоб вирішити скрипти в браузері на скрипти на диску

# node.sourceMapPathOverrides.description
source: A set of mappings for rewriting the locations of source files from what the sourcemap says, to their locations on disk.
uk: Набір відображень для переписування місць розташування вихідних файлів з того, що вказує sourcemap, на їхні місця на диску.

# browser.sourceMapPathOverrides.description
source: A set of mappings for rewriting the locations of source files from what the sourcemap says, to their locations on disk. See README for details.
uk: Набір відображень для переписування місць розташування вихідних файлів з того, що вказує sourcemap, на їхні місця на диску. Дивіться README для деталей.

# extensionHost.launch.testConfigurationLabel
source: A single configuration to run from the file. If not specified, you may be asked to pick.
uk: Одна конфігурація для запуску з файлу. Якщо не вказано, вас можуть попросити вибрати.

# extensionHost.launch.runtimeExecutable.description
source: Absolute path to VS Code.
uk: Абсолютний шлях до VS Code.

# node.launch.envFile.description
source: Absolute path to a file containing environment variable definitions.
uk: Абсолютний шлях до файлу, що містить визначення змінних середовища.

# node.launch.program.description
source: Absolute path to the program. Generated value is guessed by looking at package.json and opened files. Edit this attribute.
uk: Абсолютний шлях до програми. Згенероване значення визначається шляхом аналізу package.json та відкритих файлів. Відредагуйте цей атрибут.

# node.remoteRoot.description
source: Absolute path to the remote directory containing the program.
uk: Абсолютний шлях до віддаленого каталогу, що містить програму.

# node.launch.cwd.description
source: Absolute path to the working directory of the program being debugged. If you've set localRoot then cwd will match that value otherwise it falls back to your workspaceFolder
uk: Абсолютний шлях до робочого каталогу програми, що налагоджується. Якщо ви встановили localRoot, тоді cwd відповідатиме цьому значенню, інакше він повернеться до вашого workspaceFolder.

# add.xhr.breakpoint
source: Add XHR/fetch Breakpoint
uk: Додати точку зупинки XHR/fetch

# browser.includeLaunchArgs.description
source: Advanced: whether any default launch/debugging arguments are set on the browser. The debugger will assume the browser will use pipe debugging such as that which is provided with `--remote-debugging-pipe`.
uk: Розширені: чи встановлені будь-які аргументи за замовчуванням для запуску/налагодження в браузері. Налагоджувач припустить, що браузер використовуватиме налагодження через канал, таке як те, що надається з `--remote-debugging-pipe`.

# node.versionHint.description
source: Allows you to explicitly specify the Node version that's running, which can be used to disable or enable certain behaviors in cases where the automatic version detection does not work.
uk: Дозволяє вам явно вказати версію Node, яка працює, що може бути використано для вимкнення або ввімкнення певних поведінок у випадках, коли автоматичне визначення версії не працює.

# browser.skipFiles.description
source: An array of file or folder names, or path globs, to skip when debugging. Star patterns and negations are allowed, for example, `["**/node_modules/**", "!**/node_modules/my-module/**"]`
uk: Масив імен файлів або папок, або шаблонів шляхів, які слід пропустити під час налагодження. Дозволені зіркові шаблони та заперечення, наприклад, `["**/node_modules/**", "!**/node_modules/my-module/**"]`

# skipFiles.description
source: An array of glob patterns for files to skip when debugging. The pattern `<node_internals>/**` matches all internal Node.js modules.
uk: Масив шаблонів glob для файлів, які потрібно пропустити під час налагодження. Шаблон `<node_internals>/**` відповідає всім внутрішнім модулям Node.js.

# extension.description
source: An extension for debugging Node.js programs and Chrome.
uk: Розширення для налагодження програм Node.js та Chrome.

# edge.useWebView.attach.description
source: An object containing the `pipeName` of a debug pipe for a UWP hosted Webview2. This is the "MyTestSharedMemory" when creating the pipe "\\.\pipe\LOCAL\MyTestSharedMemory"
uk: Об'єкт, що містить `pipeName` налагоджувальної труби для Webview2, розміщеного в UWP. Це "MyTestSharedMemory" під час створення труби "\\.\pipe\LOCAL\MyTestSharedMemory".

# breakpoint.xhr.any
source: Any XHR/fetch
uk: Будь-який XHR/fetch

# node.attach.config.name
source: Attach
uk: Прикріпити

# node.launch.autoAttachChildProcesses.description
source: Attach debugger to new child processes automatically.
uk: Автоматично підключати налагоджувач до нових дочірніх процесів.

# attach.node.process
source: Attach to Node Process
uk: Прикріпити до процесу вузла

# debug.terminal.attach
source: Attach to Node.js Terminal Process
uk: Приєднати до процесу терміналу Node.js

# node.processattach.config.name
source: Attach to Process
uk: Прикріпити до процесу

# node.snippet.attach.description
source: Attach to a running node program
uk: Приєднатися до запущеної програми вузла

# chrome.attach.description
source: Attach to an instance of Chrome already in debug mode
uk: Приєднатися до екземпляра Chrome, вже в режимі налагодження

# edge.attach.description
source: Attach to an instance of Edge already in debug mode
uk: Приєднатися до екземпляра Edge, вже в режимі налагодження

# node.snippet.remoteattach.description
source: Attach to the debug port of a remote node program
uk: Приєднайтеся до порту налагодження віддаленої програми вузла

# configuration.autoAttachMode.disabled
source: Auto attach is disabled and not shown in status bar.
uk: Авто прикріплення вимкнено і не відображається в панелі стану.

# configuration.autoAttachMode.always
source: Auto attach to every Node.js process launched in the terminal.
uk: Автоматичне приєднання до кожного процесу Node.js, запущеного в терміналі.

# configuration.autoAttachMode.smart
source: Auto attach when running scripts that aren't in a node_modules folder.
uk: Автоматичне приєднання під час виконання скриптів, які не знаходяться в папці node_modules.

# smartStep.description
source: Automatically step through generated code that cannot be mapped back to the original source.
uk: Автоматично проходьте через згенерований код, який не може бути відображений назад до оригінального джерела.

# browser.smartStep.description
source: Automatically step through unmapped lines in sourcemapped files. For example, code that TypeScript produces automatically when downcompiling async/await or other features.
uk: Автоматично проходити через не відображені рядки у файлах з відображенням джерела. Наприклад, код, який TypeScript генерує автоматично при зворотному компілюванні async/await або інших функцій.

# node.stopOnEntry.description
source: Automatically stop program after launch.
uk: Автоматично зупинити програму після запуску.

# extensionHost.launch.stopOnEntry.description
source: Automatically stop the extension host after launch.
uk: Автоматично зупинити хост розширення після запуску.

# browser.baseUrl.description
source: Base URL to resolve paths baseUrl. baseURL is trimmed when mapping URLs to the files on disk. Defaults to the launch URL domain.
uk: Базовий URL для вирішення шляхів baseUrl. baseURL обрізається при відображенні URL-адрес на файли на диску. За замовчуванням використовується домен URL-адреси запуску.

# breakpoint.xhr.contains
source: Break when URL contains:
uk: Перервати, коли URL містить:

# browser.userDataDir.description
source: By default, the browser is launched with a separate user profile in a temp folder. Use this option to override it. Set to false to launch with your default user profile. A new browser can't be launched if an instance is already running from `userDataDir`.
uk: За замовчуванням браузер запускається з окремим профілем користувача в тимчасовій папці. Використовуйте цю опцію, щоб переоприділити це. Встановіть значення false, щоб запустити з вашим профілем користувача за замовчуванням. Новий браузер не може бути запущений, якщо екземпляр вже працює з `userDataDir`.

# extensionHost.launch.rendererDebugOptions
source: Chrome launch options used when attaching to the renderer process, with `debugWebviews` or `debugWebWorkerHost`.
uk: Опції запуску Chrome, що використовуються при підключенні до процесу рендерингу, з `debugWebviews` або `debugWebWorkerHost`.

# chrome.attach.label
source: Chrome: Attach
uk: Chrome: Прикріпити

# chrome.launch.label
source: Chrome: Launch
uk: Chrome: Запустити

# commands.networkClear.label
source: Clear Network Log
uk: Очистити мережевий журнал

# node.launch.args.description
source: Command line arguments passed to the program. Can be an array of strings or a single string. When the program is launched in a terminal, setting this property to a single string will result in the arguments not being escaped for the shell.
uk: Аргументи командного рядка, передані програмі. Можуть бути масивом рядків або єдиним рядком. Коли програма запускається в терміналі, встановлення цієї властивості в єдиний рядок призведе до того, що аргументи не будуть екрановані для оболонки.

# debug.terminal.program.description
source: Command to run in the launched terminal. If not provided, the terminal will open without launching a program.
uk: Команда для виконання в запущеному терміналі. Якщо не вказано, термінал відкриється без запуску програми.

# browser.server.description
source: Configures a web server to start up. Takes the same configuration as the 'node' launch task.
uk: Налаштовує веб-сервер для запуску. Використовує таку ж конфігурацію, як і завдання запуску 'node'.

# configuration.autoAttachSmartPatterns
source: Configures glob patterns for determining when to attach in "smart" `#debug.javascript.autoAttachFilter#` mode. `$KNOWN_TOOLS$` is replaced with a list of names of common test and code runners. [Read more on the VS Code docs](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).
uk: Налаштовує глобальні шаблони для визначення, коли приєднуватися в "розумному" `#debug.javascript.autoAttachFilter#` режимі. `$KNOWN_TOOLS$` замінюється списком назв загальних тестових та кодових запусків. [Читати більше в документації VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).

# browser.killBehavior.description
source: Configures how browser processes are killed when stopping the session with `cleanUp: wholeBrowser`. Can be: - forceful (default): forcefully tears down the process tree. Sends SIGKILL on posix, or `taskkill.exe /F` on Windows. - polite: gracefully tears down the process tree. It's possible that misbehaving processes continue to run after shutdown in this way. Sends SIGTERM on posix, or `taskkill.exe` with no `/F` (force) flag on Windows. - none: no termination will happen.
uk: Налаштовує, як браузерні процеси зупиняються при завершенні сесії з `cleanUp: wholeBrowser`. Може бути: - примусовим (за замовчуванням): примусово знищує дерево процесів. Надсилає SIGKILL на posix або `taskkill.exe /F` на Windows. - ввічливим: коректно знищує дерево процесів. Можливо, що неправильно працюючі процеси продовжать виконання після завершення в такий спосіб. Надсилає SIGTERM на posix або `taskkill.exe` без прапора `/F` (примус) на Windows. - жодного: жодне завершення не відбудеться.

# node.killBehavior.description
source: Configures how debug processes are killed when stopping the session. Can be: - forceful (default): forcefully tears down the process tree. Sends SIGKILL on posix, or `taskkill.exe /F` on Windows. - polite: gracefully tears down the process tree. It's possible that misbehaving processes continue to run after shutdown in this way. Sends SIGTERM on posix, or `taskkill.exe` with no `/F` (force) flag on Windows. - none: no termination will happen.
uk: Налаштовує, як процеси налагодження зупиняються при завершенні сеансу. Може бути: - примусовим (за замовчуванням): примусово знищує дерево процесів. Надсилає SIGKILL на posix або `taskkill.exe /F` на Windows. - ввічливим: м’яко знищує дерево процесів. Можливо, що некоректно працюючі процеси продовжать виконуватись після завершення таким чином. Надсилає SIGTERM на posix або `taskkill.exe` без прапора `/F` (примус) на Windows. - жодного: жодного завершення не відбудеться.

# trace.description
source: Configures what diagnostic output is produced.
uk: Налаштовує, який діагностичний вивід буде створено.

# trace.logFile.description
source: Configures where on disk logs are written.
uk: Налаштовує, де на диску записуються журнали.

# configuration.unmapMissingSources
source: Configures whether sourcemapped file where the original file can't be read will automatically be unmapped. If this is false (default), a prompt is shown.
uk: Налаштовує, чи буде автоматично знято мапування з файлу з мапуванням джерела, якщо оригінальний файл не може бути прочитаний. Якщо це значення false (за замовчуванням), відображається запит.

# node.enableTurboSourcemaps.description
source: Configures whether to use a new, faster mechanism for sourcemap discovery
uk: Налаштовує, чи використовувати новий, швидший механізм для виявлення sourcemap

# extensionHost.launch.debugWebWorkerHost
source: Configures whether we should try to attach to the web worker extension host.
uk: Налаштовує, чи слід намагатися підключитися до хоста розширення веб-робітника.

# extensionHost.launch.debugWebviews
source: Configures whether we should try to attach to webviews in the launched VS Code instance. This will only work in desktop VS Code.
uk: Налаштовує, чи слід намагатися підключитися до веб-переглядів у запущеному екземплярі VS Code. Це буде працювати лише в настільному VS Code.

# configuration.autoAttachMode
source: Configures which processes to automatically attach and debug when `#debug.node.autoAttach#` is on. A Node process launched with the `--inspect` flag will always be attached to, regardless of this setting.
uk: Налаштовує, які процеси автоматично підключати та налагоджувати, коли `#debug.node.autoAttach#` увімкнено. Процес Node, запущений з прапором `--inspect`, завжди буде підключений, незалежно від цього налаштування.

# browser.disableNetworkCache.description
source: Controls whether to skip the network cache for each request
uk: Контролює, чи пропускати мережевий кеш для кожного запиту

# commands.networkCopyURI.label
source: Copy Request URL
uk: Скопіювати URL запиту

# debug.npm.parseError
source: Could not read {0}: {1}
uk: Не вдалося прочитати {0}: {1}

# customPropertiesGenerator.description
source: Customize the properties shown for an object in the debugger (local variables, etc...). Samples: 1. { ...this, extraProperty: '12345' } // Add an extraProperty 12345 to all objects 2. this.customProperties ? this.customProperties() : this // Use customProperties method if available, if not use the properties in this (the default properties) 3. function () { return this.customProperties ? this.customProperties() : this } // Use customDescription method if available, if not return the default properties Deprecated: This is a temporary implementation of this feature until we have time to implement it in the way described here: https://github.com/microsoft/vscode/issues/102181
uk: Налаштуйте властивості, які відображаються для об'єкта в налагоджувачі (локальні змінні тощо...). Приклади: 1. { ...this, extraProperty: '12345' } // Додати extraProperty 12345 до всіх об'єктів 2. this.customProperties ? this.customProperties() : this // Використовуйте метод customProperties, якщо він доступний, якщо ні - використовуйте властивості в this (за замовчуванням) 3. function () { return this.customProperties ? this.customProperties() : this } // Використовуйте метод customDescription, якщо він доступний, якщо ні - поверніть властивості за замовчуванням Застаріло: Це тимчасова реалізація цієї функції, поки ми не матимемо часу реалізувати її в спосіб, описаний тут: https://github.com/microsoft/vscode/issues/102181

# customDescriptionGenerator.description
source: Customize the textual description the debugger shows for objects (local variables, etc...). Samples: 1. this.toString() // will call toString to print all objects 2. this.customDescription ? this.customDescription() : defaultValue // Use customDescription method if available, if not return defaultValue 3. function (def) { return this.customDescription ? this.customDescription() : def } // Use customDescription method if available, if not return defaultValue
uk: Налаштуйте текстовий опис, який відображає відладчик для об'єктів (локальних змінних тощо...). Приклади: 1. this.toString() // викликає toString для виведення всіх об'єктів 2. this.customDescription ? this.customDescription() : defaultValue // Використовуйте метод customDescription, якщо він доступний, якщо ні - поверніть defaultValue 3. function (def) { return this.customDescription ? this.customDescription() : def } // Використовуйте метод customDescription, якщо він доступний, якщо ні - поверніть defaultValue

# node.snippet.gulp.description
source: Debug gulp task (make sure to have a local gulp installed in your project)
uk: Налагодження задачі gulp (переконайтеся, що у вашому проєкті встановлено локальний gulp)

# node.snippet.mocha.description
source: Debug mocha tests
uk: Відлагодження тестів mocha

source: Debug npm Script
uk: Налагодження npm скрипту

# node.port.description
source: Debug port to attach to. Default is 9229.
uk: Порт налагодження для підключення. За замовчуванням 9229.

# node.snippet.electron.description
source: Debug the Electron main process
uk: Відлагоджуйте основний процес Electron

# node.snippet.yo.description
source: Debug yeoman generator (install by running `npm link` in project folder)
uk: Відлагодьте генератор yeoman (встановіть, запустивши `npm link` у папці проекту)

# configuration.terminalOptions
source: Default launch options for the JavaScript debug terminal and npm scripts.
uk: Параметри запуску за замовчуванням для терміналу налагодження JavaScript та скриптів npm.

# configuration.pickAndAttachOptions
source: Default options used when debugging a process through the `Debug: Attach to Node.js Process` command
uk: Параметри за замовчуванням, що використовуються під час налагодження процесу через команду `Debug: Attach to Node.js Process`

# createDiagnostics.label
source: Diagnose Breakpoint Problems
uk: Діагностика проблем з точками зупинки

# commands.disableSourceMapStepping.label
source: Disable Source Mapped Stepping
uk: Вимкнути крокування з відображенням джерела

# node.disableOptimisticBPs.description
source: Don't set breakpoints in any file until a sourcemap has been loaded for that file.
uk: Не встановлюйте точки зупинки в жодному файлі, поки для цього файлу не буде завантажено sourcemap.

# longPredictionWarning.disable
source: Don't show again
uk: Не показувати знову

# edge.attach.label
source: Edge: Attach
uk: Edge: Прикріпити

# edge.launch.label
source: Edge: Launch
uk: Edge: Запустити

# edit.xhr.breakpoint
source: Edit XHR/fetch Breakpoint
uk: Редагувати точку зупинки XHR/fetch

# debug.npm.edit
source: Edit package.json
uk: Редагувати package.json

# browser.runtimeExecutable.description
source: Either 'canary', 'stable', 'custom' or path to the browser executable. Custom means a custom wrapper, custom build or CHROME_PATH environment variable.
uk: Може бути 'canary', 'stable', 'custom' або шлях до виконуваного файлу браузера. Custom означає кастомний обгортку, кастомну збірку або змінну середовища CHROME_PATH.

# browser.runtimeExecutable.edge.description
source: Either 'canary', 'stable', 'dev', 'custom' or path to the browser executable. Custom means a custom wrapper, custom build or EDGE_PATH environment variable.
uk: Може бути 'canary', 'stable', 'dev', 'custom' або шлях до виконуваного файлу браузера. Custom означає кастомний обгортку, кастомну збірку або змінну середовища EDGE_PATH.

# commands.enableSourceMapStepping.label
source: Enable Source Mapped Stepping
uk: Увімкнути крокування з відображенням джерела

# node.experimentalNetworking.description
source: Enable experimental inspection in Node.js. When set to `auto` this is enabled for versions of Node.js that support it. It can be set to `on` or `off` to enable or disable it explicitly.
uk: Увімкніть експериментальну перевірку в Node.js. Коли встановлено `auto`, це увімкнено для версій Node.js, які це підтримують. Його можна встановити на `on` або `off`, щоб увімкнути або вимкнути його явно.

# configuration.enableNetworkView
source: Enables the experimental network view for targets that support it.
uk: Увімкнення експериментального мережевого вигляду для цілей, які його підтримують.

# extensionHost.launch.env.description
source: Environment variables passed to the extension host.
uk: Змінні середовища, передані хосту розширення.
