Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/*-vscode.js-debug.xlf
Languages: uk

# edge.port.description
source: When debugging webviews, the port the webview debugger is listening on. Will be automatically discovered if not set.
uk: Під час налагодження веб-переглядів порт, на якому слухає налагоджувач веб-переглядів. Буде автоматично виявлений, якщо не встановлено.

# configuration.npmScriptLensLocation
source: Where a "Run" and "Debug" code lens should be shown in your npm scripts. It may be on "all", scripts, on "top" of the script section, or "never".
uk: Де слід відображати кодові лінзи "Запустити" та "Відлагодити" у ваших npm-скриптах. Це може бути на "всіх" скриптах, "вгорі" секції скриптів або "ніколи".

# node.launch.console.description
source: Where to launch the debug target.
uk: Де запустити ціль налагодження.

# browser.includeDefaultArgs.description
source: Whether default browser launch arguments (to disable features that may make debugging harder) will be included in the launch.
uk: Чи будуть включені аргументи запуску браузера за замовчуванням (для відключення функцій, які можуть ускладнити налагодження) у запуск.

# browser.perScriptSourcemaps.description
source: Whether scripts are loaded individually with unique sourcemaps containing the basename of the source file. This can be set to optimize sourcemap handling when dealing with lots of small scripts. If set to "auto", we'll detect known cases where this is appropriate.
uk: Чи завантажуються скрипти окремо з унікальними sourcemaps, що містять базову назву вихідного файлу. Це можна налаштувати для оптимізації обробки sourcemap при роботі з великою кількістю малих скриптів. Якщо встановлено "auto", ми виявимо відомі випадки, коли це доречно.

# browser.targetSelection
source: Whether to attach to all targets that match the URL filter ("automatic") or ask to pick one ("pick").
uk: Чи прикріпити до всіх цілей, які відповідають фільтру URL ("автоматично"), чи запитати вибрати одну ("вибрати").

# node.attach.attachExistingChildren.description
source: Whether to attempt to attach to already-spawned child processes.
uk: Чи намагатися приєднатися до вже створених дочірніх процесів.

# browser.restart
source: Whether to reconnect if the browser connection is closed
uk: Чи підключитися знову, якщо з'єднання браузера закрито

# trace.stdio.description
source: Whether to return trace data from the launched application or browser.
uk: Чи повертати дані трасування з запущеного додатку або браузера.

# node.attach.attachSpawnedProcesses.description
source: Whether to set environment variables in the attached process to track spawned children.
uk: Чи встановлювати змінні середовища в прикріпленому процесі для відстеження створених дочірніх процесів.

# configuration.breakOnConditionalError
source: Whether to stop when conditional breakpoints throw an error.
uk: Чи зупинятися, коли умовні точки зупинки викликають помилку.

# browser.sourceMapRenames.description
source: Whether to use the "names" mapping in sourcemaps. This requires requesting source content, which can be slow with certain debuggers.
uk: Чи використовувати відображення "names" у sourcemaps. Це вимагає запиту на отримання вихідного контенту, що може бути повільним з певними налагоджувачами.

# node.pauseForSourceMap.description
source: Whether to wait for source maps to load for each incoming script. This has a performance overhead, and might be safely disabled when running off of disk, so long as `rootPath` is not disabled.
uk: Чи чекати на завантаження карт джерел для кожного вхідного скрипта. Це має накладні витрати на продуктивність і може бути безпечно вимкнено при виконанні з диска, якщо `rootPath` не вимкнено.

# browser.urlFilter.description
source: Will search for a page with this url and attach to it, if found. Can have * wildcards.
uk: Шукатиме сторінку з цим URL і прикріпить до неї, якщо знайде. Можуть бути * підстановочні знаки.

# browser.url.description
source: Will search for a tab with this exact url and attach to it, if found
uk: Шукатиме вкладку з цим точним URL і приєднається до неї, якщо буде знайдена

# debug.npm.noWorkspaceFolder
source: You need to open a workspace folder to debug npm scripts.
uk: Вам потрібно відкрити папку робочого простору, щоб налагодити npm скрипти.

# debug.terminal.welcome
source: [JavaScript Debug Terminal](command:extension.js-debug.createDebuggerTerminal) You can use the JavaScript Debug Terminal to debug Node.js processes run on the command line.
uk: [Термінал налагодження JavaScript](command:extension.js-debug.createDebuggerTerminal) Ви можете використовувати Термінал налагодження JavaScript для налагодження процесів Node.js, що виконуються в командному рядку.

# debug.terminal.welcomeWithLink
source: [JavaScript Debug Terminal](command:extension.js-debug.createDebuggerTerminal) You can use the JavaScript Debug Terminal to debug Node.js processes run on the command line. [Debug URL](command:extension.js-debug.debugLink)
uk: [Термінал налагодження JavaScript](command:extension.js-debug.createDebuggerTerminal) Ви можете використовувати Термінал налагодження JavaScript для налагодження процесів Node.js, які виконуються в командному рядку. [Налагодити URL](command:extension.js-debug.debugLink)

# errors.timeout
source: {0}: timeout after {1}ms
uk: {0}: тайм-аут після {1}мс
