Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/*-vscode.js-debug.xlf
Languages: uk

# node.launch.env.description
source: Environment variables passed to the program. The value `null` removes the variable from the environment.
uk: Змінні середовища, передані програмі. Значення `null` видаляє змінну з середовища.

# node.websocket.address.description
source: Exact websocket address to attach to. If unspecified, it will be discovered from the address and port.
uk: Точна адреса вебсокета для підключення. Якщо не вказано, вона буде виявлена з адреси та порту.

# commands.callersAdd.label
source: Exclude Caller
uk: Виключити викликач

# commands.callersAdd.paletteLabel
source: Exclude caller from pausing in the current location
uk: Виключити абонента з паузи в поточному місці

# node.remote.host.header.description
source: Explicit Host header to use when connecting to the websocket of inspector. If unspecified, the host header will be set to 'localhost'. This is useful when the inspector is running behind a proxy that only accept particular Host header.
uk: Явний заголовок Host, який слід використовувати при підключенні до вебсокета інспектора. Якщо не вказано, заголовок host буде встановлено на 'localhost'. Це корисно, коли інспектор працює за проксі, який приймає лише певний заголовок Host.

# node.launch.console.externalTerminal.description
source: External terminal that can be configured via user settings
uk: Зовнішній термінал, який можна налаштувати через налаштування користувача

# timeouts.sourceMaps.sourceMapCumulativePause.description
source: Extra time in milliseconds allowed per session to be spent waiting for source-maps to be processed, after the minimum time (sourceMapMinPause) has been exhausted
uk: Додатковий час у мілісекундах, дозволений за сесію для очікування обробки source-map, після того як мінімальний час (sourceMapMinPause) буде вичерпано

# browser.revealPage
source: Focus Tab
uk: Вкладка Фокус

# browser.browserAttachLocation.description
source: Forces the browser to attach in one location. In a remote workspace (through ssh or WSL, for example) this can be used to attach to a browser on the remote machine rather than locally.
uk: Примушує браузер підключатися в одному місці. У віддаленому робочому просторі (через ssh або WSL, наприклад) це можна використовувати для підключення до браузера на віддаленій машині, а не локально.

# browser.browserLaunchLocation.description
source: Forces the browser to be launched in one location. In a remote workspace (through ssh or WSL, for example) this can be used to open the browser on the remote machine rather than locally.
uk: Примушує браузер запускатися в одному місці. У віддаленому робочому просторі (наприклад, через ssh або WSL) це можна використовувати для відкриття браузера на віддаленій машині, а не локально.

# browser.inspectUri.description
source: Format to use to rewrite the inspectUri: It's a template string that interpolates keys in `{curlyBraces}`. Available keys are: - `url.*` is the parsed address of the running application. For instance, `{url.port}`, `{url.hostname}` - `port` is the debug port that Chrome is listening on. - `browserInspectUri` is the inspector URI on the launched browser - `browserInspectUriPath` is the path part of the inspector URI on the launched browser (e.g.: "/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2"). - `wsProtocol` is the hinted websocket protocol. This is set to `wss` if the original URL is `https`, or `ws` otherwise.
uk: Формат, який потрібно використовувати для переписування inspectUri: Це шаблонний рядок, який інтерполює ключі в `{curlyBraces}`. Доступні ключі: - `url.*` - це розпарсена адреса запущеного застосунку. Наприклад, `{url.port}`, `{url.hostname}` - `port` - це порт налагодження, на якому слухає Chrome. - `browserInspectUri` - це URI інспектора на запущеному браузері. - `browserInspectUriPath` - це частина шляху URI інспектора на запущеному браузері (наприклад: "/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2"). - `wsProtocol` - це вказаний протокол вебсокетів. Це встановлюється на `wss`, якщо оригінальна URL-адреса є `https`, або `ws` в іншому випадку.

# node.launch.outputCapture.description
source: From where to capture output messages: the default debug API if set to `console`, or stdout/stderr streams if set to `std`.
uk: Звідки захоплювати вихідні повідомлення: за замовчуванням API налагодження, якщо встановлено `console`, або потоки stdout/stderr, якщо встановлено `std`.

# commands.callersGoToCaller.label
source: Go to caller location
uk: Перейти до місця виклику

# commands.callersGoToTarget.label
source: Go to target location
uk: Перейти до цільового місця

# node.attach.processId.description
source: ID of process to attach to.
uk: ID процесу, до якого потрібно приєднатися.

# browser.address.description
source: IP address or hostname the debugged browser is listening on.
uk: IP-адреса або ім'я хоста, на якому слухає налагоджений браузер.

# node.attachSimplePort.description
source: If set, attaches to the process via the given port. This is generally no longer necessary for Node.js programs and loses the ability to debug child processes, but can be useful in more esoteric scenarios such as with Deno and Docker launches. If set to 0, a random port will be chosen and --inspect-brk added to the launch arguments automatically.
uk: Якщо встановлено, приєднується до процесу через вказаний порт. Це зазвичай більше не є необхідним для програм Node.js і втрачає можливість налагодження дочірніх процесів, але може бути корисним у більш екзотичних сценаріях, таких як запуск з Deno та Docker. Якщо встановлено на 0, буде вибрано випадковий порт, і --inspect-brk буде автоматично додано до аргументів запуску.

# outFiles.description
source: If source maps are enabled, these glob patterns specify the generated JavaScript files. If a pattern starts with `!` the files are excluded. If not specified, the generated code is expected in the same directory as its source.
uk: Якщо карти джерел увімкнені, ці шаблони glob вказують на згенеровані файли JavaScript. Якщо шаблон починається з `!`, файли виключаються. Якщо не вказано, згенерований код очікується в тому ж каталозі, що й його джерело.

# node.attach.continueOnAttach
source: If true, we'll automatically resume programs launched and waiting on `--inspect-brk`
uk: Якщо це правда, ми автоматично відновимо програми, які були запущені та чекають на `--inspect-brk`

# node.profileStartup.description
source: If true, will start profiling as soon as the process launches
uk: Якщо це правда, почне профілювання, як тільки процес запуститься

# browser.profileStartup.description
source: If true, will start profiling soon as the process launches
uk: Якщо це правда, почнемо профілювання, як тільки процес запуститься

# longPredictionWarning.message
source: It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.
uk: Налаштування ваших точок зупинки займає деякий час. Ви можете прискорити цей процес, оновивши 'outFiles' у вашому launch.json.

# debug.terminal.label
source: JavaScript Debug Terminal
uk: Термінал налагодження JavaScript

# node.launch.config.name
source: Launch
uk: Запустити

# chrome.launch.description
source: Launch Chrome to debug a URL
uk: Запустіть Chrome для налагодження URL

# edge.launch.description
source: Launch Edge to debug a URL
uk: Запустіть Edge для налагодження URL

# extensionHost.launch.config.name
source: Launch Extension
uk: Запустити розширення

# extensionHost.snippet.launch.description
source: Launch a VS Code extension in debug mode
uk: Запустіть розширення VS Code в режимі налагодження

# node.snippet.launch.description
source: Launch a node program in debug mode
uk: Запустіть програму вузла в режимі налагодження

# node.snippet.npm.description
source: Launch a node program through an npm `debug` script
uk: Запустіть програму вузла через скрипт `debug` npm

# node.launch.logging
source: Logging configuration
uk: Конфігурація журналювання

# timeouts.sourceMaps.sourceMapMinPause.description
source: Minimum time in milliseconds spent waiting for each source-map to be processed when a script is being parsed
uk: Мінімальний час у мілісекундах, витрачений на очікування обробки кожної source-map під час парсингу скрипта

# debug.npm.noScripts
source: No npm scripts found in your package.json
uk: Не знайдено npm-скриптів у вашому package.json

# longPredictionWarning.noFolder
source: No workspace folder open.
uk: Немає відкритої папки робочого простору.

# node.console.title
source: Node Debug Console
uk: Консоль налагодження Node

# node.snippet.attach.label
source: Node.js: Attach
uk: Node.js: Прикріпити

# node.snippet.attachProcess.label
source: Node.js: Attach to Process
uk: Node.js: Приєднатися до процесу

# node.snippet.remoteattach.label
source: Node.js: Attach to Remote Program
uk: Node.js: Підключитися до віддаленої програми

# node.snippet.electron.label
source: Node.js: Electron Main
uk: Node.js: Головний процес Electron

# node.snippet.gulp.label
source: Node.js: Gulp task
uk: Node.js: Завдання Gulp

# node.snippet.launch.label
source: Node.js: Launch Program
uk: Node.js: Запустити програму

# node.snippet.npm.label
source: Node.js: Launch via npm
uk: Node.js: Запуск через npm

# node.snippet.mocha.label
source: Node.js: Mocha Tests
uk: Node.js: Тести Mocha

# node.snippet.nodemon.label
source: Node.js: Nodemon Setup
uk: Node.js: Налаштування Nodemon

# node.snippet.yo.label
source: Node.js: Yeoman generator
uk: Node.js: генератор Yeoman

# configuration.autoAttachMode.explicit
source: Only auto attach when the `--inspect` is given.
uk: Автоматичне приєднання лише тоді, коли вказано `--inspect`.

# openEdgeDevTools.label
source: Open Browser Devtools
uk: Відкрити інструменти розробника браузера

# debugLink.label
source: Open Link
uk: Відкрити посилання

# commands.networkOpenBody.label
source: Open Response Body
uk: Відкрити тіло відповіді

# commands.networkOpenBodyInHexEditor.label
source: Open Response Body in Hex Editor
uk: Відкрити тіло відповіді в Hex редакторі

# longPredictionWarning.open
source: Open launch.json
uk: Відкрити launch.json

# node.snippet.attachProcess.description
source: Open process picker to select node process to attach to
uk: Відкрийте вибір процесу, щоб вибрати процес вузла для підключення

# node.launch.runtimeArgs.description
source: Optional arguments passed to the runtime executable.
uk: Необов'язкові аргументи, передані виконуваному файлу часу виконання.

# browser.runtimeArgs.description
source: Optional arguments passed to the runtime executable.
uk: Необов'язкові аргументи, передані виконуваному файлу часу виконання.

# browser.env.description
source: Optional dictionary of environment key/value pairs for the browser.
uk: Необов'язковий словник пар ключ/значення для середовища браузера.

# browser.cwd.description
source: Optional working directory for the runtime executable.
uk: Необов'язкова робоча директорія для виконуваного файлу під час виконання.

# configuration.debugByLinkOptions
source: Options used when debugging open links clicked from inside the JavaScript Debug Terminal. Can be set to "off" to disable this behavior, or "always" to enable debugging in all terminals.
uk: Опції, що використовуються під час налагодження відкритих посилань, на які натискають зсередини терміналу налагодження JavaScript. Можна встановити на "вимкнено", щоб вимкнути цю поведінку, або "завжди", щоб увімкнути налагодження в усіх терміналах.

# extensionHost.launch.testConfiguration
source: Path to a test configuration file for the [test CLI](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).
uk: Шлях до файлу конфігурації тесту для [test CLI](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).

# node.localRoot.description
source: Path to the local directory containing the program.
uk: Шлях до локального каталогу, що містить програму.

# node.launch.logging.cdp
source: Path to the log file for Chrome DevTools Protocol messages
uk: Шлях до файлу журналу для повідомлень протоколу Chrome DevTools

# node.launch.logging.dap
source: Path to the log file for Debug Adapter Protocol messages
uk: Шлях до файлу журналу для повідомлень протоколу адаптера налагодження

# browser.launch.port.description
source: Port for the browser to listen on. Defaults to "0", which will cause the browser to be debugged via pipes, which is generally more secure and should be chosen unless you need to attach to the browser from another tool.
uk: Порт, на якому браузер буде слухати. За замовчуванням - "0", що призведе до налагодження браузера через канали, що зазвичай є більш безпечним і має бути обрано, якщо вам не потрібно підключатися до браузера з іншого інструменту.

# browser.attach.port.description
source: Port to use to remote debugging the browser, given as `--remote-debugging-port` when launching the browser.
uk: Порт, який використовувати для віддаленого налагодження браузера, вказується як `--remote-debugging-port` під час запуску браузера.

# pretty.print.script
source: Pretty print for debugging
uk: Красива друкована версія для налагодження

# remove.eventListener.breakpoint.all
source: Remove All Event Listener Breakpoints
uk: Видалити всі точки зупинки слухача подій

# remove.xhr.breakpoint.all
source: Remove All XHR/fetch Breakpoints
uk: Видалити всі точки зупинки XHR/fetch

# remove.xhr.breakpoint
source: Remove XHR/fetch Breakpoint
uk: Видалити XHR/fetch Точка зупинки

# commands.callersRemoveAll.label
source: Remove all excluded callers
uk: Видалити всіх виключених абонентів

# commands.callersRemove.label
source: Remove excluded caller
uk: Видалити виключеного абонента

# commands.networkReplayXHR.label
source: Replay Request
uk: Запит на повтор

# requestCDPProxy.label
source: Request CDP Proxy for Debug Session
uk: Запитати CDP Proxy для сесії налагодження

# configuration.resourceRequestOptions
source: Request options to use when loading resources, such as source maps, in the debugger. You may need to configure this if your sourcemaps require authentication or use a self-signed certificate, for instance. Options are used to create a request using the [`got`](https://github.com/sindresorhus/got) library. A common case to disable certificate verification can be done by passing `{ "https": { "rejectUnauthorized": false } }`.
uk: Запитати параметри для використання при завантаженні ресурсів, таких як карти джерел, у налагоджувачі. Можливо, вам потрібно буде налаштувати це, якщо ваші карти джерел вимагають автентифікації або використовують самопідписаний сертифікат, наприклад. Параметри використовуються для створення запиту за допомогою бібліотеки [`got`](https://github.com/sindresorhus/got). Звичайний випадок для вимкнення перевірки сертифіката можна реалізувати, передавши `{ "https": { "rejectUnauthorized": false } }`.

# node.timeout.description
source: Retry for this number of milliseconds to connect to Node.js. Default is 10000 ms.
uk: Спробуйте знову протягом цього числа мілісекунд для підключення до Node.js. За замовчуванням 10000 мс.

# browser.timeout.description
source: Retry for this number of milliseconds to connect to the browser. Default is 10000 ms.
uk: Спробуйте знову протягом цього часу в мілісекундах, щоб підключитися до браузера. За замовчуванням 10000 мс.

# debug.terminal.snippet.label
source: Run "npm start" in a debug terminal
uk: Запустіть "npm start" у терміналі налагодження

# node.launch.runtimeExecutable.description
source: Runtime to use. Either an absolute path or the name of a runtime available on the PATH. If omitted `node` is assumed.
uk: Час виконання для використання. Або абсолютний шлях, або ім'я часу виконання, доступного в PATH. Якщо пропущено, вважається, що використовується `node`.

# getDiagnosticLogs.label
source: Save Diagnostic JS Debug Logs
uk: Зберегти журнали налагодження JS діагностики

# node.showAsyncStacks.description
source: Show the async calls that led to the current call stack.
uk: Показати асинхронні виклики, які призвели до поточного стеку викликів.

# debug.unverifiedBreakpoints
source: Some of your breakpoints could not be set. If you're having an issue, you can [troubleshoot your launch configuration](command:extension.js-debug.createDiagnostics).
uk: Деякі з ваших точок зупинки не можуть бути встановлені. Якщо у вас виникає проблема, ви можете [усунути неполадки у вашій конфігурації запуску](command:extension.js-debug.createDiagnostics).

# startWithStopOnEntry.label
source: Start Debugging and Stop on Entry
uk: Почати налагодження та зупинитися на вході

# start.with.stop.on.entry
source: Start Debugging and Stop on Entry
uk: Почати налагодження та зупинитися на вході

# profile.stop
source: Stop Performance Profile
uk: Зупинити профіль продуктивності

# node.address.description
source: TCP/IP address of process to be debugged. Default is 'localhost'.
uk: TCP/IP адреса процесу, який потрібно налагодити. За замовчуванням 'localhost'.

# profile.start
source: Take Performance Profile
uk: Взяти профіль продуктивності

# configuration.defaultRuntimeExecutables
source: The default `runtimeExecutable` used for launch configurations, if unspecified. This can be used to config custom paths to Node.js or browser installations.
uk: За замовчуванням `runtimeExecutable`, що використовується для конфігурацій запуску, якщо не вказано. Це можна використовувати для налаштування користувацьких шляхів до установок Node.js або браузера.

# browser.webRoot.description
source: This specifies the workspace absolute path to the webserver root. Used to resolve paths like `/app.js` to files on disk. Shorthand for a pathMapping for "/"
uk: Це вказує абсолютний шлях до кореня веб-сервера в робочому просторі. Використовується для вирішення шляхів, таких як `/app.js`, до файлів на диску. Скорочення для pathMapping для "/"

# timeouts.hoverEvaluation.description
source: Time until value evaluation for hovered symbols is aborted. If set to 0, hover evaluation does never time out.
uk: Час до оцінки значення для символів, на які наведено курсор, скасовується. Якщо встановлено 0, оцінка при наведенні ніколи не закінчується.

# timeouts.generalDescription
source: Timeouts for several debugger operations.
uk: Тайм-аути для кількох операцій налагодження.

# timeouts.generalDescription.markdown
source: Timeouts for several debugger operations.
uk: Таймаути для кількох операцій налагоджувача.

# timeouts.sourceMaps.description
source: Timeouts related to source maps operations.
uk: Таймаути, пов'язані з операціями карт джерел.

# add.eventListener.breakpoint
source: Toggle Event Listener Breakpoints
uk: Перемикання точок зупинки слухача подій

source: Toggle Skipping this File
uk: Переключити пропуск цього файлу

# debug.terminal.toggleAuto
source: Toggle Terminal Node.js Auto Attach
uk: Перемикання автоматичного підключення до терміналу Node.js

# base.enableDWARF.label
source: Toggles whether the debugger will try to read DWARF debug symbols from WebAssembly, which can be resource intensive. Requires the `ms-vscode.wasm-dwarf-debugging` extension to function.
uk: Перемикає, чи буде відладчик намагатися зчитувати символи налагодження DWARF з WebAssembly, що може вимагати багато ресурсів. Для роботи потрібен розширення `ms-vscode.wasm-dwarf-debugging`.

# enableContentValidation.description
source: Toggles whether we verify the contents of files on disk match the ones loaded in the runtime. This is useful in a variety of scenarios and required in some, but can cause issues if you have server-side transformation of scripts, for example.
uk: Перемикає, чи перевіряємо ми, що вміст файлів на диску відповідає завантаженим у час виконання. Це корисно в різних сценаріях і є обов'язковим у деяких, але може викликати проблеми, якщо у вас є серверна трансформація скриптів, наприклад.

# trace.boolean.description
source: Trace may be set to 'true' to write diagnostic logs to the disk.
uk: Trace може бути встановлено на 'true', щоб записувати діагностичні журнали на диск.

# workspaceTrust.description
source: Trust is required to debug code in this workspace.
uk: Для налагодження коду в цьому робочому просторі потрібна довіра.

# node.attach.restart.description
source: Try to reconnect to the program if we lose connection. If set to `true`, we'll try once a second, forever. You can customize the interval and maximum number of attempts by specifying the `delay` and `maxAttempts` in an object instead.
uk: Спробуйте перепідключитися до програми, якщо ми втратимо з'єднання. Якщо встановлено `true`, ми будемо намагатися раз на секунду, вічно. Ви можете налаштувати інтервал і максимальну кількість спроб, вказавши `delay` та `maxAttempts` в об'єкті замість цього.

# node.launch.restart.description
source: Try to restart the program if it exits with a non-zero exit code.
uk: Спробуйте перезапустити програму, якщо вона завершується з ненульовим кодом виходу.

# node.sourceMaps.description
source: Use JavaScript source maps (if they exist).
uk: Використовуйте карти джерел JavaScript (якщо вони існують).

# browser.sourceMaps.description
source: Use JavaScript source maps (if they exist).
uk: Використовуйте карти джерел JavaScript (якщо вони існують).

# node.launch.useWSL.description
source: Use Windows Subsystem for Linux.
uk: Використовуйте підсистему Windows для Linux.

# node.snippet.nodemon.description
source: Use nodemon to relaunch a debug session on source changes
uk: Використовуйте nodemon для перезапуску сеансу налагодження при змінах у вихідному коді

# node.launch.console.internalConsole.description
source: VS Code Debug Console (which doesn't support to read input from a program)
uk: Консоль налагодження VS Code (яка не підтримує читання введення з програми)

# extensionHost.snippet.launch.label
source: VS Code Extension Development
uk: Розробка розширень для VS Code

# extensionHost.label
source: VS Code Extension Development
uk: Розробка розширень для VS Code

# node.launch.console.integratedTerminal.description
source: VS Code's integrated terminal
uk: інтегрований термінал VS Code

# node.launch.runtimeVersion.description
source: Version of `node` runtime to use. Requires `nvm`.
uk: Версія середовища виконання `node`, яку слід використовувати. Потрібен `nvm`.

# commands.networkViewRequest.label
source: View Request as cURL
uk: Переглянути запит як cURL

# chrome.label
source: Web App (Chrome)
uk: Веб-додаток (Chrome)

# edge.label
source: Web App (Edge)
uk: Веб-додаток (Edge)

# browser.cleanUp.description
source: What clean-up to do after the debugging session finishes. Close only the tab being debug, vs. close the whole browser.
uk: Яке очищення потрібно зробити після завершення сеансу налагодження. Закрити лише вкладку, що налагоджується, проти закриття всього браузера.

# edge.useWebView.launch.description
source: When 'true', the debugger will treat the runtime executable as a host application that contains a WebView allowing you to debug the WebView script content.
uk: Коли 'true', налагоджувач буде розглядати виконуваний файл під час виконання як хост-додаток, що містить WebView, що дозволяє вам налагоджувати вміст скрипта WebView.

# configuration.automaticallyTunnelRemoteServer
source: When debugging a remote web app, configures whether to automatically tunnel the remote server to your local machine.
uk: Під час налагодження віддаленого веб-додатку налаштовується, чи потрібно автоматично тунелювати віддалений сервер на вашу локальну машину.

# edge.address.description
source: When debugging webviews, the IP address or hostname the webview is listening on. Will be automatically discovered if not set.
uk: При налагодженні веб-переглядів IP-адреса або ім'я хоста, на якому слухає веб-перегляд. Буде автоматично виявлено, якщо не встановлено.
