Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.markdown-language-features.xlf
Languages: uk

# ++CODE++d3711f47b53cbbff701820ac079cd74e4ed557dcaa0755b975b8c016eb852efd
source: ...1 additional file not shown
uk: ...1 додатковий файл не показано

# ++CODE++e75869fbe8b1c0131ba14d717b8b6d04e3e75a6f1c9d50f310f0a8c099f6fe57
source: ...{0} additional files not shown
uk: ...{0} додаткових файлів не показано

# ++CODE++e9713f9270dc97b4fe12f68f9bae70b524b8859bc8255963ecfd03cb45d8bf47
source: Allow all content and script execution. Not recommended
uk: Дозволити весь контент та виконання скриптів. Не рекомендується

# ++CODE++2e3326dc4371b8e36641342d8537651baef3741cb9c4484ff164100cda8b7682
source: Allow insecure content
uk: Дозволити небезпечний контент

# ++CODE++8dd5990c482107365abed86dd50ebf7aa84f5b601551f1febc240faf9e144da8
source: Allow insecure local content
uk: Дозволити небезпечний локальний контент

# ++CODE++de9f057a471cdb8d3b082719bdc7ad2031788d042947349723fa83c9d13a517a
source: Always
uk: Завжди

# ++CODE++f4999cad68defba052ac5a2d0458ce9b026167587bc0e578ba3139cb9ca64137
source: An unexpected error occurred while restoring the Markdown preview.
uk: Сталася несподівана помилка під час відновлення попереднього перегляду Markdown.

# ++CODE++d5c09f3941913ac7db1bf869cd19a50a227d5926189a9e91d9e9a67ed36f19d2
source: Checking for Markdown links to update
uk: Перевірка наявності посилань Markdown для оновлення

# ++CODE++f81d5cdd15e1ec6236e2bc9dc581710eee2ebf70247f89cb24873828e5c58997
source: Content Disabled Security Warning
uk: Попередження про безпеку: вміст вимкнено

# ++CODE++a10a1848d55ccae2f632ebc711de6518e1275d4ed860d140bbd51191cb042615
source: Could not load 'markdown.styles': {0}
uk: Не вдалося завантажити 'markdown.styles': {0}

# ++CODE++623fc51f3cc4395e23f93d1754b8b8b7d2d4167eaf75745759ed3de0ec7d3047
source: Could not open {0}
uk: Не вдалося відкрити {0}

# ++CODE++b7e3e4aa4257b9a11a82f59faf34c8450ca10d4116885b0a29fedf60842d81d5
source: Disable
uk: Вимкнути

# ++CODE++4a1b52199382365b1821e926be2ed256b2be661e8689a73553f5a102118dee9d
source: Disable preview security warning in this workspace
uk: Вимкнути попередження про безпеку попереднього перегляду в цьому робочому просторі

# ++CODE++4bdf808888f813b92f254a8dc2ad516326ac4139325530954d635916685bde95
source: Disable validation of Markdown links
uk: Вимкнути валідацію посилань Markdown

# ++CODE++162bf10949b7378fdb01e1ba623d1d69373b654da17ae1316e20309f05efc0ab
source: Does not affect the content security level
uk: Не впливає на рівень безпеки контенту

# ++CODE++5342e09f2729fbc6514528e727aeb9857afb31719d43568e6b18661ace7d1014
source: Enable
uk: Увімкнути

# ++CODE++735f8d2a97b0dc61f28e6a4bdfa4aa5d088a8bc555b78f28d21bdda8516953a8
source: Enable loading content over http
uk: Увімкнути завантаження вмісту через http

# ++CODE++f29bd0fa2b0afd4b31d8c6ab80ffd084c53febfe11d033c12da7c148f357ff34
source: Enable loading content over http served from localhost
uk: Увімкнути завантаження вмісту через http, що подається з localhost

# ++CODE++0469cecf7ddfe054b68ca53bebbffaa20bcd943d8a03c0ef6795fbd257ec6208
source: Enable preview security warnings in this workspace
uk: Увімкнути попередження про безпеку попереднього перегляду в цьому робочому просторі

# ++CODE++e80205b16dc6786baecb23deb9dd0f5cb737400ccc9484decfe3bb352460d863
source: Enable validation of Markdown links
uk: Увімкнути валідацію посилань Markdown

# ++CODE++687cb51e4fbba7bd530ab353851a0839b13fed834e7ebbfe57c74f09a125cab9
source: Exclude '{0}' from link validation.
uk: Виключити '{0}' з перевірки посилань.

# ++CODE++7b17163bec0465e596dcd819fef9733cba55702206533d0d22623f98151a4849
source: Extract to link definition
uk: Витягти до визначення посилання

# ++CODE++9d17a1a4f2804303bd4c14ad38314cb0d0e866309c659b137d1065df191cd3a5
source: File does not exist at path: {0}
uk: Файл не існує за шляхом: {0}

# ++CODE++074accffb3bf7b6e0810bc93a321f7ab2867abd9e1569ea114914c0fabc33112
source: Find file references failed. No resource provided.
uk: Не вдалося знайти посилання на файл. Ресурс не надано.

# ++CODE++99ba1e8ef633bbdbdcb59fa90ded44154f3fd1e1e4d7166c45d2f759ef5bef77
source: Finding file references
uk: Знаходження посилань на файли

# ++CODE++773c6c3aafa8c9f58eea260fe7d5dedc52b3068c2e947a47683a088bd23a03d4
source: Follow link
uk: Слідувати за посиланням

# ++CODE++3b3f85e6622ccac289a6bc88240712b7a1dfd0fcf85cf7d0a43ac63e487af10c
source: Go to link definition
uk: Перейти до визначення посилання

# ++CODE++88ad7b25bc7024185aeb3f5b4d74d2de6c3c393c8f165dce416196aa75bdcff4
source: Header does not exist in file: {0}
uk: Заголовок не існує у файлі: {0}

# ++CODE++1a8c938f20cae54358e672a29e5d8ef41186e90ea8243842fbc5fe4f3e32c97d
source: Insert Markdown Audio
uk: Вставити аудіо Markdown

# ++CODE++d0aadcea57bf54746e475dd94d504712ad74c2e111f1c510034329be2b6a2b87
source: Insert Markdown Image
uk: Вставити зображення Markdown

# ++CODE++0d080d7da1bd4b072f597ef4ec958c8bd786a38c70a8d43ef5d5ddb73ab4174b
source: Insert Markdown Images
uk: Вставити зображення Markdown

# ++CODE++d13ce2b12a57d4e00bb72c08353d0b1820cbcf301e8be9bf52205c9e0224ee2c
source: Insert Markdown Images and Links
uk: Вставити зображення та посилання Markdown

# ++CODE++1f2d4e3b43a6d436b9ee54a731ec6af4e297a1c37030bb0d919a2a6afccb68f9
source: Insert Markdown Link
uk: Вставити посилання Markdown

# ++CODE++e35defa793ab737223f07dbd193ed675e564823908578be0d476f1fd2b3b6b71
source: Insert Markdown Links
uk: Вставити посилання Markdown

# ++CODE++b1c74f869ba00d05c567b55c69d64cc42e0a0b52bff89dd12aea636ff65581f3
source: Insert Markdown Media
uk: Вставити медіа Markdown

# ++CODE++bd1378ca3f2eb4871bc8572fadd9d6faa5f6e8f9403766f44045d2ae002d8e4f
source: Insert Markdown Media and Images
uk: Вставити медіа та зображення Markdown

# ++CODE++bd65341f833f1da57bd7affbdf18b697338be82d3e5dbf676d03831555cf02aa
source: Insert Markdown Media and Links
uk: Вставити медіа та посилання Markdown

# ++CODE++61297ceed1285205df8a7d4d3188cab6a4c46d89cabc8afb99f3b3aff6150911
source: Insert Markdown Video
uk: Вставити відео Markdown

# ++CODE++cf3a92dadb38f2884332c90b76c92b02768ae44587dab1e7966d990bf13836de
source: Insert image
uk: Вставити зображення

# ++CODE++421eaa9e095dc28ce033298d5e18930edc92e272e315193668309d22513b8ae6
source: Insert link
uk: Вставити посилання

# ++CODE++9de33fc6486581d6c14b270e682a82a8948d8ab049dddbcecc3445681231d4fc
source: Link definition for '{0}' already exists
uk: Визначення посилання для '{0}' вже існує

# ++CODE++ae42682cc7c6cd6e6d124dae2840ceec1ee25494801228bd4125b17ae01d6798
source: Link definition is unused
uk: Визначення посилання не використовується

# ++CODE++75ca360993003b3c80ed4792d04a60340e20b13bd800b75b1955dff08328af79
source: Link is already a reference
uk: Посилання вже є посиланням

# ++CODE++7f495b3494357bca7e5adadeed7e7cc806fe6460469e5ffe2aa89098bdff7857
source: Link is also defined here
uk: Посилання також визначено тут

# ++CODE++4538e5c723c865755335b040dca18fcf7bb313c76721e1e9c97390f4475740b9
source: Link to '# {0}' in '{1}'
uk: Посилання на '# {0}' у '{1}'

# ++CODE++265f693939f1847cd4ddb89fb616aa84ad9db4cb72585a6a8e3d8a8a4c83e9d1
source: Link to '{0}'
uk: Посилання на '{0}'

# ++CODE++997ca95a484dc4ff449238f0f85348de5975ced6e575aa2c1bf37563793f7ebc
source: Markdown Language Server
uk: Сервер мови Markdown

# ++CODE++f8f2732f4a508aa2ca0df1d5fa68855514e2efefd7c4535eff9a24485c307171
source: Markdown link validation disabled
uk: Перевірка посилань Markdown вимкнена

# ++CODE++73dc6e5c870d29213b604f3fa1fbb197ab33d066a925d35722803b6299e19491
source: Markdown link validation enabled
uk: Перевірка посилань Markdown увімкнена

# ++CODE++d357175cfe8978d39b0f86552dcd9404973493e2816101d9ff6c05ee248ef6bd
source: Media
uk: Медіа

# ++CODE++db544175508b84f83a649639af65ff9746d5de83269f817ebb589ebcc147f0ba
source: More Information
uk: Більше інформації

# ++CODE++6300ef800bb884295b0b4b35682b75cecd7cc550d202db56d04a0643b8fb873f
source: Never
uk: Ніколи

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні

# ++CODE++2f159bc046d69d39e3769bbcd63866c38c850a663f3b8bd19d1c7113682d7e6c
source: No header found: '{0}'
uk: Заголовок не знайдено: '{0}'

# ++CODE++0012234f9c97c0b8e4a37e123f0beed3e1e78232186c95540a35b9147250bb30
source: No link definition found: '{0}'
uk: Не знайдено визначення посилання: '{0}'

# ++CODE++aa99510cd76c19555d51034ea3982676db7eea7cefe6fe4e4cccceaf46283701
source: Not on link
uk: Не на посиланні

# ++CODE++3e7b013917c976ab5bb23e6c254b40e52dd04efd285525ab7c9beeb044a9d088
source: Only load secure content
uk: Завантажувати лише безпечний контент

# ++CODE++1948420c3961e7cb510a6c78b31be7767e26e0c2527b6098cc5503a6492e751c
source: Paste and update pasted links
uk: Вставити та оновити вставлені посилання

# ++CODE++910704f5982794495511af85e53d238eb01d38dc45ce4069a5dcd707e1d996cd
source: Potentially unsafe or insecure content has been disabled in the Markdown preview. Change the Markdown preview security setting to allow insecure content or enable scripts
uk: Потенційно небезпечний або ненадійний контент було вимкнено у попередньому перегляді Markdown. Змініть налаштування безпеки попереднього перегляду Markdown, щоб дозволити ненадійний контент або увімкніть скрипти.

# ++CODE++c7b79792a29189106fb1d6f6eae92248dc069f0ae2cf53a89dc48379ecdde948
source: Preview {0}
uk: Попередній перегляд {0}

# ++CODE++8082cb9e4b11a75c1e0c2001924389f744bf3fb8b798c7849610680e88b0324a
source: Reference link '{0}'
uk: Посилання на джерело '{0}'

# ++CODE++ec0d0f751c715b5a7ebb6a0ee629240d4a366ec969ba2727c386a6eefd573cad
source: Remove duplicate link definition
uk: Видалити визначення дублікатів посилань

# ++CODE++92f877f6b08c7277ffba18c6437331172175210214f79a6bd539e53b0c62bba9
source: Remove unused link definition
uk: Видалити невикористане визначення посилання

# ++CODE++107a2302bf2a41458d3084276ef047186c3200651dd7ddd952f2f7d8ef7de601
source: Renaming is not supported here. Try renaming a header or link.
uk: Перейменування тут не підтримується. Спробуйте перейменувати заголовок або посилання.

# ++CODE++42827543c5312d91c4c10bb931e58a4717517eeb21e3ec1e9f9376037e3cf98c
source: Select security settings for Markdown previews in this workspace
uk: Виберіть налаштування безпеки для попереднього перегляду Markdown у цьому робочому просторі

# ++CODE++14ba2cd6a91e7d6b16298d4fb605c7c208a56240847eb000826288bcf36d7b9c
source: Some content has been disabled in this document
uk: Деякий контент у цьому документі було відключено

# ++CODE++2e1a4c07ce94cb0ceb769cc5fd0edc0e53ec37feebeb36b53fa7fed72d619a5b
source: Strict
uk: Суворий

# ++CODE++10c0f042b9553365c9bd1376881f957c0b3930f6f4a6df8d799ea0b79b367aa6
source: Update Markdown links for '{0}'?
uk: Оновити посилання Markdown для '{0}'?

# ++CODE++0c562d15f75a0cb7217446d18f9a4c81248f74461ffafb9f20a10d0c4b8703b9
source: Update Markdown links for the following {0} files?
uk: Оновити посилання Markdown для наступних {0} файлів?

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
uk: Так

# ++CODE++04926a4483c7c89433683d096bcf960d7a142cb134e4241d04454d29e6947be2
source: [Preview] {0}
uk: [Попередній перегляд] {0}

# ++CODE++c94b7a0e54b912c932e6d4e645d535132d05167451916ddbd39367980833ed15
source: {0} cannot be found
uk: {0} не може бути знайдено

# markdown.styles.dec
source: A list of URLs or local paths to CSS style sheets to use from the Markdown preview. Relative paths are interpreted relative to the folder open in the Explorer. If there is no open folder, they are interpreted relative to the location of the Markdown file. All '\' need to be written as '\\'.
uk: Список URL-адрес або локальних шляхів до CSS стилів, які використовуються з попереднім переглядом Markdown. Відносні шляхи інтерпретуються відносно папки, відкритої в Провіднику. Якщо немає відкритої папки, вони інтерпретуються відносно місця розташування файлу Markdown. Усі '\' потрібно писати як '\\'.

# configuration.pasteUrlAsFormattedLink.always
source: Always insert Markdown links.
uk: Завжди вставляйте посилання Markdown.

# configuration.markdown.editor.filePaste.enabled.always
source: Always insert Markdown links.
uk: Завжди вставляйте посилання Markdown.

# configuration.markdown.editor.drop.enabled.always
source: Always insert Markdown links.
uk: Завжди вставляйте посилання Markdown.

# configuration.markdown.updateLinksOnFileMove.enabled.always
source: Always update links automatically.
uk: Завжди автоматично оновлювати посилання.

# markdown.showPreviewSecuritySelector.title
source: Change Preview Security Settings
uk: Змінити налаштування безпеки попереднього перегляду

# configuration.markdown.validate.ignoredLinks.description
source: Configure links that should not be validated. For example adding `/about` would not validate the link `[about](/about)`, while the glob `/assets/**/*.svg` would let you skip validation for any link to `.svg` files under the `assets` directory.
uk: Налаштуйте посилання, які не повинні перевірятися. Наприклад, додавання `/about` не перевірить посилання `[about](/about)`, тоді як шаблон `/assets/**/*.svg` дозволить вам пропустити перевірку для будь-якого посилання на файли `.svg` у каталозі `assets`.

# configuration.markdown.copyFiles.destination
source: Configures the path and file name of files created by copy/paste or drag and drop. This is a map of globs that match against a Markdown document path to the destination path where the new file should be created. The destination path may use the following variables: - `${documentDirName}` — Absolute parent directory path of the Markdown document, e.g. `/Users/me/myProject/docs`. - `${documentRelativeDirName}` — Relative parent directory path of the Markdown document, e.g. `docs`. This is the same as `${documentDirName}` if the file is not part of a workspace. - `${documentFileName}` — The full filename of the Markdown document, e.g. `README.md`. - `${documentBaseName}` — The basename of the Markdown document, e.g. `README`. - `${documentExtName}` — The extension of the Markdown document, e.g. `md`. - `${documentFilePath}` — Absolute path of the Markdown document, e.g. `/Users/me/myProject/docs/README.md`. - `${documentRelativeFilePath}` — Relative path of the Markdown document, e.g. `docs/README.md`. This is the same as `${documentFilePath}` if the file is not part of a workspace. - `${documentWorkspaceFolder}` — The workspace folder for the Markdown document, e.g. `/Users/me/myProject`. This is the same as `${documentDirName}` if the file is not part of a workspace. - `${fileName}` — The file name of the dropped file, e.g. `image.png`. - `${fileExtName}` — The extension of the dropped file, e.g. `png`. - `${unixTime}` — The current Unix timestamp in milliseconds. - `${isoTime}` — The current time in ISO 8601 format, e.g. '2025-06-06T08:40:32.123Z'.
uk: Налаштовує шлях та ім'я файлу для файлів, створених шляхом копіювання/вставки або перетягування. Це карта глобусів, які відповідають шляху до документа Markdown, до шляху призначення, де має бути створено новий файл. Шлях призначення може використовувати такі змінні: - `${documentDirName}` — Абсолютний шлях до батьківської директорії документа Markdown, наприклад, `/Users/me/myProject/docs`. - `${documentRelativeDirName}` — Відносний шлях до батьківської директорії документа Markdown, наприклад, `docs`. Це те саме, що і `${documentDirName}`, якщо файл не є частиною робочого простору. - `${documentFileName}` — Повне ім'я файлу документа Markdown, наприклад, `README.md`. - `${documentBaseName}` — Базове ім'я документа Markdown, наприклад, `README`. - `${documentExtName}` — Розширення документа Markdown, наприклад, `md`. - `${documentFilePath}` — Абсолютний шлях до документа Markdown, наприклад, `/Users/me/myProject/docs/README.md`. - `${documentRelativeFilePath}` — Відносний шлях до документа Markdown, наприклад, `docs/README.md`. Це те саме, що і `${documentFilePath}`, якщо файл не є частиною робочого простору. - `${documentWorkspaceFolder}` — Папка робочого простору для документа Markdown, наприклад, `/Users/me/myProject`. Це те саме, що і `${documentDirName}`, якщо файл не є частиною робочого простору. - `${fileName}` — Ім'я файлу перетягнутого файлу, наприклад, `image.png`. - `${fileExtName}` — Розширення перетягнутого файлу, наприклад, `png`. - `${unixTime}` — Поточна Unix мітка часу в мілісекундах. - `${isoTime}` — Поточний час у форматі ISO 8601, наприклад, '2025-06-06T08:40:32.123Z'.

# configuration.markdown.preview.openMarkdownLinks.description
source: Controls how links to other Markdown files in the Markdown preview should be opened.
uk: Контролює, як посилання на інші файли Markdown у попередньому перегляді Markdown повинні відкриватися.

# configuration.markdown.editor.pasteUrlAsFormattedLink.enabled
source: Controls if Markdown links are created when URLs are pasted into a Markdown editor. Requires enabling `#editor.pasteAs.enabled#`.
uk: Контролює, чи створюються посилання Markdown, коли URL-адреси вставляються в редактор Markdown. Потребує увімкнення `#editor.pasteAs.enabled#`.

# configuration.markdown.preferredMdPathExtensionStyle
source: Controls if file extensions (for example `.md`) are added or not for links to Markdown files. This setting is used when file paths are added by tooling such as path completions or file renames.
uk: Контролює, чи додаються розширення файлів (наприклад, `.md`) для посилань на Markdown-файли. Цей параметр використовується, коли шляхи до файлів додаються за допомогою інструментів, таких як автозавершення шляхів або перейменування файлів.

# configuration.markdown.copyFiles.overwriteBehavior
source: Controls if files created by drop or paste should overwrite existing files.
uk: Контролює, чи файли, створені шляхом перетягування або вставки, повинні перезаписувати існуючі файли.

# configuration.markdown.editor.drop.copyIntoWorkspace
source: Controls if files outside of the workspace that are dropped into a Markdown editor should be copied into the workspace. Use `#markdown.copyFiles.destination#` to configure where copied dropped files should be created
uk: Контролює, чи файли поза робочою областю, які перетягуються в редактор Markdown, повинні бути скопійовані в робочу область. Використовуйте `#markdown.copyFiles.destination#`, щоб налаштувати, де повинні бути створені скопійовані файли.

# configuration.markdown.editor.filePaste.copyIntoWorkspace
source: Controls if files outside of the workspace that are pasted into a Markdown editor should be copied into the workspace. Use `#markdown.copyFiles.destination#` to configure where copied files should be created.
uk: Контролює, чи файли поза робочою областю, які вставляються в редактор Markdown, повинні бути скопійовані в робочу область. Використовуйте `#markdown.copyFiles.destination#`, щоб налаштувати, де повинні бути створені скопійовані файли.

# markdown.preview.fontFamily.desc
source: Controls the font family used in the Markdown preview.
uk: Керує сім'єю шрифтів, що використовується в попередньому перегляді Markdown.

# markdown.preview.fontSize.desc
source: Controls the font size in pixels used in the Markdown preview.
uk: Контролює розмір шрифту в пікселях, що використовується в попередньому перегляді Markdown.

# markdown.preview.lineHeight.desc
source: Controls the line height used in the Markdown preview. This number is relative to the font size.
uk: Контролює висоту рядка, що використовується в попередньому перегляді Markdown. Це число є відносним до розміру шрифту.

# markdown.server.log.desc
source: Controls the logging level of the Markdown language server.
uk: Контролює рівень журналювання серверу мови Markdown.

# configuration.markdown.links.openLocation.description
source: Controls where links in Markdown files should be opened.
uk: Контролює, де повинні відкриватися посилання в файлах Markdown.

# markdown.preview.linkify
source: Convert URL-like text to links in the Markdown preview.
uk: Перетворіть текст, схожий на URL, на посилання у попередньому перегляді Markdown.

# markdown.copyImage.title
source: Copy Image
uk: Копіювати зображення

# configuration.markdown.suggest.paths.includeWorkspaceHeaderCompletions.never
source: Disable workspace header suggestions.
uk: Вимкнути підказки заголовка робочого простору.

# configuration.copyIntoWorkspace.never
source: Do not copy external files into the workspace.
uk: Не копіюйте зовнішні файли в робочий простір.

# markdown.preview.doubleClickToSwitchToEditor.desc
source: Double-click in the Markdown preview to switch to the editor.
uk: Двічі клацніть у попередньому перегляді Markdown, щоб перейти до редактора.

# configuration.markdown.validate.enabled.description
source: Enable all error reporting in Markdown files.
uk: Увімкніть усю звітність про помилки у файлах Markdown.

# markdown.trace.extension.desc
source: Enable debug logging for the Markdown extension.
uk: Увімкніть журналювання налагодження для розширення Markdown.

# configuration.markdown.editor.drop.enabled
source: Enable dropping files into a Markdown editor while holding Shift. Requires enabling `#editor.dropIntoEditor.enabled#`.
uk: Увімкніть перетягування файлів у редактор Markdown, утримуючи Shift. Потрібно увімкнути `#editor.dropIntoEditor.enabled#`.

# configuration.markdown.occurrencesHighlight.enabled
source: Enable highlighting link occurrences in the current document.
uk: Увімкнути підсвічування посилань у поточному документі.

# configuration.markdown.editor.filePaste.enabled
source: Enable pasting files into a Markdown editor to create Markdown links. Requires enabling `#editor.pasteAs.enabled#`.
uk: Увімкніть вставку файлів у редактор Markdown для створення посилань Markdown. Потрібно увімкнути `#editor.pasteAs.enabled#`.

# configuration.markdown.suggest.paths.enabled.description
source: Enable path suggestions while writing links in Markdown files.
uk: Увімкніть пропозиції шляхів під час написання посилань у файлах Markdown.

# markdown.preview.typographer
source: Enable some language-neutral replacement and quotes beautification in the Markdown preview.
uk: Увімкніть деяке нейтральне до мови заміщення та покращення цитат у попередньому перегляді Markdown.

# configuration.markdown.suggest.paths.includeWorkspaceHeaderCompletions
source: Enable suggestions for headers in other Markdown files in the current workspace. Accepting one of these suggestions inserts the full path to header in that file, for example: `[link text](/path/to/file.md#header)`.
uk: Увімкніть пропозиції для заголовків в інших Markdown файлах у поточному робочому просторі. Прийняття однієї з цих пропозицій вставляє повний шлях до заголовка в цьому файлі, наприклад: `[link text](/path/to/file.md#header)`.

# configuration.markdown.updateLinksOnFileMove.enableForDirectories
source: Enable updating links when a directory is moved or renamed in the workspace.
uk: Увімкнути оновлення посилань, коли каталог переміщується або перейменовується в робочій області.

source: Enable workspace header suggestions after typing `##` in a path, for example: `[link text](##`.
uk: Увімкніть пропозиції заголовка робочого простору після введення `##` у шляху, наприклад: `[link text](##`.

source: Enable workspace header suggestions after typing either `##` or `#` in a path, for example: `[link text](#` or `[link text](##`.
uk: Увімкніть пропозиції заголовків робочого простору після введення `##` або `#` у шляху, наприклад: `[link text](#` або `[link text](##`.
