Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.git.xlf
Languages: uk

# config.commandsToLog
source: List of git commands (ex: commit, push) that would have their `stdout` logged to the [git output](command:git.showOutput). If the git command has a client-side hook configured, the client-side hook's `stdout` will also be logged to the [git output](command:git.showOutput).
uk: Список команд git (наприклад: commit, push), для яких буде записано їхній `stdout` у [git output](command:git.showOutput). Якщо команда git має налаштований клієнтський хуком, `stdout` клієнтського хуку також буде записано у [git output](command:git.showOutput).

# config.scanRepositories
source: List of paths to search for Git repositories in.
uk: Список шляхів для пошуку Git-репозиторіїв.

# config.branchProtection
source: List of protected branches. By default, a prompt is shown before changes are committed to a protected branch. The prompt can be controlled using the `#git.branchProtectionPrompt#` setting.
uk: Список захищених гілок. За замовчуванням перед комітом змін у захищену гілку відображається запит. Запит можна контролювати за допомогою налаштування `#git.branchProtectionPrompt#`.

# config.checkoutType.local
source: Local branches
uk: Місцеві відділення

# command.manageUnsafeRepositories
source: Manage Unsafe Repositories
uk: Керувати небезпечними репозиторіями

# command.merge
source: Merge...
uk: Злиття...

# config.openRepositoryInParentFolders.never
source: Never open a repository in parent folders of workspaces or open files.
uk: Ніколи не відкривайте репозиторій у батьківських папках робочих просторів або відкритих файлах.

# config.publishBeforeContinueOn.never
source: Never publish unpublished Git state when using Continue Working On from a Git repository
uk: Ніколи не публікуйте неопублікований стан Git, використовуючи Продовжити роботу з репозиторію Git

# config.openAfterClone.whenNoFolderOpen
source: Only open in current window when no folder is opened.
uk: Відкривати лише в поточному вікні, коли жодна папка не відкрита.

# command.openAllChanges
source: Open All Changes
uk: Відкрити всі зміни

# command.viewChanges
source: Open Changes
uk: Відкриті зміни

# command.timelineOpenDiff
source: Open Changes
uk: Відкриті зміни

# command.openChange
source: Open Changes
uk: Відкриті зміни

# command.viewCommit
source: Open Commit
uk: Відкрити коміт

# command.revealFileInOS.linux
source: Open Containing Folder
uk: Відкрити папку, що містить

# command.openFile
source: Open File
uk: Відкрити файл

# command.openHEADFile
source: Open File (HEAD)
uk: Відкрити файл (HEAD)

# command.openRepositoriesInParentFolders
source: Open Repositories In Parent Folders
uk: Відкрити репозиторії в батьківських папках

# command.openRepository
source: Open Repository
uk: Відкрите репозиторій

# command.viewStagedChanges
source: Open Staged Changes
uk: Відкриті етапні зміни

# command.viewUntrackedChanges
source: Open Untracked Changes
uk: Відкрити непідраховані зміни

# config.mergeEditor
source: Open the merge editor for files that are currently under conflict.
uk: Відкрийте редактор злиття для файлів, які наразі знаходяться в конфлікті.

# config.path
source: Path and filename of the git executable, e.g. `C:\Program Files\Git\bin\git.exe` (Windows). This can also be an array of string values containing multiple paths to look up.
uk: Шлях і ім'я файлу виконуваного файлу git, наприклад, `C:\Program Files\Git\bin\git.exe` (Windows). Це також може бути масив значень рядків, що містять кілька шляхів для пошуку.

# command.stashPopLatest
source: Pop Latest Stash
uk: Витягти останній запас

# command.stashPopEditor
source: Pop Stash
uk: Поп Сташ

# command.stashPop
source: Pop Stash...
uk: Поп Сташ...

# config.branchPrefix
source: Prefix used when creating a new branch.
uk: Префікс, що використовується при створенні нової гілки.

# config.openRepositoryInParentFolders.prompt
source: Prompt before opening a repository the parent folders of workspaces or open files.
uk: Запит перед відкриттям репозиторію батьківських папок робочих просторів або відкритих файлів.

# config.publishBeforeContinueOn.prompt
source: Prompt to publish unpublished Git state when using Continue Working On from a Git repository
uk: Запит на публікацію неопублікованого стану Git під час використання Продовжити роботу з репозиторію Git

# config.pruneOnFetch
source: Prune when fetching.
uk: Обрізати під час отримання.

# command.publish
source: Publish Branch...
uk: Опублікувати гілку...

# command.pull
source: Pull
uk: Тягнути

# command.pullRebase
source: Pull (Rebase)
uk: Витягти (Перебазувати)

# command.pullFrom
source: Pull from...
uk: Витягнути з...

# submenu.pullpush
source: Pull, Push
uk: Тягнути, Штовхати

# command.push
source: Push
uk: Натисніть

# command.pushFollowTags
source: Push (Follow Tags)
uk: Натисніть (Слідкувати за тегами)

# command.pushFollowTagsForce
source: Push (Follow Tags, Force)
uk: Натисніть (Слідкувати за тегами, Примусово)

# command.pushForce
source: Push (Force)
uk: Натисніть (Сила)

# command.pushTags
source: Push Tags
uk: Натисніть Теги

# config.followTagsWhenSync
source: Push all annotated tags when running the sync command.
uk: Відправте всі анотовані теги під час виконання команди синхронізації.

# command.pushTo
source: Push to...
uk: Натисніть, щоб...

# command.pushToForce
source: Push to... (Force)
uk: Натиснути на... (Сила)

# command.rebase
source: Rebase Branch...
uk: Перебазувати гілку...

# command.refresh
source: Refresh
uk: Оновити

# config.rememberPostCommitCommand
source: Remember the last git command that ran after a commit.
uk: Запам'ятайте останню команду git, яка виконувалася після коміту.

# submenu.remotes
source: Remote
uk: Віддалений

# config.checkoutType.remote
source: Remote branches
uk: Віддалені гілки

# command.removeRemote
source: Remove Remote
uk: Видалити віддалений

# command.rename
source: Rename
uk: Перейменувати

# command.renameBranch
source: Rename Branch...
uk: Перейменувати гілку...

# command.reopenClosedRepositories
source: Reopen Closed Repositories...
uk: Відкрити закриті репозиторії...

# command.git.openMergeEditor
source: Resolve in Merge Editor
uk: Вирішити в редакторі злиття

# command.restoreCommitTemplate
source: Restore Commit Template
uk: Відновити шаблон коміту

# command.revealInExplorer
source: Reveal in Explorer View
uk: Показати в режимі Провідника

# command.revealFileInOS.windows
source: Reveal in File Explorer
uk: Показати у Провіднику файлів

# command.revealFileInOS.mac
source: Reveal in Finder
uk: Показати у Finder

# command.revertChange
source: Revert Change
uk: Скасувати зміни

# command.revertSelectedRanges
source: Revert Selected Ranges
uk: Повернути вибрані діапазони

# config.postCommitCommand.sync
source: Run 'git pull' and 'git push' after a successful commit.
uk: Запустіть 'git pull' та 'git push' після успішного коміту.

# config.postCommitCommand.push
source: Run 'git push' after a successful commit.
uk: Запустіть 'git push' після успішного коміту.

# config.postCommitCommand
source: Run a git command after a successful commit.
uk: Виконайте команду git після успішного коміту.

# config.autoRepositoryDetection.true
source: Scan for both subfolders of the current opened folder and parent folders of open files.
uk: Сканувати як підпапки поточної відкритої папки, так і батьківські папки відкритих файлів.

# config.autoRepositoryDetection.openEditors
source: Scan for parent folders of open files.
uk: Сканувати батьківські папки відкритих файлів.

# config.autoRepositoryDetection.subFolders
source: Scan for subfolders of the currently opened folder.
uk: Сканувати підпапки відкритого в даний момент папки.

# view.workbench.scm.scanFolderForRepositories
source: Scanning folder for Git repositories...
uk: Сканування папки на наявність репозиторіїв Git...

# view.workbench.scm.scanWorkspaceForRepositories
source: Scanning workspace for Git repositories...
uk: Сканування робочого простору на наявність репозиторіїв Git...

# command.timelineSelectForCompare
source: Select for Compare
uk: Вибрати для порівняння

# command.showOutput
source: Show Git Output
uk: Показати вихід Git

# config.showActionButton.commit
source: Show an action button to commit changes when the local branch has modified files ready to be committed.
uk: Показати кнопку дії для збереження змін, коли локальна гілка має змінені файли, готові до збереження.

# config.showActionButton.publish
source: Show an action button to publish the local branch when it does not have a tracking remote branch.
uk: Показати кнопку дії для публікації локальної гілки, коли вона не має відстежуваної віддаленої гілки.

# config.showActionButton.sync
source: Show an action button to synchronize changes when the local branch is either ahead or behind the remote branch.
uk: Показати кнопку дії для синхронізації змін, коли локальна гілка або випереджає, або відстає від віддаленої гілки.

# submenu.commit.signoff
source: Sign Off
uk: Вихід

# view.workbench.scm.missing.linux
source: Source control depends on Git being installed. [Download Git for Linux](https://git-scm.com/download/linux) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
uk: Контроль версій залежить від наявності Git. [Завантажити Git для Linux](https://git-scm.com/download/linux) Після встановлення, будь ласка, [перезавантажте](command:workbench.action.reloadWindow) (або [усуньте неполадки](command:git.showOutput)). Додаткові постачальники контролю версій можуть бути встановлені [з Маркетплейсу](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# command.stageAll
source: Stage All Changes
uk: Стадія всіх змін

# command.stageAllMerge
source: Stage All Merge Changes
uk: Стадія всіх змін злиття

# command.stageAllTracked
source: Stage All Tracked Changes
uk: Стадія всіх відстежених змін

# command.stageAllUntracked
source: Stage All Untracked Changes
uk: Стадіювати всі непідконтрольні зміни

# command.stageBlock
source: Stage Block
uk: Блок Сцени

# command.stageChange
source: Stage Change
uk: Зміна етапу

# command.stage
source: Stage Changes
uk: Зміни стадії

# command.stageSelectedRanges
source: Stage Selected Ranges
uk: Етап вибраних діапазонів

# command.stageSelection
source: Stage Selection
uk: Вибір етапу

# submenu.stash
source: Stash
uk: Сховище

# command.stash
source: Stash
uk: Сховище

# command.stashIncludeUntracked
source: Stash (Include Untracked)
uk: Сховати (Включити непідраховані)

# command.stashStaged
source: Stash Staged
uk: Сховати стадію

# config.autoStash
source: Stash any changes before pulling and restore them after successful pull.
uk: Збережіть будь-які зміни перед отриманням і відновіть їх після успішного отримання.

# config.suggestSmartCommit
source: Suggests to enable smart commit (commit all changes when there are no staged changes).
uk: Пропонує увімкнути розумний коміт (комітити всі зміни, коли немає підготовлених змін).

# command.sync
source: Sync
uk: Синхронізувати

# command.syncRebase
source: Sync (Rebase)
uk: Синхронізувати (Перебазувати)

# submenu.tags
source: Tags
uk: Теги

# config.checkoutType.tags
source: Tags
uk: Теги

# config.blameEditorDecoration.template
source: Template for the blame information editor decoration. Supported variables: * `hash`: Commit hash * `hashShort`: First N characters of the commit hash according to `#git.commitShortHashLength#` * `subject`: First line of the commit message * `authorName`: Author name * `authorEmail`: Author email * `authorDate`: Author date * `authorDateAgo`: Time difference between now and the author date
uk: Шаблон для оформлення редактора інформації про провину. Підтримувані змінні: * `hash`: Хеш коміту * `hashShort`: Перші N символів хешу коміту відповідно до `#git.commitShortHashLength#` * `subject`: Перше речення повідомлення коміту * `authorName`: Ім'я автора * `authorEmail`: Електронна пошта автора * `authorDate`: Дата автора * `authorDateAgo`: Різниця в часі між теперішнім моментом і датою автора

# config.blameStatusBarItem.template
source: Template for the blame information status bar item. Supported variables: * `hash`: Commit hash * `hashShort`: First N characters of the commit hash according to `#git.commitShortHashLength#` * `subject`: First line of the commit message * `authorName`: Author name * `authorEmail`: Author email * `authorDate`: Author date * `authorDateAgo`: Time difference between now and the author date
uk: Шаблон для елемента статусного рядка інформації про провину. Підтримувані змінні: * `hash`: Хеш коміту * `hashShort`: Перші N символів хешу коміту відповідно до `#git.commitShortHashLength#` * `subject`: Перше речення повідомлення коміту * `authorName`: Ім'я автора * `authorEmail`: Електронна пошта автора * `authorDate`: Дата автора * `authorDateAgo`: Різниця в часі між теперішнім моментом і датою автора

# config.branchWhitespaceChar
source: The character to replace whitespace in new branch names, and to separate segments of a randomly generated branch name.
uk: Символ для заміни пробілів у нових назвах гілок та для розділення сегментів випадково згенерованої назви гілки.

# config.defaultCloneDirectory
source: The default location to clone a Git repository.
uk: За замовчуванням місце для клонування репозиторію Git.

# view.workbench.scm.unsafeRepositories
source: The detected Git repositories are potentially unsafe as the folders are owned by someone other than the current user. [Manage Unsafe Repositories](command:git.manageUnsafeRepositories) To learn more about unsafe repositories [read our docs](https://aka.ms/vscode-git-unsafe-repository).
uk: Виявлені Git-репозиторії можуть бути небезпечними, оскільки папки належать не поточному користувачу. [Управління небезпечними репозиторіями](command:git.manageUnsafeRepositories) Щоб дізнатися більше про небезпечні репозиторії, [прочитайте нашу документацію](https://aka.ms/vscode-git-unsafe-repository).

# view.workbench.scm.unsafeRepository
source: The detected Git repository is potentially unsafe as the folder is owned by someone other than the current user. [Manage Unsafe Repositories](command:git.manageUnsafeRepositories) To learn more about unsafe repositories [read our docs](https://aka.ms/vscode-git-unsafe-repository).
uk: Виявлений репозиторій Git потенційно небезпечний, оскільки папка належить не поточному користувачу. [Управління небезпечними репозиторіями](command:git.manageUnsafeRepositories) Щоб дізнатися більше про небезпечні репозиторії, [прочитайте нашу документацію](https://aka.ms/vscode-git-unsafe-repository).

# view.workbench.scm.folder
source: The folder currently open doesn't have a Git repository. You can initialize a repository which will enable source control features powered by Git. [Initialize Repository](command:git.init?%5Btrue%5D) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Тека, яка зараз відкрита, не має репозиторію Git. Ви можете ініціалізувати репозиторій, що дозволить використовувати функції контролю версій, які підтримуються Git. [Ініціалізувати репозиторій](command:git.init?%5Btrue%5D) Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# config.defaultBranchName
source: The name of the default branch (example: main, trunk, development) when initializing a new Git repository. When set to empty, the default branch name configured in Git will be used. **Note:** Requires Git version `2.28.0` or later.
uk: Назва гілки за замовчуванням (наприклад: main, trunk, development) під час ініціалізації нового Git-репозиторію. Якщо залишити порожнім, буде використано назву гілки за замовчуванням, налаштовану в Git. **Примітка:** Потрібна версія Git `2.28.0` або новіша.

# view.workbench.scm.workspace
source: The workspace currently open doesn't have any folders containing Git repositories. You can initialize a repository on a folder which will enable source control features powered by Git. [Initialize Repository](command:git.init) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Поточне робоче середовище не містить жодних папок з репозиторіями Git. Ви можете ініціалізувати репозиторій у папці, що дозволить активувати функції контролю версій, які підтримуються Git. [Ініціалізувати репозиторій](command:git.init) Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# view.workbench.scm.emptyWorkspace
source: The workspace currently open doesn't have any folders containing Git repositories. [Add Folder to Workspace](command:workbench.action.addRootFolder) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Поточне робоче середовище не містить жодних папок з репозиторіями Git. [Додати папку до робочого середовища](command:workbench.action.addRootFolder) Щоб дізнатися більше про використання Git та контролю версій у VS Code [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# view.workbench.learnMore
source: To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# command.blameToggleEditorDecoration
source: Toggle Git Blame Editor Decoration
uk: Перемкнути оформлення редактора Git Blame

# command.blameToggleStatusBarItem
source: Toggle Git Blame Status Bar Item
uk: Перемкнути елемент статусного рядка Git Blame

# config.countBadge.off
source: Turn off counter.
uk: Вимкнути лічильник.

# command.undoCommit
source: Undo Last Commit
uk: Скасувати останній коміт

# command.unstageAll
source: Unstage All Changes
uk: Скасувати всі зміни

# command.unstage
source: Unstage Changes
uk: Скасувати зміни

# command.unstageSelectedRanges
source: Unstage Selected Ranges
uk: Скасувати вибрані діапазони

# config.untrackedChanges.separate
source: Untracked changes appear separately in the Source Control view. They are also excluded from several actions.
uk: Невідстежувані зміни з'являються окремо в перегляді Контролю джерел. Вони також виключені з кількох дій.

# config.untrackedChanges.hidden
source: Untracked changes are hidden and excluded from several actions.
uk: Невідслідковані зміни приховані та виключені з кількох дій.

# config.timeline.date.authored
source: Use the authored date
uk: Використовуйте дату авторства

# config.timeline.date.committed
source: Use the committed date
uk: Використовуйте дату зобов'язання

# command.stashView
source: View Stash...
uk: Переглянути сховище...

# config.fetchOnPull
source: When enabled, fetch all branches when pulling. Otherwise, fetch just the current one.
uk: Коли увімкнено, отримуйте всі гілки під час витягування. В іншому випадку отримуйте лише поточну.

# config.autofetch
source: When set to true, commits will automatically be fetched from the default remote of the current Git repository. Setting to `all` will fetch from all remotes.
uk: Коли встановлено на true, коміти автоматично будуть завантажені з віддаленого репозиторію за замовчуванням поточного Git-репозиторію. Встановлення на `all` завантажить з усіх віддалених репозиторіїв.

# config.enabled
source: Whether Git is enabled.
uk: Чи ввімкнено Git.

# config.autorefresh
source: Whether auto refreshing is enabled.
uk: Чи увімкнено автоматичне оновлення.

# view.workbench.cloneRepository
source: You can clone a repository locally. [Clone Repository](command:git.clone 'Clone a repository once the Git extension has activated')
uk: Ви можете клонувати репозиторій локально. [Клонувати репозиторій](command:git.clone 'Клонувати репозиторій після активації розширення Git')

# view.workbench.scm.missing.windows
source: [Download Git for Windows](https://git-scm.com/download/win) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
uk: [Завантажити Git для Windows](https://git-scm.com/download/win) Після встановлення, будь ласка, [перезавантажте](command:workbench.action.reloadWindow) (або [усуньте неполадки](command:git.showOutput)). Додаткові постачальники контролю версій можуть бути встановлені [з Маркетплейсу](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# view.workbench.scm.missing.mac
source: [Download Git for macOS](https://git-scm.com/download/mac) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
uk: [Завантажити Git для macOS](https://git-scm.com/download/mac) Після встановлення, будь ласка, [перезавантажте](command:workbench.action.reloadWindow) (або [усуньте неполадки](command:git.showOutput)). Додаткові провайдери контролю версій можуть бути встановлені [з Маркетплейсу](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# ++CODE++c2fa2f449ea8d49bbc3a9bf455f5d6c16ebe650897eb2d0338b98dddb021545f
source: Choose a URL to clone from.
uk: Виберіть URL для клонування.

# ++CODE++f9fee30a9be5a95956accba8731f5a0632ec4e0402929306bb7b7d2f3574cf09
source: No remote repositories found.
uk: Не знайдено віддалених репозиторіїв.

# ++CODE++d607ef6368c425c42a1ec43e35dc475df28f819680af42826c4d760073ad56b2
source: Provide repository URL
uk: Надайте URL репозиторію

# ++CODE++fbf6eba980bda8feba1c77235c85f44c9a15adfa8afd9ce0bd1bf1bf00c3a8a1
source: Provide repository URL or pick a repository source.
uk: Вкажіть URL репозиторію або виберіть джерело репозиторію.

# ++CODE++a2b1b3f24a4b0370e287023edc5ccf8c9b4d8af69e97a2f698cf3aa6dae8c558
source: Repository name
uk: Назва репозиторію

# ++CODE++31d53c86fdf2d53060cb71bb888f8ad83b1dd6e9c2be5ac389671386ba26e8fd
source: Repository name (type to search)
uk: Назва репозиторію (введіть для пошуку)

# ++CODE++968d1f3bdf727d26b2658b599484235429cded615ee52a054392cf8d3b3d7fac
source: recently opened
uk: недавно відкритий

# ++CODE++aceba33b4406f3906102cd82ed39a7fad9518d970f9b17b0c8d88623bfee1cb1
source: remote sources
uk: віддалені джерела

# ++CODE++8fcac67ee85e97fbfe731ebc3fca3a5beed1076700fe862d261a8e9ec529c7cd
source: {0} Error: {1}
uk: {0} Помилка: {1}

# description
source: Git static contributions and pickers.
uk: Git статичні внески та вибірки.
