Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.references-view.xlf
Languages: uk

# ++CODE++690cf05569eb4ea63e5139acfcd7d026340efad84c863b38e71182e0c89fa0e8
source: Callers Of
uk: Дзвонять до

# ++CODE++dc47a3b432839b7f407634205233f94048e637e8a5b6ff76f40a55a2a8cd75a4
source: Calls From
uk: Дзвінки з

# ++CODE++c9a4ff4843dbab2bcd5477b72f59872bfcad51dd85d558b4bc1d95a8a0897374
source: No results.
uk: Немає результатів.

# ++CODE++0f145d5de8b8221af245bc2f7f9f735d4f51be14ad5d76d21eb2998e08920f71
source: No results. Try running a previous search again:
uk: Немає результатів. Спробуйте ще раз виконати попередній пошук:

# ++CODE++9dbe33435dc0dde57b4ac64b7994a564fe7465274f571ab8ba6e30f6f0ee66e9
source: Open Call
uk: Відкритий конкурс

# ++CODE++3d760ee21947af8367641ba70266b0b8bfd46f4883b4920f5e74eab9784d3c1c
source: Open Reference
uk: Відкрити посилання

# ++CODE++3d305b4b90e322545c16f011aad8daef528a43e88992947e50b7a5ccae0e06b1
source: Open Type
uk: Відкритий тип

# ++CODE++69824d3b0e70ca6aaa0da1613b65fd914c442bf1f7ad1bb22bcdfbdfe1a05e39
source: References
uk: Посилання

# ++CODE++4004a79eaf29661f3548d4131219d944e668bc53c073de136e71c39a60f031a9
source: Rerun
uk: Перезапустити

# ++CODE++023956d4d7da95bc825370869c24ffafb249a9550bbf61151b5cdf7ada3b25b3
source: Select previous reference search
uk: Виберіть попередній пошук посилання

# ++CODE++f76b1e264f43c92a6b119af65e479f41ff7f3f5c50ab19ed1fbb392f227ecd1d
source: Subtypes Of
uk: Підтипи

# ++CODE++b84394ebf09b90dedf77ae9966f5d7ccbf9db2645a33084ea851166f8863fb20
source: Supertypes Of
uk: Супертипи

# ++CODE++185e5e9ad993828bbc0e3a5725272216c34e4afe4ae4a443d192226ee89bc185
source: {0} result in {1} file
uk: {0} результат у {1} файлі

# ++CODE++7d05c35f8ff8c84f4caba207051023809b2f81210b2d430a2e0e6033e570895d
source: {0} result in {1} files
uk: {0} результат у {1} файлах

# ++CODE++913fd27ee590c08bfcc64cf5d7a1da544446fb19778bd8c2db9aa3878c165af1
source: {0} results in {1} file
uk: {0} результати в {1} файлі

# ++CODE++f7b525ed5ce7b544168ca58c966948639db57b09c1c6c2b3e1ad0456f7443e36
source: {0} results in {1} files
uk: {0} результати в {1} файлах

# cmd.references-view.clear
source: Clear
uk: Очистити

# cmd.references-view.clearHistory
source: Clear History
uk: Очистити історію

# config.references.preferredLocation
source: Controls whether 'Peek References' or 'Find References' is invoked when selecting CodeLens references.
uk: Контролює, чи викликається 'Перегляд посилань' або 'Знайти посилання' при виборі посилань CodeLens.

# cmd.references-view.copy
source: Copy
uk: Копіювати

# cmd.references-view.copyAll
source: Copy All
uk: Скопіювати все

# cmd.references-view.copyPath
source: Copy Path
uk: Копіювати шлях

# cmd.references-view.removeTypeItem
source: Dismiss
uk: Відхилити

# cmd.references-view.removeCallItem
source: Dismiss
uk: Відхилити

# cmd.references-view.removeReferenceItem
source: Dismiss
uk: Відхилити

# cmd.references-view.findImplementations
source: Find All Implementations
uk: Знайти всі реалізації

# cmd.references-view.findReferences
source: Find All References
uk: Знайти всі посилання

# cmd.references-view.next
source: Go to Next Reference
uk: Перейти до наступної довідки

# cmd.references-view.prev
source: Go to Previous Reference
uk: Перейти до попередньої довідки

# view.title
source: Reference Search Results
uk: Результати пошуку посилань

# displayName
source: Reference Search View
uk: Перегляд пошуку посилань

# description
source: Reference Search results as separate, stable view in the sidebar
uk: Результати пошуку посилань як окремий, стабільний вигляд у бічній панелі

# cmd.category.references
source: References
uk: Посилання

# container.title
source: References
uk: Посилання

# cmd.references-view.refresh
source: Refresh
uk: Оновити

# cmd.references-view.refind
source: Rerun
uk: Перезапустити

# cmd.references-view.showCallHierarchy
source: Show Call Hierarchy
uk: Показати ієрархію викликів

# cmd.references-view.pickFromHistory
source: Show History
uk: Показати історію

# cmd.references-view.showIncomingCalls
source: Show Incoming Calls
uk: Показати вхідні дзвінки

# cmd.references-view.showOutgoingCalls
source: Show Outgoing Calls
uk: Показати вихідні дзвінки

# cmd.references-view.showSubtypes
source: Show Subtypes
uk: Показати підтипи

# cmd.references-view.showSupertypes
source: Show Supertypes
uk: Показати супертипи

# cmd.references-view.showTypeHierarchy
source: Show Type Hierarchy
uk: Показати ієрархію типів

# config.references.preferredLocation.peek
source: Show references in peek editor.
uk: Показати посилання в редакторі попереднього перегляду.

# config.references.preferredLocation.view
source: Show references in separate view.
uk: Показати посилання в окремому вигляді.
