Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.typescript-language-features.xlf
Languages: uk

# configuration.tsserver.web.projectWideIntellisense.suppressSemanticErrors
source: Suppresses semantic errors on web even when project wide IntelliSense is enabled. This is always on when project wide IntelliSense is not enabled or available. See `#typescript.tsserver.web.projectWideIntellisense.enabled#`
uk: Приховує семантичні помилки в вебі, навіть коли увімкнено IntelliSense для всього проєкту. Це завжди активовано, коли IntelliSense для всього проєкту не увімкнено або недоступно. Дивіться `#typescript.tsserver.web.projectWideIntellisense.enabled#`

# configuration.server
source: TS Server
uk: TS Сервер

# workspaceTrust
source: The extension requires workspace trust when the workspace version is used because it executes code specified by the workspace.
uk: Розширення вимагає довіри до робочого простору, коли використовується версія робочого простору, оскільки воно виконує код, вказаний робочим простором.

# configuration.tsserver.maxTsServerMemory
source: The maximum amount of memory (in MB) to allocate to the TypeScript server process. To use a memory limit greater than 4 GB, use `#typescript.tsserver.nodePath#` to run TS Server with a custom Node installation.
uk: Максимальна кількість пам'яті (в МБ), яку можна виділити для процесу сервера TypeScript. Щоб використовувати обмеження пам'яті більше 4 ГБ, використовуйте `#typescript.tsserver.nodePath#`, щоб запустити TS Server з власною установкою Node.

# configuration.hover.maximumLength
source: The maximum number of characters in a hover. If the hover is longer than this, it will be truncated. Requires TypeScript 5.9+.
uk: Максимальна кількість символів у ховері. Якщо ховер перевищує цю кількість, він буде обрізаний. Потрібен TypeScript 5.9+.

# taskDefinition.tsconfig.description
source: The tsconfig file that defines the TS build.
uk: Файл tsconfig, який визначає збірку TS.

# typescript.preferences.organizeImports.typeOrder.first
source: Type only named imports are sorted to the beginning of the import list. E.g. `import { type A, type Y, B, Z } from 'module';`
uk: Типові імпорти з іменами сортуються на початку списку імпортів. Наприклад, `import { type A, type Y, B, Z } from 'module';`

# typescript.preferences.organizeImports.typeOrder.last
source: Type only named imports are sorted to the end of the import list. E.g. `import { B, Z, type A, type Y } from 'module';`
uk: Імпорти тільки з іменами типів сортуються в кінець списку імпортів. Наприклад, `import { B, Z, type A, type Y } from 'module';`

# displayName
source: TypeScript and JavaScript Language Features
uk: Особливості мов TypeScript та JavaScript

# typescript.problemMatchers.tsc.label
source: TypeScript problems
uk: Проблеми з TypeScript

# typescript.problemMatchers.tscWatch.label
source: TypeScript problems (watch mode)
uk: Проблеми TypeScript (режим спостереження)

# typescript.preferences.organizeImports.caseFirst.upper
source: Upper-case comes before lower-case. E.g. ` A, a, B, b`.
uk: Великі літери йдуть перед малими. Наприклад, ` A, a, B, b`.

# typescript.locale.auto
source: Use VS Code's configured display language.
uk: Використовуйте налаштовану мову відображення VS Code.

# configuration.tsserver.watchOptions.vscode
source: Use VS Code's file watchers instead of TypeScript's. Requires using TypeScript 5.4+ in the workspace.
uk: Використовуйте спостерігачі файлів VS Code замість спостерігачів TypeScript. Потрібно використовувати TypeScript 5.4+ у робочому просторі.

# configuration.tsserver.useVsCodeWatcher
source: Use VS Code's file watchers instead of TypeScript's. Requires using TypeScript 5.4+ in the workspace.
uk: Використовуйте спостерігачі файлів VS Code замість спостерігачів TypeScript. Потрібно використовувати TypeScript 5.4+ у робочому просторі.

# configuration.tsserver.watchOptions.watchDirectory.dynamicPriorityPolling
source: Use a dynamic queue where less-frequently modified directories will be checked less often.
uk: Використовуйте динамічну чергу, де менш часто змінювані каталоги будуть перевірятися рідше.

# configuration.tsserver.watchOptions.fallbackPolling.dynamicPriorityPolling
source: Use a dynamic queue where less-frequently modified files will be checked less often.
uk: Використовуйте динамічну чергу, де файли, що змінюються рідше, будуть перевірятися рідше.

# configuration.tsserver.watchOptions.watchFile.dynamicPriorityPolling
source: Use a dynamic queue where less-frequently modified files will be checked less often.
uk: Використовуйте динамічну чергу, де файли, що змінюються рідше, будуть перевірятися рідше.

# configuration.tsserver.useSyntaxServer.always
source: Use a lighter weight syntax server to handle all IntelliSense operations. This syntax server can only provide IntelliSense for opened files.
uk: Використовуйте легший сервер синтаксису для обробки всіх операцій IntelliSense. Цей сервер синтаксису може надавати IntelliSense лише для відкритих файлів.

# typescript.preferences.importModuleSpecifierEnding.auto
source: Use project settings to select a default.
uk: Використовуйте налаштування проекту, щоб вибрати значення за замовчуванням.

# walkthroughs.nodejsWelcome.learnMoreAboutJs.description
source: Want to get more comfortable with JavaScript, Node.js, and VS Code? Be sure to check out our docs! We've got lots of resources for learning [JavaScript](https://code.visualstudio.com/docs/nodejs/working-with-javascript) and [Node.js](https://code.visualstudio.com/docs/nodejs/nodejs-tutorial). [Learn More](https://code.visualstudio.com/docs/nodejs/nodejs-tutorial)
uk: Хочете стати більш впевненими у JavaScript, Node.js та VS Code? Обов'язково ознайомтеся з нашою документацією! У нас є багато ресурсів для вивчення [JavaScript](https://code.visualstudio.com/docs/nodejs/working-with-javascript) та [Node.js](https://code.visualstudio.com/docs/nodejs/nodejs-tutorial). [Дізнатися більше](https://code.visualstudio.com/docs/nodejs/nodejs-tutorial)

# typescript.preferences.renameMatchingJsxTags
source: When on a JSX tag, try to rename the matching tag instead of renaming the symbol. Requires using TypeScript 5.1+ in the workspace.
uk: Коли ви на тегу JSX, спробуйте перейменувати відповідний тег замість перейменування символу. Потрібно використовувати TypeScript 5.1+ у робочому просторі.

# configuration.tsserver.watchOptions.fallbackPolling
source: When using file system events, this option specifies the polling strategy that gets used when the system runs out of native file watchers and/or doesn't support native file watchers.
uk: Коли використовуються події файлової системи, ця опція вказує стратегію опитування, яка використовується, коли система вичерпує кількість нативних спостерігачів файлів та/або не підтримує нативних спостерігачів файлів.
