Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.html-language-features.xlf
Languages: uk

# ++CODE++75187aa025dea458e1b9791f9ab58ba4306d5f5e60771aad15e3537cb0921ef8
source: 'from' expected
uk: 'from' очікується

# ++CODE++a9c3613e9b65b65e06ce22a4a3bef41773cb27abdeaf97d908e76655e3ae0228
source: 'in' expected
uk: 'in' очікується

# ++CODE++524dc66314cbb02dce27558312408d1bd7a0e8c065ab885313d1a46662cfb4a1
source: 'through' or 'to' expected
uk: 'через' або 'до' очікується

# ++CODE++55bc52341dd41a29fe1c56cd85dd2cd6c1ba78990f7e61fc6273d0e838f35a49
source: "store" a boolean test for later evaluation in a guard or if().
uk: "зберегти" булевий тест для подальшої оцінки в охоронці або if().

# ++CODE++ca3d4320c824d7ac54b858f6c5e43f8e5a568f4d01c0379f45e0a3a7faf5670a
source: ( expected
uk: ( очікується

# ++CODE++afcb0daa612202cf3b52a984dd238434653e3d782b8c8bdef023b56f3ba5f995
source: ) expected
uk: ) очікується

# ++CODE++a658352e038dc131ca5b14a7ac4ff8575db9aa3e11c1bc3668dec85b2fb36161
source: @font-face rule must define 'src' and 'font-family' properties
uk: Правило @font-face повинно визначати властивості 'src' та 'font-family'.

# ++CODE++e2b3045bc41a7d617d1d7d47118d48ef4155a7eb944fdbb3c605ee3ea109a993
source: A list of properties that are not validated against the `unknownProperties` rule.
uk: Список властивостей, які не підтверджені за правилом `unknownProperties`.

# ++CODE++61b2c7768672af3b337f7bb4a200735c8916a6fa67c9c4efe3e5954910f08984
source: Adds quotes to a string.
uk: Додає лапки до рядка.

# ++CODE++c4c3f68e03fa4a7ddca0c2b74f3be260b62543b07638ac2714023a0a4a4f51f5
source: Also define the standard property '{0}' for compatibility
uk: Також визначте стандартну властивість '{0}' для сумісності

# ++CODE++ade906cf72bb45e866817bf53761e3b3e8d89ff7ab144d8ea1a57427da75ca61
source: Always define standard rule '@keyframes' when defining keyframes.
uk: Завжди визначайте стандартне правило '@keyframes', коли визначаєте ключові кадри.

# ++CODE++9ad20d0dd82a4b92583cf642b2db1838f2da56d10ec8103aa28707a23735c11c
source: Always include all vendor specific properties: Missing: {0}
uk: Завжди включайте всі специфічні властивості постачальника: Відсутні: {0}

# ++CODE++c66c8146a58f8fbbea9ca38b88992578d800b20bd5820ca99eb45b4f7573a925
source: Always include all vendor specific rules: Missing: {0}
uk: Завжди включайте всі специфічні правила постачальника: Відсутні: {0}

# ++CODE++328362e3157e98c7050f981349eab773d770f69ec258a2967c0a784c3bf6a6e3
source: Appends a single value onto the end of a list.
uk: Додає одне значення в кінець списку.

# ++CODE++dcd13ed914c30525c21ba7bde58ddcfe700ea88c261da703cf842caf9b964c60
source: Appends selectors to one another without spaces in between.
uk: Додає селектори один до одного без пробілів між ними.

# ++CODE++4a7f927b2368164cb4a0029cc049dd5bce45359760f11f7a70dd5775deecbe24
source: Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.
uk: Уникайте використання !important. Це вказує на те, що специфічність усього CSS вийшла з-під контролю і потребує рефакторингу.

# ++CODE++554f334c48720b2f210cff788c2de11e9b016a77d252c9e1a84ec9c5229defd4
source: Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.
uk: Уникайте використання 'float'. Флоти призводять до крихкого CSS, який легко зламати, якщо змінюється один аспект макету.

# ++CODE++2d7ebf2bc4e5ccb35460e8ac0e45abaa3a0110ef76c58cb1b4d916d8932530e9
source: Causes one or more rules to be emitted at the root of the document.
uk: Викликає виведення одного або кількох правил на корені документа.

# ++CODE++ec045d74a1f42f2d866d2adcc566abc48e13597414cb55cc1a5dc0a0a5e0bedf
source: Changes one or more properties of a color.
uk: Змінює одну або кілька властивостей кольору.

# ++CODE++a01258fa5f6df0aa5326a67e6796a6e51bfb1ac183c2d1e4547fc1d6c735e367
source: Changes the alpha component for a color.
uk: Змінює альфа-компоненту для кольору.

# ++CODE++56d6eb384a863a05ef69d4feb40f280e9fce0a7f020489265a07851095b00ccc
source: Changes the hue of a color.
uk: Змінює відтінок кольору.

# ++CODE++611acce1a6f81050e5f48f6633be980c3fac4d95e9cca9de027002ec2f0221a2
source: Character entity representing '{0}'
uk: Сутність символу, що представляє '{0}'

# ++CODE++988e518f6ce5ba0d777773a4d63484b714e26ba91c3b8680de6c01f7f3dc56c9
source: Character entity representing '{0}', unicode equivalent '{1}'
uk: Сутність символу, що представляє '{0}', еквівалент юнікоду '{1}'

# ++CODE++31af7755508edcc3a8c05e776556cb3aefad2d9f9f53b9e37d7c0a820af995a6
source: Closing bracket expected.
uk: Очікується закриваюча дужка.

# ++CODE++95640a02d6420ceda52e40106848642e3758368c2be2921674af89cf40402a5c
source: Closing bracket missing.
uk: Відсутня закриваюча дужка.

# ++CODE++f1505b8c4b5488edc30ea2a2fa9e72effcdc8a4ea9d9c4adb97393c04311f5ff
source: Combines several lists into a single multidimensional list.
uk: Об'єднує кілька списків в один багатовимірний список.

# ++CODE++6defafa2caa65304173956e3fbc26b6947c50bc769c08c3da32c1032fa6519d4
source: Configure
uk: Налаштувати

# ++CODE++73d4b714d9f990427ffd8ae1137eb2a99148060ea3dc5dff922de3f496bc3595
source: Converts a color into the format understood by IE filters.
uk: Перетворює колір у формат, зрозумілий фільтрам IE.

# ++CODE++9b848b60a4fd80815a81656e3690591f31e270de1a949e482d88354151aee85f
source: Converts a color to grayscale.
uk: Перетворює колір у градації сірого.

# ++CODE++bd3deaf2dca22cdd67a57e9780990dcde73c535ef300f18ace705f848cb52f12
source: Converts a string to lower case.
uk: Перетворює рядок на малий регістр.

# ++CODE++7f3c0fcedb05fc4a896bc38d8ce05a41c5c487fbd00672cc37c82df4abde2c79
source: Converts a string to upper case.
uk: Перетворює рядок на великі літери.

# ++CODE++571b440d8447c934fc53ec6d699cd0bb2e4192c0d055cca91f88a1de74abefa2
source: Converts a unitless number to a percentage.
uk: Перетворює безрозмірне число в відсоток.

# ++CODE++a3d06339fee956689e48727343e0defe1e72b3f62a8b52a3d3136cda5ccc5c91
source: Creates a Color from hue, saturation, and lightness values.
uk: Створює колір з значень відтінку, насиченості та світлості.

# ++CODE++bf137d15c1ac6f778dd2381b9b02fec13b379301525aeb94bbf311512f3748a2
source: Creates a Color from hue, saturation, lightness, and alpha values.
uk: Створює колір з значень відтінку, насиченості, яскравості та альфа.

# ++CODE++f6c5548362040af17fa9ed3e917c9b40866f1d4e1b6062f4ff78bf90756b4b16
source: Creates a Color from hue, white, and black values.
uk: Створює колір з відтінку, білого та чорного значень.

# ++CODE++aa24928f87a106e1fea5f5a86bc61e118c2dd4dda4b967de4365332c4a1322fa
source: Creates a Color from lightness, a, and b values.
uk: Створює колір з значень світлості, a та b.

# ++CODE++402cb0931e0cb418cb38c52035d99151555d4d8dd3f134bbada40567f8eb6ff5
source: Creates a Color from lightness, chroma, and hue values.
uk: Створює колір з значень світлоти, хроми та відтінку.

# ++CODE++19ba64242a0bbd657eef71695d8fb9052e48d1888de34c8d57ea67c1bb8c126e
source: Creates a Color from red, green, and blue values.
uk: Створює колір з червоних, зелених та синіх значень.

# ++CODE++671f48990e087bb61e590db0d46ccc21428742bfaa2a150a74e274f4fd215415
source: Creates a Color from red, green, blue, and alpha values.
uk: Створює колір з червоних, зелених, синіх та альфа-значень.

# ++CODE++c5fabf9d4630f097e3a4912355a4e4e50da805531d9380ff922c60f52ca578f6
source: Creates a Color from the hue, saturation, and lightness values of another Color.
uk: Створює колір з відтінку, насиченості та яскравості значень іншого кольору.

# ++CODE++ee93d948aed89832108f44a004a7ae393e0e177c4c84e66146e55d37529b138b
source: Creates a Color from the hue, white, and black values of another Color.
uk: Створює колір з відтінку, білого та чорного значень іншого кольору.

# ++CODE++824c56886de36f7e853314ba78061dd62f0a376bd3f6e7b10ca0ce1f6b8723ca
source: Creates a Color from the lightness, a, and b values of another Color.
uk: Створює колір з параметрів світлості, a та b іншого кольору.

# ++CODE++17ac0ef0e27e0c91c64f22e25fe090e3aa957d4609190cf2612659c2c55e6ba3
source: Creates a Color from the lightness, chroma, and hue values of another Color.
uk: Створює колір з значень світлоти, хроматичності та відтінку іншого кольору.

# ++CODE++554fc4bef6ee5fa8aadf44a7e6db5d9a756946d5dba99b1c4e1a92cba99dd878
source: Creates a Color from the red, green, and blue values of another Color.
uk: Створює колір з червоних, зелених та синіх значень іншого кольору.

# ++CODE++e4fd597c7ce90105fc8e37c15a795d13003758628ffb3af92686a4decb7d9f62
source: Creates a Color in a specific color space from red, green, and blue values.
uk: Створює колір у конкретному кольоровому просторі з червоних, зелених і синіх значень.

# ++CODE++53beec914261b91f87c300dde721eaf22d5c38b654e2d6d74ba08837e69a5e21
source: Creates a Color in a specific color space from the red, green, and blue values of another Color.
uk: Створює колір у певному колірному просторі з червоних, зелених і синіх значень іншого кольору.

# ++CODE++adca022a34bc9876782070c903d5bcd68c859348b37f8a4c07ba9648fb0ae924
source: Defines complex operations that can be re-used throughout stylesheets.
uk: Визначає складні операції, які можна повторно використовувати в стилях.

# ++CODE++45fb20d28fdd5c862cc2722758fed35e556c618bbbf2caf0f6118e36fb0aad39
source: Defines styles that can be re-used throughout the stylesheet with `@include`.
uk: Визначає стилі, які можна повторно використовувати в усьому стилі з `@include`.

# ++CODE++05e389d1117404c2239e4282d08566ddf91ea9729483a1a7a74bd1e97276a6b7
source: Do not use duplicate style definitions
uk: Не використовуйте дублікати визначень стилю

# ++CODE++d20d0aff28626aeabd785e7200f58011e1a769b800c7f990b9a155f143d38110
source: Do not use empty rulesets
uk: Не використовуйте порожні набори правил

# ++CODE++54f23bf0b2cb97a6f1d02224d961e438175432653b6687dd4432bea05ddcdb49
source: Do not use width or height when using padding or border
uk: Не використовуйте ширину або висоту, коли використовуєте відступ або рамку

# ++CODE++ee1a12ca666831b707bbcac90392f3393f34e5da41ba6504c6002eb0e96bf04d
source: Dynamically calls a Sass function.
uk: Динамічно викликає функцію Sass.

# ++CODE++f7d0aa900e5f5f073078c5e6c1139c5eabdd4b9162f85292d4f4747fb5fe6177
source: Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.
uk: Кожен цикл, який встановлює `$var` на кожен елемент у списку або мапі, а потім виводить стилі, які він містить, використовуючи це значення `$var`.

# ++CODE++5bd8198f4aab620bb64e99b2fd358d5b30565ac0b06e60173c08c22f879dfcda
source: End tag name expected.
uk: Очікується ім'я закриваючого тегу.

# ++CODE++253fbf8e69a04e9a1b69d6b531b6aca8924585bc487860103910706bfb7874aa
source: Exposes the details of Sass’s inner workings.
uk: Відкриває деталі внутрішньої роботи Sass.

# ++CODE++19afff98e0cd0397f0d809267a024f6b7641384b42e1c7eef8a5654d5cbf1e67
source: Extends $extendee with $extender within $selector.
uk: Розширює $extendee за допомогою $extender в межах $selector.

# ++CODE++b010ba796d36ae3e3b36fd3337eb2f06fe437e51cd63b633accdbcbcb24f74a3
source: Extracts a substring from $string.
uk: Витягує підрядок з $string.

# ++CODE++bf40c3e59212416205f9be2c4926fc3d2dcde9592e0b1a28b75f125137820d33
source: Finds the maximum of several numbers.
uk: Знаходить максимум з кількох чисел.

# ++CODE++c34b8ef8baf6d189d5fe8a37d1522860152e3962ee0739150f45498bae32e4be
source: Finds the minimum of several numbers.
uk: Знаходить мінімальне значення кількох чисел.

# ++CODE++3fb782e7fac906889a76f15c719b39b4c5bf7f474efd9b62d82f7947c3e585cb
source: Fluidly scales one or more properties of a color.
uk: Гладко масштабує одну або кілька властивостей кольору.

# ++CODE++aeaa327786bc4298f85a4f1ab35407881ea5482dc4561e27887fb573171ea492
source: Folding Region End
uk: Кінець складеного регіону

# ++CODE++f5bff26750023f35ca78f0c7543c9bd5e4f23753325b64d28ffec84bfec13abf
source: Folding Region Start
uk: Початок складної області

# ++CODE++95c5d1d69a23b33d10946c763f2d9df656a57416954fdcbe652a0b4711885c19
source: For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.
uk: For loop, який повторно виводить набір стилів для кожного `$var` у клаузі `from/through` або `from/to`.

# ++CODE++27e2e04cfd2c0374add476cf56460210095beb7ab5721c20e2c4b7ce6db10324
source: Generates new colors based on existing ones, making it easy to build color themes.
uk: Генерує нові кольори на основі існуючих, спрощуючи створення кольорових тем.

# ++CODE++d0117c80b4b80f34173ad493516b0d9e07b4d5ff315104b3851db741a118b162
source: Gets the blue component of a color.
uk: Отримує синій компонент кольору.

# ++CODE++60e87507436436b69a468c99b8d6615d49a52e4029b8eaa1f5271fdb4d82ae03
source: Gets the green component of a color.
uk: Отримує зелений компонент кольору.

# ++CODE++8ec6738b749add4aea67bf104b8f2391b0186bea03b90831c289c6346239dcda
source: Gets the hue component of a color.
uk: Отримує компонент відтінку кольору.

# ++CODE++c7d9b0bb4b41d7ed9b7c1e2890d6dfa6fa373e2bf46da61a51c468f06733d3ee
source: Gets the lightness component of a color.
uk: Отримує компонент легкості кольору.

# ++CODE++a910e1de0a39464fbf10546ffbfb716220ea9bde8d607f4fddc7b7ad8c7cfec1
source: Gets the opacity component of a color.
uk: Отримує компонент непрозорості кольору.

# ++CODE++fbaa167b69141e2bac73f11ed5613b751db85c218b7fb51169cdcd3cc3197ff7
source: Gets the red component of a color.
uk: Отримує червоний компонент кольору.

# ++CODE++28b4e6a4f5d842f8ec4f73091433755a903739b4aba2bcd9f209e51eb5279666
source: Gets the saturation component of a color.
uk: Отримує компонент насиченості кольору.

# ++CODE++887621a07a2658b2dd1ba82400b0e474ebc57241ace11524c37f0a438104e065
source: HTML Language Server
uk: HTML Сервер Мови

# ++CODE++87e1c8b908a881778059d995666bc71abbd87b90642ce52d7697415f021cb4a4
source: Hex colors must consist of three, four, six or eight hex numbers
uk: Шістнадцяткові кольори повинні складатися з трьох, чотирьох, шести або восьми шістнадцяткових чисел

# ++CODE++0aefba2fa7ec8282aafcab7ec48be8e26a4247fe5f90e9a0a84e63168258208a
source: IE hacks are only necessary when supporting IE7 and older
uk: Хаки для IE необхідні лише при підтримці IE7 та старіших версій

# ++CODE++240ffff08178b4a2a9ac1c26c481c4c9f5f240be7c95a721ad8f39c18b7d688f
source: Import statements do not load in parallel
uk: Імпортні оператори не завантажуються паралельно

# ++CODE++45c1c001ba27d7aeb652aa8f8ed6b0e38a1e8787b7b16ea4780960db3480d684
source: Includes the body if the expression does not evaluate to `false` or `null`.
uk: Включає тіло, якщо вираз не оцінюється як `false` або `null`.

# ++CODE++6828342637601614878eafbd09cd8a6c3f888602127b26b103982c2ec668e295
source: Includes the styles defined by another mixin into the current rule.
uk: Включає стилі, визначені іншим міксином, у поточне правило.

# ++CODE++6a6d7f14f8428e451e5832e5739d8580ad4c18642e32b827302b169263d4f557
source: Increases or decreases one or more components of a color.
uk: Збільшує або зменшує один або кілька компонентів кольору.

# ++CODE++5046d7547124a531f9ab2408f2b2fffcd0bdadbbd2c2a25c95fe0268739d6e71
source: Inherits the styles of another selector.
uk: Спадкує стилі іншого селектора.

# ++CODE++57cc411cf3744046ce1ad9699887ece9e34e139871b6455a34cbad4f3fd11882
source: Inserts $insert into $string at $index.
uk: Вставляє $insert у $string на $index.

# ++CODE++01848e8b0305caeef0c59946acd37958142a88206b6372d9e92929c2eb383ec3
source: Invalid number of parameters
uk: Неправильна кількість параметрів

# ++CODE++2f583e74789547eecd30f530ee3d3b4c99838a23368566a20adf1ba8b33e0fdc
source: Joins together two lists into one.
uk: Об'єднує два списки в один.

# ++CODE++523704401331d269f7f7f30a791c91e9998bd3c43f62fcbe4526037d797bca5f
source: Lets you access and modify values in lists.
uk: Дозволяє вам отримувати доступ і змінювати значення в списках.

# ++CODE++4da532fc4b2e5428e58e84c5a31b787388d42323af776d05b990b867edf41371
source: Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.
uk: Завантажує стилі листа Sass і робить його міксини, функції та змінні доступними, коли цей стилі лист завантажується за допомогою правила @use.

# ++CODE++8ac0741963a15f18f4614ccb468b9e76bc20e90ae835fa45f952e933f273e2f0
source: Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.
uk: Завантажує міксини, функції та змінні з інших стилів Sass як 'модулі' та об'єднує CSS з кількох стилів разом.

# ++CODE++a618705f9014e7f78e3e29d9d8096f5f90c2018206c046ab0a6065dbf8a208bc
source: Makes a color darker.
uk: Затемнює колір.

# ++CODE++5ec5f64a976de89207566d11d8a43b33727e924f6c8788dae44cba2c2dc59204
source: Makes a color less saturated.
uk: Зменшує насиченість кольору.

# ++CODE++902905d3667a78d13d4e8162f2d395387403a220542d9f42709ea6759c8ae499
source: Makes a color lighter.
uk: Зробити колір світлішим.

# ++CODE++a8d2b18d28d11f7e9c579fd9f089e4c82c4e21fe3e3ff60420fcfebcaf15929b
source: Makes a color more opaque.
uk: Зробити колір більш непрозорим.

# ++CODE++d5df82bf6ec5e993a92d3ce0db72c68b77e44d0624b0bf584530d55257b45aa8
source: Makes a color more saturated.
uk: Збільшує насиченість кольору.

# ++CODE++eb87b944525a4883ccb7ed33f01941418367b0b368c168a1b360b0a3d5860176
source: Makes a color more transparent.
uk: Зробити колір більш прозорим.

# ++CODE++daae99f8e36e169ab555c491dd93f96750cbfe25d68b7aba256e3f1040dfc6c5
source: Makes it easy to combine, search, or split apart strings.
uk: Забезпечує легкість у поєднанні, пошуку або розділенні рядків.

# ++CODE++677797fc64cf8aa11ee9e3dffb15fbaf17f9f7edc84befef8123cdd2612e92b8
source: Makes it possible to look up the value associated with a key in a map, and much more.
uk: Дозволяє шукати значення, пов'язане з ключем у мапі, і багато іншого.

# ++CODE++1a41a4ddfcd453e97cdd7e463bcb984cf4e63e76f610631ea2ddeca3c4c324ad
source: Merges two maps together into a new map.
uk: Об'єднує дві мапи в нову мапу.

# ++CODE++81b53a247c98fcee1e40697f1a19bd8b2b906bd91b67aaee736256547758af52
source: Mix two colors together in a polar color space.
uk: Змішайте два кольори разом у полярному кольоровому просторі.

# ++CODE++a2ff091608fc4e4e9d57b7d50eb676dc9ca0da39ea315ab61fa95bc4d5b4221b
source: Mix two colors together in a rectangular color space.
uk: Змішайте два кольори разом у прямокутному кольоровому просторі.

# ++CODE++1a2cebef79cf29b6bec13028808c23687e1d32d7b128b07727d98f7761b9fcc7
source: Mixes two colors together.
uk: Змішує два кольори разом.

# ++CODE++e4d9cffe73c722d60797bb9b8717aa00068dda35371bb56c718e1f759eaea1f0
source: Nests selector beneath one another like they would be nested in the stylesheet.
uk: Вибірники вкладені один під одним, як якби вони були вкладені в таблиці стилів.

# ++CODE++c7208f9542aef2d34110c411384c1c8741c5fbdd797eb1fb5be952c3437da6b8
source: No unit for zero needed
uk: Не потрібна одиниця для нуля

# ++CODE++c99ca8df489d0b021ece6ea6d1bd1b1d3a3a08161e1e86952c3fe7b2e967de52
source: Parses a selector into the format returned by &.
uk: Парсить селектор у формат, що повертається за допомогою &.

# ++CODE++4bb05217bb482c4a67b7fea9f5f288b21d8582c3679ad5a11e4b92a0ae3f9d43
source: Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.
uk: Виводить значення виразу в стандартний потік помилок. Корисно для налагодження складних файлів Sass.

# ++CODE++1ca5485f24079c598401ece13355764f38073c73a13c9b1526b18fad0b2af124
source: Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.
uk: Виводить значення виразу в стандартний потік помилок. Корисно для бібліотек, які повинні попереджати користувачів про застарілість або відновлюватися після незначних помилок використання міксинів. Попередження можна вимкнути за допомогою параметра командного рядка `--quiet` або параметра Sass `:quiet`.

# ++CODE++586d54e2861db99f74abc9d8bbda3be191e8cf1d7ab6fdfdc05e137e54506f72
source: Property is ignored due to the display.
uk: Властивість ігнорується через відображення.

# ++CODE++2173b5f429352047080631c2fc4cf98f5fef284cd105ae2f42dfc4b6a6c140e7
source: Property is ignored due to the display. With 'display: block', vertical-align should not be used.
uk: Властивість ігнорується через відображення. З 'display: block' вертикальне вирівнювання не повинно використовуватися.

# ++CODE++4e31a7655f7de555085e0bb160cc5fd46b74ffe8f0653350af3625f39e2327d3
source: Provides access to Sass’s powerful selector engine.
uk: Надає доступ до потужного механізму селекторів Sass.

# ++CODE++7328b1261d0f87a235bb06f14c5c61cd2b935e2e13b49d948ccb0c73534f2a7b
source: Provides functions that operate on numbers.
uk: Надає функції, які працюють з числами.

# ++CODE++e370cda5bb4aab6d58c9f44f42e96c984833ccafe51ea06c6438177e1b736792
source: Removes quotes from a string.
uk: Видаляє лапки з рядка.

# ++CODE++3e1e2dd1d17b0c002b48bcd81c96261572ec95a667667077c8e36e54a6077ae0
source: Rename to '{0}'
uk: Перейменувати на '{0}'

# ++CODE++952d47272fc7e0139654f1facacdba47c68f34e76ba4acda0fc4c83897b7e3ed
source: Replaces $original with $replacement within $selector.
uk: Замінює $original на $replacement в межах $selector.

# ++CODE++cabd508a005fe0d202a258ebee88b3526959c3086e36d0aa0c104ffa4851f799
source: Replaces the nth item in a list.
uk: Замінює n-й елемент у списку.

# ++CODE++cda2f554fceaaafa1936205fa7696015fd1149277adf81fd1ee155f6f0636a5b
source: Returns a list of all keys in a map.
uk: Повертає список усіх ключів у мапі.

# ++CODE++a24dde40803dbc135aec76e61a0c2d7d0a60bf6f1d896ef9808ec04842fd025d
source: Returns a list of all values in a map.
uk: Повертає список усіх значень у мапі.

# ++CODE++7f5619fec0c13a37a54756347b04cb45ea88203f0bac502efccd3f839a6a8a11
source: Returns a new map with keys removed.
uk: Повертає нову мапу з видаленими ключами.

# ++CODE++6ea577938d0a2e57db0ef70fd362ad06651ff8951c1428f527f1a4914d047ffd
source: Returns a random number.
uk: Повертає випадкове число.

# ++CODE++8fdd79c593cc64c4cf439a94fc77ab78e77eceb4f564907d35bc179a1d2596d6
source: Returns a specific item in a list.
uk: Повертає конкретний елемент у списку.

# ++CODE++880ae967f683284035050ee09f8688b18193ace7d3b10ef03d4ec424553e96a5
source: Returns the absolute value of a number.
uk: Повертає абсолютне значення числа.

# ++CODE++e667ba7add6bca292e591a9c1926e17b28c58a0e1336b40b90fd10c0de75bc28
source: Returns the complement of a color.
uk: Повертає доповнення кольору.

# ++CODE++c3005da07706d0c1b502470ca89ec016ab5be8d0500a93e0cdec984fdb28054f
source: Returns the index of the first occurance of $substring in $string.
uk: Повертає індекс першого входження $substring в $string.

# ++CODE++303ca79f4f13eeae35c9dcc32c3eaf246792be472594c4b314b3d43c6c7bdbbf
source: Returns the inverse of a color.
uk: Повертає обернене значення кольору.

# ++CODE++86b50480edbbc70b48ad5a49a03536c70842591666079f4f734c43d7ad182b34
source: Returns the keywords passed to a function that takes variable arguments.
uk: Повертає ключові слова, передані функції, яка приймає змінні аргументи.

# ++CODE++9602c7d20ab61fcb6abe79f0b6a5e762e42fdc7d005aad9aaa7267250bac19c0
source: Returns the length of a list.
uk: Повертає довжину списку.

# ++CODE++f8a658fbed6a52b3694e0416ce1c9bcf7eeefe7a38e2b5f48d37fa3eef37faa1
source: Returns the number of characters in a string.
uk: Повертає кількість символів у рядку.

# ++CODE++cc23b9f46906a8e6603c16b00fe8a8b4c71d5d532f3df95a466099618a0757a3
source: Returns the position of a value within a list.
uk: Повертає позицію значення в списку.
