Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.html-language-features.xlf
Languages: uk

# html.format.indentHandlebars.desc
source: Format and indent `{{#foo}}` and `{{/foo}}`.
uk: Форматувати та відступити `{{#foo}}` та `{{/foo}}`.

# displayName
source: HTML Language Features
uk: Особливості мови HTML

# html.format.templating.desc
source: Honor django, erb, handlebars and php templating language tags.
uk: Вшануй теги мов шаблонів django, erb, handlebars та php.

# html.format.indentInnerHtml.desc
source: Indent `<head>` and `<body>` sections.
uk: Відступіть секції `<head>` та `<body>`.

# html.format.wrapAttributesIndentSize.desc
source: Indent wrapped attributes to after N characters. Use `null` to use the default indent size. Ignored if `#html.format.wrapAttributes#` is set to `aligned`.
uk: Відступити обгорнуті атрибути після N символів. Використовуйте `null`, щоб використовувати розмір відступу за замовчуванням. Ігнорується, якщо `#html.format.wrapAttributes#` встановлено на `aligned`.

# html.format.unformattedContentDelimiter.desc
source: Keep text content together between this string.
uk: Тримайте текстовий контент разом між цим рядком.

# html.format.extraLiners.desc
source: List of tags, comma separated, that should have an extra newline before them. `null` defaults to `"head, body, /html"`.
uk: Список тегів, розділених комами, перед якими має бути додатковий переніс рядка. `null` за замовчуванням дорівнює `"head, body, /html"`.

# html.format.unformatted.desc
source: List of tags, comma separated, that shouldn't be reformatted. `null` defaults to all tags listed at https://www.w3.org/TR/html5/dom.html#phrasing-content.
uk: Список тегів, розділених комами, які не повинні бути переформатовані. `null` за замовчуванням означає всі теги, вказані на https://www.w3.org/TR/html5/dom.html#phrasing-content.

# html.format.contentUnformatted.desc
source: List of tags, comma separated, where the content shouldn't be reformatted. `null` defaults to the `pre` tag.
uk: Список тегів, розділених комами, де вміст не повинен бути переформатований. `null` за замовчуванням відповідає тегу `pre`.

# html.format.wrapLineLength.desc
source: Maximum amount of characters per line (0 = disable).
uk: Максимальна кількість символів на рядок (0 = вимкнути).

# html.format.maxPreserveNewLines.desc
source: Maximum number of line breaks to be preserved in one chunk. Use `null` for unlimited.
uk: Максимальна кількість переносів рядків, які потрібно зберегти в одному фрагменті. Використовуйте `null` для необмеженого.

# html.format.wrapAttributes.preservealigned
source: Preserve wrapping of attributes but align.
uk: Зберегти обгортку атрибутів, але вирівняти.

# html.format.wrapAttributes.preserve
source: Preserve wrapping of attributes.
uk: Зберегти обгортку атрибутів.

# description
source: Provides rich language support for HTML and Handlebar files
uk: Надає розширену підтримку мов для файлів HTML та Handlebar

# html.hover.references
source: Show references to MDN in hover.
uk: Показати посилання на MDN при наведенні.

# html.hover.documentation
source: Show tag and attribute documentation in hover.
uk: Показати документацію тегів та атрибутів при наведенні.

# html.trace.server.desc
source: Traces the communication between VS Code and the HTML language server.
uk: Відстежує комунікацію між VS Code та сервером мови HTML.

# html.format.wrapAttributes.auto
source: Wrap attributes only when line length is exceeded.
uk: Обгортати атрибути лише коли перевищена довжина рядка.

# html.format.wrapAttributes.desc
source: Wrap attributes.
uk: Обгортати атрибути.

# html.format.wrapAttributes.forcealign
source: Wrap each attribute except first and keep aligned.
uk: Обгорніть кожен атрибут, крім першого, і зберігайте вирівнювання.

# html.format.wrapAttributes.force
source: Wrap each attribute except first.
uk: Обгорніть кожен атрибут, крім першого.

# html.format.wrapAttributes.forcemultiline
source: Wrap each attribute.
uk: Обгорніть кожен атрибут.

# html.format.wrapAttributes.alignedmultiple
source: Wrap when line length is exceeded, align attributes vertically.
uk: Обгортати, коли перевищена довжина рядка, вирівнювати атрибути вертикально.
