Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.php-language-features.xlf
Languages: uk

# ++CODE++a672d54b87df71bf836b86ddeb97b023cc1e4c471aa5bb40106151f91d221760
source: Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.
uk: Не вдалося перевірити, оскільки установка PHP не була знайдена. Використовуйте налаштування 'php.validate.executablePath', щоб налаштувати виконуваний файл PHP.

# ++CODE++440e4d34486580e60277cd8a924216c3d7f72bb4803257c8f75dd013201cc474
source: Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.
uk: Не вдається перевірити, оскільки не встановлено виконуваний файл PHP. Використайте налаштування 'php.validate.executablePath', щоб налаштувати виконуваний файл PHP.

# ++CODE++a2b0c138e62e546b529a12d0e6148999c8dd88b53789493dcbf99b9a2f1abcf1
source: Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.
uk: Не вдається перевірити, оскільки {0} не є дійсним виконуваним файлом php. Використайте налаштування 'php.validate.executablePath', щоб налаштувати виконуваний файл PHP.

# ++CODE++6c2541aae942abc4c387918fdc47f1f20fa9f21a05e5702deb62dc96b241cf56
source: Failed to run php using path: {0}. Reason is unknown.
uk: Не вдалося запустити php за шляхом: {0}. Причина невідома.

# ++CODE++3f940108cb1ecd9c0090da0b51b45f9fe673f00b22c7ffe3d013319b97456674
source: Open Settings
uk: Відкрити Налаштування

# configuration.suggest.basic
source: Controls whether the built-in PHP language suggestions are enabled. The support suggests PHP globals and variables.
uk: Контролює, чи увімкнені вбудовані пропозиції мови PHP. Підтримка пропонує глобальні змінні та змінні PHP.

# command.untrustValidationExecutable
source: Disallow PHP validation executable (defined as workspace setting)
uk: Не дозволяти виконуваний файл валідації PHP (визначено як налаштування робочого простору)

# configuration.validate.enable
source: Enable/disable built-in PHP validation.
uk: Увімкнути/вимкнути вбудовану валідацію PHP.

# displayName
source: PHP Language Features
uk: Особливості мови PHP

# configuration.validate.executablePath
source: Points to the PHP executable.
uk: Вказує на виконуваний файл PHP.

# description
source: Provides rich language support for PHP files.
uk: Надає розширену підтримку мовлення для файлів PHP.

# workspaceTrust
source: The extension requires workspace trust when the `php.validate.executablePath` setting will load a version of PHP in the workspace.
uk: Розширення вимагає довіри до робочого простору, коли налаштування `php.validate.executablePath` завантажить версію PHP у робочому просторі.

# configuration.validate.run
source: Whether the linter is run on save or on type.
uk: Чи запускається лінтер при збереженні, чи при введенні.
