Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.configuration-editing.xlf
Languages: uk

# ++CODE++d029f87e3d80f8fd9b1be67c7426b4cc1ff47b4a9d0a8461c826a59d8c5eb6cd
source: Example
uk: Приклад

# ++CODE++d0f4445fcf942aca3a710f2f609469ebca0f2a6662e2c6ab58503e9e3ab7b13a
source: Files by Extension
uk: Файли за розширенням

# ++CODE++8ef2a9934a7a2de4a4de93f34a48cd5b306d6768317ebeb3dcea26de2479eec3
source: Files with Extension
uk: Файли з розширенням

# ++CODE++01d3ae1e827f62fb5c7536bb0f590c8731fb9d3d4d9ffd1d022546e5ead8271b
source: Files with Multiple Extensions
uk: Файли з кількома розширеннями

# ++CODE++23b20faa9a8da334fff0e52c32791469fea1d12b83272bc482b4cff993ca80ef
source: Files with Path
uk: Файли з шляхом

# ++CODE++c1574e2e356f38272b274c964aa5c8b71bb0e88479f6548e2bdf8bbcf2cecf2c
source: Files with Siblings by Name
uk: Файли з братами та сестрами за іменем

# ++CODE++bf87f1afb5c3fb6f977fb026053a622287392593a89f4fb161196ec59460ec99
source: Folder by Name (Any Location)
uk: Папка за назвою (будь-яке місце)

# ++CODE++c134dfe20ebb45ad2b2f81d28eea7b0d3af7ae530514f82ae6dd221b5a2d31ff
source: Folder by Name (Top Level)
uk: Папка за назвою (вищий рівень)

# ++CODE++8e5865d792217e3a3b5a57153243121df17374c04aa27244e013f2b81b59fa9b
source: Folders with Multiple Names (Top Level)
uk: Папки з кількома іменами (верхній рівень)

# ++CODE++0af0dad21a267ab4495ed36cffc6adcc145f8df95d1bb0fa1c0f0e00561fafa6
source: Map all files matching the absolute path glob pattern in their path to the language with the given identifier.
uk: Складіть мапу всіх файлів, що відповідають шаблону абсолютного шляху в їхньому шляху, до мови з вказаним ідентифікатором.

# ++CODE++280f8ba0005f806081f59c0ae0e7584946b2edbd92d48f950d056e29f9d54934
source: Map all files matching the glob pattern in their filename to the language with the given identifier.
uk: Складіть карту всіх файлів, що відповідають шаблону glob у їхніх іменах файлів, до мови з вказаним ідентифікатором.

# ++CODE++a9e7ced68ba5a9efa7ca2c5aa9e366575acffcc10425787b81e2dc4518b926aa
source: Match a folder with a specific name in any location.
uk: Знайдіть папку з конкретною назвою в будь-якому місці.

# ++CODE++52e6f2486d0bfc506271d740dab9aace304455e76fc0b1527c93ed2aac29ed18
source: Match a top level folder with a specific name.
uk: Відповідність верхнього рівня папки з конкретною назвою.

# ++CODE++3ea7a86ce7fc60524727fd7722b3939c4dd9f555a5d69d3d429ed83828f7ced7
source: Match all files of a specific file extension.
uk: Знайти всі файли з певним розширенням.

# ++CODE++3279ecaae39894c87b6d7cdf6f0a08c7c36382412697701224a430c783be7177
source: Match all files with any of the file extensions.
uk: Відповідність усім файлам з будь-яким з розширень файлів.

# ++CODE++00fa5684878110eb2287d2bfa5835d541cc83757db048920cfa3111aedc110d8
source: Match files that have siblings with the same name but a different extension.
uk: Знайдіть файли, які мають братів і сестер з однаковим ім'ям, але з іншими розширеннями.

# ++CODE++d430f773455bc23d0671aee907e3fc6a9a0d7cad24bf0c1256f92922543e37ae
source: Match multiple top level folders.
uk: Відповідність кільком верхнім папкам.

# ++CODE++47854f791dc57145478e045a110fbb42572f74a52a58b5c5c348a5231cc62dbc
source: The character used by the operating system to separate components in file paths. Is also aliased to '/'.
uk: Символ, що використовується операційною системою для розділення компонентів у шляхах до файлів. Також має псевдонім '/'.

# ++CODE++8520d36040a5e5ec1235c8bf9c72025dd1d4ca7da770c7e8970a4393a06a008b
source: The current opened file
uk: Відкритий файл

# ++CODE++6dbef7e4684c9e2d8592e0fff30b507a153196b17361bfd783ddb38e97bce5f7
source: The current opened file relative to ${workspaceFolder}
uk: Відкритий файл відносно ${workspaceFolder}

# ++CODE++622e4bdc0d03e6fc5b03e3afbd84db23901641923f3aeaad039de69b6d6c72f9
source: The current opened file workspace folder name without any slashes (/)
uk: Ім'я папки робочого простору відкритого файлу без жодних слешів (/)

# ++CODE++6c665657c901da145b7912f1b3d6d1ff2902e6c6a8a1f35da9efae69ea9e8e4d
source: The current opened file's basename
uk: Базове ім'я відкритого файлу

# ++CODE++d248ae910c49e7269f9c51352862f4cb63c3d4387a1acfde86f79bca8e4ca2ba
source: The current opened file's basename with no file extension
uk: Базова назва відкритого файлу без розширення файлу

# ++CODE++c0cc1eaa6b19b8368f860e709938d229194e5b158a61c5d6d46c0f96e3261058
source: The current opened file's dirname
uk: Ім'я каталогу відкритого файлу

# ++CODE++166528b1f37ec31d7608be0c04bcae27c445c27bd12d846d0d108bba966293ab
source: The current opened file's dirname relative to ${workspaceFolder}
uk: Поточний каталог відкритого файлу відносно ${workspaceFolder}

# ++CODE++65567b4768e9acd24f7c6e947c0bf48560747553867b1c9b41e0d500df5f48c7
source: The current opened file's extension
uk: Розширення відкритого файлу

# ++CODE++bb0d3af81a7f3e7b40030b72ec6aa244268075a6e80f97acc33fa759f34acba0
source: The current selected line number in the active file
uk: Поточний вибраний номер рядка в активному файлі

# ++CODE++9d7edbed20f782bf84002626a6679567dd8a9ec7179529cefe66218225080d8a
source: The current selected text in the active file
uk: Поточний вибраний текст у активному файлі

# ++CODE++b8fd20ef55de62a682bbeb2a7dea6d7bab25de852ce4b6d8e948dd16430a4ddc
source: The file extension of the editor (e.g. txt)
uk: Розширення файлу редактора (наприклад, txt)

# ++CODE++f640baf16c8b3a4229376f1186e108a68019bcc4ca5f139633c25b65b8f4cf76
source: The file name of the editor without its directory or extension (e.g. myFile)
uk: Ім'я файлу редактора без його каталогу або розширення (наприклад, myFile)

# ++CODE++b3527f00212c91c21f27367700bec04e8643b10c6b107861722abb2433671afa
source: The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.
uk: Назва завдання збірки за замовчуванням. Якщо немає єдиного завдання збірки за замовчуванням, тоді відображається швидкий вибір для вибору завдання збірки.

# ++CODE++3b86f12d87758adb092bffecba498b8faa0bbc6ee302e42f56c0c01c912221e6
source: The name of the folder opened in VS Code without any slashes (/)
uk: Назва папки, відкритої в VS Code без жодних слешів (/)

# ++CODE++f5b79eb894a66fd54b05e969c54c4dc8e9d35ced4c9efb95bbca0c5449cfc05d
source: The nth parent folder name of the editor
uk: Назва n-ного батьківського каталогу редактора

# ++CODE++70d323fc94568a27a0d15d1a64d3b1e53b9e6d737e80f6aadbba92d63eccc4f8
source: The parent folder name of the editor (e.g. myFileFolder)
uk: Ім'я батьківської папки редактора (наприклад, myFileFolder)

# ++CODE++8417d7d45f45407a0c18be692c746f117166016b0ead94aada5826cb1b026ef0
source: The path of the folder opened in VS Code
uk: Шлях до папки, відкритої в VS Code

# ++CODE++58b6f5a5b0b82474a5d40e2ae09a2ca7dd68e46f36f500870ec6888bf554fd22
source: The path where an extension is installed.
uk: Шлях, де встановлено розширення.

# ++CODE++870ddddad833e626f0c072455ee4ae98fda3111f13b549d1c29d4107b0c5ae68
source: The task runner's current working directory on startup
uk: Поточний робочий каталог виконуваного завдання під час запуску

# ++CODE++ecf4d78b9ab75ca50b98222e594248911a897a5bba63112c18874b26aa30b339
source: Use the language of the currently active text editor if any
uk: Використовуйте мову поточного активного текстового редактора, якщо такий є

# ++CODE++4dc269fa1407cf9ef463608d855a3b989ad557a223606213066468e9e5be90d1
source: a conditional separator (' - ') that only shows when surrounded by variables with values
uk: умовний роздільник (' - '), який відображається лише тоді, коли оточений змінними з значеннями

# ++CODE++ac229109905600e8d939f01d30b794bb838409e90ab1a3cbe3b8f37ad1ffb75e
source: an indicator for when the active editor has unsaved changes
uk: індикатор, коли активний редактор має незбережені зміни

# ++CODE++79e89de3cc4e99f0daa1607e05e176cc7b7b7fe1e662e220f75c26a425158d20
source: e.g. SSH
uk: наприклад, SSH

# ++CODE++6ca777591d4daf6d5beb528b9da9760b596cb27635b59d374651b3f61ec71d9e
source: e.g. VS Code
uk: наприклад, VS Code

# ++CODE++f2e641e7d2af8e01ae5adfef3bfbab8a2a96493b3499061b147d8675e503811d
source: file path of the workspace (e.g. /Users/Development/myWorkspace)
uk: шлях до файлу робочого простору (наприклад, /Users/Development/myWorkspace)

# ++CODE++41e2498b8e0f9019cc43253f55701b803f92b3ef3c47fb6a70babeb0a782577c
source: file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)
uk: шлях до файлу папки робочого простору, в якій міститься файл (наприклад, /Users/Development/myFolder)

# ++CODE++b1c76e6a52867105fa6ccedd16e86de8c13ac300ca2e54a4ab192df4a5755f9a
source: gist
uk: суть

# ++CODE++6dbc0536af667db124d8df0063ce2d662652d0a8b0bac9fc12f8b1b16897c71b
source: name of the workspace folder the file is contained in (e.g. myFolder)
uk: назва папки робочого простору, в якій міститься файл (наприклад, myFolder)

# ++CODE++a6b2024de55c983650f75343e7cb3f0eb534093a25218aef0afeb1d733ed126a
source: name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))
uk: ім'я робочого простору з необов'язковим віддаленим ім'ям та індикатором робочого простору, якщо це застосовно (наприклад, myFolder, myRemoteFolder [SSH] або myWorkspace (Workspace))

# ++CODE++bb9dba82aec7202e95d28570b6121898995a446f80ea493cc0c002523d355254
source: shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)
uk: скорочене ім'я робочого простору без суфіксів (наприклад, myFolder або myWorkspace)

# ++CODE++11a174dbf25f5cb97fa1038b2e342a739e26fabdccfe6c1b2240c277eb585e68
source: the file name (e.g. myFile.txt)
uk: ім'я файлу (наприклад, myFile.txt)

# ++CODE++1461a401834198f224c399100891ace390fa161d679754b940d02b37b972dcf2
source: the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)
uk: повний шлях до файлу (наприклад, /Users/Development/myFolder/myFileFolder/myFile.txt)

# ++CODE++7c2eee462e5c71eedce642ff50e6a2bd0c0c540c49642d8f7bb87446a18a5099
source: the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)
uk: повний шлях до папки, в якій міститься файл (наприклад, /Users/Development/myFolder/myFileFolder)

# ++CODE++2d0092f01e3fef5ee5d9d3eb5ec457f655cfc5dce3df6c709fa72975919a2131
source: the name of the active branch in the active repository (e.g. main)
uk: назва активної гілки в активному репозиторії (наприклад, main)

# ++CODE++9a677a337c5ab04d8b992d09c88a6136fd0c880e51c7e99295e140ce16fc2847
source: the name of the active repository (e.g. vscode)
uk: назва активного репозиторію (наприклад, vscode)

# ++CODE++b840d30b86977eaf329276b158f0df3bd68c9b7a1ce7aa9592c5e3422026a1c7
source: the name of the folder the file is contained in (e.g. myFileFolder)
uk: ім'я папки, в якій міститься файл (наприклад, myFileFolder)

# ++CODE++6c6f5a47c00d66770df5ff4d573bc9d53b7bf0d812c38ce7db9f6c0ecf2eb924
source: the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)
uk: шлях до файлу відносно папки робочого простору (наприклад, myFolder/myFileFolder/myFile.txt)

# ++CODE++2a4d71ac91f87f0aba770ca8b46b23e3ae41aba986258cfd5eb03806638639da
source: the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)
uk: шлях папки, в якій міститься файл, відносно папки робочого простору (наприклад, myFolder/myFileFolder)

# ++CODE++a726fc40810f8a26b58326ccb1d9b438d414983e907a48f80fdfbadbeeec491b
source: the state of the active editor (e.g. modified).
uk: стан активного редактора (наприклад, змінено).

# displayName
source: Configuration Editing
uk: Редагування конфігурації

# description
source: Provides capabilities (advanced IntelliSense, auto-fixing) in configuration files like settings, launch, and extension recommendation files.
uk: Надає можливості (розширений IntelliSense, автоматичне виправлення) у файлах конфігурації, таких як налаштування, запуск і файли рекомендацій розширень.
