Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.json-language-features.xlf
Languages: uk

# ++CODE++6ccb89929298043ae28e5090382c4b47c78ad321725a7be9fe6e375de6dabcad
source: $ref '{0}' in '{1}' can not be resolved.
uk: $ref '{0}' у '{1}' не може бути розпізнаний.

# ++CODE++42a7fe43f4d9ba1324a8ff5aa47fba093b7caa637d0607c534eabb724f481b2c
source: A default value. Used by suggestions.
uk: Значення за замовчуванням. Використовується пропозиціями.

# ++CODE++b37ca3c37f727ab64423dbae876c9a349db0e2bd7193eee262786bd4a8062252
source: A descriptive title of the schema.
uk: Описовий заголовок схеми.

# ++CODE++58572c68d8012f0ae75652f0ab23c8165c4298791c1019ddb6f1e905791998ec
source: A long description of the schema. Used in hover menus and suggestions.
uk: Довгий опис схеми. Використовується в меню підказок і пропозиціях.

# ++CODE++17d0372d64986464c5a0ee3cbbbbf5445200bff5a134d639db83d5bfcd15c3c2
source: A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.
uk: Карта імен властивостей до або масиву імен властивостей, або схеми. Масив імен властивостей означає, що властивість, названа в ключі, залежить від наявності властивостей у масиві в об'єкті для того, щоб бути дійсною. Якщо значення є схемою, то схема застосовується до об'єкта лише в тому випадку, якщо властивість у ключі існує в об'єкті.

# ++CODE++2a8a4217ff405a6ed75e7b314363da79b435d7a4ee8f8f97f365f57f1ccf8ca8
source: A map of property names to schemas for each property.
uk: Карта імен властивостей до схем для кожної властивості.

# ++CODE++12160af96f819f00ab35d12f8d1db48ef229d16d37bd2469976c158ec6d96b67
source: A map of regular expressions on property names to schemas for matching properties.
uk: Карта регулярних виразів для імен властивостей до схем для співпадіння властивостей.

# ++CODE++c8a4028b4aa5f8325e3f300056da7d781fae81bceb5d3261cd0b50850edd5273
source: A number that should cleanly divide the current value (i.e. have no remainder).
uk: Число, яке повинно ділити поточне значення без залишку (тобто не мати залишку).

# ++CODE++d2432d23b5bbbdefd16af382be51e493402a79e28d21085ca66928bf6bcadbdb
source: A regular expression to match the string against. It is not implicitly anchored.
uk: Регулярний вираз для порівняння з рядком. Він не є неявно закріпленим.

# ++CODE++23785d2041e7eb47f4e83b7f5d03b60999be83b242528a90f2fb96b1c10086a5
source: A schema which must not match.
uk: Схема, яка не повинна відповідати.

# ++CODE++afe780c4a34f7fe972f1877d0ec4faad654f76da75e9531b01f3308284d732e9
source: A unique identifier for the schema.
uk: Унікальний ідентифікатор для схеми.

# ++CODE++ae43926d1f2eedb21e83606da7eb6c0bb333ed16b859aac88b07f784d090363f
source: An array instance is valid against "contains" if at least one of its elements is valid against the given schema.
uk: Екземпляр масиву є дійсним для "містить", якщо принаймні один з його елементів є дійсним відповідно до заданої схеми.

# ++CODE++b5b038d169c544718a0ea7c7c524d3cb6574fc330376d10e1b3758aa92b68e02
source: An array of schemas, all of which must match.
uk: Масив схем, всі з яких повинні відповідати.

# ++CODE++b3c940747252b7d8617b1c218206621d7e3ca631580fa156f57c33b7b6a328c4
source: An array of schemas, exactly one of which must match.
uk: Масив схем, одна з яких повинна відповідати.

# ++CODE++185d9339ce37f38b44927fba054fd7db66bf81addf2f434998606017a9540e8f
source: An array of schemas, where at least one must match.
uk: Масив схем, де принаймні одна повинна відповідати.

# ++CODE++31f773fd40033d80a8d8ba05b47a654eb1ffba12d8fd727097e51f3c64e74bd3
source: An array of strings that lists the names of all properties required on this object.
uk: Масив рядків, що містить назви всіх властивостей, необхідних для цього об'єкта.

# ++CODE++0dc7cd0842f5bc5b77e2c0fbb3b2d1f6f2b99744dc867ead8ecd906917a97312
source: An instance validates successfully against this keyword if its value is equal to the value of the keyword.
uk: Екземпляр успішно проходить валідацію за цим ключовим словом, якщо його значення дорівнює значенню ключового слова.

# ++CODE++2ab981af3d38a00b67e7f0f21d640c3f20a12b68c0d2e4e84e4996a8ec1d53d9
source: Array does not contain required item.
uk: Масив не містить необхідного елемента.

# ++CODE++b789ed5a3de85ef534fe7070e7e30e53b907bc29c9d091d41ec068f69b9b6a20
source: Array has duplicate items.
uk: Масив має дублікати.

# ++CODE++8ae1c95a80121564313e6456312f749ec44128891407bb823cf91bc22d2c0d09
source: Array has too few items that match the contains contraint. Expected {0} or more.
uk: Масив має занадто мало елементів, які відповідають обмеженню contains. Очікувалося {0} або більше.

# ++CODE++bafbd350e5269888e890d5a72b1bd4c6de814a16f7b2818a76aa77bce2b2d799
source: Array has too few items. Expected {0} or more.
uk: Масив містить занадто мало елементів. Очікувалося {0} або більше.

# ++CODE++8ff41754cb061e408df3d312d5c88a90622c737f770a16b9e98b01b2a5e22971
source: Array has too many items according to schema. Expected {0} or fewer.
uk: Масив містить занадто багато елементів відповідно до схеми. Очікується {0} або менше.

# ++CODE++2844a99c19a1e89a4642ae4a6e7dae2ce69a1602a731062ca50ed1825bf3aa0f
source: Array has too many items that match the contains contraint. Expected {0} or less.
uk: Масив містить занадто багато елементів, які відповідають обмеженню contains. Очікувалося {0} або менше.

# ++CODE++5c3d366f4303c90dd74ea2ae80c428b72c9c213d3489002f6b0f19cbddf63c2f
source: Array has too many items. Expected {0} or fewer.
uk: Масив має занадто багато елементів. Очікувалося {0} або менше.

# ++CODE++56f59c7021ef4162d93b74e8837c3621f5fb450404787a7a59a91299130cddc1
source: Colon expected
uk: Очікується двокрапка

# ++CODE++78bf2ce6f80887eab0a98de57d116f142e06572fb31934a627d5f69a14d7e29b
source: Comments are not permitted in JSON.
uk: Коментарі не дозволені в JSON.

# ++CODE++f9c50c03fe2d75954a86099c79d42e8bc8cebba49db5b91e82d78a1949bfdea7
source: Comments from schema authors to readers or maintainers of the schema.
uk: Коментарі від авторів схеми до читачів або підтримувачів схеми.

# ++CODE++6defafa2caa65304173956e3fbc26b6947c50bc769c08c3da32c1032fa6519d4
source: Configure
uk: Налаштувати

# ++CODE++30ddcb0b8525d4a19a8c16e68440b952c2668cee903ec2078828e4ebdc4ef838
source: Configured by extension: {0}
uk: Налаштовано за допомогою розширення: {0}

# ++CODE++06331a612ea4594706ad5d520b8bc63860182a8eff832696089ab443533f3bb8
source: Configured in user settings
uk: Налаштовано в налаштуваннях користувача

# ++CODE++e982523ce438ed65a276e310d30881936f77e28ea5c35143176456310fb38a71
source: Configured in workspace settings
uk: Налаштовано в налаштуваннях робочого простору

# ++CODE++e6fdffbb82b605ae5e6e49e3aef0d7114b57792358ecd84f68be6fafde57e319
source: Default value
uk: Значення за замовчуванням

# ++CODE++a8dcde372265d6d3b887ed71c698e571a2656d4812cc3aeadab624ea810ec66b
source: Describes the content encoding of a string property.
uk: Описує кодування вмісту властивості рядка.

# ++CODE++3245e8dd65a2848c34f4776a01ea660d92ea03d5070c5857c6acfad9fff978dd
source: Describes the format expected for the value. By default, not used for validation
uk: Описує формат, який очікується для значення. За замовчуванням не використовується для валідації.

# ++CODE++17f6e16640851ff5f8f107e625f37fea87d46c8638fd5c8b9610ca3efc17135f
source: Describes the media type of a string property.
uk: Описує тип медіа для властивості рядка.

# ++CODE++6c0050a7efb7d3c2d26bd306153c8234db19f6392354488621979ee41f5a06bd
source: Downloading schemas is disabled through setting '{0}'
uk: Завантаження схем вимкнено через налаштування '{0}'

# ++CODE++13a73a21d1e734ec8d16e44679d2c69bce9b520d7265017b954c9ec1fd9bee6d
source: Downloading schemas is disabled. Click to configure.
uk: Завантаження схем вимкнено. Натисніть, щоб налаштувати.

# ++CODE++ec6aa8df2260ff9246c64a691fface1cbf9fef2b40c368940e9ce265bef4fe41
source: Draft-03 schemas are not supported.
uk: Схеми Draft-03 не підтримуються.

# ++CODE++97f0005e310a43f7954896f7b785fe8143ef46c27ac82923cc75dbad654f4fac
source: Duplicate anchor declaration: '{0}'
uk: Дублювання оголошення якоря: '{0}'

# ++CODE++00f76ddee44b624f346c62be8b135c4bba5312de199df7a187afa4ff69b26b36
source: Duplicate object key
uk: Дублюючий ключ об'єкта

# ++CODE++1be6d369cd433b17cac4be4027701a89e77432f37e160aabab55cb64c41a8479
source: Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.
uk: Або схема, або булеве значення. Якщо схема, використовується для валідації всіх властивостей, які не відповідають 'properties', 'propertyNames' або 'patternProperties'. Якщо false, будь-які властивості, які не визначені сусідніми ключовими словами, призведуть до невдачі цієї схеми.

# ++CODE++ad797f4b7d849b77cbd9cb2d29743e02e9bfeaa2eea2ff62e972dd5b1f3e3ff2
source: Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.
uk: Або рядок одного з основних типів схеми (число, ціле число, null, масив, об'єкт, булевий, рядок) або масив рядків, що вказує на підмножину цих типів.

# ++CODE++a74f1b4386098104781088c32d6f602bfa8e2feb294884988dc454e784060e03
source: End of file expected.
uk: Очікується кінець файлу.

# ++CODE++443dbe089d8c7e07bdd82ce972503db32f7794e1901994104e629834f55b8b0c
source: Expected a JSON object, array or literal.
uk: Очікував об'єкт JSON, масив або літерал.

# ++CODE++dbec3510840a2a8fa6031cf0643cfd85e0dfa3e7c4532d774cece2c8cb0f4d4f
source: Expected comma
uk: Очікувана кома

# ++CODE++e5af5945b5aa7a0ac8de1d78e30f0e1e5412a66efd7483835d9c3d9212aad9d9
source: Expected comma or closing brace
uk: Очікується кома або закриваюча дужка

# ++CODE++56bd7959147476cdb6f5924b8e81bd0d8acab90184e9d1350401df97b0a6e63e
source: Expected comma or closing bracket
uk: Очікується кома або закриваюча дужка

# ++CODE++08370c8aedea352506b95b0b8bcdc1975fda127fd301f15de901b64e72a3cb0e
source: Failed to sort the JSONC document, please consider opening an issue.
uk: Не вдалося відсортувати документ JSONC, будь ласка, розгляньте можливість відкриття проблеми.

# ++CODE++0bb76344caf97c29b93affbf3529dc0ef46ba9d122b26fb44c78f6161f1d6f30
source: For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.
uk: Для масивів, тільки коли items встановлено як масив. Якщо items є схемою, ця схема валідує items після тих, що вказані схемою items. Якщо false, додаткові items призведуть до невдачі валідації.

# ++CODE++819ac19c9f1effb819b310b3273a12688e35622d868f40ac5ad2fef7a9331135
source: For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.
uk: Для масивів. Може бути або схемою для валідації кожного елемента, або масивом схем для валідації кожного елемента по порядку (перша схема буде валідувати перший елемент, друга схема буде валідувати другий елемент і так далі).

# ++CODE++1fbc854b7da400274aebb16ca22442be51cd75bebca6813258e3d4eb3ea09ccb
source: If all of the items in the array must be unique. Defaults to false.
uk: Якщо всі елементи в масиві повинні бути унікальними. За замовчуванням - false.

# ++CODE++16d51aea1cdb608436b90207ee3a0a17bc45499b5f719473d62a349e5f27994a
source: If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.
uk: Якщо екземпляр є об'єктом, це ключове слово перевіряє, чи кожне ім'я властивості в екземплярі відповідає наданій схемі.

# ++CODE++c7fcb30f4542fc48d7971eac1b870fc1f63c2efa73a91c79ad5cd714d892c32c
source: Incorrect type. Expected "{0}".
uk: Неправильний тип. Очікувалося "{0}".

# ++CODE++bbcaedec5f34cbbd7a3d49bbe9d7cb95e251ae3e0ba454534b7d678bfb778d16
source: Incorrect type. Expected one of {0}.
uk: Неправильний тип. Очікувався один з {0}.

# ++CODE++bd921b45850084948ec9affd709128d67bf53cf6e69d56d21fc68e7aa2a55da0
source: Indicates that the value of the instance is managed exclusively by the owning authority.
uk: Вказує на те, що значення екземпляра керується виключно власником.

# ++CODE++55b498713d731004e8ff021806f4b3a999cc734c707ab1cca1a6e9ebcac62796
source: Invalid characters in string. Control characters must be escaped.
uk: Недійсні символи в рядку. Символи управління повинні бути екрановані.

# ++CODE++88de0d1338e3af6177d484d8cff7b114005bc92546c8788708f6882e7be33d96
source: Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.
uk: Неправильний формат кольору. Використовуйте #RGB, #RGBA, #RRGGBB або #RRGGBBAA.

# ++CODE++e0b9a8cb5a9f7d20c6bdbdd389449fbb14542e44d4f86197c1580fddebb04d36
source: Invalid escape character in string.
uk: Неправильний символ ескейпу в рядку.

# ++CODE++d1b2a4d0481607c345f73553076874316c2fd00eca9c9eb8c9976a24c065dab0
source: Invalid number format.
uk: Неправильний формат номера.

# ++CODE++c9dcf813bfc82bef919dd02dd8cafeed9ce1e2403260a5215125618d047a9e2e
source: Invalid unicode sequence in string.
uk: Недійсна юнікодна послідовність у рядку.

# ++CODE++8e5a98b6343541a09fb54081ec108d3e04b9169510fde7e1536722550c739e4f
source: Item does not match any validation rule from the array.
uk: Елемент не відповідає жодному правилу валідації з масиву.

# ++CODE++98d19f019a935f3b8aacaba5614c989f0b2de819f9587f5a3990c0e76e3a6cf0
source: JSON Language Server
uk: JSON Мовний Сервер

# ++CODE++bcd54747e41ef4634c457515396a8d15e3e83ce4a3d99426f13639a8dee98d4c
source: JSON Outline Status
uk: Статус JSON Outline

# ++CODE++15d61a08e9390d1c99305b441123143ec285c71701323c2e723e201152510757
source: JSON Validation Status
uk: Статус валідації JSON

# ++CODE++6485437b756390eaaf6aa9475cc4c38bdc2782a53a03fc15a2a068d53b2cc170
source: JSON schema cache cleared.
uk: Кеш схеми JSON очищено.

# ++CODE++dfea69dcb93981cfdc548650e078f824e2e1a517a8a243871c44ff60976a1d14
source: JSON schema configured
uk: Налаштована схема JSON

# ++CODE++58a6b787809fd5503196f0e40d38fcdea53adcde8f04801a2dd08a4bcbe48585
source: JSON: Schema Resolution Error
uk: JSON: Помилка розв'язання схеми

# ++CODE++8c3f13b4629acdb547c215f3a20eb0ec57ef8f1a3b4ad919743a05936bcbc33a
source: Learn more about JSON schema configuration...
uk: Дізнайтеся більше про конфігурацію схеми JSON...

# ++CODE++46f0f56bed33e025d5bb24615904f6ea2123f7e3aa9e60dd53a0c88feb30bd28
source: Loading JSON info
uk: Завантаження інформації JSON

# ++CODE++81527f4e502bef6cfd1729c0f79805aecbe2cdf3306a473a16bb0ee561aaf60d
source: Makes the maximum property exclusive.
uk: Робить максимальну власність ексклюзивною.

# ++CODE++c8b9479bb75dfa036a05b96b21db7f52bf4743fd3909055a2dfa68c33ed906b1
source: Makes the minimum property exclusive.
uk: Робить мінімальну власність ексклюзивною.

# ++CODE++ee48cabe5f9095355f81947e980c55af41343bac54a77f86ae5e67076f409c48
source: Matches a schema that is not allowed.
uk: Відповідає схемі, яка не дозволена.

# ++CODE++cc6b8faa12677b6c16361b4d92c1195ea6cc3cb54de99ed3f9568d8e8bbab129
source: Matches multiple schemas when only one must validate.
uk: Відповідає кільком схемам, коли має бути дійсною лише одна.

# ++CODE++9211277cc6fb68673210ca5aec2a00d49cba8935366b7fbaadd345af486333b6
source: Missing property "{0}".
uk: Відсутня властивість "{0}".

# ++CODE++292727366ac3e6a101c6e708db3abadc83d99919efea9e47c31cbbbd12b9e945
source: New array
uk: Новий масив

# ++CODE++bf1bba04531b3a045e51eb95fc60f233268701bfe3491cc0e6b258136ed16565
source: New object
uk: Новий об'єкт

# ++CODE++13d38f4ecddf24d3bf4eff500a68a6afc33c206d2f7cc6eb014ff8c615d51c74
source: No schema configured for this file
uk: Схема не налаштована для цього файлу

# ++CODE++e0dc964ed569a66aa2982a5f0cf87905a3337ffa34409b1f27a567d5ea9583c3
source: No schema validation
uk: Без валідації схеми

# ++CODE++0f0fe2ab7f6af49aae8013d0c22079f3e2e3787fee75cbaff0767fa3309bdb5e
source: Not used for validation. Place subschemas here that you wish to reference inline with $ref.
uk: Не використовується для валідації. Розмістіть підсхеми тут, на які ви хочете посилатися вбудовано з $ref.

# ++CODE++a8997b7246081993a65673af2c9baa81a06dd86ee1210237fd2a97d02273c967
source: Object has fewer properties than the required number of {0}
uk: Об'єкт має менше властивостей, ніж необхідна кількість {0}

# ++CODE++17d7cbe6eaa52db32724a6655be348293a6cb1f16e226cc2f2930488bb967125
source: Object has more properties than limit of {0}.
uk: Об'єкт має більше властивостей, ніж ліміт {0}.

# ++CODE++a66564b4a41d58f27932d6ba244870ef948f5d4962b6871f97fe46c4a7a7a782
source: Object is missing property {0} required by property {1}.
uk: Об'єкт не має властивості {0}, яка потрібна для властивості {1}.

# ++CODE++fe73b33b867234bfd25771b58359306547b1edaa7f85435996838353bf94cb86
source: Open Extension
uk: Відкрити розширення

# ++CODE++3f940108cb1ecd9c0090da0b51b45f9fe673f00b22c7ffe3d013319b97456674
source: Open Settings
uk: Відкрити Налаштування

# ++CODE++eabbf3abaf8d98abb9763d83f29b04716524a9d697dfdd06ae3ed77bdd12c929
source: Outline
uk: Контур

# ++CODE++c25d4b9c51530c137a763512d260568272f47afea2782e150740902a027826a2
source: Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.
uk: Проблема зчитування вмісту з '{0}': виявлено UTF-8 з BOM, дозволено лише UTF 8.

# ++CODE++2e6a8d9868ad7d372409cb6ec393688ff9e2aef260343865f16da8a893bf1042
source: Problems loading reference '{0}': {1}
uk: Проблеми з завантаженням посилання '{0}': {1}

# ++CODE++d5737088c2bfac1133119193db53f4ed467d280daef5319a17befaa177e408a1
source: Property expected
uk: Очікувана властивість

# ++CODE++5da3989baff810bab8bc8bddda0d43b4af0210959130ef8d40263aacc044c654
source: Property keys must be doublequoted
uk: Ключі властивостей повинні бути в подвійних лапках

# ++CODE++e351b4510a3eace3eb6e290acdaec23ff33c7f86e3c5787480e511712fbac78a
source: Property {0} is not allowed.
uk: Властивість {0} не дозволена.

# ++CODE++960145a347c5a466e5017da95a6ac3fc36889c33069bbdf1c7b80d055493c397
source: Reference a definition hosted on any location.
uk: Посилайтеся на визначення, розміщене в будь-якому місці.

# ++CODE++8177ba5291018f088e08bd7ce4e419f6ecb3e4c937c6176641d6b982ae389801
source: Sample JSON values associated with a particular schema, for the purpose of illustrating usage.
uk: Приклад значень JSON, пов'язаних з певною схемою, з метою ілюстрації використання.

# ++CODE++8d5f276c8f879d13434f094d70457089f96e2b5e05582080ed3f36ceb12c7203
source: Schema not found: {0}
uk: Схему не знайдено: {0}

# ++CODE++081a920faa806c5b412c07b23925e11e674bc8d3e1090ca486282b1f3a3e638d
source: Schema validated
uk: Схему перевірено

# ++CODE++4941d7526eea24ce4abe1765790f567542778ca93bed061c8ce0d6fe7f3fd169
source: Select the schema to use for {0}
uk: Виберіть схему для використання {0}

# ++CODE++5610c5671d41f41321bf7e4fafbcdf3fd9a40478318f7cd16b64d56a0697f4f1
source: Show Schemas
uk: Показати схеми

# ++CODE++69accedc482be4cc5c94f865ce63b533e2622895b49e608fa9bf8b10689b3dfa
source: Sort JSON
uk: Сортувати JSON

# ++CODE++51d96dea767becf472daf043609e0a9633d352f638a0373e2ac7054d21e86016
source: String does not match the pattern of "{0}".
uk: Рядок не відповідає шаблону "{0}".

# ++CODE++1871841c368f16435c7626bc6a6fc6cdb91e48eaa1bd2051243ab92aacdf5cc3
source: String is longer than the maximum length of {0}.
uk: Рядок довший за максимальну довжину {0}.

# ++CODE++4d813a9b207645c672f3ea9e3c7792a910ac88789acb34f9913ba49ee1a8bfbb
source: String is not a RFC3339 date-time.
uk: Рядок не є датою-часом RFC3339.

# ++CODE++a11e5e341864b2d35824d2baa89c7d84f8ca29f4077043ca84452952d8c26f93
source: String is not a RFC3339 date.
uk: Рядок не є датою RFC3339.

# ++CODE++cb018ce89c71330580643de05eb8ab4c074d73f0146d7b6d6cb0571e99165c26
source: String is not a RFC3339 time.
uk: Рядок не є часом у форматі RFC3339.

# ++CODE++fbd0aa3c5680502785050b2df90cbee3244160b7ec7f4f4e8a599258d1845fc0
source: String is not a URI: {0}
uk: Рядок не є URI: {0}

# ++CODE++318c9c90a495940f30053e00e7e41782ce5fb407908f9930d3567d7d5a548d50
source: String is not a hostname.
uk: Рядок не є ім'ям хоста.

# ++CODE++4d7e877515fb6799f95a9d06613506debde626681b351998d1ae480650395112
source: String is not an IPv4 address.
uk: Рядок не є адресою IPv4.

# ++CODE++886d5a55af81b1df71e92d79dcaede38cef9a8940da0ab043d28795473935b52
source: String is not an IPv6 address.
uk: Рядок не є адресою IPv6.

# ++CODE++428ea393f376bf888ede3543a88660a694fd7f07dac52fcc8c294a1e478a6d87
source: String is not an e-mail address.
uk: Рядок не є адресою електронної пошти.

# ++CODE++73de6b18f5f1d566ba0ec859c8f64db0d03615d99d076284c7e0b659639e7e22
source: String is shorter than the minimum length of {0}.
uk: Рядок коротший за мінімальну довжину {0}.

# ++CODE++48815e8d9d3b712dcbd621cb0a30ab468631736806751c34a9df5d2e08b06b99
source: The "else" subschema is used for validation when the "if" subschema fails.
uk: Субсхема "else" використовується для валідації, коли субсхема "if" не проходить.

# ++CODE++715f199631ff51a4ee6387c938aa517d628296560fdc609d6aaa3ff2f2e7d3ca
source: The "then" subschema is used for validation when the "if" subschema succeeds.
uk: Субсхема "then" використовується для валідації, коли субсхема "if" успішно виконується.

# ++CODE++fd4b366fa38073251d3803fa4edbe7fa6ff3c76b6b205a3af55ef7561277992a
source: The maximum length of a string.
uk: Максимальна довжина рядка.

# ++CODE++a65e8b7b92fe2d498e2d574be2befe4aa5489c932dd4a1b01ab4d232a3ccad06
source: The maximum number of items that can be inside an array. Inclusive.
uk: Максимальна кількість елементів, яка може бути в масиві. Включно.

# ++CODE++bf2faae5a7e4373bb4537fa1237cd19674935832ede67f206c07ba7551d4d068
source: The maximum number of properties an object can have. Inclusive.
uk: Максимальна кількість властивостей, яку може мати об'єкт. Включно.

# ++CODE++b07b9cd97c6127d74a1ba875ca97b6ec3cc5db245fe3353cc872a9aed6c85eaf
source: The maximum numerical value, inclusive by default.
uk: Максимальне числове значення, включно за замовчуванням.

# ++CODE++22c89367edac51c48fb84d2263b7b515565f61ac4e89204e2cb16526e69f2607
source: The minimum length of a string.
uk: Мінімальна довжина рядка.

# ++CODE++3bd936e54e18fef8003085e0f5da7126e3ddd9206a8212233ce3614098f51f0a
source: The minimum number of items that can be inside an array. Inclusive.
uk: Мінімальна кількість елементів, яка може бути в масиві. Включно.

# ++CODE++9a302f0dc539fb342e859e79ba2a32cf8f70482c7f9402c96f8f04cf87781867
source: The minimum number of properties an object can have. Inclusive.
uk: Мінімальна кількість властивостей, яку може мати об'єкт. Включно.

# ++CODE++a09e5e454056c0ac1ed28c9b7b62955f0be9e142d0cc1d643a2558b8ff1ea34c
source: The minimum numerical value, inclusive by default.
uk: Мінімальне числове значення, включно за замовчуванням.

# ++CODE++a7da8f981a7a09d597a9c95b4cadaa6440101a8cb1bd0a74646b8c0e014b732d
source: The schema to verify this document against.
uk: Схема для перевірки цього документа.

# ++CODE++ab8a60f361f7c44b45cd74e840c07eeb0e1e60828120180031b8d7b479a40f30
source: The schema uses meta-schema features ({0}) that are not yet supported by the validator.
uk: Схема використовує функції мета-схеми ({0}), які ще не підтримуються валідатором.

# ++CODE++562beaae3d65089bc9c4da773df63c69f693bbae6660d6de4f84266e8052ac62
source: The set of literal values that are valid.
uk: Набір літеральних значень, які є дійсними.
