Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.microsoft-authentication.xlf
Languages: uk

# ++CODE++fab2fbc62210f63d1e04db7304c64d70ea21df9269e47c24aa22cdb43093ce36
source: Authorization code is required.
uk: Необхідний код авторизації.

# ++CODE++3d16e08ba7da5814cb58bbc53d0b9904ec6b00593e40644497e2fe4b6716348f
source: Error validating custom environment setting: {0}
uk: Помилка валідації налаштування користувацького середовища: {0}

# ++CODE++2c1355b1b52e1bb108a7d638522f74ca3b7fe8aebbae36fda7902ccbdbe9e335
source: Having trouble logging in? Would you like to try a different way? ({0})
uk: Маєте проблеми з входом? Хотіли б спробувати інший спосіб? ({0})

# ++CODE++e81c4cad2a4a64d4a15d4280188ae05c9d441a0d0b3b298ff69aa72a20163b01
source: Microsoft Account configuration has been changed.
uk: Конфігурація облікового запису Microsoft була змінена.

# ++CODE++9cbd34dd316d693742dd120af0f59ec6075d7020661356360a0404258aa0bdaa
source: Microsoft Authentication
uk: Автентифікація Microsoft

# ++CODE++5af70f3eafdda951e76e977d91b933b1f8fdc8a772ce4bb4501eae929a0307ab
source: Microsoft Sovereign Cloud Authentication
uk: Автентифікація в суверенному хмарному середовищі Microsoft

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні

# ++CODE++ca381c1e76e681b6c18fa984a2e2fda6ed4a9f28e914f539db34a6dcb3737149
source: Open settings
uk: Відкрити налаштування

# ++CODE++a19a3e5a991c8e6eac6532be261a4c51eca60d6160e9d6f68f9e186f94ed18e5
source: Paste authorization code here...
uk: Вставте код авторизації сюди...

# ++CODE++75d90547bd787139c44b1b6149334f8bcb24fe12fb6b5200c611c2ba6e22d32e
source: Provide the authorization code to complete the sign in flow.
uk: Надайте код авторизації, щоб завершити процес входу.

# ++CODE++bdc090ec61e3fcfc65f469951dfe00f3f2ecfc6003c44deac8e05b7237092de6
source: Reload
uk: Перезавантажити

# ++CODE++6e8766bd45dfbf6ab5663cda427ca7bca612c493c3e063a96ae0d0fbe33c1760
source: Signing in to Microsoft...
uk: Увійти в Microsoft...

# ++CODE++5de91fe0ace0b4d76edcd2e4056cdfa29051580d62bf78892c668ac85159f7cb
source: Signing in to your account...
uk: Увійти до вашого облікового запису...

# ++CODE++0a3b6324edad55e0af962b4093244fbf54ee11be03dba1fe9ae77d74b3091ec2
source: The environment `{0}` is not a valid environment.
uk: Середовище `{0}` не є дійсним середовищем.

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
uk: Так

# ++CODE++e9a286bf81e88f9caf26e049290e3d87a89414757f8440e39fc2b709a5a579a6
source: You have been signed out because reading stored authentication information failed.
uk: Ви вийшли з системи, оскільки не вдалося прочитати збережену інформацію для аутентифікації.

# ++CODE++9adc8f6192670f4cf3ef694d60d421042584fad3d5aa3fdc3cfc1e05a71e0845
source: You have not yet finished authorizing this extension to use your Microsoft Account. Would you like to try a different way? ({0})
uk: Ви ще не завершили авторизацію цього розширення для використання вашого облікового запису Microsoft. Хотіли б ви спробувати інший спосіб? ({0})

# ++CODE++97e3447a773bc2cd2f5f31a05ac17d624f0d7e8996241fa3944e58893f6faa89
source: You must also specify a custom environment in order to use the custom environment auth provider.
uk: Вам також потрібно вказати власне середовище, щоб використовувати постачальника автентифікації для власного середовища.

# microsoft-authentication.implementation.enumDescriptions.classic
source: (deprecated) Use the classic authentication flow to sign in with a Microsoft account.
uk: (застаріло) Використовуйте класичний процес аутентифікації для входу з обліковим записом Microsoft.

# microsoft-sovereign-cloud.environment.enumDescriptions.custom
source: A custom Microsoft Sovereign Cloud
uk: Індивідуальний Microsoft Sovereign Cloud

# microsoft-sovereign-cloud.environment.enumDescriptions.AzureUSGovernment
source: Azure US Government
uk: Уряд США Azure

# displayName
source: Microsoft Account
uk: Обліковий запис Microsoft

# description
source: Microsoft authentication provider
uk: Постачальник аутентифікації Microsoft

source: Sign In
uk: Увійти

source: Sign Out
uk: Вийти

source: The Active Directory endpoint for the custom Sovereign Cloud.
uk: Точка доступу Active Directory для користувацького Суверенного Хмари.

source: The Active Directory resource ID for the custom Sovereign Cloud.
uk: Ідентифікатор ресурсу Active Directory для користувацького Sovereign Cloud.

# microsoft-sovereign-cloud.environment.description
source: The Sovereign Cloud to use for authentication. If you select `custom`, you must also set the `#microsoft-sovereign-cloud.customEnvironment#` setting.
uk: Суверенне хмара для використання при автентифікації. Якщо ви виберете `custom`, ви також повинні налаштувати параметр `#microsoft-sovereign-cloud.customEnvironment#`.

# microsoft-authentication.implementation.description
source: The authentication implementation to use for signing in with a Microsoft account. *NOTE: The `classic` implementation is deprecated and will be removed, along with this setting, in a future release. If only the `classic` implementation works for you, please [open an issue](command:workbench.action.openIssueReporter) and explain what you are trying to log in to.*
uk: Реалізація автентифікації, яку слід використовувати для входу з обліковим записом Microsoft. *ПРИМІТКА: Реалізація `classic` застаріла і буде видалена разом із цим налаштуванням у майбутньому випуску. Якщо тільки реалізація `classic` працює для вас, будь ласка, [відкрийте проблему](command:workbench.action.openIssueReporter) і поясніть, до чого ви намагаєтеся увійти.*

# microsoft-sovereign-cloud.customEnvironment.description
source: The custom configuration for the Sovereign Cloud to use with the Microsoft Sovereign Cloud authentication provider. This along with setting `#microsoft-sovereign-cloud.environment#` to `custom` is required to use this feature.
uk: Користувацька конфігурація для Sovereign Cloud, яку потрібно використовувати з постачальником аутентифікації Microsoft Sovereign Cloud. Це разом із встановленням `#microsoft-sovereign-cloud.environment#` на `custom` є обов'язковим для використання цієї функції.

# microsoft-sovereign-cloud.customEnvironment.managementEndpointUrl.description
source: The management endpoint for the custom Sovereign Cloud.
uk: Кінцева точка управління для користувацького Суверенного Хмари.

# microsoft-sovereign-cloud.customEnvironment.name.description
source: The name of the custom Sovereign Cloud.
uk: Назва кастомного Sovereign Cloud.

# microsoft-sovereign-cloud.customEnvironment.portalUrl.description
source: The portal URL for the custom Sovereign Cloud.
uk: URL порталу для кастомного Sovereign Cloud.

source: The resource manager endpoint for the custom Sovereign Cloud.
uk: Точка доступу менеджера ресурсів для користувацького Суверенного Хмари.

# microsoft-authentication.implementation.enumDescriptions.msal
source: Use the Microsoft Authentication Library (MSAL) to sign in with a Microsoft account.
uk: Використовуйте бібліотеку автентифікації Microsoft (MSAL) для входу з обліковим записом Microsoft.
