Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.git.xlf
Languages: uk

# ++CODE++440633c6285d225a6e3849eb5e17f33c608ad0285fdf7acc14f7e4d912516ed9
source: No rebase in progress.
uk: Немає процесу ребейсу.

# ++CODE++62607574966e6b050c4b7af301ec847b9aa93a212868591406431bf280dea774
source: Not Committed Yet
uk: Ще не підтверджено

# ++CODE++35876477bb2ecde66411d0c8ce7b6fa73d41a46c30b1413e22f8349d979bcbe2
source: Not Committed Yet (Staged)
uk: Ще не зафіксовано (На стадії)

# ++CODE++565339bc4d33d72817b583024112eb7f5cdf3e5eef0252d6ec1b9c9a94e12bb3
source: OK
uk: Гаразд

# ++CODE++a58d0391693da44ddd212cda20ef3e0a1a76038b9eeab11edb5bd2e0db5336eb
source: OK, Don't Ask Again
uk: Гаразд, не запитуйте знову

# ++CODE++204a3e9c871cb1dbdd8e55c636c3cca6bc7b56577284c50bfc8b3c0e3fab839a
source: OK, Don't Show Again
uk: Гаразд, Не показувати знову

# ++CODE++ed077f3d8125d60dca1979c7133601bd187d47c73ed9975028f677e49e709942
source: Open
uk: Відкрити

# ++CODE++3bbf2006d32037a27fb850100bc057963aa25d2118de0561d59e43762f7fad73
source: Open Commit
uk: Відкрити коміт

# ++CODE++d77d0470fcb6e709dbc646f6ae4b68a4db64162b769b2914a3a760a1bbadb4df
source: Open Comparison
uk: Відкрити порівняння

# ++CODE++1e8d18f62f2d2a2fcb2027969e109cad13bcf2a861737f80eabd6774406c8a10
source: Open File
uk: Відкрити файл

# ++CODE++893fcb727fc6ee5a7516324e78ec23f7c12b62546a74b0b37f86d7e30d205547
source: Open Git Log
uk: Відкрити Git Log

# ++CODE++6fba1de2739c8e7ee835016e3340ef0b6c11d1b7cb2123af7ee23abf7f124682
source: Open Merge
uk: Відкрити злиття

# ++CODE++f10c3c817a26227242cc20133608ec65402399011cff683c49aed7ea3b4e5436
source: Open Repositories In Parent Folders
uk: Відкрити репозиторії в батьківських папках

# ++CODE++2466923190a5c2d42540382922f01b6091b99ac2253c9eac5a066ccc129fac1d
source: Open Repository
uk: Відкрите сховище

# ++CODE++3f940108cb1ecd9c0090da0b51b45f9fe673f00b22c7ffe3d013319b97456674
source: Open Settings
uk: Відкрити Налаштування

# ++CODE++e8e0ccba8b0da9ab15259028d04ab1bb9e9ae240bae643e8e07c87dae591120b
source: Open in New Window
uk: Відкрити в новому вікні

# ++CODE++4085b549321e7af912c77c7eaf2313790ad7d283eb11d32780764b816c2a3c34
source: Optionally provide a stash message
uk: За бажанням надайте повідомлення про сховище

# ++CODE++e7611f0537df5fc5d0177da520628219fccf065a1d4176cfbde2f75d824821f4
source: Passphrase
uk: Парольна фраза

# ++CODE++93abc930718bf1254198727dd8023b30499c5f833319550cdf7a20490a5ee744
source: Pick a branch to pull from
uk: Виберіть гілку для витягування

# ++CODE++23a1e19a9fdf977e37f940b03ad56faab51a9a907bba6a975e35a707e5469c50
source: Pick a provider to publish the branch "{0}" to:
uk: Виберіть постачальника для публікації гілки "{0}":

# ++CODE++3e7c9d7d3ffce6d2931f8f2ec3cb30afce7f4786401f1391b97866c4f8739ccf
source: Pick a remote to publish the branch "{0}" to:
uk: Виберіть віддалений репозиторій для публікації гілки "{0}":

# ++CODE++9b097971a9f0ce4309cddca492d9689f9e39b5b37cb374442960925f227c0776
source: Pick a remote to pull the branch from
uk: Виберіть віддалений доступ, щоб витягнути гілку

# ++CODE++e60dcf7dfc306478e6b869345c50ad6ac41a4b2697c8c449ab03e2b74ed81754
source: Pick a remote to remove
uk: Виберіть пульт для видалення

# ++CODE++1db2709f2fc57a3e38685eeb075e00235bad5ee2538a98973dc2f5cb6b09c4ec
source: Pick a repository to mark as safe and open
uk: Виберіть репозиторій, щоб позначити його як безпечний і відкрити

# ++CODE++6e2c8ec7bb53a72cb08507098e1cd6685bb5b0defbf4bb4751a91f73fd4ab061
source: Pick a repository to open
uk: Виберіть репозиторій для відкриття

# ++CODE++43cfba061c66b48d18654d4630284c8f93f76fd551a761506e76d04100be78d2
source: Pick a repository to reopen
uk: Виберіть репозиторій для повторного відкриття

# ++CODE++4409fc12fb9667fbb6713fe6c40de5a69128fafb717e7f925f9829d842769a66
source: Pick a stash to apply
uk: Виберіть запас для застосування

# ++CODE++8c4d9b659312323368fa1e554a7aaf11f36cb27249a24c81435d66ffb3633e36
source: Pick a stash to drop
uk: Виберіть схованку для скидання

# ++CODE++e7ae4efa4b2f3d2f0dfc06be57bd0d9b4a693241f232b00f301497beb274a7eb
source: Pick a stash to pop
uk: Виберіть схованку, щоб відкрити

# ++CODE++64c338cff57f4602a85a1e6aee889b57bb72a32b58b08ad9b9b0d2544b8ebe33
source: Pick a stash to view
uk: Виберіть сховище для перегляду

# ++CODE++75fba89ae3e3799730e92c23de5c58ee0ea959aa5da12542326144c238174630
source: Pick workspace folder to initialize git repo in
uk: Виберіть папку робочого простору для ініціалізації репозиторію git

# ++CODE++3fa8ce1777f7ddc400c486a158fcb785fe326b88693300df8417d8cb7747cc52
source: Please check out a branch to push to a remote.
uk: Будь ласка, перевірте гілку, щоб надіслати її на віддалений репозиторій.

# ++CODE++afd39827f783ddaf8c31a86ba2a80713ab112800005041f8819c14f5a121d6e1
source: Please clean your repository working tree before checkout.
uk: Будь ласка, очистіть робоче дерево вашого репозиторію перед виконанням checkout.

# ++CODE++ec5aa3af193303194748ccfa4adc86db1954ea441cb3ca754747829c73082e55
source: Please provide a commit message
uk: Будь ласка, надайте повідомлення про коміт

# ++CODE++e1ac5b25ecf9376124ae3505bdd6ffea60e96fb3744db2d6b08b9ec5dbbabd72
source: Please provide a message to annotate the tag
uk: Будь ласка, надайте повідомлення для анотації тегу

# ++CODE++90aebb5a363734633e81d596dbc87a7083af97c15029ec4ed00ed85d3018c20e
source: Please provide a new branch name
uk: Будь ласка, надайте нову назву гілки

# ++CODE++a0d728e7c6fd83c9267a9b4bf25b543be6cded7d82d72c9d958ea552ddcaf1c7
source: Please provide a remote name
uk: Будь ласка, надайте ім'я віддаленого репозиторію

# ++CODE++fc2a1795716d5b38e136f05edebeea54359088832fc36dcf048a92deba47971d
source: Please provide a tag name
uk: Будь ласка, введіть назву тегу

# ++CODE++00b3526ea21a69a7bbd09c6f006cce721c78be5995e2eb6c3cb8f0c2ede22879
source: Please provide the commit hash
uk: Будь ласка, надайте хеш коміту

# ++CODE++fe4e7d8ab1a693b8d287c28b1fe5b6f772a2afbaa5063ebbd0766c52e54f161a
source: Publish Branch
uk: Опублікувати гілку

# ++CODE++c293a1d51314232c4ec79dce0e0ba928b4fc287124feb00c8c5cd98914a0f9ab
source: Publish Branch
uk: Опублікувати Branch

# ++CODE++7b7fce492a49fe2194302f4d5f2d1b1d22fe41602d876524174f6c819d9d05da
source: Publish Branch "{0}"
uk: Опублікувати гілку "{0}

# ++CODE++260304d6c22e64ea2f796f4f4a3ff96dcf866e99b747e759b12bcd31e8b52c0a
source: Publish to {0}
uk: Опублікувати на {0}

# ++CODE++095bbfcf66c550a934f58c2bf959ecdcde72853a70196b86e619503c41b3dbdc
source: Publish to...
uk: Опублікувати в...

# ++CODE++0dd87f831d7eff59524e2c4567b7ef14f691d2956d887315793bd818f29cfca0
source: Publishing Branch "{0}"...
uk: Публікація гілки "{0}"...

# ++CODE++f401b998c2c5d9bcffc048b2e4ab1484559b14e6d232742a05671ca3e75cf311
source: Publishing Branch...
uk: Публікація Branch...

# ++CODE++b66d044181a0e29642a958723512a8706ae494ccf63552c08cddca418d1cf097
source: Pull
uk: Тягнути

# ++CODE++2fa67ee4b98c8e901e1c778121ae4ffded7b1b732bbea170aa7f751847aa399f
source: Pull {0} and push {1} commits between {2}/{3}
uk: Витягніть {0} та надішліть {1} коміти між {2}/{3}

# ++CODE++02f3c611e65bc29302de5c9875f7ff07a7ce87d0d0452f9daa175b8fdcc8ad5f
source: Pull {0} commits from {1}/{2}
uk: Витягти {0} комітів з {1}/{2}

# ++CODE++591937c4982b465f47118b1e37d9e2eac87a8d8d43125721e347585ec544f12a
source: Push {0} commits to {1}/{2}
uk: Відправити {0} комітів до {1}/{2}

# ++CODE++276cd31a44092264bf1967b71011e0bf264668edf0e6872bf767b75cf60ec3a0
source: Rebasing
uk: Ребейзинг

# ++CODE++eed45fd91560b3fcaa2c5c621dd3797c4dd06e38995e9ea55052837090062b12
source: Regenerate Branch Name
uk: Відновити назву гілки

# ++CODE++c780499abfa9079473c8de8595fd16c2f601d0695e95f691a5abe35286604b1d
source: Remote "{0}" already exists.
uk: Віддалений "{0}" вже існує.

# ++CODE++bd5bc169c6e722863058ba5e309b4a9a775d3419563c2a06a6c147291a81055d
source: Remote branch at {0}
uk: Віддалена гілка на {0}

# ++CODE++96c1a5aafd493223d4edf01cfcd541cfbb69b57c438ed03db51bc3ee2510a377
source: Remote name
uk: Ім'я віддаленого репозиторію

# ++CODE++2e141cb8b2a2a6376c496e0068e12538b13e4b1e7a12386b9e9907699866cf45
source: Remote name format invalid
uk: Неправильний формат імені віддаленого репозиторію

# ++CODE++ca5af331d8ed541083dae2b812acd75bf24d9ef8332e34376a190737db200138
source: Remote tag at {0}
uk: Віддалений тег на {0}

# ++CODE++382638de5d12f729cec7910b1bb7998999342f9ab710360306bd29bdd8d89ca3
source: Reopen Closed Repositories
uk: Відкрити закриті репозиторії

# ++CODE++25202086021659225a6b0065ed7ea55875f99c94859e62037b4e00bf1aead47b
source: Replace Local Tag(s)
uk: Замінити локальний тег(и)

# ++CODE++9ec4f00af1aaabce94c9d3dab784a3ee28fa484519364956a4ad508dc0376fc9
source: Restore All {0} Files
uk: Відновити всі {0} файли

# ++CODE++bbd51db9cd49f7ab59ed360dc8c4b758ef71a45280d74fa7636de0cfc71f5307
source: Restore File
uk: Відновити файл

# ++CODE++9a67de1b5740e2d935f5bab0d89233b2b75a777a7ea3b57c7e53ac29427c91c6
source: Save All & Commit Changes
uk: Зберегти все та зафіксувати зміни

# ++CODE++73bd1493a71408520de7d84d0c500708f92ae677a49fe1cec7350d5363f1088e
source: Save All & Stash
uk: Зберегти все та сховати

# ++CODE++037c1c212912fcec15b3d4126ce0e79c0593c0f74cf8668451ca698b7bc52475
source: Select a branch or tag to checkout
uk: Виберіть гілку або тег для перевірки

# ++CODE++97be5519b0e5d817f78dd4bd17e70e47ebe3713b01d48f85d52fae137f88888b
source: Select a branch or tag to merge from
uk: Виберіть гілку або тег для злиття

# ++CODE++be8e59066232b90b3820f1ad5bafd5d609e5d3ab42d30fb11a27c7e6cd8e2448
source: Select a branch to checkout in detached mode
uk: Виберіть гілку для перевірки в режимі від'єднання

# ++CODE++5410dd4e0d2b06155ae6bd36e52b58b7358ce288ef781b45e9852016e2394b7a
source: Select a branch to delete
uk: Виберіть гілку для видалення

# ++CODE++6f8226b637c0f77b71ff88c5ec433a57f3ce11bbe7053bc43d1aa8a6589e75a2
source: Select a branch to rebase onto
uk: Виберіть гілку для ребейсу

# ++CODE++34412b9ae0d9a8f1243ae6c065eacf2f2d3febce0e38f5df0b6e8d8cdbed0c20
source: Select a ref to create the branch from
uk: Виберіть ref, з якого створити гілку

# ++CODE++bdfd5e5c7e18e36a027605c4230990bab64012b8cd03f0535613896a1778d346
source: Select a remote branch to delete
uk: Виберіть віддалену гілку для видалення

# ++CODE++182b084671376e02bc8ce747dd0d39362acd63980762adabb9e91cd4331c787f
source: Select a remote tag to delete
uk: Виберіть віддалений тег для видалення

# ++CODE++9fd471b3f11fb4a7e5f87c9f2a87aee1c38c65ff43a596cb75a23f605bc43b17
source: Select a remote to delete a tag from
uk: Виберіть віддалений репозиторій, з якого потрібно видалити тег

# ++CODE++f549e4b0d6b56de82dafefee73dd06920cc27a791ad66fa19d99017abae64158
source: Select a remote to fetch
uk: Виберіть віддалений репозиторій для отримання

# ++CODE++28c2080e378f1d291ab790609682492e0a165b461868f8546b32bc1aa497c3da
source: Select a tag to delete
uk: Виберіть тег для видалення

# ++CODE++a2f33e4d476de1d0148d5cdc59a5d6d85769b8980e454594cb34dde1372ab35c
source: Select as Repository Destination
uk: Виберіть як місце призначення репозиторію

# ++CODE++edd969c69f64aff645b3027bab51746e3b4b8bbafdc573981df42125e9e85dbe
source: Show Changes
uk: Показати зміни

# ++CODE++6b6f44c50d93c59d9c56dce2d44335706fc24ecf4e926d7eabbb6e34c226ae47
source: Show Command Output
uk: Показати вихідні дані команди

# ++CODE++b5ff1947b664c6719dfbb25602ff832dd7fcfc5068944fa750a36fad11a9f7e6
source: Staged Changes
uk: Сценічні зміни

# ++CODE++1b0a609aede05f4f39c423b8a4b57d004741211ef76980e4a37179df32d731a5
source: Stash & Checkout
uk: Сховати та оформити замовлення

# ++CODE++9af34d9f6e18cfc2c71f9bfa484d075cda9121682aba174a6fca7a915f403ff1
source: Stash Anyway
uk: Сховати все одно

# ++CODE++ec8df3d159f741b74f7099bbd10d817aa40b3df5b7ae075629351f950cd462ff
source: Stash message
uk: Повідомлення для зберігання

# ++CODE++3601420ab6a0cf864306d9d83b2714b1b2c7976e1affe639d813d280267aa3e2
source: Stashed Changes
uk: Сховані зміни

# ++CODE++376ab71f351b85d3afac0fcbd859636e97909a7fe85d5c049dff55139600db27
source: Successfully pushed.
uk: Успішно надіслано.

# ++CODE++e8cd388771e552260257ad74ec3080faa98ffa7598b8e782b2a8c08ae1f8107a
source: Synchronize Changes
uk: Синхронізувати зміни

# ++CODE++720bccb504d6429a9e4ec1f87fae45a608701f32f298c17a874e884064b0b9cc
source: Synchronizing Changes...
uk: Синхронізація змін...

# ++CODE++c620cca03e560f7ed57a468dddc1935ece81ff2095dda0f98d987226857b60cc
source: Syncing. Cancelling may cause serious damages to the repository
uk: Синхронізація. Скасування може призвести до серйозних пошкоджень репозиторію

# ++CODE++44b333daa4f9e6decfc3260fee4c03285e7b4d9c5315de608d5710283e49e54a
source: Tag at {0}
uk: Мітка в {0}

# ++CODE++1ace926bc7cdee5323e297d439d2d268286749252b1c7f5e332d5003681d092d
source: Tag name
uk: Назва тегу

# ++CODE++f5c58a33df8fc9fe24b592f358a2796949c7d2b83e28306be28c8ba0454dbadf
source: The "{0}" repository has {1} submodules which won't be opened automatically. You can still open each one individually by opening a file within.
uk: Репозиторій "{0}" має {1} підмодулів, які не будуть відкриті автоматично. Ви все ще можете відкрити кожен з них окремо, відкривши файл всередині.

# ++CODE++8d1325663e5e67d11bb0e5e78eaa966671dfb0b6b3e1fc25b59427d0d7d2713e
source: The active branch cannot be deleted.
uk: Активну гілку не можна видалити.

# ++CODE++a19a357466e3cc3926579645f74ec7860df52578196b7b4147b221046f946d8d
source: The branch "{0}" has no remote branch. Would you like to publish this branch?
uk: Гілка "{0}" не має віддаленої гілки. Чи бажаєте ви опублікувати цю гілку?

# ++CODE++a213b755cc8239f62a4220d72ca8756a1ef91aec1ca885d2ddec7604f9718675
source: The branch "{0}" is not fully merged. Delete anyway?
uk: Гілка "{0}" не повністю злитта. Видалити все ж?

# ++CODE++149526064e0dd520f32dd4541df0f1ba4cf8763075d3cb842712ff05cbdfe546
source: The changes are already present in the current branch.
uk: Зміни вже присутні в поточній гілці.

# ++CODE++96bbc2b6d0b5fa5726a6c8930a2bbcd4cfb8a4b95edd9f2a6666260ec402564d
source: The current branch is not published to the remote. Would you like to publish it to access your changes elsewhere?
uk: Поточна гілка не опублікована на віддаленому сервері. Чи хочете ви опублікувати її, щоб отримати доступ до ваших змін в інших місцях?

# ++CODE++c4f7bdfd5afa9a29d61948b60c23118eb9020493d6265ce1917200dbb33ee381
source: The following file has unresolved diagnostics: '{0}'. How would you like to proceed?
uk: Наступний файл має невирішені діагностики: '{0}'. Як ви хочете продовжити?

# ++CODE++3362cb8501f59d8c5e21a58875c8feb5020043dda58553dccbd8b3fd80357c50
source: The following file has unsaved changes which won't be included in the commit if you proceed: {0}. Would you like to save it before committing?
uk: Наступний файл має незбережені зміни, які не будуть включені в коміт, якщо ви продовжите: {0}. Чи хочете ви зберегти його перед комітом?

# ++CODE++1b7d37ba7112bf4a25ad7d727bce3110e53b2704ea026c87aa7a69ed3b5fb873
source: The following file has unsaved changes which won't be included in the stash if you proceed: {0}. Would you like to save it before stashing?
uk: Наступний файл має незбережені зміни, які не будуть включені в сховище, якщо ви продовжите: {0}. Чи хочете ви зберегти його перед сховищем?

# ++CODE++e109d755dd32053afa001e1e366b7a51561c73d2fcea81e79cdb7a46dc7fc47a
source: The git repositories in the current folder are potentially unsafe as the folders are owned by someone other than the current user.
uk: Git-репозиторії в поточній папці потенційно небезпечні, оскільки папки належать не поточному користувачу.

# ++CODE++02c2cdd6b3ac71010ce7c47a400c9719fead4aa3269d72b8f462ff61a45d4ab3
source: The git repository at "{0}" has too many active changes, only a subset of Git features will be enabled.
uk: Git-репозиторій за адресою "{0}" має занадто багато активних змін, лише підмножина функцій Git буде активована.

# ++CODE++8d01c87529131c0fe41305b68799b99052dc4a274a4affcc1cea877cc14346d7
source: The git repository in the current folder is potentially unsafe as the folder is owned by someone other than the current user.
uk: Git-репозиторій у поточній папці потенційно небезпечний, оскільки папка належить не поточному користувачу.

# ++CODE++5fd10738fc1c6f99d48f2d972e7a4c4fa0ffa39ff4f89ae5cba4055c08eb98d4
source: The last commit was a merge commit. Are you sure you want to undo it?
uk: Останній коміт був комітом злиття. Ви впевнені, що хочете скасувати його?

# ++CODE++b45f0ffa9a6ab73edb905b626d6fe3ed00854ca7abf7303b919cf686315b9f99
source: The new branch will be "{0}"
uk: Нова гілка буде "{0}"

# ++CODE++4168b0869d785d04f6352100231164eae8fd06f0dbc7ac603d90ab9594a96129
source: The remote branch of the active branch cannot be deleted.
uk: Віддалену гілку активної гілки не можна видалити.

# ++CODE++37ef81ba71eba9f9eff994fceb877f912ef4a6c4d6d4998ed550a243f35b36e8
source: The repository does not have any changes.
uk: Репозиторій не має жодних змін.

# ++CODE++4360153c542717595a316b4979c6bba0e30dd9ccd312e1c4c852a00bdd6366d6
source: The repository does not have any commits. Please make an initial commit before creating a stash.
uk: Репозиторій не має жодних комітів. Будь ласка, зробіть початковий коміт перед створенням сховища.

# ++CODE++13cb99586bfd29d751f531f2ae8e65073691d8cd284f994dae3603a160267d19
source: The repository does not have any staged changes.
uk: Репозиторій не має жодних підготовлених змін.

# ++CODE++8d3634e9f43f4094f473671a6ddc6668eb51eebe0fa8f0a6c78a01b270a392bd
source: The repository does not have any untracked changes.
uk: Репозиторій не має жодних не відслідковуваних змін.

# ++CODE++27ee389973941a5e4c33938ada96f71810852631100b4c853fde3b8ff00a4b5c
source: The selection range does not contain any changes.
uk: Діапазон вибору не містить жодних змін.

# ++CODE++72dbcd7478452a578554f9540148e0276884de955c89a499404e8723d8276986
source: There are known issues with the installed Git "{0}". Please update to Git >= 2.27 for the git features to work correctly.
uk: Існують відомі проблеми з встановленим Git "{0}". Будь ласка, оновіть до Git >= 2.27, щоб функції git працювали правильно.

# ++CODE++afc7a0a052244cf074d97256a36bbc8ce4c0a07f1cfd00dd4894ec37c06aaad9
source: There are merge conflicts while applying the stash. Please resolve them before committing your changes.
uk: Є конфлікти злиття під час застосування сховища. Будь ласка, вирішіть їх перед комітом ваших змін.

# ++CODE++8d3b8bdc062f87997d55c1be1363f19d099a88398e9bbba397c0c6451c16a3bc
source: There are merge conflicts. Please resolve them before committing your changes.
uk: Є конфлікти злиття. Будь ласка, вирішіть їх перед комітом ваших змін.

# ++CODE++4a9bc15b4ed0cf72587423bf0e2d14780f2050bfbb59d187cf98cc081e0d1d1b
source: There are no available repositories
uk: Немає доступних репозиторіїв

# ++CODE++ae1a589b1c95953ed140c40811e495dcbaea430a742c8f895231e3c270e852ef
source: There are no changes to commit.
uk: Немає змін для коміту.

# ++CODE++1817660c6b621c7c863521e96a45227469758a3f51d690448de5d1b50c46bc2d
source: There are no changes to stash.
uk: Зміни до сховища відсутні.

# ++CODE++c9b5226d031f781a50dd9c231a7787151868d3077dfcfdc33fefda1719e83c8c
source: There are no staged changes to commit. Would you like to stage all your changes and commit them directly?
uk: Немає змінених файлів для коміту. Бажаєте додати всі ваші зміни до стадії та комітити їх безпосередньо?

# ++CODE++0a6f7df2d272dbe9feb4bf0dd43c6a93144be7e5192b330ca7a1b191666c5b93
source: There are no staged changes to stash.
uk: Немає змінених файлів для збереження.

# ++CODE++46031808b597269632b77fb15757e8f4e0f56b9028ddf7b5889e68f5753668c9
source: There are no stashes in the repository.
uk: У репозиторії немає сховищ.

# ++CODE++d1d24b63c277663d53785f4e08545f88e55cf19a45955833e5afce47d455526c
source: There are {0} files that have unresolved diagnostics. How would you like to proceed?
uk: Є {0} файлів з нерозв'язаними діагностиками. Як би ви хотіли продовжити?

# ++CODE++2ea13fa0d2df0cc2514d3685714c978c33344aa102e1d2397585bada616247c9
source: There are {0} unsaved files. Would you like to save them before committing?
uk: Є {0} незбережених файлів. Чи хочете ви їх зберегти перед комітом?

# ++CODE++2f1dd70cc53e8e0044fe457c592281537534eff20fd0fdb1c0d3b2a2ded08cc5
source: There are {0} unsaved files. Would you like to save them before stashing?
uk: Є {0} незбережених файлів. Чи хочете ви зберегти їх перед схованням?

# ++CODE++11ec7c31e1a55d9bf006194c2c40611b4c77e958cc52620eb5551b78e768cb55
source: There were merge conflicts while cherry picking the changes. Resolve the conflicts before committing them.
uk: Під час вибору змін виникли конфлікти злиття. Вирішіть конфлікти перед їх комітом.

# ++CODE++4e5370c14c2e52f7bc248222f1d743cfeecaef3f484f987facbf4604af7d7bdd
source: This action will pull and push commits from and to "{0}/{1}".
uk: Ця дія буде витягувати та відправляти коміти з та до "{0}/{1}".

# ++CODE++a3bfed7d5da3d9d87e3ffe75f75ecb1c47b3d635177a918a421dbc3da4789012
source: This repository has no remotes configured to fetch from.
uk: У цьому репозиторії не налаштовано жодних віддалених репозиторіїв для отримання.

# ++CODE++8a31a9a33b1daab0d79eae0dc86548abb75d8210f058d99a3ef4b6f3ece60162
source: This will create a Git repository in "{0}". Are you sure you want to continue?
uk: Це створить репозиторій Git у "{0}". Ви впевнені, що хочете продовжити?

# ++CODE++05f7892749ae2c9768ce4044a9df51b9f9bb38485c7c42049a15b1b99b9535d9
source: Too many changes were detected. Only the first {0} changes will be shown below.
uk: Виявлено занадто багато змін. Нижче буде показано лише перші {0} зміни.

# ++CODE++dce9960e3b2a3c0c30e66c7e1a3ec396a86650a7acb8fd3cedf74196356deb54
source: Type Changed
uk: Тип змінено

# ++CODE++4460d1b1316e9beeda90bd568c3e9d13b47a3710674433fd1022371f8e1d3108
source: Unable to pull from remote repository due to conflicting tag(s): {0}. Would you like to resolve the conflict by replacing the local tag(s)?
uk: Неможливо отримати з віддаленого репозиторію через конфліктуючі тег(и): {0}. Чи бажаєте ви вирішити конфлікт, замінивши локальний тег(и)?

# ++CODE++0d0b4290628654ca57e79767b0c2c66ab30fd9b41dfe4eb48495003a199bf27f
source: Uncommitted Changes
uk: Незавершені зміни

# ++CODE++35a96c53b643b0cfb6501a078cb24a26c2158f732df4e497c68292ab9b2fb387
source: Undo merge commit
uk: Скасувати злиття коміту

# ++CODE++c7ba5477e19cf0bb25460d840cc2e67341e81e1c2d274d00b3054c73898d4d27
source: Untracked
uk: Не відстежується

# ++CODE++d9dbf89a0df1e2e894271aa0784f5a497aa621698eca5da8c125870ead7b718e
source: Untracked Changes
uk: Невідстежувані зміни

# ++CODE++034e16a7430ebedfd237d80c76b3589cfa03e8bd1193ac24be41bd1fda112715
source: Update Git
uk: Оновити Git

# ++CODE++2dc8b13386dff158637242fd41c300a614a188df36546d65f9efde8953c68e3b
source: View Problems
uk: Переглянути проблеми

# ++CODE++7f1d79b89e7e2a73fb77da103a8f48ff6a1d82d197245b96a00bd0bb1b807301
source: Would you like to add "{0}" to .gitignore?
uk: Ви хочете додати "{0}" до .gitignore?

# ++CODE++a9b2a56ef24209b80c6e9e0508fae6e0cd8dde12582670f4867730d234fa660f
source: Would you like to open the cloned repository, or add it to the current workspace?
uk: Чи хочете ви відкрити клонований репозиторій, чи додати його до поточного робочого простору?

# ++CODE++8e3e2fa1eac65813d54533388a9394094f68b3af6c8408dde1e4a3d4e57d91d7
source: Would you like to open the cloned repository?
uk: Ви хочете відкрити клонований репозиторій?

# ++CODE++2f583a9a7e36a2087285836c950f99f22099e18fd2565543ba73d4b175fdd72f
source: Would you like to open the initialized repository, or add it to the current workspace?
uk: Ви хочете відкрити ініціалізований репозиторій або додати його до поточного робочого простору?

# ++CODE++01cedefc7a6bda340489ba5bce02d9cf13cf3344b44ff23845566a379edf01a5
source: Would you like to open the initialized repository?
uk: Ви хочете відкрити ініціалізований репозиторій?
