Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.merge-conflict.xlf
Languages: uk

# ++CODE++64be7cd0d6812f62757b30a6ef1eb0143de39839d30d97cc48cba9aa73cb8dc0
source: (Current Change)
uk: (Поточна зміна)

# ++CODE++61567c1dfe2c66e62eeba538b15c7751ba46d43862cd6ae1ecc36d9548fa4947
source: (Incoming Change)
uk: (Вхідна зміна)

# ++CODE++6ac29f5e756c68952c258049b06eb7907e3bac89d600bb24a1438b36ea8e6c56
source: Accept Both Changes
uk: Прийняти обидві зміни

# ++CODE++a83d37047dad3ed5a567475cb81939b329403f40759d597fcb047cfaf24de60c
source: Accept Current Change
uk: Прийняти поточні зміни

# ++CODE++663e7f17a611d2a3948128b511ad431578b02b9040666ffb144b610b528ddc1f
source: Accept Incoming Change
uk: Прийняти вхідну зміну

# ++CODE++3910559471149316e3794fed81dd0027e3daa2594db8e35f1a003f1018dd49ad
source: Compare Changes
uk: Порівняти зміни

# ++CODE++c76522a7e73e95a209f0fdb45074a5eed941fc5e147585a3da74a18f4d71ebc3
source: Editor cursor is not within a merge conflict
uk: Курсор редактора не знаходиться в конфлікті злиття

# ++CODE++66247633e041f8b77963b88cad988197d3c706973d520d78038c39354d1fc75a
source: Editor cursor is within the common ancestors block, please move it to either the "current" or "incoming" block
uk: Курсор редактора знаходиться в блоці загальних предків, будь ласка, перемістіть його в блок "поточний" або "вхідний"

# ++CODE++71b315790f1dd7cc4104a190a93503f511494fc9230379bd87ccf45587e617e6
source: Editor cursor is within the merge conflict splitter, please move it to either the "current" or "incoming" block
uk: Курсор редактора знаходиться в роздільнику конфлікту злиття, будь ласка, перемістіть його в блок "поточний" або "вхідний"

# ++CODE++ea41ba85ee3788b41d702b0f75b19c927cb2d7a96906110042807f8f18e6c16f
source: No merge conflicts found in this file
uk: Конфліктів злиття не знайдено в цьому файлі

# ++CODE++c80a1638f8069a69ed78e4537ac50e140887f027905de1ce3eee3bb32296757a
source: No other merge conflicts within this file
uk: Немає інших конфліктів злиття в цьому файлі

# ++CODE++3d6e417a3f59c93908c253e59f61eb973c4e39b27ff3a96432d954785ea92d97
source: {0}: Current Changes ↔ Incoming Changes
uk: {0}: Поточні зміни ↔ Вхідні зміни

# command.accept.all-both
source: Accept All Both
uk: Прийняти всі обидва

# command.accept.all-current
source: Accept All Current
uk: Прийняти всі поточні

# command.accept.all-incoming
source: Accept All Incoming
uk: Прийняти всі вхідні

# command.accept.both
source: Accept Both
uk: Прийняти обидва

# command.accept.current
source: Accept Current
uk: Прийняти поточний

# command.accept.incoming
source: Accept Incoming
uk: Прийняти вхідні

# command.accept.selection
source: Accept Selection
uk: Прийняти вибір

# command.compare
source: Compare Current Conflict
uk: Порівняти поточний конфлікт

# config.diffViewPosition
source: Controls where the diff view should be opened when comparing changes in merge conflicts.
uk: Контролює, де має відкриватися перегляд відмінностей при порівнянні змін у конфліктах злиття.

# config.codeLensEnabled
source: Create a CodeLens for merge conflict blocks within editor.
uk: Створіть CodeLens для блоків конфлікту злиття в редакторі.

# config.decoratorsEnabled
source: Create decorators for merge conflict blocks within editor.
uk: Створіть декоратори для блоків конфлікту злиття в редакторі.

# description
source: Highlighting and commands for inline merge conflicts.
uk: Виділення та команди для конфліктів злиття в рядку.

# config.title
source: Merge Conflict
uk: Конфлікт злиття

# command.category
source: Merge Conflict
uk: Конфлікт злиття

# displayName
source: Merge Conflict
uk: Конфлікт злиття

# command.next
source: Next Conflict
uk: Наступний конфлікт

# config.diffViewPosition.below
source: Open the diff view below the current editor group.
uk: Відкрийте перегляд різниць нижче поточної групи редакторів.

# config.diffViewPosition.current
source: Open the diff view in the current editor group.
uk: Відкрийте перегляд відмінностей у поточній групі редакторів.

# config.diffViewPosition.beside
source: Open the diff view next to the current editor group.
uk: Відкрийте перегляд відмінностей поруч з поточною групою редакторів.

# command.previous
source: Previous Conflict
uk: Попередній конфлікт

# config.autoNavigateNextConflictEnabled
source: Whether to automatically navigate to the next merge conflict after resolving a merge conflict.
uk: Чи автоматично переходити до наступного конфлікту злиття після вирішення конфлікту злиття.
