Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.extension-editing.xlf
Languages: uk

# ++CODE++e27ff66d5d7992d3fc9f5043b5d46d04b2ffe712502ad1c4608fedc020cbe678
source: Data URLs are not a valid image source.
uk: URL-адреси даних не є дійсним джерелом зображення.

# ++CODE++4b90f828b67aedaca983fdc584fc250e1e5870839ae46bd777781b7577e435d7
source: Embedded SVGs are not a valid image source.
uk: Вбудовані SVG не є дійсним джерелом зображення.

# ++CODE++0fa833a88194bcfadc259c8984281d04ff958344176e524772f6c00eda2fc0e5
source: Error parsing the when-clause:
uk: Помилка при розборі when-клаузи:

# ++CODE++7b2384bc0184e0d3b2f62fd3454c281a47d4099f625a04f0b37916d9db35e7a4
source: Images must use the HTTPS protocol.
uk: Зображення повинні використовувати протокол HTTPS.

# ++CODE++f1b72a86f0dca72dcb1eb348efe9411c2fc02b38b0522f46396415a961698e01
source: Language specific editor settings
uk: Налаштування редактора, специфічні для мови

# ++CODE++4bcc414846f4c4c9380d340f21e5adef14a25a223e4356a1947feae038ae2137
source: Override editor settings for language
uk: Перезаписати налаштування редактора для мови

# ++CODE++173ea39e519ed16c38b7564ff0a625a925e46ecf947f7bd6c6a5d86e6ca12eea
source: Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.
uk: Відносні URL значків вимагають, щоб у цьому package.json був вказаний репозиторій з протоколом HTTPS.

# ++CODE++cba82e900f4d943642c709c38435b64820038c17789071a71ab5033a12e87417
source: Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.
uk: Відносні URL-адреси зображень вимагають вказівки репозиторію з протоколом HTTPS у файлі package.json.

# ++CODE++8f109beabd5459c13504b93816b39f95fcc77442bed89c19cb2a80ab38fc30b1
source: Remove activation event
uk: Видалити подію активації

# ++CODE++5c1fc8b9807ecfc80b2c14831b7c5ff78403bb7a467791ea0b60ff30e0d0955f
source: SVGs are not a valid image source.
uk: SVG не є дійсним джерелом зображення.

# ++CODE++ae69770185bc8ecf5462b957f0ac6b5900b863369aa9adb5bdfb393747945cd9
source: This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.
uk: Цю подію активації можна видалити, оскільки VS Code автоматично генерує їх з ваших декларацій внесків у package.json.

# ++CODE++b78d6b1ae6b1e24f3f12e9366e12256b5491de0636d7d77ad78806953c6c6027
source: This activation event can be removed for extensions targeting engine version ^1.75.0 as VS Code will generate these automatically from your package.json contribution declarations.
uk: Цю подію активації можна видалити для розширень, що націлені на версію движка ^1.75.0, оскільки VS Code автоматично згенерує їх з ваших декларацій внесків у package.json.

# ++CODE++25833487700404b7bd292a8f0805cdb3c1b2f16a2b92da48431ea7619cddca94
source: This activation event cannot be explicitly listed by your extension.
uk: Цю подію активації не можна явно вказати у вашій розширенні.

# ++CODE++ca4969c58a3a1664b4ea86a5f5e305af4f8267aa2ed19fd3256718ea3016b3b5
source: This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.
uk: Цю пропозицію не можна використовувати, оскільки для цього розширення продукт визначає фіксований набір API-пропозицій. Ви можете протестувати своє розширення, але перед публікацією ви МАЄТЕ зв'язатися з командою VS Code.

# ++CODE++f3596ed8068dedb32662fea40c192d4d1c121aaeaccff9da30a7dcb8707c242b
source: Using '*' activation is usually a bad idea as it impacts performance.
uk: Використання активації '*' зазвичай є поганою ідеєю, оскільки це впливає на продуктивність.

# displayName
source: Extension Authoring
uk: Авторинг розширень

# description
source: Provides linting capabilities for authoring extensions.
uk: Надає можливості лінтингу для створення розширень.
