Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.ipynb.xlf
Languages: uk

# ++CODE++19b3753f5af801ce9a4b20949f3f633c4a7eeb14029257f769451d6775a56cce
source: Insert Image as Attachment
uk: Вставити зображення як вкладення

# displayName
source: .ipynb Support
uk: .ipynb Підтримка

# addCellOutputToChat.title
source: Add Cell Output to Chat
uk: Додати вихід комірки до чату

# cleanInvalidImageAttachment.title
source: Clean Invalid Image Attachment Reference
uk: Очистити посилання на недійсне зображення вкладення

# copyCellOutput.title
source: Copy Cell Output
uk: Копіювати вихід клітинки

# ipynb.pasteImagesAsAttachments.enabled
source: Enable/disable pasting of images into Markdown cells in ipynb notebook files. Pasted images are inserted as attachments to the cell.
uk: Увімкнути/вимкнути вставку зображень у Markdown-клітинки в файлах ipynb. Вставлені зображення додаються як вкладення до клітинки.

# ipynb.experimental.serialization
source: Experimental feature to serialize the Jupyter notebook in a worker thread.
uk: Експериментальна функція для серіалізації ноутбука Jupyter у фоновому потоці.

# markdownAttachmentRenderer.displayName
source: Markdown-It ipynb Cell Attachment renderer
uk: Markdown-It ipynb Cell Attachment рендерер

# newUntitledIpynb.title
source: New Jupyter Notebook
uk: Новий Jupyter Notebook

# openCellOutput.title
source: Open Cell Output in Text Editor
uk: Відкрити вихід комірки в текстовому редакторі

# openIpynbInNotebookEditor.title
source: Open IPYNB File In Notebook Editor
uk: Відкрити файл IPYNB у редакторі нотаток

# description
source: Provides basic support for opening and reading Jupyter's .ipynb notebook files
uk: Надає базову підтримку для відкриття та читання файлів нотаток .ipynb Jupyter
