Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.typescript-language-features.xlf
Languages: uk

# ++CODE++012bbb9a170b9a0eb11af4bda1287186470aee83e6e7c1e9d2a14b1b9cdc88be
source: (loading...)
uk: (завантаження...)

# ++CODE++d3711f47b53cbbff701820ac079cd74e4ed557dcaa0755b975b8c016eb852efd
source: ...1 additional file not shown
uk: ...1 додатковий файл не відображено

# ++CODE++e75869fbe8b1c0131ba14d717b8b6d04e3e75a6f1c9d50f310f0a8c099f6fe57
source: ...{0} additional files not shown
uk: ...не показано {0} додаткових файлів

# ++CODE++3da87c9c678d52e02a23f8c22b5175f2270626047c8cbf369ae4b4b79521c003
source: 1 implementation
uk: 1 реалізація

# ++CODE++65c5f187273a6658a72e450db5937d87ec44e2776f984d8310d2ee932767b7ac
source: 1 reference
uk: 1 посилання

# ++CODE++6a43dc30384ef169516f430c1095d32a10116f8e7db05c02a615553e51e6a097
source: Acquiring typings definitions for IntelliSense.
uk: Отримання визначень typings для IntelliSense.

# ++CODE++c72e8bce6830ebf885cf827b017d59bb9f5e181d237ca34e226d49c5deebe94b
source: Acquiring typings...
uk: Отримання typings...

# ++CODE++c52481d39f2c491eb1c81e82b9e4f0c7290b66c909f620cde4877f60e9cc0b00
source: Add all missing imports
uk: Додати всі відсутні імпорти

# ++CODE++e213c161d5cefa520c8dd4155c9569076d9a40406111465136a6f1b207045761
source: Allow
uk: Дозволити

# ++CODE++de9f057a471cdb8d3b082719bdc7ad2031788d042947349723fa83c9d13a517a
source: Always
uk: Завжди

# ++CODE++67e7251f0a24732ab54589f7ed22abc5570f9c6d6bb212b18b8796be462dda2f
source: An error occurred while renaming file
uk: Сталася помилка під час перейменування файлу

# ++CODE++282e8d68d41e22e3f6e9e496603cf117970c778d61e4912dc15422ca1d9935a4
source: Analyzing '{0}' and its dependencies
uk: Аналізуючи '{0}' та його залежності

# ++CODE++35794235635df0a4831e18ea5c28fafa2e00732d5cd27f5c6f119eca43d850ba
source: Checking for update of JS/TS imports
uk: Перевірка оновлення імпортів JS/TS

# ++CODE++cbcb53933ff9aee120c1c9baa0683ccfc2a5bdfbbcbf997f89f8fa56326ac1cc
source: Configure Excludes
uk: Налаштувати виключення

# ++CODE++c72d23bb01a1affe9c58da674471c92b9f369bb810c52411747348270160a45f
source: Configure JSConfig
uk: Налаштувати JSConfig

# ++CODE++da283fdb9276bebfe3103b17be9e83ff5f2e9fbbc92b42eb3d3dde6fddfc6c8c
source: Configure TSConfig
uk: Налаштувати TSConfig

# ++CODE++43bc64ba21e2947798577d509baf03323e3021d8f2aafe62e4f9fee3a96128e1
source: Configure jsconfig.json
uk: Налаштувати jsconfig.json

# ++CODE++e4702d76df5c5938e931b3ede1fb60eeb37afc54b0d67d330909446de452aac3
source: Configure tsconfig.json
uk: Налаштуйте tsconfig.json

# ++CODE++2666d1141bb8027cedffc4b1de82c11ea236db16252ff2b70e43f19b4765d962
source: Could not apply refactoring
uk: Не вдалося застосувати рефакторинг

# ++CODE++becff441caef1ee4447d8ae15cb8a1fba5229581afe166c0e0e5bb5c6f927c30
source: Could not detect a Node installation to run TS Server.
uk: Не вдалося виявити установку Node для запуску TS Server.

# ++CODE++295c7803d7e7cd03f4b1fc41021eb60cb9944e794b4f9bf349a32e3633588a14
source: Could not determine TypeScript or JavaScript project
uk: Не вдалося визначити проект TypeScript або JavaScript

# ++CODE++a30e44af37dc6d6ace810a84cf49c50bc5bcda2dea8e6276b45d1304cbbf153f
source: Could not determine TypeScript or JavaScript project. Unsupported file type
uk: Не вдалося визначити проект TypeScript або JavaScript. Непідтримуваний тип файлу

# ++CODE++54f7822fa5072b5266cae29e5480dc51046ebd33e97ac193ae7a5683bea8c866
source: Could not determine references
uk: Не вдалося визначити посилання

# ++CODE++7abab4ba4a654f142c352cd74b30383d4e23969985089f2d4c9dd67541d069ba
source: Could not install typings files for JavaScript language features. Please ensure that NPM is installed, or configure 'typescript.npm' in your user settings. Alternatively, check the [documentation]({0}) to learn more.
uk: Не вдалося встановити файли типів для функцій мови JavaScript. Будь ласка, переконайтеся, що NPM встановлено, або налаштуйте 'typescript.npm' у ваших налаштуваннях користувача. Альтернативно, перегляньте [документацію]({0}), щоб дізнатися більше.

# ++CODE++704c9d9267270252092f44c7a1063371a9573338479612b4cfba8d3848a2922f
source: Could not load the TypeScript version at this path
uk: Не вдалося завантажити версію TypeScript за цим шляхом

# ++CODE++6371b23e6b67bf59c1651877d670b3b2dc0c36015ab0b126a76c1b2cfa493c49
source: Could not open TS Server log file
uk: Не вдалося відкрити файл журналу TS Server

# ++CODE++b2583e537e75ae2e0febd8843fc57677b8873b91932461ee259c76706bb343c0
source: Disable logging
uk: Вимкнути журналювання

# ++CODE++b2b600444647d6a397a015f15842b79e86be09871c1933884cf917c08e63be4f
source: Disables semantic checking in a JavaScript file. Must be at the top of a file.
uk: Вимикає семантичну перевірку в файлі JavaScript. Має бути на початку файлу.

# ++CODE++48845bff334a50a59aaecf499f28a7a24c3b4b891b8b18a9f1169ad8e8a6b261
source: Dismiss
uk: Відхилити

# ++CODE++1d60d0cdcb5408b8e39ed364f675c9cad8a2f6174a413324d1e34437bd41269b
source: Don't Show Again
uk: Не показувати знову

# ++CODE++4e5374759acb5346cc22cfbece70ad33d2d775b391fe2d7655bdceebf3bb4a44
source: Don't show again
uk: Не показувати знову

# ++CODE++537f83711a07a3a71fe13aad559b5a7013defa268f2e3915744b1152b6e09fdd
source: Enable logging and restart TS server
uk: Увімкніть журналювання та перезапустіть сервер TS

# ++CODE++913855a0116e510ff0644074f88e435a40f28985a75b60e8e1c03bd3bb4baee8
source: Enables semantic checking in a JavaScript file. Must be at the top of a file.
uk: Дозволяє семантичну перевірку у файлі JavaScript. Має бути на початку файлу.

# ++CODE++5a690a5e722b04ad4281333e49ed3a7ac40823d40746fb5c83a33201c237fbf5
source: Enter file path
uk: Введіть шлях до файлу

# ++CODE++6b6fcf25b399d82290af1b78af661483150a934c2f2441c438bdd913673f1d5d
source: Enter new file path...
uk: Введіть новий шлях до файлу...

# ++CODE++52201b011a0a46c3866ce679df6d0203dbe52cffed0c925a4e0332de4d248da9
source: Extract to constant
uk: Витягнути в константу

# ++CODE++0b6028c46b82af6e49f4eb65a8a51f0964adddd11dcf8595273b6d9909addf4a
source: Extract to function
uk: Виділити в функцію

# ++CODE++917496459e7dc27e12593edf19f6ba106d09fc4d719b385996be96cec5bf8b12
source: Failed to resolve {0} as module
uk: Не вдалося розпізнати {0} як модуль

# ++CODE++f8740b79b623bd32b6e702fb87896d08940925d928df3bffe44d7cdbc0127da2
source: Fetching data for better TypeScript IntelliSense
uk: Отримання даних для покращення IntelliSense TypeScript

# ++CODE++498d7064f7bc1af345ff329c069586b1ccb5ca0dc65ca244c3489382c687e712
source: File is not part of a JavaScript project. View the [jsconfig.json documentation]({0}) to learn more.
uk: Файл не є частиною проекту JavaScript. Перегляньте [документацію jsconfig.json]({0}), щоб дізнатися більше.

# ++CODE++6e97ccaa07aca98f70e482a8eb8bd8acad3ede36a0d7c404c77aa9638b15410f
source: File is not part of a TypeScript project. View the [tsconfig.json documentation]({0}) to learn more.
uk: Файл не є частиною проекту TypeScript. Перегляньте [документацію tsconfig.json]({0}), щоб дізнатися більше.

# ++CODE++ce0fe8763c0f93bd2885ba055576eb87b48ef88019b16d83435eb887aab31339
source: File is not part opened folders
uk: Файл не є частиною відкритих папок

# ++CODE++074accffb3bf7b6e0810bc93a321f7ab2867abd9e1569ea114914c0fabc33112
source: Find file references failed. No resource provided.
uk: Не вдалося знайти посилання на файл. Ресурс не надано.

# ++CODE++771c397498f7dba74693cecfb53dd96da849877ad7c9a5eec7ac23db2ca1b7df
source: Find file references failed. Requires TypeScript 4.2+.
uk: Не вдалося знайти посилання на файл. Потрібен TypeScript 4.2+.

# ++CODE++b51ba549d6cbe77eb273b252959c4cb334e8b39a9e7c902a171e6ad819c823a3
source: Find file references failed. Unknown file type.
uk: Не вдалося знайти посилання на файл. Невідомий тип файлу.

# ++CODE++39d404c29258162648f3d8b9ec99d9d493eabe74eeb58267eaf60f6a30b05644
source: Find file references failed. Unsupported file type.
uk: Не вдалося знайти посилання на файл. Непідтримуваний тип файлу.

# ++CODE++99ba1e8ef633bbdbdcb59fa90ded44154f3fd1e1e4d7166c45d2f759ef5bef77
source: Finding file references
uk: Знаходження посилань на файли

# ++CODE++d1309d9be9de14c0738089c27a185c121a42da8ec493c751520a4e2191c1d23b
source: Finding source definitions
uk: Знаходження визначень джерел

# ++CODE++26804638dad4fa7f7bc3ca47cd4b06ac5f5c98ccf93a5c0dfc01355083ad3f66
source: Fix all fixable JS/TS issues
uk: Виправте всі виправні проблеми JS/TS

# ++CODE++773c6c3aafa8c9f58eea260fe7d5dedc52b3068c2e947a47683a088bd23a03d4
source: Follow link
uk: Слідуйте за посиланням

# ++CODE++a29a8ef37333f806fc5f9076b288f5ac22b295b81461cdc43ea6c738897e26ae
source: Go to Source Definition failed. No resource provided.
uk: Перехід до визначення джерела не вдався. Ресурс не надано.

# ++CODE++b2feadbb4a2882a5fb2cea3f4bcd2c52415ab7e7417e0c79f5961c64365cf928
source: Go to Source Definition failed. Requires TypeScript 4.7+.
uk: Перехід до визначення джерела не вдався. Потрібен TypeScript 4.7+.

# ++CODE++8f01bea5ce7a7eb0ebe0f4bee973941d0095a0d5c770972efb965ddb99ac771e
source: Go to Source Definition failed. Unknown file type.
uk: Перехід до визначення джерела не вдався. Невідомий тип файлу.

# ++CODE++7db02cfc2c17db1dfb572dbfdb173acd14ef78ee7425ca53a83d8e26edbe2d7d
source: Go to Source Definition failed. Unsupported file type.
uk: Перехід до визначення джерела не вдався. Непідтримуваний тип файлу.

# ++CODE++e2ca755eccdc287ca2c74b86e9a33a06671c11cd9dda1c69de2d2b47a9a14e0d
source: Initializing '{0}'
uk: Ініціалізація '{0}'

# ++CODE++00288f01741225c3ff00094bacb6455d996af76613ea2511ea445f0e58baf524
source: JS/TS IntelliSense Status
uk: Статус IntelliSense JS/TS

# ++CODE++0bf93b633f33a36c8e50f78e11dffd62a8e32a606364e60f10d0e6725e64f06b
source: JSDoc comment
uk: Коментар JSDoc

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
uk: Дізнатися більше

# ++CODE++87432d306e7ece18dedf1d712f6771421ce9052e74c1e3c50c5a803170333567
source: Learn more about JS/TS refactorings
uk: Дізнайтеся більше про рефакторинг JS/TS

# ++CODE++b13879b55aeeb667ef7f700158776edd7c6b0e7707e88c373dda8a18205877d2
source: Learn more about managing TypeScript versions
uk: Дізнайтеся більше про управління версіями TypeScript

# ++CODE++00b633b87b1d606f82e52077e5f82b1c7fe9de7660d0a954f07f43fc35eec62a
source: Loading IntelliSense status
uk: Завантаження статусу IntelliSense

# ++CODE++f498bdd33d192a2654b223f4515643c2f3615a277dc9f8ed92dca1eeb31de725
source: Move to File
uk: Перемістити до файлу

# ++CODE++6300ef800bb884295b0b4b35682b75cecd7cc550d202db56d04a0643b8fb873f
source: Never
uk: Ніколи

# ++CODE++cf15925d522f2af72fc34f65786bfe06438043149d60918be1fda8d4faa3cdd9
source: Never in this Workspace
uk: Ніколи в цьому Робочому просторі

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні

# ++CODE++da6819db3628c01f3d24be26ba764568c184f1e1e74100c77277fec38cf11b75
source: No jsconfig
uk: Немає jsconfig

# ++CODE++98961582c15a3efc7911b1001bc08733e243fdf7374b8cad608358f331653531
source: No opened folders
uk: Немає відкритих папок

# ++CODE++a111df6bad92ea2f0285c50ff27e121acffcfc0d99e15e1a7c82130e47eb7b58
source: No source definitions found.
uk: Джерел визначень не знайдено.

# ++CODE++ae3db19da101521906958af547ec5fea064acdcf53701c42767688eacb9b3466
source: No tsconfig
uk: Немає tsconfig

# ++CODE++a0e63d7c7125d29af84d6919af5550529be77c327324940c98c4b2cb13a99c8c
source: Not now
uk: Не зараз

# ++CODE++f76ba63dc61ef2c6d26415763270531dcbc46803ae43acfa1804148aa22a83de
source: Open Config File
uk: Відкрити файл конфігурації

# ++CODE++03f69885814b5b7aa5e4758e46733da443a237e2ec63488bddd230f501ff166a
source: Open on GitHub
uk: Відкрити на GitHub

# ++CODE++5d40b1f86b7c14ffbe79c4e326d1ca14ad35225cce6bef125f243202a3ac00d1
source: Organize Imports
uk: Організувати імпорти

# ++CODE++077651279807da5fa1ff67c463640c67320917862134d7db750e3035abf32ace
source: Partial mode
uk: Частковий режим

# ++CODE++8b61433590af70da480d73e9f40dbedb98f53ec1bc7a37f4b2613e7f31064e56
source: Paste with imports
uk: Вставити з імпортами

# ++CODE++d21baf67ea2cd8c6d1aab1bda6e429ddbcfe58e0db246ccc6a538bfdc2d71d9d
source: Please open a folder in VS Code to use a TypeScript or JavaScript project
uk: Будь ласка, відкрийте папку у VS Code, щоб використовувати проект TypeScript або JavaScript

# ++CODE++cf42f2d7821fd8b5b3a955758a1783a90fb10a198e2f03ba8172abcce516b783
source: Please report an issue against Yarn PnP
uk: Будь ласка, повідомте про проблему з Yarn PnP

# ++CODE++40adb68c1cd54660716374c6bd000a3ebcf4af8f16b04781953b0cd66544aa87
source: Please update your TypeScript version
uk: Будь ласка, оновіть вашу версію TypeScript.

# ++CODE++5ff65dd2848cdddae03a57b1ec2ae9130fcb4b8d54575462bf952821da3233e8
source: Project wide IntelliSense not available
uk: ІнтеліСенс для всього проєкту недоступний

# ++CODE++1a58e5284053a769896d58e7ba836f33c1c903cb20d1f5fc21da914b9714ff5f
source: Remove Unused Imports
uk: Видалити невикористовувані імпорти

# ++CODE++99bf1dcb6dc8e07e84b9aecba57bbccbf388228aa278584567a1739c6f5626c8
source: Remove all unused code
uk: Видалити весь невикористаний код

# ++CODE++653f005a60724912916a58829d3b7e40fa138ae0872c380f2b5dd0d330840997
source: Report Issue
uk: Повідомити про проблему

# ++CODE++f5868a7f0144341e82abc276ae7fcaeaa5219a5f28b8cb3710d476bea287dfc0
source: Report issue against Yarn PnP
uk: Повідомити про проблему з Yarn PnP

# ++CODE++6ae46849bda95f4fa817885862a58b38edd3e337bc24d94d9cfd8ddb2ea00bc0
source: Select Version
uk: Вибрати версію

# ++CODE++76a2fbdb3f8efb23e5033d3eebcc629adeadaf17b738cf3326eaa6551ec49639
source: Select code action to apply
uk: Виберіть дію коду для застосування

# ++CODE++f7a227c85c0b32cbf72b2cba0d41c2f6486f2bc73460fc4d4b7c33c03337fece
source: Select existing file...
uk: Виберіть існуючий файл...

# ++CODE++9eced3a624952d9fe5453127841ddc931b50627d2c08347da75468f94c1a733d
source: Select move destination
uk: Виберіть місце призначення для переміщення

# ++CODE++95cf2447e6ea199ce57d411d85fc8bd67b75f2ef1e268e6d7045d4ab6e8eca9e
source: Select the TypeScript version used for JavaScript and TypeScript language features
uk: Виберіть версію TypeScript, що використовується для функцій мови JavaScript та TypeScript

# ++CODE++aaf69eb0e5cd835944acea08084a75a0cd184e47be5073994ab7390c2edc3cb9
source: Sort Imports
uk: Сортувати імпорти

# ++CODE++8b739b8e8c6ab7de44064c98f650ffdd601b31c10783375a33e70ca96c24f526
source: Suppresses @ts-check errors on the next line of a file, expecting at least one to exist.
uk: Приховує помилки @ts-check на наступному рядку файлу, очікуючи, що принаймні одна з них існує.

# ++CODE++70bc285903bd9ce273f6bc71eb23d9ada450bc9f97418be89ea3b443753eabb1
source: Suppresses @ts-check errors on the next line of a file.
uk: Приховує помилки @ts-check на наступному рядку файлу.

# ++CODE++cc2c51353932e501c4ca373fc6ec512106f15c68d7c25c08675f0fbc5a02310c
source: TS Server has not started logging.
uk: Сервер TS ще не почав реєстрацію.

# ++CODE++1e32e5d3b54f26c23592c471d672beb47c5d95a8a6946fdf17dd486c77320284
source: TS Server logging is currently enabled which may impact performance.
uk: Журналювання сервера TS наразі увімкнене, що може вплинути на продуктивність.

# ++CODE++00edef43b793884c746a58b028731f392d3c59b7b32ccde6bc676d4f3e865a99
source: TS Server logging is off. Please set 'typescript.tsserver.log' and restart the TS server to enable logging
uk: Журналювання TS сервера вимкнено. Будь ласка, встановіть 'typescript.tsserver.log' і перезапустіть TS сервер, щоб увімкнути журналювання.

# ++CODE++fab6a7ed1ed9b87eec1851d4397bc0c0da3050fd4e18467a8d0a7b4fe1eb85ea
source: The JS/TS language service crashed 5 times in the last 5 Minutes.
uk: Служба мови JS/TS зламалася 5 разів за останні 5 хвилин.

# ++CODE++66027bbda0a342675b70624b30e7b9cba8600ae5a8f7494eb0081fa4f820db90
source: The JS/TS language service crashed 5 times in the last 5 Minutes. This may be caused by a plugin contributed by one of these extensions: {0} Please try disabling these extensions before filing an issue against VS Code.
uk: Служба мови JS/TS зламалася 5 разів за останні 5 хвилин. Це може бути викликано плагіном, внесеним одним із цих розширень: {0} Будь ласка, спробуйте вимкнути ці розширення перед поданням проблеми до VS Code.

# ++CODE++c248aa51509819abb988df148ad29b0dc6a9787b3e440733d9a89d0877a630f7
source: The JS/TS language service crashed.
uk: Служба мови JS/TS зазнала збою.

# ++CODE++e0faf0329e1fd443d7872be17d971a3b40df4cfd14ea697b445446376bc02fda
source: The JS/TS language service crashed. This may be caused by a plugin contributed by one of these extensions: {0}. Please try disabling these extensions before filing an issue against VS Code.
uk: Служба мови JS/TS зазнала збою. Це може бути спричинено плагіном, наданим одним із цих розширень: {0}. Будь ласка, спробуйте вимкнути ці розширення перед поданням проблеми щодо VS Code.

# ++CODE++17666535ebf86614a3081cbd6f6e3f43d75e71cc8091405c22c2d9563610466b
source: The JS/TS language service immediately crashed 5 times. The service will not be restarted.
uk: Служба мови JS/TS відразу ж зламалася 5 разів. Служба не буде перезапущена.

# ++CODE++1bee642f6b81661485922334f80ec8755bedd6b1fb8cc88fd15c3fd04a1172f4
source: The JS/TS language service immediately crashed 5 times. The service will not be restarted. This may be caused by a plugin contributed by one of these extensions: {0}. Please try disabling these extensions before filing an issue against VS Code.
uk: Служба мови JS/TS відразу ж зламалася 5 разів. Служба не буде перезапущена. Це може бути викликано плагіном, внесеним одним із цих розширень: {0}. Будь ласка, спробуйте вимкнути ці розширення перед тим, як подати запит на виправлення проблеми у VS Code.

# ++CODE++f042c53a9eee9047d6f2d807ed1266c13253a6848e195a9fd2a5f23bd3e24660
source: The TypeScript Go extension is not installed.
uk: Розширення TypeScript Go не встановлено.

# ++CODE++db560cf2114ff87b85623ee5375a8f83059098968a27572f492b18a9c494ba46
source: The current selection cannot be extracted
uk: Поточний вибір не може бути витягнутий

# ++CODE++79dd57bc09ff37c15d35fa51ebae790240f6198d45a25651e125b3d5fcfbda09
source: The path {0} doesn't point to a valid Node installation to run TS Server. Falling back to bundled Node.
uk: Шлях {0} не вказує на дійсну установку Node для запуску TS Server. Повертаємося до вбудованого Node.

# ++CODE++11bd7eb7b98d0706f310da4cae21f00e55b6c3726a421676dcc08e3a122d9ae5
source: The path {0} doesn't point to a valid tsserver install. Falling back to bundled TypeScript version.
uk: Шлях {0} не вказує на дійсну установку tsserver. Повертаємося до вбудованої версії TypeScript.

# ++CODE++513768bb4385063ca9abaa1c95bdd6174cdf4136ab73d997bfa59a8e1d678455
source: The workspace is using a version of the TypeScript Server that has been patched by Yarn PnP. This patching is a common source of bugs.
uk: Робоча область використовує версію TypeScript Server, яка була виправлена за допомогою Yarn PnP. Це виправлення є поширеним джерелом помилок.

# ++CODE++98c06d273886baed7095754d9519fbc1cbcc090bf772d279bc6bdf2b4de2141a
source: The workspace is using an old version of TypeScript ({0}). Before reporting an issue, please update the workspace to use TypeScript {1} or newer to make sure the bug has not already been fixed.
uk: Робоче середовище використовує стару версію TypeScript ({0}). Перед тим як повідомити про проблему, будь ласка, оновіть робоче середовище до використання TypeScript {1} або новішої версії, щоб переконатися, що помилка вже не була виправлена.

# ++CODE++a78c926c7fa2e923bb29f60b37f0eea0e8d7d4f7d452ea861e2d6634bedd611b
source: This workspace contains a TypeScript version. Would you like to use the workspace TypeScript version for TypeScript and JavaScript language features?
uk: Цей робочий простір містить версію TypeScript. Чи бажаєте ви використовувати версію TypeScript робочого простору для функцій мов TypeScript та JavaScript?

# ++CODE++e9cb3b27939c312865393da3cfb28e7e94a7515f8f4e2fc2e9f706fb057eeb0f
source: This workspace wants to use the Node installation at '{0}' to run TS Server. Would you like to use it?
uk: Цей робочий простір хоче використовувати установку Node за адресою '{0}' для запуску TS Server. Чи бажаєте ви її використовувати?

# ++CODE++1f0f9b85b3a4687eebd06776b3b0405f0b6f2a1c22f769dd6b7ee0627a568d5c
source: To enable project-wide JavaScript/TypeScript language features, exclude folders with many files, like: {0}
uk: Щоб увімкнути функції мови JavaScript/TypeScript для всього проєкту, виключіть папки з великою кількістю файлів, такі як: {0}

# ++CODE++f7208a0481001f45bba41f9033b238421e9b1a5db356c864db3d9585c32740c5
source: To enable project-wide JavaScript/TypeScript language features, exclude large folders with source files that you do not work on.
uk: Щоб увімкнути функції мови JavaScript/TypeScript для всього проєкту, виключіть великі папки з вихідними файлами, над якими ви не працюєте.

# ++CODE++017d70fbcbf87e8aa65e2563f7ee58ff2337156a965a4141fb6595cb6799ff70
source: TypeScript Server Log
uk: Журнал сервера TypeScript

# ++CODE++290642babb3e3db5a4a483a1f0bb040298db0c7df9a319323c2ca5c624253a5a
source: TypeScript Task in tasks.json contains "\\". TypeScript tasks tsconfig must use "/"
uk: Завдання TypeScript у tasks.json містить "\\". Завдання TypeScript tsconfig повинні використовувати "/".

# ++CODE++4c2350f2dbce544e0c16436f7b19b90dcf5a4aa116630232c5c0948a26effb4e
source: TypeScript Version
uk: Версія TypeScript

# ++CODE++63b732ffe5d40e33ab4ca8cfc5518795028dc734d1eff0c6e3b26e57b6ed1508
source: TypeScript language server exited with error. Error message is: {0}
uk: Сервер мови TypeScript завершив роботу з помилкою. Повідомлення про помилку: {0}

# ++CODE++735e662a45aba4811689635f2dc072f426351e523b575d22332cead384b5add2
source: TypeScript version
uk: Версія TypeScript

# ++CODE++286df8bff4cff50d071bfa3d6d5d3bb6a548a179fd8b3f4d33adfe1ba3357f70
source: TypeScript: Configure Excludes
uk: TypeScript: Налаштування виключень

# ++CODE++e41fbf91e51675671a6dea301e76b3db8a1da6faf72a73ee7c2e931bf4772a11
source: Update imports for '{0}'?
uk: Оновити імпорти для '{0}'?

# ++CODE++c959c280f828e1598d8e796076878d7a2dde9875a4287f6032c45fa13bcede2b
source: Update imports for the following {0} files?
uk: Оновити імпорти для наступних {0} файлів?

# ++CODE++a48ad4c858751b66d827e6ed1f2a1974a660e1042c70da87b2f1278fb37edd73
source: Use VS Code's Version
uk: Використовуйте версію VS Code

# ++CODE++ff1ce5c617c474d55bbb1b87c60463aa57787ad4ebc26d0714b067db841826e5
source: Use Workspace Version
uk: Використовувати версію робочого простору

# ++CODE++5cc39c6d1762eef8d005bbf913094e314ad3958e7e01de9706bac37ba51bac09
source: VS Code's tsserver was deleted by another application such as a misbehaving virus detection tool. Please reinstall VS Code.
uk: tsserver VS Code було видалено іншим додатком, таким як неправильно працюючий інструмент виявлення вірусів. Будь ласка, перевстановіть VS Code.

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
uk: Так

# ++CODE++c6dfea7025e71ace1d9bd83bf31138420354c2e14145de2da6fd488a274a10d8
source: build - {0}
uk: будувати - {0}

# ++CODE++6aeb50de41ca7956419663f388c9b1098352e3ca2e3937bc9a435d2a03022ea8
source: destination files
uk: файли призначення

# ++CODE++abb0efe95296c1a5009db15d861e7e5c48fc96b5bcfa34f465d2cf94cdf9b4e2
source: invalid version
uk: недійсна версія

# ++CODE++eee3a126e7c77f0a50493399f57015ea55f1f0c3123108b303159746aef1393e
source: watch - {0}
uk: годинник - {0}

# ++CODE++87014d5cb51025382be45cb80c1e9934af6ced88aefc63f3c07de2469ae1db0a
source: {0} (Fix all in file)
uk: {0} (Виправити все у файлі)

# ++CODE++07a140471f1ca9a4e89f4caa561173677eb133d17b8181889f3c3ce1c2b45a59
source: {0} implementations
uk: {0} реалізацій

# ++CODE++5f18beb7414fce49ba98e82211c9d20698214f3d58ac672865cbee7cada1edf2
source: {0} references
uk: {0} посилань
