Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.emmet.xlf
Languages: uk

# ++CODE++f03e9fb37f9c1f78676ea2f62a88f1b571a398a845155f2a91b0d65ac994ad7f
source: Emmet Abbreviation
uk: Скорочення Emmet

# ++CODE++af23a53b738e7958ce22ef8d95891c4aefc5b3d4556533fcdbb98750943de737
source: Enter Abbreviation
uk: Введіть скорочення

# ++CODE++5de9fbf5dcab43b637106b180d24fca513b75f0d3ba64f80b34ad7c31216d781
source: Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.
uk: Неправильне поле emmet.variables. Дивіться https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration для правильного прикладу.

# ++CODE++e064b60a2a6f3e0643c2a157fdd3f116f53057d454b4ac6dda0f962f8fb4039d
source: Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.
uk: Недійсний файл фрагментів. Дивіться https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets для дійсного прикладу.

# ++CODE++d43611495334502b6c95d9edeb443af4d599e2a2eb88cd225286fbe87a5e5325
source: Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.
uk: Неправильний синтаксис профілю. Дивіться https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration для правильного прикладу.

# emmetPreferencesFilterCommentTrigger
source: A comma-separated list of attribute names that should exist in the abbreviation for the comment filter to be applied.
uk: Список імен атрибутів, розділених комами, які повинні існувати в абревіатурі, щоб фільтр коментарів міг бути застосований.

# emmetPreferencesFilterCommentAfter
source: A definition of comment that should be placed after matched element when comment filter is applied.
uk: Визначення коментаря, яке слід розмістити після відповідного елемента, коли застосовується фільтр коментарів.

# emmetPreferencesFilterCommentBefore
source: A definition of comment that should be placed before matched element when comment filter is applied.
uk: Визначення коментаря, яке повинно бути розміщене перед відповідним елементом, коли застосовується фільтр коментарів.

# emmetExtensionsPathItem
source: A path containing Emmet syntaxProfiles and/or snippets.
uk: Шлях, що містить синтаксис Emmet, профілі та/або фрагменти.

# emmetExclude
source: An array of languages where Emmet abbreviations should not be expanded.
uk: Масив мов, де абревіатури Emmet не повинні розширюватися.

# emmetExtensionsPath
source: An array of paths, where each path can contain Emmet syntaxProfiles and/or snippet files. In case of conflicts, the profiles/snippets of later paths will override those of earlier paths. See https://code.visualstudio.com/docs/editor/emmet for more information and an example snippet file.
uk: Масив шляхів, де кожен шлях може містити синтаксис Emmet, профілі та/або файли фрагментів. У разі конфліктів профілі/фрагменти пізніших шляхів переважатимуть над тими, що в ранніх шляхах. Дивіться https://code.visualstudio.com/docs/editor/emmet для отримання додаткової інформації та прикладу файлу фрагмента.

# emmetPreferencesFormatForceIndentTags
source: An array of tag names that should always get inner indentation.
uk: Масив імен тегів, які завжди повинні отримувати внутрішнє відступлення.

# emmetPreferencesFormatNoIndentTags
source: An array of tag names that should never get inner indentation.
uk: Масив імен тегів, які ніколи не повинні мати внутрішнє відступлення.

# command.balanceIn
source: Balance (inward)
uk: Баланс (вхідний)

# command.balanceOut
source: Balance (outward)
uk: Баланс (вихідний)

# emmetPreferencesCssMozProperties
source: Comma separated CSS properties that get the 'moz' vendor prefix when used in Emmet abbreviation that starts with `-`. Set to empty string to always avoid the 'moz' prefix.
uk: Властивості CSS, розділені комами, які отримують префікс постачальника 'moz', коли використовуються в скороченні Emmet, що починається з `-`. Встановіть в порожній рядок, щоб завжди уникати префікса 'moz'.

# emmetPreferencesCssMsProperties
source: Comma separated CSS properties that get the 'ms' vendor prefix when used in Emmet abbreviation that starts with `-`. Set to empty string to always avoid the 'ms' prefix.
uk: Властивості CSS, розділені комами, які отримують префікс постачальника 'ms', коли використовуються в скороченні Emmet, що починається з `-`. Встановіть у порожній рядок, щоб завжди уникати префікса 'ms'.

# emmetPreferencesCssOProperties
source: Comma separated CSS properties that get the 'o' vendor prefix when used in Emmet abbreviation that starts with `-`. Set to empty string to always avoid the 'o' prefix.
uk: Властивості CSS, розділені комами, які отримують префікс постачальника 'o', коли використовуються в скороченні Emmet, що починається з `-`. Встановіть у порожній рядок, щоб завжди уникати префікса 'o'.

# emmetPreferencesCssWebkitProperties
source: Comma separated CSS properties that get the 'webkit' vendor prefix when used in Emmet abbreviation that starts with `-`. Set to empty string to always avoid the 'webkit' prefix.
uk: Властивості CSS, розділені комами, які отримують префікс постачальника 'webkit', коли використовуються в скороченні Emmet, що починається з `-`. Встановіть у порожній рядок, щоб завжди уникати префікса 'webkit'.

# command.decrementNumberByOneTenth
source: Decrement by 0.1
uk: Зменшити на 0.1

# command.decrementNumberByOne
source: Decrement by 1
uk: Зменшити на 1

# command.decrementNumberByTen
source: Decrement by 10
uk: Зменшити на 10

# emmetPreferencesFloatUnit
source: Default unit for float values.
uk: За замовчуванням одиниця для значень з плаваючою комою.

# emmetPreferencesIntUnit
source: Default unit for integer values.
uk: За замовчуванням одиниця для цілих значень.

# emmetSyntaxProfiles
source: Define profile for specified syntax or use your own profile with specific rules.
uk: Визначте профіль для вказаного синтаксису або використовуйте свій власний профіль з конкретними правилами.

# emmetPreferencesBemElementSeparator
source: Element separator used for classes when using the BEM filter.
uk: Роздільник елементів, що використовується для класів при використанні фільтра BEM.

# description
source: Emmet support for VS Code
uk: Підтримка Emmet для VS Code

# emmetIncludeLanguages
source: Enable Emmet abbreviations in languages that are not supported by default. Add a mapping here between the language and Emmet supported language. For example: `{"vue-html": "html", "javascript": "javascriptreact"}`
uk: Увімкніть скорочення Emmet у мовах, які не підтримуються за замовчуванням. Додайте тут відповідність між мовою та мовою, що підтримується Emmet. Наприклад: `{"vue-html": "html", "javascript": "javascriptreact"}`

# command.evaluateMathExpression
source: Evaluate Math Expression
uk: Оцінити математичний вираз

# command.matchTag
source: Go to Matching Pair
uk: Перейти до парів, що збігаються

# command.nextEditPoint
source: Go to Next Edit Point
uk: Перейти до наступної точки редагування

# command.prevEditPoint
source: Go to Previous Edit Point
uk: Перейти до попередньої точки редагування

# emmetUseInlineCompletions
source: If `true`, Emmet will use inline completions to suggest expansions. To prevent the non-inline completion item provider from showing up as often while this setting is `true`, turn `#editor.quickSuggestions#` to `inline` or `off` for the `other` item.
uk: Якщо `true`, Emmet використовуватиме вбудовані завершення для пропозицій розширень. Щоб запобігти частому появленню постачальника елементів завершення, що не є вбудованим, під час активації цього налаштування `true`, встановіть `#editor.quickSuggestions#` на `inline` або `off` для елемента `other`.

# emmetPreferencesCssColorShort
source: If `true`, color values like `#f` will be expanded to `#fff` instead of `#ffffff`.
uk: Якщо `true`, значення кольорів, такі як `#f`, будуть розширені до `#fff` замість `#ffffff`.

# emmetPreferencesAllowCompactBoolean
source: If `true`, compact notation of boolean attributes are produced.
uk: Якщо `true`, генерується компактна нотація булевих атрибутів.

# emmetPreferencesOutputReverseAttributes
source: If `true`, reverses attribute merging directions when resolving snippets.
uk: Якщо `true`, змінює напрямки об'єднання атрибутів під час вирішення фрагментів.

# emmetShowSuggestionsAsSnippets
source: If `true`, then Emmet suggestions will show up as snippets allowing you to order them as per `#editor.snippetSuggestions#` setting.
uk: Якщо `true`, тоді пропозиції Emmet з'являться як фрагменти, що дозволяє вам впорядковувати їх відповідно до налаштування `#editor.snippetSuggestions#`.

# command.incrementNumberByOneTenth
source: Increment by 0.1
uk: Збільшити на 0.1

# command.incrementNumberByOne
source: Increment by 1
uk: Збільшити на 1

# command.incrementNumberByTen
source: Increment by 10
uk: Збільшити на 10

# command.mergeLines
source: Merge Lines
uk: Об'єднати рядки

# emmetPreferencesBemModifierSeparator
source: Modifier separator used for classes when using the BEM filter.
uk: Розділювач модифікатора, що використовується для класів при використанні фільтра BEM.

# emmetPreferences
source: Preferences used to modify behavior of some actions and resolvers of Emmet.
uk: Налаштування, що використовуються для зміни поведінки деяких дій та резолверів Emmet.

# command.reflectCSSValue
source: Reflect CSS Value
uk: Відобразити значення CSS

# command.removeTag
source: Remove Tag
uk: Видалити тег

# command.selectNextItem
source: Select Next Item
uk: Вибрати наступний елемент

# command.selectPrevItem
source: Select Previous Item
uk: Вибрати попередній елемент

# command.showEmmetCommands
source: Show Emmet Commands
uk: Показати команди Emmet

# emmetShowExpandedAbbreviation
source: Shows expanded Emmet abbreviations as suggestions. The option `"inMarkupAndStylesheetFilesOnly"` applies to html, haml, jade, slim, xml, xsl, css, scss, sass, less and stylus. The option `"always"` applies to all parts of the file regardless of markup/css.
uk: Показує розширені скорочення Emmet як підказки. Опція `"inMarkupAndStylesheetFilesOnly"` застосовується до html, haml, jade, slim, xml, xsl, css, scss, sass, less та stylus. Опція `"always"` застосовується до всіх частин файлу незалежно від розмітки/css.

# emmetShowAbbreviationSuggestions
source: Shows possible Emmet abbreviations as suggestions. Not applicable in stylesheets or when emmet.showExpandedAbbreviation is set to `"never"`.
uk: Показує можливі скорочення Emmet як пропозиції. Не застосовується в таблицях стилів або коли emmet.showExpandedAbbreviation встановлено на `"never"`.

# command.splitJoinTag
source: Split/Join Tag
uk: Тег Розділити/Об'єднати

# emmetPreferencesOutputSelfClosingStyle
source: Style of self-closing tags: html (`<br>`), xml (`<br/>`) or xhtml (`<br />`).
uk: Стиль самозакриваючих тегів: html (`<br>`), xml (`<br/>`) або xhtml (`<br />`).

# emmetPreferencesSassBetween
source: Symbol to be placed at the between CSS property and value when expanding CSS abbreviations in Sass files.
uk: Символ, який буде розміщено між властивістю CSS та значенням при розширенні абревіатур CSS у файлах Sass.

# emmetPreferencesStylusBetween
source: Symbol to be placed at the between CSS property and value when expanding CSS abbreviations in Stylus files.
uk: Символ, який потрібно розмістити між властивістю CSS та значенням при розширенні абревіатур CSS у файлах Stylus.

# emmetPreferencesCssBetween
source: Symbol to be placed at the between CSS property and value when expanding CSS abbreviations.
uk: Символ, який потрібно розмістити між властивістю CSS та значенням при розширенні абревіатур CSS.

# emmetPreferencesSassAfter
source: Symbol to be placed at the end of CSS property when expanding CSS abbreviations in Sass files.
uk: Символ, який буде розміщений в кінці властивості CSS при розширенні абревіатур CSS у файлах Sass.

# emmetPreferencesStylusAfter
source: Symbol to be placed at the end of CSS property when expanding CSS abbreviations in Stylus files.
uk: Символ, який буде розміщено в кінці властивості CSS при розширенні абревіатур CSS у файлах Stylus.

# emmetPreferencesCssAfter
source: Symbol to be placed at the end of CSS property when expanding CSS abbreviations.
uk: Символ, який потрібно розмістити в кінці властивості CSS при розширенні абревіатур CSS.

# emmetPreferencesCssFuzzySearchMinScore
source: The minimum score (from 0 to 1) that fuzzy-matched abbreviation should achieve. Lower values may produce many false-positive matches, higher values may reduce possible matches.
uk: Мінімальний бал (від 0 до 1), який повинна досягти нечітко співпадна абревіатура. Нижчі значення можуть призвести до багатьох помилкових позитивних співпадінь, вищі значення можуть зменшити можливі співпадіння.

# emmetPreferencesOutputInlineBreak
source: The number of sibling inline elements needed for line breaks to be placed between those elements. If `0`, inline elements are always expanded onto a single line.
uk: Кількість сусідніх інлайн-елементів, необхідних для розміщення перенесень рядка між цими елементами. Якщо `0`, інлайн-елементи завжди розширюються на один рядок.

# command.toggleComment
source: Toggle Comment
uk: Переключити коментар

# command.updateImageSize
source: Update Image Size
uk: Оновити розмір зображення

# command.updateTag
source: Update Tag
uk: Оновити тег

# emmetVariables
source: Variables to be used in Emmet snippets.
uk: Змінні, які будуть використовуватися в фрагментах Emmet.

# emmetTriggerExpansionOnTab
source: When enabled, Emmet abbreviations are expanded when pressing TAB, even when completions do not show up. When disabled, completions that show up can still be accepted by pressing TAB.
uk: Коли увімкнено, скорочення Emmet розгортаються при натисканні TAB, навіть якщо підказки не з'являються. Коли вимкнено, підказки, що з'являються, все ще можна прийняти, натиснувши TAB.

# emmetOptimizeStylesheetParsing
source: When set to `false`, the whole file is parsed to determine if current position is valid for expanding Emmet abbreviations. When set to `true`, only the content around the current position in CSS/SCSS/Less files is parsed.
uk: Коли встановлено `false`, весь файл аналізується, щоб визначити, чи є поточна позиція дійсною для розширення скорочень Emmet. Коли встановлено `true`, аналізується лише вміст навколо поточної позиції у файлах CSS/SCSS/Less.

# command.wrapWithAbbreviation
source: Wrap with Abbreviation
uk: Обгорнути з абревіатурою
