Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.markdown-language-features.xlf
Languages: uk

# configuration.markdown.editor.updateLinksOnPaste.enabled
source: Enable/disable a paste option that updates links and reference in text that is copied and pasted between Markdown editors. To use this feature, after pasting text that contains updatable links, just click on the Paste Widget and select `Paste and update pasted links`.
uk: Увімкніть/вимкніть опцію вставки, яка оновлює посилання та посилання в тексті, що копіюється та вставляється між редакторами Markdown. Щоб скористатися цією функцією, після вставки тексту, що містить оновлювальні посилання, просто натисніть на віджет вставки та виберіть `Вставити та оновити вставлені посилання`.

# markdown.findAllFileReferences
source: Find File References
uk: Знайти посилання на файли

# configuration.markdown.preferredMdPathExtensionStyle.auto
source: For existing paths, try to maintain the file extension style. For new paths, add file extensions.
uk: Для існуючих шляхів намагайтеся зберігати стиль розширення файлів. Для нових шляхів додайте розширення файлів.

# configuration.markdown.updateLinksOnFileMove.include
source: Glob patterns that specifies files that trigger automatic link updates. See `#markdown.updateLinksOnFileMove.enabled#` for details about this feature.
uk: Глобальні шаблони, які вказують файли, що викликають автоматичні оновлення посилань. Дивіться `#markdown.updateLinksOnFileMove.enabled#` для отримання деталей про цю функцію.

# configuration.markdown.copyFiles.overwriteBehavior.nameIncrementally
source: If a file with the same name already exists, append a number to the file name, for example: `image.png` becomes `image-1.png`.
uk: Якщо файл з такою ж назвою вже існує, додайте число до назви файлу, наприклад: `image.png` стає `image-1.png`.

# configuration.markdown.copyFiles.overwriteBehavior.overwrite
source: If a file with the same name already exists, overwrite it.
uk: Якщо файл з такою ж назвою вже існує, перезаписати його.

# markdown.editor.insertImageFromWorkspace
source: Insert Image from Workspace
uk: Вставити зображення з робочої області

# markdown.editor.insertLinkFromWorkspace
source: Insert Link to File in Workspace
uk: Вставити посилання на файл у робочій області

# markdown.preview.markEditorSelection.desc
source: Mark the current editor selection in the Markdown preview.
uk: Позначте вибір поточного редактора в попередньому перегляді Markdown.

# displayName
source: Markdown Language Features
uk: Особливості мови Markdown

# configuration.pasteUrlAsFormattedLink.never
source: Never create Markdown links.
uk: Ніколи не створюйте посилання Markdown.

# configuration.markdown.editor.filePaste.enabled.never
source: Never create Markdown links.
uk: Ніколи не створюйте посилання Markdown.

# configuration.markdown.editor.drop.enabled.never
source: Never create Markdown links.
uk: Ніколи не створюйте посилання Markdown.

# configuration.markdown.updateLinksOnFileMove.enabled.never
source: Never try to update link and don't prompt.
uk: Ніколи не намагайтеся оновити посилання і не запитуйте.

# markdown.openImage.title
source: Open Image
uk: Відкрити зображення

# markdown.showLockedPreviewToSide.title
source: Open Locked Preview to the Side
uk: Відкрити заблокований попередній перегляд збоку

# markdown.preview.title
source: Open Preview
uk: Відкрити попередній перегляд

# markdown.previewSide.title
source: Open Preview to the Side
uk: Відкрити попередній перегляд збоку

# configuration.markdown.links.openLocation.beside
source: Open links beside the active editor.
uk: Відкрийте посилання поруч з активним редактором.

# configuration.markdown.links.openLocation.currentGroup
source: Open links in the active editor group.
uk: Відкривати посилання в активній групі редакторів.

# configuration.markdown.preferredMdPathExtensionStyle.includeExtension
source: Prefer including the file extension. For example, path completions to a file named `file.md` will insert `file.md`.
uk: Надавайте перевагу включенню розширення файлу. Наприклад, автозавершення шляху до файлу з назвою `file.md` вставить `file.md`.

# configuration.markdown.preferredMdPathExtensionStyle.removeExtension
source: Prefer removing the file extension. For example, path completions to a file named `file.md` will insert `file` without the `.md`.
uk: Виберіть видалення розширення файлу. Наприклад, завершення шляху до файлу з назвою `file.md` вставить `file` без `.md`.

# configuration.markdown.updateLinksOnFileMove.enabled.prompt
source: Prompt on each file move.
uk: Запит на кожен переміщення файлу.

# description
source: Provides rich language support for Markdown.
uk: Надає багатий мовний супровід для Markdown.

# markdown.preview.refresh.title
source: Refresh Preview
uk: Оновити попередній перегляд

# workspaceTrust
source: Required for loading styles configured in the workspace.
uk: Необхідно для завантаження стилів, налаштованих у робочому просторі.

# markdown.preview.breaks.desc
source: Sets how line-breaks are rendered in the Markdown preview. Setting it to `true` creates a `<br>` for newlines inside paragraphs.
uk: Встановлює, як перенос рядків відображається в попередньому перегляді Markdown. Встановлення значення `true` створює `<br>` для нових рядків всередині абзаців.

# markdown.showSource.title
source: Show Source
uk: Показати джерело

# configuration.markdown.editor.drop.enabled.smart
source: Smartly create Markdown links by default when not dropping into a code block or other special element. Use the drop widget to switch between pasting as plain text or as Markdown links.
uk: Розумно створюйте посилання Markdown за замовчуванням, коли не вставляєте в блок коду або інший спеціальний елемент. Використовуйте віджет для перемикання між вставкою як простий текст або як посилання Markdown.

# configuration.pasteUrlAsFormattedLink.smart
source: Smartly create Markdown links by default when not pasting into a code block or other special element. Use the paste widget to switch between pasting as plain text or as Markdown links.
uk: Розумно створюйте посилання Markdown за замовчуванням, коли не вставляєте в блок коду або інший спеціальний елемент. Використовуйте віджет вставки, щоб перемикатися між вставкою як простого тексту або як посилань Markdown.

# configuration.markdown.editor.filePaste.enabled.smart
source: Smartly create Markdown links by default when not pasting into a code block or other special element. Use the paste widget to switch between pasting as plain text or as Markdown links.
uk: Розумно створюйте посилання Markdown за замовчуванням, коли не вставляєте в кодовий блок або інший спеціальний елемент. Використовуйте віджет вставки, щоб перемикатися між вставкою як простий текст або як посилання Markdown.

# configuration.pasteUrlAsFormattedLink.smartWithSelection
source: Smartly create Markdown links by default when you have selected text and are not pasting into a code block or other special element. Use the paste widget to switch between pasting as plain text or as Markdown links.
uk: Розумно створюйте посилання Markdown за замовчуванням, коли ви виділили текст і не вставляєте його в кодовий блок або інший спеціальний елемент. Використовуйте віджет вставки, щоб перемикатися між вставкою як простого тексту або як посилань Markdown.

# configuration.markdown.editor.filePaste.audioSnippet
source: Snippet used when adding audio to Markdown. This snippet can use the following variables: - `${src}` — The resolved path of the audio file. - `${title}` — The title used for the audio. A snippet placeholder will automatically be created for this variable.
uk: Фрагмент, що використовується при додаванні аудіо до Markdown. Цей фрагмент може використовувати такі змінні: - `${src}` — Вирішений шлях до аудіофайлу. - `${title}` — Заголовок, що використовується для аудіо. Для цієї змінної автоматично буде створено плейсхолдер фрагмента.

# configuration.markdown.editor.filePaste.videoSnippet
source: Snippet used when adding videos to Markdown. This snippet can use the following variables: - `${src}` — The resolved path of the video file. - `${title}` — The title used for the video. A snippet placeholder will automatically be created for this variable.
uk: Фрагмент, що використовується при додаванні відео до Markdown. Цей фрагмент може використовувати такі змінні: - `${src}` — Вирішений шлях до відеофайлу. - `${title}` — Назва, що використовується для відео. Для цієї змінної автоматично буде створено плейсхолдер фрагмента.

# configuration.markdown.updateLinksOnFileMove.include.property
source: The glob pattern to match file paths against. Set to true to enable the pattern.
uk: Шаблон glob для порівняння з шляхами до файлів. Встановіть в true, щоб увімкнути шаблон.

# markdown.preview.toggleLock.title
source: Toggle Preview Locking
uk: Перемикання блокування попереднього перегляду

# markdown.trace.server.desc
source: Traces the communication between VS Code and the Markdown language server.
uk: Відстежує комунікацію між VS Code та сервером мови Markdown.

# configuration.copyIntoWorkspace.mediaFiles
source: Try to copy external image and video files into the workspace.
uk: Спробуйте скопіювати зовнішні файли зображень і відео в робочу область.

# configuration.markdown.preview.openMarkdownLinks.inPreview
source: Try to open links in the Markdown preview.
uk: Спробуйте відкрити посилання в попередньому перегляді Markdown.

# configuration.markdown.preview.openMarkdownLinks.inEditor
source: Try to open links in the editor.
uk: Спробуйте відкрити посилання в редакторі.

# configuration.markdown.updateLinksOnFileMove.enabled
source: Try to update links in Markdown files when a file is renamed/moved in the workspace. Use `#markdown.updateLinksOnFileMove.include#` to configure which files trigger link updates.
uk: Спробуйте оновити посилання в Markdown файлах, коли файл перейменовано/переміщено в робочій області. Використовуйте `#markdown.updateLinksOnFileMove.include#`, щоб налаштувати, які файли викликають оновлення посилань.

# configuration.markdown.validate.duplicateLinkDefinitions.description
source: Validate duplicated definitions in the current file.
uk: Перевірте наявність дублікатів визначень у поточному файлі.

# configuration.markdown.validate.fragmentLinks.enabled.description
source: Validate fragment links to headers in the current Markdown file, for example: `[link](#header)`. Requires enabling `#markdown.validate.enabled#`.
uk: Перевірте фрагменти посилань на заголовки в поточному Markdown файлі, наприклад: `[link](#header)`. Потрібно увімкнути `#markdown.validate.enabled#`.

# configuration.markdown.validate.unusedLinkDefinitions.description
source: Validate link definitions that are unused in the current file.
uk: Перевірте визначення посилань, які не використовуються в поточному файлі.

# configuration.markdown.validate.fileLinks.enabled.description
source: Validate links to other files in Markdown files, for example `[link](/path/to/file.md)`. This checks that the target files exists. Requires enabling `#markdown.validate.enabled#`.
uk: Перевірте посилання на інші файли в Markdown-файлах, наприклад `[link](/path/to/file.md)`. Це перевіряє, що цільові файли існують. Потрібно увімкнути `#markdown.validate.enabled#`.

# configuration.markdown.validate.referenceLinks.enabled.description
source: Validate reference links in Markdown files, for example: `[link][ref]`. Requires enabling `#markdown.validate.enabled#`.
uk: Перевірте посилання на довідки у файлах Markdown, наприклад: `[link][ref]`. Потрібно увімкнути `#markdown.validate.enabled#`.

# configuration.markdown.validate.fileLinks.markdownFragmentLinks.description
source: Validate the fragment part of links to headers in other files in Markdown files, for example: `[link](/path/to/file.md#header)`. Inherits the setting value from `#markdown.validate.fragmentLinks.enabled#` by default.
uk: Перевірте фрагментну частину посилань на заголовки в інших файлах у Markdown файлах, наприклад: `[link](/path/to/file.md#header)`. За замовчуванням успадковує значення налаштування з `#markdown.validate.fragmentLinks.enabled#`.

# markdown.preview.scrollPreviewWithEditor.desc
source: When a Markdown editor is scrolled, update the view of the preview.
uk: Коли редактор Markdown прокручується, оновіть перегляд попереднього вигляду.

# markdown.preview.scrollEditorWithPreview.desc
source: When a Markdown preview is scrolled, update the view of the editor.
uk: Коли попередній перегляд Markdown прокручується, оновіть вигляд редактора.
