Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.debug-auto-launch.xlf
Languages: uk

# ++CODE++de9f057a471cdb8d3b082719bdc7ad2031788d042947349723fa83c9d13a517a
source: Always
uk: Завжди

# ++CODE++db594dedfe3dd6c2b4e770e8c71a1d5d955c1322e6029fbd156e166ceb9cdda9
source: Auto Attach: Always
uk: Авто прикріплення: завжди

# ++CODE++db4093a5a4da4e3f469d8114ff3ffb6e40a445ae83c36ed4c65c570a1c220d66
source: Auto Attach: Disabled
uk: Авто прикріплення: Вимкнено

# ++CODE++a9b3015cc7109f4979fa825b83bbd674e441bd374d65fd44edc3ce37b9633f9a
source: Auto Attach: Smart
uk: Авто прикріплення: Розумне

# ++CODE++c56a197285bb3c3e51412a31ba20823c43359d4bb66f7548397efef9fee70b7c
source: Auto Attach: With Flag
uk: Авто прикріплення: з прапором

# ++CODE++5b75ac6b0c9d2a8d549b6e8fb2a7549869e801021ca19a60290681aa97f8877e
source: Auto attach is disabled and not shown in status bar
uk: Авто прикріплення вимкнено і не відображається в рядку стану

# ++CODE++7d74f58e90607eebf6c79b3efec5a82acc9b157fa2d94c683bb37aed1b455bf2
source: Auto attach to every Node.js process launched in the terminal
uk: Автоматичне приєднання до кожного процесу Node.js, запущеного в терміналі

# ++CODE++ac9d59444473d2c13e52c7289080a4290def4b8da754785df635a2109181c841
source: Auto attach when running scripts that aren't in a node_modules folder
uk: Автоматичне приєднання під час виконання скриптів, які не знаходяться в папці node_modules

# ++CODE++1aa801c17ee9a9433bacdb7ca47f8a6b0d894d6cb5477061eed38cfb179259bf
source: Automatically attach to node.js processes in debug mode
uk: Автоматично підключатися до процесів node.js у режимі налагодження

# ++CODE++06cce960225b94cee08549e774fd3c52bf1cc356b581137e921f7507f65ff10e
source: Debug Auto Attach
uk: Налагодження автоматичного підключення

# ++CODE++75081b593d15cf6e631971bc6768723f593b88b172477e40ae7d363e4829816d
source: Disabled
uk: Вимкнено

# ++CODE++4d354ae7bdede21143cdb89f8780f11bbf002951b06794e9f9933a0bba00fcb8
source: Only With Flag
uk: Тільки з прапором

# ++CODE++40e39e09179519256f8282fe9796d4073de39847d487959f9b057ee709141dd1
source: Only auto attach when the `--inspect` flag is given
uk: Автоматичне приєднання лише за наявності прапора `--inspect`

# ++CODE++3d5bf382c9965a5e7d7dce7c5b82ce3796fb57e8ebaef1d533f3fa47eec171f2
source: Re-enable auto attach
uk: Увімкнути автоматичне приєднання знову

# ++CODE++9e6ad6db21dbc4ccca3a5789b267e29fbacebb89091f6d55123a060ecd7c2cbe
source: Smart
uk: Розумний

# ++CODE++7ff9517cbfc066e9afec6aba5b07ea7cb0cc5fe6a94ade0e0d5fc04931880ba6
source: Temporarily disable auto attach in this session
uk: Тимчасово вимкнути автоматичне приєднання в цій сесії

# ++CODE++81c124d7bc74a751661437eba86673c53bc243deaca4cdd5161359f606acbe59
source: Toggle auto attach in this workspace
uk: Перемкнути автоматичне приєднання в цьому робочому просторі

# ++CODE++dd254530cad41ff6f2dfbda9f39a19fa57161e580c80e5a054a313fc30569c69
source: Toggle auto attach on this machine
uk: Перемкнути автоматичне приєднання на цьому комп'ютері

# description
source: Helper for auto-attach feature when node-debug extensions are not active.
uk: Допомога для функції автоматичного приєднання, коли розширення node-debug не активні.

# displayName
source: Node Debug Auto-attach
uk: Авто-підключення налагодження Node

source: Toggle Auto Attach
uk: Перемикати автоматичне приєднання
