Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.typescript-language-features.xlf
Languages: uk

# typescript.tsserver.log
source: Enables logging of the TS server to a file. This log can be used to diagnose TS Server issues. The log may contain file paths, source code, and other potentially sensitive information from your project.
uk: Дозволяє записувати журнал сервера TS у файл. Цей журнал можна використовувати для діагностики проблем сервера TS. Журнал може містити шляхи до файлів, вихідний код та іншу потенційно чутливу інформацію з вашого проєкту.

# configuration.tsserver.experimental.enableProjectDiagnostics
source: Enables project wide error reporting.
uk: Увімкнення звітності про помилки на рівні проекту.

# typescript.enablePromptUseWorkspaceTsdk
source: Enables prompting of users to use the TypeScript version configured in the workspace for Intellisense.
uk: Дозволяє запрошувати користувачів використовувати версію TypeScript, налаштовану в робочому просторі для Intellisense.

# typescript.tsserver.enableRegionDiagnostics
source: Enables region-based diagnostics in TypeScript. Requires using TypeScript 5.6+ in the workspace.
uk: Увімкнення діагностики на основі регіонів у TypeScript. Вимагає використання TypeScript 5.6+ у робочому просторі.

# typescript.tsserver.enableTracing
source: Enables tracing TS server performance to a directory. These trace files can be used to diagnose TS Server performance issues. The log may contain file paths, source code, and other potentially sensitive information from your project.
uk: Дозволяє трасування продуктивності сервера TS у каталог. Ці файли трасування можуть бути використані для діагностики проблем з продуктивністю сервера TS. Журнал може містити шляхи до файлів, вихідний код та іншу потенційно чутливу інформацію з вашого проєкту.

# typescript.tsserver.trace
source: Enables tracing of messages sent to the TS server. This trace can be used to diagnose TS Server issues. The trace may contain file paths, source code, and other potentially sensitive information from your project.
uk: Дозволяє трасування повідомлень, надісланих на сервер TS. Цю трасу можна використовувати для діагностики проблем сервера TS. Траса може містити шляхи до файлів, вихідний код та іншу потенційно чутливу інформацію з вашого проєкту.

# typescript.workspaceSymbols.excludeLibrarySymbols
source: Exclude symbols that come from library files in `Go to Symbol in Workspace` results. Requires using TypeScript 5.3+ in the workspace.
uk: Виключити символи, які походять з бібліотечних файлів, у результатах `Перейти до символу в робочій області`. Потрібно використовувати TypeScript 5.3+ у робочій області.

# walkthroughs.nodejsWelcome.learnMoreAboutJs.title
source: Explore More
uk: Досліджуйте більше

# typescript.findAllFileReferences
source: Find File References
uk: Знайти посилання на файл

# configuration.format
source: Formatting
uk: Форматування

# walkthroughs.nodejsWelcome.title
source: Get started with JavaScript and Node.js
uk: Почніть працювати з JavaScript та Node.js

# javascript.goToProjectConfig.title
source: Go to Project Configuration (jsconfig / tsconfig)
uk: Перейдіть до Налаштування проекту (jsconfig / tsconfig)

# typescript.goToProjectConfig.title
source: Go to Project Configuration (tsconfig)
uk: Перейдіть до Налаштування проекту (tsconfig)

# typescript.goToSourceDefinition
source: Go to Source Definition
uk: Перейти до визначення джерела

# virtualWorkspaces
source: In virtual workspaces, resolving and finding references across files is not supported.
uk: У віртуальних робочих просторах вирішення та знаходження посилань між файлами не підтримується.

# typescript.preferences.preferTypeOnlyAutoImports
source: Include the `type` keyword in auto-imports whenever possible. Requires using TypeScript 5.3+ in the workspace.
uk: Включайте ключове слово `type` в автоматичні імпорти, коли це можливо. Потребує використання TypeScript 5.3+ в робочому просторі.

# format.indentSwitchCase
source: Indent case clauses in switch statements. Requires using TypeScript 5.1+ in the workspace.
uk: Відступайте випадки в switch-операторах. Потрібно використовувати TypeScript 5.1+ у робочому просторі.

# typescript.preferences.quoteStyle.auto
source: Infer quote type from existing code
uk: Визначити тип цитати з існуючого коду

# configuration.inlayHints
source: Inlay Hints
uk: Вставні підказки

# typescript.preferences.jsxAttributeCompletionStyle.braces
source: Insert `={}` after attribute names.
uk: Вставте `={}` після назв атрибутів.

# javascript.preferences.jsxAttributeCompletionStyle.auto
source: Insert `={}` or `=""` after attribute names based on the prop type. See `#javascript.preferences.quoteStyle#` to control the type of quotes used for string attributes.
uk: Вставте `={}` або `=""` після імен атрибутів в залежності від типу пропа. Дивіться `#javascript.preferences.quoteStyle#`, щоб контролювати тип лапок, що використовуються для строкових атрибутів.

# typescript.preferences.jsxAttributeCompletionStyle.auto
source: Insert `={}` or `=""` after attribute names based on the prop type. See `#typescript.preferences.quoteStyle#` to control the type of quotes used for string attributes.
uk: Вставте `={}` або `=""` після імен атрибутів залежно від типу пропа. Дивіться `#typescript.preferences.quoteStyle#`, щоб контролювати тип лапок, що використовуються для строкових атрибутів.

# format.semicolons.insert
source: Insert semicolons at statement ends.
uk: Вставте крапки з комами в кінці операторів.

# walkthroughs.nodejsWelcome.downloadNode.forLinux.title
source: Install Node.js
uk: Встановити Node.js

# walkthroughs.nodejsWelcome.downloadNode.forMacOrWindows.title
source: Install Node.js
uk: Встановіть Node.js

# walkthroughs.nodejsWelcome.learnMoreAboutJs.altText
source: Learn more about JavaScript and Node.js in Visual Studio Code.
uk: Дізнайтеся більше про JavaScript та Node.js у Visual Studio Code.

# walkthroughs.nodejsWelcome.makeJsFile.description
source: Let's write our first JavaScript file. We'll have to create a new file and save it with the ``.js`` extension at the end of the file name. [Create a JavaScript File](command:javascript-walkthrough.commands.createJsFile)
uk: Давайте напишемо наш перший файл JavaScript. Нам потрібно створити новий файл і зберегти його з розширенням ``.js`` в кінці назви файлу. [Створити файл JavaScript](command:javascript-walkthrough.commands.createJsFile)

# typescript.preferences.organizeImports.caseFirst.lower
source: Lower-case comes before upper-case. E.g.` a, A, z, Z`.
uk: Малі літери йдуть перед великими. Наприклад: `a, A, z, Z`.

# walkthroughs.nodejsWelcome.description
source: Make the most of Visual Studio Code's first-class JavaScript experience.
uk: Скористайтеся перевагами першокласного досвіду JavaScript у Visual Studio Code.

# configuration.preferGoToSourceDefinition
source: Makes `Go to Definition` avoid type declaration files when possible by triggering `Go to Source Definition` instead. This allows `Go to Source Definition` to be triggered with the mouse gesture.
uk: Змушує `Перейти до визначення` уникати файлів оголошення типів, коли це можливо, активуючи `Перейти до визначення джерела` замість цього. Це дозволяє активувати `Перейти до визначення джерела` за допомогою жесту миші.

# typescript.preferences.organizeImports.typeOrder.inline
source: Named imports are sorted by name only. E.g. `import { type A, B, type Y, Z } from 'module';`
uk: Іменовані імпорти сортуються лише за назвою. Наприклад, `import { type A, B, type Y, Z } from 'module';`

# typescript.updateImportsOnFileMove.enabled.never
source: Never rename paths and don't prompt.
uk: Ніколи не перейменовуйте шляхи і не запитуйте.

# typescript.preferences.includePackageJsonAutoImports.off
source: Never search dependencies.
uk: Ніколи не шукайте залежності.

# walkthroughs.nodejsWelcome.downloadNode.forMacOrWindows.description
source: Node.js is an easy way to run JavaScript code. You can use it to quickly build command-line apps and servers. It also comes with npm, a package manager which makes reusing and sharing JavaScript code easy. [Install Node.js](https://nodejs.org/en/download/)
uk: Node.js - це простий спосіб виконувати код JavaScript. Ви можете використовувати його для швидкого створення командних додатків та серверів. Він також постачається з npm, менеджером пакетів, який спрощує повторне використання та обмін кодом JavaScript. [Встановити Node.js](https://nodejs.org/en/download/)

# walkthroughs.nodejsWelcome.downloadNode.forLinux.description
source: Node.js is an easy way to run JavaScript code. You can use it to quickly build command-line apps and servers. It also comes with npm, a package manager which makes reusing and sharing JavaScript code easy. [Install Node.js](https://nodejs.org/en/download/package-manager/)
uk: Node.js - це простий спосіб виконання коду JavaScript. Ви можете використовувати його для швидкого створення командних додатків та серверів. Він також постачається з npm, менеджером пакетів, який спрощує повторне використання та обмін кодом JavaScript. [Встановити Node.js](https://nodejs.org/en/download/package-manager/)

# walkthroughs.nodejsWelcome.debugJsFile.description
source: Once you've installed Node.js, you can run JavaScript programs at a terminal by entering ``node your-file-name.js`` Another easy way to run Node.js programs is by using VS Code's debugger which lets you run your code, pause at different points, and help you understand what's going on step-by-step. [Start Debugging](command:javascript-walkthrough.commands.debugJsFile)
uk: Після встановлення Node.js ви можете запускати програми JavaScript у терміналі, ввівши ``node your-file-name.js`` Ще один простий спосіб запуску програм Node.js - це використання налагоджувача VS Code, який дозволяє вам виконувати код, ставити на паузу в різних точках і допомагає зрозуміти, що відбувається крок за кроком. [Почати налагодження](command:javascript-walkthrough.commands.debugJsFile)

# typescript.tsc.autoDetect.watch
source: Only create compile and watch tasks.
uk: Створюйте лише завдання компіляції та спостереження.

# typescript.tsc.autoDetect.build
source: Only create single run compile tasks.
uk: Створюйте лише завдання компіляції для одноразового виконання.

# typescript.preferences.jsxAttributeCompletionStyle.none
source: Only insert attribute names.
uk: Вставляйте лише імена атрибутів.

# typescript.workspaceSymbols.scope.currentProject
source: Only search for symbols in the current JavaScript or TypeScript project.
uk: Шукати символи лише в поточному проекті JavaScript або TypeScript.

# typescript.openTsServerLog.title
source: Open TS Server log
uk: Відкрити журнал сервера TS

# configuration.tsserver.watchOptions.watchDirectory.fixedChunkSizePolling
source: Polls directories in chunks at regular interval.
uk: Опитування каталогів частинами через регулярні інтервали.

# configuration.tsserver.watchOptions.watchFile.fixedChunkSizePolling
source: Polls files in chunks at regular interval.
uk: Опитування файлів частинами через регулярні інтервали.

# configuration.preferences
source: Preferences
uk: Налаштування

# typescript.preferences.importModuleSpecifierEnding
source: Preferred path ending for auto imports.
uk: Улюблений шлях завершення для автоматичних імпортів.

# typescript.preferences.importModuleSpecifier
source: Preferred path style for auto imports.
uk: Переважний стиль шляху для автоматичних імпортів.

# typescript.preferences.quoteStyle
source: Preferred quote style to use for Quick Fixes.
uk: Переважний стиль цитування для використання в Quick Fixes.

# typescript.preferences.jsxAttributeCompletionStyle
source: Preferred style for JSX attribute completions.
uk: Бажаний стиль для завершень атрибутів JSX.

# typescript.preferences.importModuleSpecifier.nonRelative
source: Prefers a non-relative import based on the `baseUrl` or `paths` configured in your `jsconfig.json` / `tsconfig.json`.
uk: Віддає перевагу імпорту без відносин на основі `baseUrl` або `paths`, налаштованих у вашому `jsconfig.json` / `tsconfig.json`.

# typescript.preferences.importModuleSpecifier.shortest
source: Prefers a non-relative import only if one is available that has fewer path segments than a relative import.
uk: Вибирає імпорт без відносин лише в тому випадку, якщо доступний імпорт, який має менше сегментів шляху, ніж відносний імпорт.

# typescript.preferences.importModuleSpecifier.projectRelative
source: Prefers a non-relative import only if the relative import path would leave the package or project directory.
uk: Вибирає імпорт без відносин лише в тому випадку, якщо шлях відносного імпорту залишить директорію пакету або проекту.

# typescript.preferences.importModuleSpecifier.relative
source: Prefers a relative path to the imported file location.
uk: Віддає перевагу відносному шляху до місця розташування імпортованого файлу.

# typescript.updateImportsOnFileMove.enabled.prompt
source: Prompt on each rename.
uk: Запит на кожне перейменування.

# description
source: Provides rich language support for JavaScript and TypeScript.
uk: Надає багатий мовний супровід для JavaScript та TypeScript.

# reloadProjects.title
source: Reload Project
uk: Перезавантажити проект

# typescript.removeUnusedImports
source: Remove Unused Imports
uk: Видалити невикористані імпорти

# format.semicolons.remove
source: Remove unnecessary semicolons.
uk: Видаліть непотрібні крапки з комою.

# typescript.reportStyleChecksAsWarnings
source: Report style checks as warnings.
uk: Повідомляти про перевірки стилю як попередження.

# typescript.preferences.organizeImports.caseFirst
source: Requires `organizeImports.unicodeCollation: 'unicode'`, and `organizeImports.caseSensitivity` is not `caseInsensitive`. Indicates whether upper-case will sort before lower-case.
uk: Вимагає `organizeImports.unicodeCollation: 'unicode'`, і `organizeImports.caseSensitivity` не є `caseInsensitive`. Вказує, чи буде великі літери сортуватися перед малими.

# typescript.preferences.organizeImports.accentCollation
source: Requires `organizeImports.unicodeCollation: 'unicode'`. Compare characters with diacritical marks as unequal to base character.
uk: Вимагає `organizeImports.unicodeCollation: 'unicode'`. Порівнюйте символи з діакритичними знаками як нерівні базовому символу.

# typescript.preferences.organizeImports.locale
source: Requires `organizeImports.unicodeCollation: 'unicode'`. Overrides the locale used for collation. Specify `auto` to use the UI locale.
uk: Вимагає `organizeImports.unicodeCollation: 'unicode'`. Перезаписує локаль, що використовується для колації. Вкажіть `auto`, щоб використовувати локаль інтерфейсу.

# typescript.preferences.organizeImports.numericCollation
source: Requires `organizeImports.unicodeCollation: 'unicode'`. Sort numeric strings by integer value.
uk: Вимагає `organizeImports.unicodeCollation: 'unicode'`. Сортуйте числові рядки за значенням цілих чисел.

# typescript.restartTsServer
source: Restart TS Server
uk: Перезапустити TS сервер

# configuration.tsserver.nodePath
source: Run TS Server on a custom Node installation. This can be a path to a Node executable, or 'node' if you want VS Code to detect a Node installation.
uk: Запустіть TS Server на власній установці Node. Це може бути шлях до виконуваного файлу Node, або 'node', якщо ви хочете, щоб VS Code виявив установку Node.

# walkthroughs.nodejsWelcome.debugJsFile.title
source: Run and Debug your JavaScript
uk: Запустіть та налагодьте ваш JavaScript

# typescript.workspaceSymbols.scope.allOpenProjects
source: Search all open JavaScript or TypeScript projects for symbols.
uk: Шукайте всі відкриті проекти JavaScript або TypeScript за символами.

# typescript.preferences.includePackageJsonAutoImports.auto
source: Search dependencies based on estimated performance impact.
uk: Шукати залежності на основі оціненого впливу на продуктивність.

# typescript.selectTypeScriptVersion.title
source: Select TypeScript Version...
uk: Виберіть версію TypeScript...

# configuration.implicitProjectConfig.target
source: Set target JavaScript language version for emitted JavaScript and include library declarations. See more: https://www.typescriptlang.org/tsconfig#target.
uk: Встановіть цільову версію мови JavaScript для згенерованого JavaScript та включіть оголошення бібліотек. Дивіться більше: https://www.typescriptlang.org/tsconfig#target.

# typescript.locale
source: Sets the locale used to report JavaScript and TypeScript errors. Defaults to use VS Code's locale.
uk: Встановлює локаль, що використовується для звітування про помилки JavaScript та TypeScript. За замовчуванням використовується локаль VS Code.

# configuration.implicitProjectConfig.module
source: Sets the module system for the program. See more: https://www.typescriptlang.org/tsconfig#module.
uk: Встановлює систему модулів для програми. Дивіться більше: https://www.typescriptlang.org/tsconfig#module.

# typescript.preferences.importModuleSpecifierEnding.index
source: Shorten `./component/index.js` to `./component/index`.
uk: Скоротіть `./component/index.js` до `./component/index`.

# typescript.preferences.importModuleSpecifierEnding.minimal
source: Shorten `./component/index.js` to `./component`.
uk: Скоротіть `./component/index.js` до `./component`.

# typescript.sortImports
source: Sort Imports
uk: Сортувати імпорти

# typescript.preferences.organizeImports.caseSensitivity.insensitive
source: Sort imports case-insensitively.
uk: Сортувати імпорти без урахування регістру.

# typescript.preferences.organizeImports.caseSensitivity.sensitive
source: Sort imports case-sensitively.
uk: Сортувати імпорти з урахуванням регістру.

# typescript.preferences.organizeImports.unicodeCollation.unicode
source: Sort imports using the Unicode code collation.
uk: Сортувати імпорти, використовуючи колацію коду Unicode.

# typescript.preferences.organizeImports.unicodeCollation.ordinal
source: Sort imports using the numeric value of each code point.
uk: Сортуйте імпорти, використовуючи числове значення кожної кодової точки.

# configuration.tsserver.useSyntaxServer.auto
source: Spawn both a full server and a lighter weight server dedicated to syntax operations. The syntax server is used to speed up syntax operations and provide IntelliSense while projects are loading.
uk: Створіть як повний сервер, так і легший сервер, призначений для синтаксичних операцій. Синтаксичний сервер використовується для прискорення синтаксичних операцій і надання IntelliSense під час завантаження проектів.

# typescript.preferences.organizeImports.caseSensitivity
source: Specifies how imports should be sorted with regards to case-sensitivity. If `auto` or unspecified, we will detect the case-sensitivity per file
uk: Вказує, як імпорти повинні бути відсортовані з урахуванням чутливості до регістру. Якщо `auto` або не вказано, ми виявимо чутливість до регістру для кожного файлу.

# typescript.tsdk.desc
source: Specifies the folder path to the tsserver and `lib*.d.ts` files under a TypeScript install to use for IntelliSense, for example: `./node_modules/typescript/lib`. - When specified as a user setting, the TypeScript version from `typescript.tsdk` automatically replaces the built-in TypeScript version. - When specified as a workspace setting, `typescript.tsdk` allows you to switch to use that workspace version of TypeScript for IntelliSense with the `TypeScript: Select TypeScript version` command. See the [TypeScript documentation](https://code.visualstudio.com/docs/typescript/typescript-compiling#_using-newer-typescript-versions) for more detail about managing TypeScript versions.
uk: Вказує шлях до папки з tsserver та файлами `lib*.d.ts` під час встановлення TypeScript, які використовуються для IntelliSense, наприклад: `./node_modules/typescript/lib`. - Коли вказано як налаштування користувача, версія TypeScript з `typescript.tsdk` автоматично замінює вбудовану версію TypeScript. - Коли вказано як налаштування робочого простору, `typescript.tsdk` дозволяє переключитися на використання цієї версії TypeScript для IntelliSense за допомогою команди `TypeScript: Select TypeScript version`. Дивіться [документацію TypeScript](https://code.visualstudio.com/docs/typescript/typescript-compiling#_using-newer-typescript-versions) для отримання додаткової інформації про управління версіями TypeScript.

# typescript.npm
source: Specifies the path to the npm executable used for [Automatic Type Acquisition](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition).
uk: Вказує шлях до виконуваного файлу npm, який використовується для [Автоматичного отримання типів](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition).

# typescript.preferences.autoImportFileExcludePatterns
source: Specify glob patterns of files to exclude from auto imports. Relative paths are resolved relative to the workspace root. Patterns are evaluated using tsconfig.json [`exclude`](https://www.typescriptlang.org/tsconfig#exclude) semantics.
uk: Вкажіть шаблони файлів для виключення з автоматичних імпортів. Відносні шляхи розв'язуються відносно кореня робочого простору. Шаблони оцінюються за семантикою tsconfig.json [`exclude`](https://www.typescriptlang.org/tsconfig#exclude).

# typescript.preferences.organizeImports.typeOrder
source: Specify how type-only named imports should be sorted.
uk: Вкажіть, як слід сортувати імпорти з іменами тільки типів.

# typescript.preferences.autoImportSpecifierExcludeRegexes
source: Specify regular expressions to exclude auto imports with matching import specifiers. Examples: - `^node:` - `lib/internal` (slashes don't need to be escaped...) - `/lib\/internal/i` (...unless including surrounding slashes for `i` or `u` flags) - `^lodash$` (only allow subpath imports from lodash)
uk: Вкажіть регулярні вирази для виключення автоматичних імпортів з відповідними специфікаторами імпорту. Приклади: - `^node:` - `lib/internal` (косі риски не потрібно екранувати...) - `/lib\/internal/i` (...якщо не включати навколишні косі риски для прапорців `i` або `u`) - `^lodash$` (дозволити лише імпорти з підшляхів з lodash)

# typescript.preferences.organizeImports.unicodeCollation
source: Specify whether to sort imports using Unicode or Ordinal collation.
uk: Вкажіть, чи сортувати імпорти за допомогою колації Unicode або Ordinal.

# configuration.tsserver.watchOptions.watchDirectory
source: Strategy for how entire directory trees are watched under systems that lack recursive file-watching functionality.
uk: Стратегія для того, як спостерігати за цілими деревами каталогів у системах, які не мають функціональності рекурсивного спостереження за файлами.

# configuration.tsserver.watchOptions.watchFile
source: Strategy for how individual files are watched.
uk: Стратегія щодо того, як спостерігаються окремі файли.

# configuration.suggest
source: Suggestions
uk: Пропозиції

# configuration.inlayHints.parameterNames.suppressWhenArgumentMatchesName
source: Suppress parameter name hints on arguments whose text is identical to the parameter name.
uk: Приховати підказки імен параметрів для аргументів, текст яких ідентичний імені параметра.

# configuration.inlayHints.variableTypes.suppressWhenTypeMatchesName
source: Suppress type hints on variables whose name is identical to the type name.
uk: Приховати підказки типів для змінних, ім'я яких ідентичне імені типу.
