Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.html-language-features.xlf
Languages: uk

# ++CODE++a16eb2a3a20e8e4378ba701de7bd9002ddbdfd350e54ccd99f074d8ae82fc46b
source: Returns the separator of a list.
uk: Повертає роздільник списку.

# ++CODE++f32b295151d7a6d93a975cd0bc3f0ad81e64871d325bfa346f7a15a2532445e5
source: Returns the simple selectors that comprise a compound selector.
uk: Повертає прості селектори, які складають складений селектор.

# ++CODE++3a5c716e4ec6bf8e41e1cadc8e725cf55e1381d5bba81ad164372074ae09ccf7
source: Returns the string representation of a value as it would be represented in Sass.
uk: Повертає рядкове представлення значення так, як воно було б представлене в Sass.

# ++CODE++f339a6f560f81613df1385edf716aa7afcc37b4fd3b535308eaadc975983cf6b
source: Returns the type of a value.
uk: Повертає тип значення.

# ++CODE++011136c796e75c5e694ead813de63625e8ba31af82c46567aa1a9787f47fde33
source: Returns the unit(s) associated with a number.
uk: Повертає одиницю(і), пов'язані з числом.

# ++CODE++905aab18ee6b55218f1c0df5bc38153eb6b634e6c9fdb2dd162418ad542eae2a
source: Returns the value in a map associated with a given key.
uk: Повертає значення в мапі, асоційоване з заданим ключем.

# ++CODE++4e45cfe82cb8bca46a7af20ce7fa967858d29deddca554e55981341ea5091f97
source: Returns whether $super matches all the elements $sub does, and possibly more.
uk: Повертає, чи $super відповідає всім елементам, які є у $sub, і, можливо, більше.

# ++CODE++c9f306ba021f7ed55db82964845070a64d5127eb0fc7ce3db4f143c8570b839d
source: Returns whether a feature exists in the current Sass runtime.
uk: Повертає, чи існує функція в поточному середовищі виконання Sass.

# ++CODE++3a267306e8519a1b9819030f85f2a04a2f4ad848bfcb10fe00ef308d46fa4834
source: Returns whether a function with the given name exists.
uk: Повертає, чи існує функція з вказаним ім'ям.

# ++CODE++ce384fd26ab7cdcb3f62c77839d4964ed93191e04c4ee2f8c8cd6db1280b47ad
source: Returns whether a map has a value associated with a given key.
uk: Повертає, чи має мапа значення, пов'язане з заданим ключем.

# ++CODE++93f98bf431ee1e6f068e334b95ca9bca64bbc96a436f1ac95bbb26c23072f86d
source: Returns whether a mixin with the given name exists.
uk: Повертає, чи існує міксин з вказаним ім'ям.

# ++CODE++e5d23f54f9a55eb712448e788b30d02ea8fd9b0433ce71e9032d9e2744260ed3
source: Returns whether a number has units.
uk: Повертає, чи має число одиниці.

# ++CODE++5ebc26ad508d92f5f225894274dacc2868a204365ebfd79fab32c80c29be4b5f
source: Returns whether a variable with the given name exists in the current scope.
uk: Повертає, чи існує змінна з вказаним ім'ям у поточній області видимості.

# ++CODE++64446f8347017d66d0eb525309455978539ff41d47263f88006731d4e31c73c5
source: Returns whether a variable with the given name exists in the global scope.
uk: Повертає, чи існує змінна з вказаним ім'ям у глобальній області видимості.

# ++CODE++13536af6298fd23c204ce4b1355c2dd9cb34e9402ceb8c131b2b7a5d1bc7ee1d
source: Returns whether two numbers can be added, subtracted, or compared.
uk: Повертає, чи можуть два числа бути додані, відняті або порівняні.

# ++CODE++5a3c214f10677e223e2a36bc899f7850d9d0f4bab01cc6bf6fc85ef25763ffa9
source: Rounds a number down to the previous whole number.
uk: Округлює число вниз до попереднього цілого числа.

# ++CODE++327ebd244c4b23041f246ba0627652790ab039b216eabd0ad23c8e112e9a7b23
source: Rounds a number to the nearest whole number.
uk: Округлює число до найближчого цілого числа.

# ++CODE++42b98f7721d29de7e1fb03058d1085131e9e44042b3a79ec52e050a5934d4b14
source: Rounds a number up to the next whole number.
uk: Округлює число до наступного цілого числа.

# ++CODE++008296b5d58a6f5132ccc07752e61fa74ce3034e9427542cd825c50a352481f0
source: Sass documentation
uk: Документація Sass

# ++CODE++33e6e7555a73633d89ecc0d89436a1bfef4e90c38b89749b74354885875cf7f7
source: Selector Specificity
uk: Специфічність селектора

# ++CODE++f1377b7425d78681cf2f92dd4da2b5d473f94f13cbdbc0e8ca82ce5c1bc6519b
source: Selectors should not contain IDs because these rules are too tightly coupled with the HTML.
uk: Селектори не повинні містити ID, оскільки ці правила занадто тісно пов'язані з HTML.

# ++CODE++3962b79834163a000225f238dbdfcca23007503a733262a7edc3985cddc86252
source: Simple HTML5 starting point
uk: Простий стартовий шаблон HTML5

# ++CODE++d6c62036cfaa20b6d0739e6b67eefc4cf974e0bd5149dba0c6207f10d91e47e1
source: Start tag name expected.
uk: Очікується ім'я початкового тегу.

# ++CODE++6375cba9be2bfb545af053a3d2d0b12f45c82ec0169c0b9706cad36137367af9
source: Tag name must directly follow the open bracket.
uk: Ім'я тегу повинно безпосередньо слідувати за відкритою дужкою.

# ++CODE++5f80199aa891d4281836557d731df8f92d89ae9a117ea64881336502f058f2e6
source: The universal selector (*) is known to be slow
uk: Універсальний селектор (*) відомий своєю повільністю.

# ++CODE++ca4d8697d1282e7b0fd91b6707c61ae5bc5bc9769164e450f6aaea0958eb5ce9
source: Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.
uk: Викидає значення виразу як фатальну помилку з трасуванням стеку. Корисно для валідації аргументів до міксинів та функцій.

# ++CODE++b1501ff32ccda347a396407daa93a89bc3d52c1e0df38fa0081f3d0e4f95e523
source: URI expected
uk: Очікується URI

# ++CODE++6265811d95fc63cb36605d3045196f555fe2b67d1e4a3e4cd6a185d0e48095ba
source: URL encodes a string
uk: URL кодує рядок

# ++CODE++0a181159e68199a246a3b94e2135c3b9c5eaaf3f52655d66ab529ff3ad350c94
source: Unexpected character in tag.
uk: Несподіваний символ у тегу.

# ++CODE++46752c1cc350bb9fde1422a8b46a312d50e6cb26cc7525e5489d03e24b554c5b
source: Unifies two selectors to produce a selector that matches elements matched by both.
uk: Об'єднує два селектори, щоб створити селектор, який відповідає елементам, що відповідають обом.

# ++CODE++635a69943b3ccb14cb9a863b359dac9b322448618b41b0b57e243c9357f7a588
source: Unknown at-rule.
uk: Невідома ат-правило.

# ++CODE++2f52c2e39642f904d8ed4f131d62e95bae649657fbed32fad52e2a929b44951c
source: Unknown property.
uk: Невідома властивість.

# ++CODE++d1c754fc4090ca755297958b713e258d3db8cca7a91ef9a5429022365f333a1b
source: Unknown property: '{0}'
uk: Невідома властивість: '{0}'

# ++CODE++48bbbfee3b3e69910b50a6b73a09cb78b1ff91523198f515d184da098655e597
source: Unknown vendor specific property.
uk: Невідома специфічна властивість постачальника.

# ++CODE++f5c8b38cbc45da3f72a499d188e6be74cd1e64f44ee377020b0cdd5d4f9b46ed
source: VS Code now has built-in support for auto-renaming tags. Do you want to enable it?
uk: VS Code тепер має вбудовану підтримку автоматичного перейменування тегів. Ви хочете увімкнути цю функцію?

# ++CODE++03f8ff8a2bf81492989bc992c10a20f7b7c519f645e1f02826b67846831e0aaa
source: When using a vendor-specific prefix also include the standard property
uk: Коли використовуєте специфічний префікс постачальника, також включайте стандартну властивість

# ++CODE++3831f24dff1050c14be280eec259202513de58b30160967ab02cf8c636aae9ee
source: When using a vendor-specific prefix make sure to also include all other vendor-specific properties
uk: При використанні специфічного префікса постачальника, переконайтеся, що також включені всі інші специфічні властивості постачальника.

# ++CODE++c713ce0b49e48bbf97664fc5ecd16d9bb8ece2384345f31e8a4445143fe1471f
source: While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.
uk: Цикл while, який приймає вираз і повторно виводить вкладені стилі, поки вираз не оціниться як `false`.

# ++CODE++cbfcde0cd2003d2daaa02b2300827410d8362bb83958f69eb432f21b579553f8
source: [ expected
uk: [ очікувалося

# ++CODE++3a0dfe0fedc48f0784a7a0c3dac223b7f04b886b80ef9c8f6f2e267a6a04b5e2
source: ] expected
uk: ] очікувалося

# ++CODE++3b9ecab62afedbfd684e1b25ab74cced097684961a415317a20b862231913612
source: absolute value of a number
uk: модуль числа

# ++CODE++e212b52db67b19b9ad08297e8610b37cf976e6d8c06f04ea7c1c31d8a2643620
source: arccosine - inverse of cosine function
uk: аркус-косинус - обернена функція косинуса

# ++CODE++eea1eec217fe965ae551517ae4845d73f2c5dcb6815501cd6dddeda1ee5cf637
source: arcsine - inverse of sine function
uk: аркусинус - обернена функція синуса

# ++CODE++a70a3ce3d6122e2b4d4f28c96239387dd3849f4fe70a77cdbfa1d69a421cc265
source: arctangent - inverse of tangent function
uk: арктангенс - обернена функція тангенса

# ++CODE++ee6227c951ecbf2a2528f9ed88b422b94768d3b7b2a739c120f930224e5798e4
source: argument from '{0}'
uk: аргумент з '{0}'

# ++CODE++b1fdde6cd676e9514a23b770e4ae350a104f0b193b8ab2f86fab33e500620036
source: at-rule or selector expected
uk: очікується at-rule або селектор

# ++CODE++8d03c446f6f24f5d4279f9c8d9e81ad3c5b7bc34fba66297dd8c34ef7053260f
source: at-rule unknown
uk: невідома at-rule

# ++CODE++d1ab3b84281bb8ed2b9ccc033785823df19ac01ce87ba7d670a963f879dac34e
source: bind the evaluation of a ruleset to each member of a list.
uk: прив'язати оцінку набору правил до кожного члена списку.

# ++CODE++c1a61ef3659b4a1feb3c0c4e8a9877594d29b5b0a72e654cd671251a4ec952c1
source: calculates square root of a number
uk: обчислює квадратний корінь числа

# ++CODE++ff3a5ccf1571d62160068632e5bb8bdb306f52497ae749bce9535fbee82cb495
source: colon expected
uk: очікується двокрапка

# ++CODE++9a0a1af81d91828e35f99d9914f1ca410cceb1868e1d8306fce0b62d22fe2942
source: comma expected
uk: очікується кома

# ++CODE++18f538a4f2f6e32f4d533376c6f3b3921f0982daa341ebb873c03ad1e857c0c4
source: condition expected
uk: очікувана умова

# ++CODE++f1cf374965d8a9f55ec71e3d67a03e76fd02b8ee5660ab991a1de552532378d1
source: converts numbers from one type into another
uk: перетворює числа з одного типу в інший

# ++CODE++4bd9c443aee885c3b98200d8ed9b51727d45f56f4311c08b088707d4f9ce81df
source: converts to a %, e.g. 0.5 > 50%
uk: перетворює на %, наприклад 0.5 > 50%

# ++CODE++aa0206b2c5ac1df8fe805fc530d2bdb2e99285c8523044ddcc90ae75d124cf4c
source: cosine function
uk: косинусна функція

# ++CODE++a102241f2ab8535e117a81fa4b03827310da27b4e05d8ad4195c54417d423651
source: creates a #AARRGGBB
uk: створює #AARRGGBB

# ++CODE++49303d4f45043106494622ba41bce37fad409b672240aea499a264ffc52073db
source: creates a color
uk: створює колір

# ++CODE++0af957c5c8a83cacbef1e9deed23087907c1bfcfa5baf934e4927651249e7674
source: dot expected
uk: очікувана крапка

# ++CODE++6b0b9c0e17e0316f070ffac88d27c7b306315d3856ba642a12acc4c51c8453e7
source: escape string content
uk: втекти вміст рядка

# ++CODE++5c83a460e39148d5a2064c18bad77bcf915c70355133bef9681fdd17eea42fde
source: expression expected
uk: очікується вираз

# ++CODE++504ea916616218fc8ca43982993217f108ef678a322f4124beacbb97a2f6a9d2
source: first argument modulus second argument
uk: перший аргумент модуль другого аргументу

# ++CODE++59b72cf9309263f1098f06363675e6d15c32e2c6b4c03913fb9d0b6d2783442b
source: first argument raised to the power of the second argument
uk: перший аргумент піднятий до степеня другого аргументу

# ++CODE++2d9f7493260cad04b812a13d3fb2d7bb70bd5729e4f5522fc905f693f90ee164
source: generate a list spanning a range of values
uk: згенерувати список, що охоплює діапазон значень

# ++CODE++2449a52576bd2e612ded63070d11b9ee46a58cf3cabbbd016c0b683849638d1e
source: identifier expected
uk: очікується ідентифікатор

# ++CODE++83e7f34ff87352333cb40fa59beeea01bb5cd97a9ce9dc51a8f6c99352af847c
source: identifier or variable expected
uk: очікується ідентифікатор або змінна

# ++CODE++d72f8c92977a5bdd88da506a042190dadba3cef4ee9e19826e4308207f09f898
source: identifier or wildcard expected
uk: очікується ідентифікатор або підстановочний знак

# ++CODE++4817b70063f4742c67f6addd2c649e3d1bc6ff8e375029164d79571a90e56845
source: inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'
uk: inline-block ігнорується через float. Якщо 'float' має значення, відмінне від 'none', то блок плаває, а 'display' розглядається як 'block'

# ++CODE++4459f66f65a9bebd5a762c19e49996b2757737fb89268b18e53be19da518ed4b
source: inlines a resource and falls back to `url()`
uk: включає ресурс і переходить до `url()`

# ++CODE++a30741fe2a78c96de336129a3c6bf160b40c01970a2595a5bb87a807eadfff6f
source: media query expected
uk: очікується медіа-запит

# ++CODE++147258e8120d9c6634b776613bd634fd709ec2a4b5a387e35329db1106e814a7
source: number expected
uk: очікується число

# ++CODE++1dae8b64e7e4b732b12f75f3ac2a5fd177a53ebee3adeb47b1bce92b276b1c2f
source: operator expected
uk: очікується оператор

# ++CODE++73d61aa855b02ee358f8cb28d76f000a7f10dbfbef04d47ad58ee43ef84a2905
source: page directive or declaraton expected
uk: очікується директива або декларація сторінки

# ++CODE++e644a5a62b856252ffd3217f45f1da67f7fa4753719009260965ce4b973094c9
source: parses a string to a color
uk: аналізує рядок на колір

# ++CODE++d24fa63e03cb6384d056e8f2da7038cb8ceec768e2ec0f07901040b7879651d1
source: percentage expected
uk: очікуваний відсоток

# ++CODE++905ad8f8e29f2abba5edcec4a991e889cf0352131dfbdd036798542f32667daf
source: property value expected
uk: очікувана вартість власності

# ++CODE++3665faddbdbbd8ac83585348437a6f8fd6add9ab3cf2802d96127de98fda31d7
source: remove or change the unit of a dimension
uk: видалити або змінити одиницю виміру

# ++CODE++f6a683aca13bdae5498f4bd8f9bdd0e8834f58c0c6fa9a61b91d3f7cc8bbf53d
source: return `@color` 10% points darker
uk: повернути `@color` на 10% темнішим

# ++CODE++1d9b76273b3a1e30cd993f1ffa4aec4d109cf27297d427e52e3c628a620ad3d8
source: return `@color` 10% points less saturated
uk: повернути `@color` на 10% менш насиченим

# ++CODE++796b284acb7a08903593c544077bd3b470b9db74140e24cd3fd8094bb68518f3
source: return `@color` 10% points less transparent
uk: повернути `@color` на 10% менш прозорим

# ++CODE++3d55153a68dbb9288f7888b3118ba0fb67e7e344689ba6e99b64b758447d75cb
source: return `@color` 10% points lighter
uk: повернути `@color` на 10% світліше

# ++CODE++a34c7bfd025079831f628085ad913f99c9be4d036342fbd761ddd629dd0013b4
source: return `@color` 10% points more saturated
uk: повернути `@color` на 10% більш насиченим

# ++CODE++99b59101f36e02974622a37f8d2a93ceb9d9f907ffadf617f0186be611468fc3
source: return `@color` 10% points more transparent
uk: повернути `@color` на 10% більш прозорим

# ++CODE++8f05a0f1ff0afbc6aaa7e6e12cb4fbbecf6b463a640761ed1fe4945a265007b3
source: return `@color` with 50% transparency
uk: повернути `@color` з 50% прозорістю

# ++CODE++a6892aaa0733a7b3354464402ec9ee42e25e775888a27afb93699cdd3e2ffe59
source: return `@color` with a 10 degree larger in hue
uk: повернути `@color` з відтінком на 10 градусів більшим

# ++CODE++d82b15b09bc5207e8cdde53030a3975d59bb0163b865d4f2e5afbcdcb1a5400d
source: return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes
uk: повернути `@darkcolor`, якщо `@color1 > 43% яскравість`, інакше повернути `@lightcolor`, див. примітки

# ++CODE++b322bb035d1e9abc254e32b23bb28252e4eca8a828c0bee24102b54d126a6278
source: return a mix of `@color1` and `@color2`
uk: повернути суміш `@color1` та `@color2`

# ++CODE++40551a9b32da2efd2dfa6bdc1f39c0217fbb0a1a4c3959847a91eae12949562b
source: returns a grey, 100% desaturated color
uk: повертає сірий, 100% десатурований колір

# ++CODE++5556edb8ff6d8607b81235473f7633bbd80f27ef5b9420d1df5db4c8dacd9bea
source: returns a value at the specified position in the list
uk: повертає значення за вказаною позицією у списку

# ++CODE++2c08381dd83386e975af4c6f6ee3f3ad53182941c13d8482de800b8968168a3d
source: returns one of two values depending on a condition.
uk: повертає одне з двох значень в залежності від умови.

# ++CODE++200c581bc77f037719b7c6e464f7a8316d62cfea80cb24e159dcab36c0d3c95c
source: returns pi
uk: повертає пі

# ++CODE++c852230ae6e2af56761f949624d1ef36651cc239075842a2db337fd848a7a57c
source: returns the `alpha` channel of `@color`
uk: повертає канал `alpha` з `@color`

# ++CODE++5f280f97f0beae1535a5ed0f971f62e633bd1f5cc3f3a2929ec091a44a480139
source: returns the `blue` channel of `@color`
uk: повертає канал `blue` з `@color`

# ++CODE++8e8f80b9f244341ffe544746163bc2f7e568a0a874c879b5d281a90ba51ec274
source: returns the `green` channel of `@color`
uk: повертає `зелений` канал `@color`

# ++CODE++247e90f7fc3c4e17c13fe1b2ce547c860dfd4920622854e0747af1431f137c9b
source: returns the `hue` channel of `@color` in the HSL space
uk: повертає канал `hue` з `@color` у просторі HSL

# ++CODE++fd605258af682a362449da83b306165a15aff3a8dde2794f1fb2a65e079afe3e
source: returns the `hue` channel of `@color` in the HSV space
uk: повертає канал `hue` кольору `@color` в просторі HSV

# ++CODE++aa1eb0b0a20d27bb9d3c89d57ab6f7e581d9ee235fb0a9a980beb49f11cd3d40
source: returns the `lightness` channel of `@color` in the HSL space
uk: повертає канал `lightness` з `@color` у HSL-просторі

# ++CODE++06b8e7cc6fbe89df3c063ad70694dd147f63e910fa0d80599666a2a8b184012e
source: returns the `luma` value (perceptual brightness) of `@color`
uk: повертає значення `luma` (перцептивна яскравість) для `@color`

# ++CODE++7b59cddf81ab27f896fd3df6b7814c3fd3cf11b9fc9453862c6efddfce826fc3
source: returns the `red` channel of `@color`
uk: повертає канал `red` з `@color`

# ++CODE++efb9ac72071415640c35be7822d15cafdd6e7a46e9f7fa134cec6c366cf33ec4
source: returns the `saturation` channel of `@color` in the HSL space
uk: повертає канал `saturation` з `@color` у просторі HSL

# ++CODE++c47edc280240379bc3a51dcf19e67e1071cfc2c311fa7f3aa387601104520a4f
source: returns the `saturation` channel of `@color` in the HSV space
uk: повертає канал `saturation` кольору `@color` у просторі HSV

# ++CODE++ea162fd244bfaa6df6f4a8144566554a0ed521522295ee132a9b0617f03d1ae8
source: returns the `value` channel of `@color` in the HSV space
uk: повертає канал `value` кольору `@color` в просторі HSV

# ++CODE++c9e094bbfe585f3cfa359820af37fd7f28782e36bc296c739dcb4d9498b701bb
source: returns the lowest of one or more values
uk: повертає найменше з одного або кількох значень

# ++CODE++e28c8741cd789dee6b70b4e8db1710ec3ee8596c57f4973ef053a082c2f6a85f
source: returns the number of elements in a value list
uk: повертає кількість елементів у списку значень

# ++CODE++111a07211ea41886cdd61bef2609409dbd9bc8fa6f9cf3532ae554a14c0df174
source: rounds a number to a number of places
uk: округлює число до певної кількості знаків

# ++CODE++cf3e7001e631995a67aea444e9dfd9b7354f8d05add2ac1e600a6493f5e7606a
source: rounds down to an integer
uk: округлює до цілого числа

# ++CODE++d4c0187853b10c9a51e765584fa26be5fee0a70a33311ca7c6098bf83e62e83d
source: rounds up to an integer
uk: округлює до цілого числа

# ++CODE++587841d00938cba8d3cc88166d4a9fbe252379815da99b3b731beadfa39aacc2
source: selector expected
uk: очікується селектор

# ++CODE++9f88ddbe44aa7911c379c38f3b64f903606847fd9a33c7ebdcc53e26b60fe2ca
source: semi-colon expected
uk: очікується крапка з комою

# ++CODE++5a2c62a6f802cb0ac6138b6549ab7cd7e381e47909ec49ed7fc34a533ae04957
source: sine function
uk: синусна функція

# ++CODE++207576e9f2b329c53f66dc5ea13cbe79e0195c67381e95ba92511b3725d58fa8
source: string literal expected
uk: очікується рядковий літерал

# ++CODE++274186a402bb94c6e69f86f3ce377f15f77cc1080c850427c854f149a70f0b0b
source: string replace
uk: заміна рядка

# ++CODE++0b7b7dd99b49258c2fce902d03b46946025b4b0b2efbe833012c10863083b939
source: tangent function
uk: тангенс функція

# ++CODE++254625f2089fc0b1862ffee33d9a8690957f4c6a8824cc8a6ab666a4ce30d5a6
source: term expected
uk: очікуваний термін

# ++CODE++9254a62821b4f0b378c8a95f715d229e78a79c2ac3b07c206ee7b34c095119c9
source: unknown keyword
uk: невідоме ключове слово

# ++CODE++7370527f09e0af86bfd110d2b4d4655815a647986ca2649030783e61b45cb679
source: uri or string expected
uk: очікується uri або рядок

# ++CODE++3ee0394ee9e803fdbb5844334bc072f63c7e9cd3ab60ee31bbb88079408745b8
source: variable name expected
uk: очікується ім'я змінної

# ++CODE++dfffa504df1ee399c07395b62c55e2a6fedd133c0db2c1932208c7d444dc30d9
source: variable value expected
uk: очікується значення змінної

# ++CODE++26c134a04d3252331e7ae0a1ebcac0b47c8d000a9f0577efa5a0475dfbbea1c8
source: whitespace expected
uk: очікується пробіл

# ++CODE++a6df5ed323ec30217d08b49e7711a7313a3b61e95071e775f661b37e7c756dc9
source: wildcard expected
uk: очікується підстановочний знак

# ++CODE++427c7482a29768a300c3300b8ebc62e6794e81d215bd9286dc265e1833cf1a2f
source: { expected
uk: { очікуваний

# ++CODE++2c89d0493628a243b0b63a966959758816baf4023c3f071a49c4df40bfc92bf9
source: } expected
uk: } очікується

# html.customData.desc
source: A list of relative file paths pointing to JSON files following the [custom data format](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md). VS Code loads custom data on startup to enhance its HTML support for the custom HTML tags, attributes and attribute values you specify in the JSON files. The file paths are relative to workspace and only workspace folder settings are considered.
uk: Список відносних шляхів до файлів JSON, що відповідають [кастомному формату даних](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md). VS Code завантажує кастомні дані під час запуску, щоб покращити підтримку HTML для кастомних HTML-тегів, атрибутів та значень атрибутів, які ви вказуєте у файлах JSON. Шляхи до файлів є відносними до робочого простору, і враховуються лише налаштування папки робочого простору.

# html.completion.attributeDefaultValue.empty
source: Attribute value is not set.
uk: Значення атрибута не встановлено.

# html.completion.attributeDefaultValue.singlequotes
source: Attribute value is set to ''.
uk: Значення атрибута встановлено на ''.

# html.completion.attributeDefaultValue.doublequotes
source: Attribute value is set to "".
uk: Значення атрибута встановлено на "".

# html.completion.attributeDefaultValue
source: Controls the default value for attributes when completion is accepted.
uk: Контролює значення за замовчуванням для атрибутів, коли завершення приймається.

# html.format.preserveNewLines.desc
source: Controls whether existing line breaks before elements should be preserved. Only works before elements, not inside tags or for text.
uk: Контролює, чи слід зберігати існуючі розриви рядків перед елементами. Працює лише перед елементами, а не всередині тегів або для тексту.

# html.suggest.html5.desc
source: Controls whether the built-in HTML language support suggests HTML5 tags, properties and values.
uk: Контролює, чи вбудована підтримка HTML мови пропонує теги, властивості та значення HTML5.

# html.validate.scripts
source: Controls whether the built-in HTML language support validates embedded scripts.
uk: Контролює, чи вбудована підтримка HTML мови перевіряє вбудовані скрипти.

# html.validate.styles
source: Controls whether the built-in HTML language support validates embedded styles.
uk: Контролює, чи вбудована підтримка HTML мови перевіряє вбудовані стилі.

# html.mirrorCursorOnMatchingTagDeprecationMessage
source: Deprecated in favor of `editor.linkedEditing`
uk: Застаріло на користь `editor.linkedEditing`

# html.autoCreateQuotes
source: Enable/disable auto creation of quotes for HTML attribute assignment. The type of quotes can be configured by `#html.completion.attributeDefaultValue#`.
uk: Увімкнути/вимкнути автоматичне створення лапок для призначення HTML-атрибутів. Тип лапок можна налаштувати за допомогою `#html.completion.attributeDefaultValue#`.

# html.autoClosingTags
source: Enable/disable autoclosing of HTML tags.
uk: Увімкнути/вимкнути автоматичне закриття HTML-тегів.

# html.format.enable.desc
source: Enable/disable default HTML formatter.
uk: Увімкнути/вимкнути стандартний HTML форматор.

# html.mirrorCursorOnMatchingTag
source: Enable/disable mirroring cursor on matching HTML tag.
uk: Увімкнути/вимкнути відображення курсора на відповідному HTML-тегу.
