Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.json-language-features.xlf
Languages: uk

# ++CODE++fda8a7c585e659b6849c5da1efab67368ee333e8b6ff265d453cd1f23e9c7d6f
source: The validation outcome of the "if" subschema controls which of the "then" or "else" keywords are evaluated.
uk: Результат валідації підсхеми "if" контролює, які з ключових слів "then" або "else" оцінюються.

# ++CODE++65fbb3cf15984d95a68fa4146434cd4709e2602b07903e0049b51f795222c5ae
source: Trailing comma
uk: Зайва кома

# ++CODE++01cb6a9785390bfa4cc81e565c67ae5851ac36b0ba5a8256c9c6f0cd95a589c4
source: URI expected.
uk: Очікується URI.

# ++CODE++f9bdd6293b59d75658fd6f782d269ae046354bb65f9843b6e5fb55bf9ed5e2e1
source: URI is expected.
uk: Очікується URI.

# ++CODE++12a88fd39d7ba5010730f2b0c245bd8ae7562f2aca3349621a66c9d79e818976
source: URI with a scheme is expected.
uk: Очікується URI з схемою.

# ++CODE++712510b06ca3345dbf38880860e1afed956f3b2fb8e074bc87291b767f9e3840
source: Unable to compute used schemas: No document
uk: Неможливо обчислити використані схеми: Немає документа

# ++CODE++4f9b24d9d53626d33ba88c0528c6145a9f1d7e6ba3b8f851319975da219d191b
source: Unable to compute used schemas: {0}
uk: Неможливо обчислити використані схеми: {0}

# ++CODE++82ce4ce92815106fba93d21231f903405a8ba450bcf84e03e98f574dd0974262
source: Unable to load schema from '{0}'. No schema request service available
uk: Не вдалося завантажити схему з '{0}'. Служба запиту схеми недоступна

# ++CODE++08ecb8fc1aa575957bdf93110e937007a28dbeda35921e61b2c7eaabf021fc28
source: Unable to load schema from '{0}': No content.
uk: Неможливо завантажити схему з '{0}': Немає вмісту.

# ++CODE++bebd7eed8d6502303d2b67e7ab04f4939f01541b30dbc06db4a3100be7b66562
source: Unable to load schema from '{0}': {1}.
uk: Неможливо завантажити схему з '{0}': {1}.

# ++CODE++27cd5d7847d6839bed03bf0cfd68fdb7d7a6234c652b532bd98412877562f689
source: Unable to load {0}
uk: Неможливо завантажити {0}

# ++CODE++4869dfeee01c39bbb1137a2c403598721f7285052d3b5ff1d94ffaeee49b251b
source: Unable to parse content from '{0}': Parse error at offset {1}.
uk: Неможливо розібрати вміст з '{0}': Помилка розбору на зсуві {1}.

# ++CODE++fae7ada87514ba5b27536e4388e27798890cfd72aeb19664cd93569c21723149
source: Unable to resolve schema. Click to retry.
uk: Неможливо вирішити схему. Натисніть, щоб спробувати ще раз.

# ++CODE++e658c1f83e67de12795f23812dd4640168c2d6f5edde207094e3c0e410efd589
source: Unexpected end of comment.
uk: Несподіваний кінець коментаря.

# ++CODE++ba475d8fdd4ae27684485f2d3c77a60d416961fe56270ba2721715104db76f92
source: Unexpected end of number.
uk: Несподіваний кінець числа.

# ++CODE++c741a1602e69dab0423be52b3c4056e080616d2b1819aa940bb461e4951553be
source: Unexpected end of string.
uk: Несподіваний кінець рядка.

# ++CODE++24077add4d1ffc447ca6a5dc541e843b1332fef312a174ebcc92a1a3f2d97594
source: Value expected
uk: Очікуване значення

# ++CODE++c7aa979dce50662607319513fb86d7b495b2241f9afbd590f6b2f89cfcde2238
source: Value is above the exclusive maximum of {0}.
uk: Значення перевищує ексклюзивний максимум {0}.

# ++CODE++3ce003ce0d5e55aae3b32ca079c52c70687346e678056f50b175878162834a29
source: Value is above the maximum of {0}.
uk: Значення перевищує максимальне значення {0}.

# ++CODE++858efbe3456d529aeaca73c6329046f62084d2fc30c44b7ddd83b7992a766f9d
source: Value is below the exclusive minimum of {0}.
uk: Значення нижче ексклюзивного мінімуму {0}.

# ++CODE++6edd8a1f5efc08a6525482c039b9dba9c13df24959e7c6dc971b42d5cfefed3c
source: Value is below the minimum of {0}.
uk: Значення нижче мінімуму {0}.

# ++CODE++db2d6614788854917765cbed0e3c4457b9d0ec91cd598e6b4db355c028dd731d
source: Value is deprecated
uk: Значення застаріло

# ++CODE++3cdeb1631b3bf6c4c2db333c749ebb72e8555a997721e72552fa484048801006
source: Value is not accepted. Valid values: {0}.
uk: Значення не приймається. Дійсні значення: {0}.

# ++CODE++f45f489eb08ea259a378c1fa45ad5eb0e1858da743440327c44488f1da7e534b
source: Value is not divisible by {0}.
uk: Значення не ділиться на {0}.

# ++CODE++ea80b430a5ce785bc100db811ea438a467a6ffda2cf1db630fe0bce128216fde
source: Value must be {0}.
uk: Значення повинно бути {0}.

# ++CODE++b053c49992ab9af29d7ebd154946368a1daa104efc9e212f5b611a0819d5f8ee
source: multiple JSON schemas configured
uk: налаштовано кілька схем JSON

# ++CODE++e2200e057b54be04d70eb05072eb53c84e83a4fe8107f3f9077954005da5cc14
source: no JSON schema configured
uk: не налаштовано схему JSON

# ++CODE++a2227c9ab80ea45a163eccb0251148cccdaecc018a60dce5a4d468d12be11755
source: only {0} document symbols shown for performance reasons
uk: показано лише {0} символів документа з причин продуктивності

# ++CODE++1ac416a4e9b371a932aa53a934795006126675d8af114f798b200dce8719f609
source: {0} is a directory, not a file
uk: {0} є директорією, а не файлом

# json.schemas.url.desc
source: A URL or absolute file path to a schema. Can be a relative path (starting with './') in workspace and workspace folder settings.
uk: URL або абсолютний шлях до схеми. Може бути відносним шляхом (починаючи з './') у налаштуваннях робочого простору та папки робочого простору.

# json.schemas.fileMatch.item.desc
source: A file pattern that can contain '*' and '**' to match against when resolving JSON files to schemas. When beginning with '!', it defines an exclusion pattern.
uk: Шаблон файлу, який може містити '*' та '**' для порівняння при вирішенні JSON-файлів до схем. Коли починається з '!', він визначає шаблон виключення.

# json.schemas.fileMatch.desc
source: An array of file patterns to match against when resolving JSON files to schemas. `*` and '**' can be used as a wildcard. Exclusion patterns can also be defined and start with '!'. A file matches when there is at least one matching pattern and the last matching pattern is not an exclusion pattern.
uk: Масив шаблонів файлів для порівняння при вирішенні JSON-файлів до схем. `*` та '**' можуть використовуватися як символи підстановки. Також можна визначити шаблони виключення, які починаються з '!'. Файл відповідає, коли є принаймні один відповідний шаблон, і останній відповідний шаблон не є шаблоном виключення.

# json.schemas.desc
source: Associate schemas to JSON files in the current project.
uk: Прив'яжіть схеми до файлів JSON у поточному проекті.

# json.command.clearCache
source: Clear Schema Cache
uk: Очистити кеш схеми

# json.clickToRetry
source: Click to retry.
uk: Натисніть, щоб спробувати ще раз.

# json.validate.enable.desc
source: Enable/disable JSON validation.
uk: Увімкнути/вимкнути валідацію JSON.

# json.format.enable.desc
source: Enable/disable default JSON formatter
uk: Увімкнути/вимкнути форматувач JSON за замовчуванням

# json.colorDecorators.enable.desc
source: Enables or disables color decorators
uk: Увімкнути або вимкнути кольорові декоратори

# displayName
source: JSON Language Features
uk: Особливості мови JSON

# json.format.keepLines.desc
source: Keep all existing new lines when formatting.
uk: Зберігайте всі існуючі нові рядки під час форматування.

# description
source: Provides rich language support for JSON files.
uk: Надає розширену підтримку мов для файлів JSON.

# json.maxItemsExceededInformation.desc
source: Show notification when exceeding the maximum number of outline symbols and folding regions.
uk: Показувати сповіщення при перевищенні максимальної кількості символів контуру та регіонів згортання.

# json.command.sort
source: Sort Document
uk: Сортувати документ

# json.maxItemsComputed.desc
source: The maximum number of outline symbols and folding regions computed (limited for performance reasons).
uk: Максимальна кількість обчислених символів контуру та зон складання (обмежена з причин продуктивності).

# json.schemas.schema.desc
source: The schema definition for the given URL. The schema only needs to be provided to avoid accesses to the schema URL.
uk: Визначення схеми для вказаного URL. Схему потрібно надати лише для уникнення доступів до URL схеми.

# json.colorDecorators.enable.deprecationMessage
source: The setting `json.colorDecorators.enable` has been deprecated in favor of `editor.colorDecorators`.
uk: Налаштування `json.colorDecorators.enable` було застарілим на користь `editor.colorDecorators`.

# json.tracing.desc
source: Traces the communication between VS Code and the JSON language server.
uk: Відстежує комунікацію між VS Code та сервером мови JSON.

# json.schemaResolutionErrorMessage
source: Unable to resolve schema.
uk: Неможливо вирішити схему.

# json.enableSchemaDownload.desc
source: When enabled, JSON schemas can be fetched from http and https locations.
uk: Коли увімкнено, JSON-схеми можна отримати з http та https-локацій.
