Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.typescript-language-features.xlf
Languages: uk

# typescript.tsserver.pluginPaths
source: Additional paths to discover TypeScript Language Service plugins.
uk: Додаткові шляхи для виявлення плагінів TypeScript Language Service.

# javascript.preferences.organizeImports
source: Advanced preferences that control how imports are ordered.
uk: Розширені налаштування, які контролюють порядок імпортів.

# typescript.preferences.organizeImports
source: Advanced preferences that control how imports are ordered.
uk: Розширені налаштування, які контролюють порядок імпортів.

# typescript.preferences.includePackageJsonAutoImports.on
source: Always search dependencies.
uk: Завжди шукайте залежності.

# typescript.updateImportsOnFileMove.enabled.always
source: Always update paths automatically.
uk: Завжди автоматично оновлювати шляхи.

# typescript.preferences.quoteStyle.double
source: Always use double quotes: `"`
uk: Завжди використовуйте подвійні лапки: `"`

# typescript.preferences.quoteStyle.single
source: Always use single quotes: `'`
uk: Завжди використовуйте одинарні лапки: `'`

# configuration.tsserver.watchOptions.watchDirectory.useFsEvents
source: Attempt to use the operating system/file system's native events for directory changes.
uk: Спробуйте використовувати рідні події операційної системи/файлової системи для змін у директорії.

# configuration.tsserver.watchOptions.watchFile.useFsEvents
source: Attempt to use the operating system/file system's native events for file changes.
uk: Спроба використовувати рідні події операційної системи/файлової системи для змін файлів.

# configuration.tsserver.watchOptions.watchFile.useFsEventsOnParentDirectory
source: Attempt to use the operating system/file system's native events to listen for changes on a file's containing directories. This can use fewer file watchers, but might be less accurate.
uk: Спробуйте використовувати рідні події операційної системи/файлової системи для прослуховування змін у каталогах, що містять файл. Це може використовувати менше спостерігачів за файлами, але може бути менш точним.

# configuration.updateImportsOnPaste
source: Automatically update imports when pasting code. Requires TypeScript 5.6+.
uk: Автоматично оновлювати імпорти при вставці коду. Потрібен TypeScript 5.6+.

# configuration.tsserver.watchOptions.watchDirectory.fixedPollingInterval
source: Check every directory for changes several times a second at a fixed interval.
uk: Перевіряйте кожен каталог на зміни кілька разів на секунду з фіксованим інтервалом.

# configuration.tsserver.watchOptions.fallbackPolling.fixedPollingInterval
source: Check every file for changes several times a second at a fixed interval.
uk: Перевіряйте кожен файл на зміни кілька разів на секунду з фіксованим інтервалом.

# configuration.tsserver.watchOptions.watchFile.fixedPollingInterval
source: Check every file for changes several times a second at a fixed interval.
uk: Перевіряйте кожен файл на зміни кілька разів на секунду з фіксованим інтервалом.

# configuration.tsserver.watchOptions.fallbackPolling.priorityPollingInterval
source: Check every file for changes several times a second, but use heuristics to check certain types of files less frequently than others.
uk: Перевіряйте кожен файл на наявність змін кілька разів на секунду, але використовуйте евристики, щоб перевіряти певні типи файлів рідше, ніж інші.

# configuration.tsserver.watchOptions.watchFile.priorityPollingInterval
source: Check every file for changes several times a second, but use heuristics to check certain types of files less frequently than others.
uk: Перевіряйте кожен файл на зміни кілька разів на секунду, але використовуйте евристики, щоб перевіряти певні типи файлів рідше, ніж інші.

# typescript.check.npmIsInstalled
source: Check if npm is installed for [Automatic Type Acquisition](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition).
uk: Перевірте, чи встановлено npm для [Автоматичного отримання типів](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition).

# configuration.suggest.completeFunctionCalls
source: Complete functions with their parameter signature.
uk: Завершіть функції з їх підписом параметрів.

# configuration.tsserver.watchOptions
source: Configure which watching strategies should be used to keep track of files and directories.
uk: Налаштуйте, які стратегії спостереження слід використовувати для відстеження файлів і каталогів.

# typescript.tsc.autoDetect
source: Controls auto detection of tsc tasks.
uk: Контролює автоматичне виявлення завдань tsc.

# configuration.tsserver.useSyntaxServer
source: Controls if TypeScript launches a dedicated server to more quickly handle syntax related operations, such as computing code folding.
uk: Контролює, чи TypeScript запускає виділений сервер для швидшої обробки операцій, пов'язаних із синтаксисом, таких як обчислення складання коду.

# typescript.workspaceSymbols.scope
source: Controls which files are searched by [Go to Symbol in Workspace](https://code.visualstudio.com/docs/editor/editingevolved#_open-symbol-by-name).
uk: Контролює, які файли шукаються за допомогою [Перейти до символу в робочій області](https://code.visualstudio.com/docs/editor/editingevolved#_open-symbol-by-name).

# walkthroughs.nodejsWelcome.makeJsFile.title
source: Create a JavaScript File
uk: Створити файл JavaScript

# typescript.tsc.autoDetect.on
source: Create both build and watch tasks.
uk: Створіть як завдання для збірки, так і для спостереження.

# walkthroughs.nodejsWelcome.debugJsFile.altText
source: Debug and run your JavaScript code in Node.js with Visual Studio Code.
uk: Відлагоджуйте та запускайте свій JavaScript код у Node.js за допомогою Visual Studio Code.

# typescript.preferences.organizeImports.caseFirst.default
source: Default order given by `locale`.
uk: Замовлення за замовчуванням, задане `locale`.

# format.semicolons
source: Defines handling of optional semicolons.
uk: Визначає обробку необов'язкових крапок з комою.

# format.insertSpaceBeforeAndAfterBinaryOperators
source: Defines space handling after a binary operator.
uk: Визначає обробку пробілів після бінарного оператора.

# format.insertSpaceAfterCommaDelimiter
source: Defines space handling after a comma delimiter.
uk: Визначає обробку пробілів після роздільника коми.

# format.insertSpaceAfterSemicolonInForStatements
source: Defines space handling after a semicolon in a for statement.
uk: Визначає обробку пробілів після крапки з комою в операторі for.

# format.insertSpaceAfterFunctionKeywordForAnonymousFunctions
source: Defines space handling after function keyword for anonymous functions.
uk: Визначає обробку пробілів після ключового слова функції для анонімних функцій.

# format.insertSpaceAfterKeywordsInControlFlowStatements
source: Defines space handling after keywords in a control flow statement.
uk: Визначає обробку пробілів після ключових слів у операторі управління потоком.

# format.insertSpaceAfterOpeningAndBeforeClosingJsxExpressionBraces
source: Defines space handling after opening and before closing JSX expression braces.
uk: Визначає обробку пробілів після відкриття та перед закриттям фігурних дужок JSX-виразу.

# format.insertSpaceAfterOpeningAndBeforeClosingEmptyBraces
source: Defines space handling after opening and before closing empty braces.
uk: Визначає обробку пробілів після відкриття та перед закриттям порожніх фігурних дужок.

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBraces
source: Defines space handling after opening and before closing non-empty braces.
uk: Визначає обробку пробілів після відкриття та перед закриттям непорожніх дужок.

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBrackets
source: Defines space handling after opening and before closing non-empty brackets.
uk: Визначає обробку пробілів після відкриття та перед закриттям непорожніх дужок.

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyParenthesis
source: Defines space handling after opening and before closing non-empty parenthesis.
uk: Визначає обробку пробілів після відкриття та перед закриттям непорожніх дужок.

# format.insertSpaceAfterOpeningAndBeforeClosingTemplateStringBraces
source: Defines space handling after opening and before closing template string braces.
uk: Визначає обробку пробілів після відкриття та перед закриттям фігурних дужок шаблонного рядка.

# format.insertSpaceAfterConstructor
source: Defines space handling after the constructor keyword.
uk: Визначає обробку простору після ключового слова конструктора.

# format.insertSpaceAfterTypeAssertion
source: Defines space handling after type assertions in TypeScript.
uk: Визначає обробку простору після перевірок типів у TypeScript.

# format.insertSpaceBeforeFunctionParenthesis
source: Defines space handling before function argument parentheses.
uk: Визначає обробку пробілів перед дужками аргументів функції.

# format.placeOpenBraceOnNewLineForControlBlocks
source: Defines whether an open brace is put onto a new line for control blocks or not.
uk: Визначає, чи відкриваюча дужка ставиться на новий рядок для блоків управління, чи ні.

# format.placeOpenBraceOnNewLineForFunctions
source: Defines whether an open brace is put onto a new line for functions or not.
uk: Визначає, чи відкриваюча дужка ставиться на новий рядок для функцій, чи ні.

# typescript.preferences.organizeImports.caseSensitivity.auto
source: Detect case-sensitivity for import sorting.
uk: Визначити чутливість до регістру для сортування імпортів.

# typescript.preferences.organizeImports.typeOrder.auto
source: Detect where type-only named imports should be sorted.
uk: Визначте, де слід сортувати імпорти з іменами, що містять лише типи.

# configuration.tsserver.watchOptions.synchronousWatchDirectory
source: Disable deferred watching on directories. Deferred watching is useful when lots of file changes might occur at once (e.g. a change in node_modules from running npm install), but you might want to disable it with this flag for some less-common setups.
uk: Вимкніть відкладене спостереження за каталогами. Відкладене спостереження корисне, коли може статися багато змін файлів одночасно (наприклад, зміна в node_modules під час виконання npm install), але ви можете захотіти вимкнути його за допомогою цього прапорця для деяких менш поширених налаштувань.

# inlayHints.parameterNames.none
source: Disable parameter name hints.
uk: Вимкнути підказки імен параметрів.

# typescript.tsc.autoDetect.off
source: Disable this feature.
uk: Вимкнути цю функцію.

# typescript.useTsgo
source: Disables TypeScript and JavaScript language features to allow usage of the TypeScript Go experimental extension. Requires TypeScript Go to be installed and configured. Requires reloading extensions after changing this setting.
uk: Вимикає функції мови TypeScript та JavaScript, щоб дозволити використання експериментального розширення TypeScript Go. Потрібно встановити та налаштувати TypeScript Go. Потрібно перезавантажити розширення після зміни цього налаштування.

# typescript.disableAutomaticTypeAcquisition
source: Disables [automatic type acquisition](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition). Automatic type acquisition fetches `@types` packages from npm to improve IntelliSense for external libraries.
uk: Вимикає [автоматичне отримання типів](https://code.visualstudio.com/docs/nodejs/working-with-javascript#_typings-and-automatic-type-acquisition). Автоматичне отримання типів завантажує пакунки `@types` з npm для покращення IntelliSense для зовнішніх бібліотек.

# typescript.preferences.importModuleSpecifierEnding.js
source: Do not shorten path endings; include the `.js` or `.ts` extension.
uk: Не скорочуйте закінчення шляхів; включайте розширення `.js` або `.ts`.

# format.semicolons.ignore
source: Don't insert or remove any semicolons.
uk: Не вставляйте і не видаляйте жодних крапок з комою.

# configuration.tsserver.useSyntaxServer.never
source: Don't use a dedicated syntax server. Use a single server to handle all IntelliSense operations.
uk: Не використовуйте спеціалізований сервер синтаксису. Використовуйте один сервер для обробки всіх операцій IntelliSense.

# typescript.tsserver.pluginPaths.item
source: Either an absolute or relative path. Relative path will be resolved against workspace folder(s).
uk: Абсолютний або відносний шлях. Відносний шлях буде вирішено відносно папки(ок) робочого простору.

# inlayHints.parameterNames.all
source: Enable parameter name hints for literal and non-literal arguments.
uk: Увімкніть підказки імен параметрів для літеральних та нелітеральних аргументів.

# inlayHints.parameterNames.literals
source: Enable parameter name hints only for literal arguments.
uk: Увімкнути підказки імен параметрів лише для літеральних аргументів.

# javascript.validate.enable
source: Enable/disable JavaScript validation.
uk: Увімкнути/вимкнути валідацію JavaScript.

# typescript.validate.enable
source: Enable/disable TypeScript validation.
uk: Увімкнути/вимкнути валідацію TypeScript.

# configuration.implicitProjectConfig.strictFunctionTypes
source: Enable/disable [strict function types](https://www.typescriptlang.org/tsconfig#strictFunctionTypes) in JavaScript and TypeScript files that are not part of a project. Existing `jsconfig.json` or `tsconfig.json` files override this setting.
uk: Увімкнути/вимкнути [суворі типи функцій](https://www.typescriptlang.org/tsconfig#strictFunctionTypes) у файлах JavaScript та TypeScript, які не є частиною проєкту. Існуючі файли `jsconfig.json` або `tsconfig.json` переважають цю налаштування.

# configuration.implicitProjectConfig.strict
source: Enable/disable [strict mode](https://www.typescriptlang.org/tsconfig#strict) in JavaScript and TypeScript files that are not part of a project. Existing `jsconfig.json` or `tsconfig.json` files override this setting.
uk: Увімкніть/вимкніть [строгий режим](https://www.typescriptlang.org/tsconfig#strict) у файлах JavaScript та TypeScript, які не є частиною проекту. Існуючі файли `jsconfig.json` або `tsconfig.json` переважають цю налаштування.

# configuration.implicitProjectConfig.strictNullChecks
source: Enable/disable [strict null checks](https://www.typescriptlang.org/tsconfig#strictNullChecks) in JavaScript and TypeScript files that are not part of a project. Existing `jsconfig.json` or `tsconfig.json` files override this setting.
uk: Увімкнути/вимкнути [суворі перевірки на null](https://www.typescriptlang.org/tsconfig#strictNullChecks) у файлах JavaScript та TypeScript, які не є частиною проєкту. Існуючі файли `jsconfig.json` або `tsconfig.json` переважають цю налаштування.

# configuration.implicitProjectConfig.experimentalDecorators
source: Enable/disable `experimentalDecorators` in JavaScript files that are not part of a project. Existing `jsconfig.json` or `tsconfig.json` files override this setting.
uk: Увімкніть/вимкніть `experimentalDecorators` у файлах JavaScript, які не є частиною проекту. Існуючі файли `jsconfig.json` або `tsconfig.json` переважають цю налаштування.

# configuration.suggest.autoImports
source: Enable/disable auto import suggestions.
uk: Увімкнути/вимкнути автоматичні пропозиції імпорту.

# configuration.suggest.includeCompletionsForImportStatements
source: Enable/disable auto-import-style completions on partially-typed import statements.
uk: Увімкнути/вимкнути автозаповнення стилю імпорту для частково введених операторів імпорту.

# typescript.suggest.enabled
source: Enable/disable autocomplete suggestions.
uk: Увімкнути/вимкнути пропозиції автозаповнення.

# typescript.autoClosingTags
source: Enable/disable automatic closing of JSX tags.
uk: Увімкнути/вимкнути автоматичне закриття тегів JSX.

# typescript.updateImportsOnFileMove.enabled
source: Enable/disable automatic updating of import paths when you rename or move a file in VS Code.
uk: Увімкніть/вимкніть автоматичне оновлення шляхів імпорту, коли ви перейменовуєте або переміщуєте файл у VS Code.

# javascript.format.enable
source: Enable/disable default JavaScript formatter.
uk: Увімкнути/вимкнути форматувач JavaScript за замовчуванням.

# typescript.format.enable
source: Enable/disable default TypeScript formatter.
uk: Увімкнути/вимкнути форматувач TypeScript за замовчуванням.

# configuration.suggest.jsdoc.generateReturns
source: Enable/disable generating `@returns` annotations for JSDoc templates.
uk: Увімкнути/вимкнути генерування анотацій `@returns` для шаблонів JSDoc.

# typescript.implementationsCodeLens.showOnInterfaceMethods
source: Enable/disable implementations CodeLens on interface methods.
uk: Увімкнути/вимкнути реалізації CodeLens для методів інтерфейсу.

# typescript.implementationsCodeLens.enabled
source: Enable/disable implementations CodeLens. This CodeLens shows the implementers of an interface.
uk: Увімкнути/вимкнути реалізації CodeLens. Цей CodeLens показує реалізаторів інтерфейсу.

# configuration.suggest.names
source: Enable/disable including unique names from the file in JavaScript suggestions. Note that name suggestions are always disabled in JavaScript code that is semantically checked using `@ts-check` or `checkJs`.
uk: Увімкнути/вимкнути включення унікальних імен з файлу в пропозиціях JavaScript. Зверніть увагу, що пропозиції імен завжди вимкнені в коді JavaScript, який семантично перевіряється за допомогою `@ts-check` або `checkJs`.

# configuration.inlayHints.parameterTypes.enabled
source: Enable/disable inlay hints for implicit parameter types: ```typescript el.addEventListener('click', e /* :MouseEvent */ => ...) ```
uk: Увімкнути/вимкнути підказки для неявних типів параметрів: ```typescript el.addEventListener('click', e /* :MouseEvent */ => ...) ```

# configuration.inlayHints.functionLikeReturnTypes.enabled
source: Enable/disable inlay hints for implicit return types on function signatures: ```typescript function foo() /* :number */ { return Date.now(); } ```
uk: Увімкнути/вимкнути підказки для неявних типів повернення у підписах функцій: ```typescript function foo() /* :number */ { return Date.now(); } ```

# configuration.inlayHints.propertyDeclarationTypes.enabled
source: Enable/disable inlay hints for implicit types on property declarations: ```typescript class Foo { prop /* :number */ = Date.now(); } ```
uk: Увімкнути/вимкнути підказки для неявних типів у деклараціях властивостей: ```typescript class Foo { prop /* :number */ = Date.now(); } ```

# configuration.inlayHints.variableTypes.enabled
source: Enable/disable inlay hints for implicit variable types: ```typescript const foo /* :number */ = Date.now(); ```
uk: Увімкнути/вимкнути підказки для неявних типів змінних: ```typescript const foo /* :number */ = Date.now(); ```

# configuration.inlayHints.enumMemberValues.enabled
source: Enable/disable inlay hints for member values in enum declarations: ```typescript enum MyValue { A /* = 0 */; B /* = 1 */; } ```
uk: Увімкнути/вимкнути підказки для значень членів у оголошеннях enum: ```typescript enum MyValue { A /* = 0 */; B /* = 1 */; } ```

# configuration.inlayHints.parameterNames.enabled
source: Enable/disable inlay hints for parameter names: ```typescript parseInt(/* str: */ '123', /* radix: */ 8) ```
uk: Увімкнути/вимкнути підказки для імен параметрів: ```typescript parseInt(/* str: */ '123', /* radix: */ 8) ```

# typescript.preferences.useAliasesForRenames
source: Enable/disable introducing aliases for object shorthand properties during renames.
uk: Увімкнути/вимкнути введення псевдонімів для скорочених властивостей об'єктів під час перейменування.

# configuration.tsserver.web.typeAcquisition.enabled
source: Enable/disable package acquisition on the web. This enables IntelliSense for imported packages. Requires `#typescript.tsserver.web.projectWideIntellisense.enabled#`. Currently not supported for Safari.
uk: Увімкнути/вимкнути придбання пакетів в Інтернеті. Це дозволяє IntelliSense для імпортованих пакетів. Потрібно `#typescript.tsserver.web.projectWideIntellisense.enabled#`. В даний час не підтримується для Safari.

# configuration.tsserver.web.projectWideIntellisense.enabled
source: Enable/disable project-wide IntelliSense on web. Requires that VS Code is running in a trusted context.
uk: Увімкнути/вимкнути IntelliSense для всього проєкту в вебі. Потрібно, щоб VS Code працював у надійному контексті.

# javascript.referencesCodeLens.enabled
source: Enable/disable references CodeLens in JavaScript files.
uk: Увімкнути/вимкнути посилання CodeLens у файлах JavaScript.

# typescript.referencesCodeLens.enabled
source: Enable/disable references CodeLens in TypeScript files.
uk: Увімкнути/вимкнути посилання CodeLens у файлах TypeScript.

# javascript.referencesCodeLens.showOnAllFunctions
source: Enable/disable references CodeLens on all functions in JavaScript files.
uk: Увімкнути/вимкнути посилання CodeLens для всіх функцій у файлах JavaScript.

# typescript.referencesCodeLens.showOnAllFunctions
source: Enable/disable references CodeLens on all functions in TypeScript files.
uk: Увімкнути/вимкнути посилання CodeLens для всіх функцій у файлах TypeScript.

# typescript.preferences.includePackageJsonAutoImports
source: Enable/disable searching `package.json` dependencies for available auto imports.
uk: Увімкнути/вимкнути пошук залежностей `package.json` для доступних автоматичних імпортів.

# configuration.implicitProjectConfig.checkJs
source: Enable/disable semantic checking of JavaScript files. Existing `jsconfig.json` or `tsconfig.json` files override this setting.
uk: Увімкнути/вимкнути семантичну перевірку файлів JavaScript. Існуючі файли `jsconfig.json` або `tsconfig.json` переважають цю налаштування.

# configuration.suggest.includeAutomaticOptionalChainCompletions
source: Enable/disable showing completions on potentially undefined values that insert an optional chain call. Requires strict null checks to be enabled.
uk: Увімкнути/вимкнути показ завершень для потенційно невизначених значень, які вставляють виклик необов'язкового ланцюга. Потрібно, щоб були увімкнені строгі перевірки на null.

# configuration.suggest.classMemberSnippets.enabled
source: Enable/disable snippet completions for class members.
uk: Увімкнути/вимкнути завершення фрагментів для членів класу.

# configuration.suggest.objectLiteralMethodSnippets.enabled
source: Enable/disable snippet completions for methods in object literals.
uk: Увімкнути/вимкнути завершення фрагментів для методів в об'єктних літералах.

# configuration.tsserver.useSeparateSyntaxServer
source: Enable/disable spawning a separate TypeScript server that can more quickly respond to syntax related operations, such as calculating folding or computing document symbols.
uk: Увімкнути/вимкнути створення окремого сервера TypeScript, який може швидше реагувати на операції, пов'язані з синтаксисом, такі як обчислення складання або обчислення символів документа.

# javascript.suggestionActions.enabled
source: Enable/disable suggestion diagnostics for JavaScript files in the editor.
uk: Увімкнути/вимкнути діагностику пропозицій для файлів JavaScript в редакторі.

# typescript.suggestionActions.enabled
source: Enable/disable suggestion diagnostics for TypeScript files in the editor.
uk: Увімкнути/вимкнути діагностику пропозицій для файлів TypeScript в редакторі.

# configuration.suggest.completeJSDocs
source: Enable/disable suggestion to complete JSDoc comments.
uk: Увімкнути/вимкнути пропозицію для завершення коментарів JSDoc.

# configuration.suggest.paths
source: Enable/disable suggestions for paths in import statements and require calls.
uk: Увімкнути/вимкнути підказки для шляхів у імпортних деклараціях та викликах require.
