Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.git.xlf
Languages: uk

# ++CODE++a93447605ef4b2cc8eda934a1e9af7ad57f8d2d2e5dc1defbaa121ed13550e57
source: $(info) Remote "{0}" has no tags.
uk: $(info) Віддалений "{0}" не має тегів.

# ++CODE++12fa952e31901a48fcf2fd1b897affd15a9e35b4f7c0a4f3693107b3cc23ba95
source: $(info) This repository has no stashes.
uk: $(info) У цьому репозиторії немає сховищ.

# ++CODE++d33636398d4d33c00d489b6b7a46b224e0b779fcf33fd6c3e3d6e40c2933373a
source: $(info) This repository has no tags.
uk: $(info) У цьому репозиторії немає тегів.

# ++CODE++418e632797c81516d50735320a9d9cc10b9ca7fdf7af3dcdab4caae0de5e1e57
source: Are you sure you want to discard ALL changes in {0} files?
uk: Ви впевнені, що хочете скасувати ВСІ зміни в {0} файлах?

# ++CODE++c79252a790aa60ebcfef1422e4a946cddc640dff892e7acc36ce397464077172
source: Are you sure you want to discard changes in '{0}'?
uk: Ви впевнені, що хочете скасувати зміни в '{0}'?

# ++CODE++96ab5dc0020f2126bcb175ec9f0fe83b01c1b357fd2a9f0a3afc3d1f2860ee85
source: "{0}" has fingerprint "{1}"
uk: "{0}" має відбиток пальця "{1}"

# ++CODE++59dacc1ec703cf2cd4c3f087ed4ff2d7da089b9634de61200779a5007bac6af0
source: A branch named "{0}" already exists
uk: Гілка з назвою "{0}" вже існує

# ++CODE++621321bc491d0f5f5702b38ee93f4b2f0b07bb9f72e3c1ad3ce06ce6b0f06219
source: A git repository was found in the parent folders of the workspace or the open file(s). Would you like to open the repository?
uk: У батьківських папках робочого простору або відкритих файлів знайдено репозиторій git. Бажаєте відкрити репозиторій?

# ++CODE++1da1a00fd75ac0a5f8e6d1c1649dec3b58f5c987faaffe73078f7296a636312f
source: Absolute paths not supported in "git.scanRepositories" setting.
uk: Абсолютні шляхи не підтримуються в налаштуванні "git.scanRepositories".

# ++CODE++6fa5252bce4290bcd9ff56fe10025f8bdfc5d4e24691f6fa68f27ed431c063a2
source: Add Remote
uk: Додати віддалений

# ++CODE++060c966a30504cab8cdc4cd05de72451e3a644e0bfe14080fc49722e00e93f75
source: Add a new remote...
uk: Додати новий віддалений...

# ++CODE++d5eca92389f946b04241308e4a3b9b92fc39429ee9348a6c24448dc1a4b24c6f
source: Add remote from URL
uk: Додати віддалений з URL

# ++CODE++d6641e7833cbdcd1456edcd6d584a99f9d005f5cd0b4c8bbcbf18099e680f089
source: Add remote from {0}
uk: Додати віддалений з {0}

# ++CODE++de161ac4087726413ce474f53279a95dc36167a2274bb58721f8720b87bfd611
source: Add to Workspace
uk: Додати до Робочого простору

# ++CODE++b9f653e0e3af44de571212f85ec3f499df207e29bd1f28ab02cb527899690926
source: All Repositories
uk: Усі репозиторії

# ++CODE++de9f057a471cdb8d3b082719bdc7ad2031788d042947349723fa83c9d13a517a
source: Always
uk: Завжди

# ++CODE++2c707611079d56814a3db49f113e4b83c4825cc85ed4a25ec42c3d93196a4b0b
source: Always Pull
uk: Завжди тягніть

# ++CODE++aba5e78271f2c013fc91b7610994fb5c242b46692041a30ea89590d28771ddab
source: Always Replace Local Tag(s)
uk: Завжди замінюйте локальний тег(и)

# ++CODE++4227c9a98760a7d1e0dbcf7b9470597d806e1bd5230ed33777f1a7df85756739
source: Are you sure you want to DELETE the following untracked file: '{0}'?{1}
uk: Ви впевнені, що хочете ВИДАЛИТИ наступний не відстежуваний файл: '{0}'?{1}

# ++CODE++b54d192974c064e5d6d66c5d2604e4ad3f994e7bc671bc6f59e4c54f0aece454
source: Are you sure you want to DELETE the {0} untracked files?{1}
uk: Ви впевнені, що хочете УДАЛИТИ {0} не відстежуваних файлів?{1}

# ++CODE++46d379e48de8077187857870eaed5866f00e7d88fee7d4f6ab609ca34912c244
source: Are you sure you want to continue connecting?
uk: Ви впевнені, що хочете продовжити підключення?

# ++CODE++ffb8582a7ae040adfcc7adbee5a8207a55754268d09fa3b06b21a86c0893b609
source: Are you sure you want to create an empty commit?
uk: Ви впевнені, що хочете створити порожній коміт?

# ++CODE++0d3ea6d88129bedbc541dd628d84b9fbed6883d7f5d06ba086dda483593256be
source: Are you sure you want to discard ALL changes in {0} files? This is IRREVERSIBLE! Your current working set will be FOREVER LOST if you proceed.
uk: Ви впевнені, що хочете скасувати ВСІ зміни в {0} файлах? Це НЕПОВЕРНУТЬ! Ваш поточний робочий набір буде НАЗАВЖДИ ВТРАЧЕНИЙ, якщо ви продовжите.

# ++CODE++4238c53d4fa11d10ec555dea91558f7ab9057b759fe13d2a8fc69a6e21ad06fe
source: Are you sure you want to discard changes in '{0}'?
uk: Ви впевнені, що хочете скасувати зміни в '{0}'?

# ++CODE++6f875b4f8d4f7d28e6dc570891696be992d21c501c1d04ae0a91adb407418b9d
source: Are you sure you want to drop ALL stashes? There are {0} stashes that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
uk: Ви впевнені, що хочете видалити ВСІ сховища? Є {0} сховищ, які підлягають очищенню, і ЇХ МОЖЕ БУТИ НЕМожливо ВІДНОВИТИ.

# ++CODE++24ab570db1c20d8c4ec76c5a64104f95d1ddff931a4194f0c0f975a22a5df50d
source: Are you sure you want to drop ALL stashes? There is 1 stash that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
uk: Ви впевнені, що хочете скинути ВСІ сховища? Є 1 сховище, яке підлягатиме очищенню, і ЙОГО МОЖЕ БУТИ НЕМожливо ВІДНОВИТИ.

# ++CODE++76f1fe23e2bbf8ac3061a3fdd5bd60802fcf476e1b2ee914f93825bd1b0faf70
source: Are you sure you want to drop the stash: {0}?
uk: Ви впевнені, що хочете скинути сховище: {0}?

# ++CODE++1e2382e5171e692babccb3da5365852f4b9bc6ca1930b12a473d58a6e80b7673
source: Are you sure you want to restore '{0}'?
uk: Ви впевнені, що хочете відновити '{0}'?

# ++CODE++06590677e304a0176c2fe482b80cb77a9293fc43fc84176794b709a627788135
source: Are you sure you want to restore ALL {0} files?
uk: Ви впевнені, що хочете відновити ВСІ {0} файли?

# ++CODE++329f9a037f3c5a986261e6a6e542e87bfa0ee72b98c08c0345a67fbe360f935c
source: Are you sure you want to stage {0} files with merge conflicts?
uk: Ви впевнені, що хочете підготувати {0} файлів з конфліктами злиття?

# ++CODE++d0d9c64e1041439f769f99f8c2e321f3c0448095a9d175f2dbb9a422e0de437f
source: Are you sure you want to stage {0} with merge conflicts?
uk: Ви впевнені, що хочете підготувати {0} з конфліктами злиття?

# ++CODE++fca24e51f77ed30ee8b875dba3000717e817f65dacb9130a9b1f1dffe8fdc679
source: Ask Me Later
uk: Запитай мене пізніше

# ++CODE++06f6bb7108ffdb5caf844b4538b5ec8f44cc1b3bc6b577624d32fc57eff9fe3f
source: Branch name
uk: Назва гілки

# ++CODE++69c5b417453bbe27e9b739db7bbb93c3ee3b7a3698a808d28fa6115e685c36f7
source: Branch name needs to match regex: {0}
uk: Назва гілки повинна відповідати регулярному виразу: {0}

# ++CODE++c8a48a8e4270f581a8215e266abccc79eb1c1e914328db324f68fec2f97a91b8
source: Can't force push refs to remote. The tip of the remote-tracking branch has been updated since the last checkout. Try running "Pull" first to pull the latest changes from the remote branch first.
uk: Не можна примусово надіслати посилання на віддалений репозиторій. Вершина гілки віддаленого відстеження була оновлена з моменту останнього чекауту. Спробуйте спочатку виконати "Pull", щоб отримати останні зміни з віддаленої гілки.

# ++CODE++defaf553a190045a5d91e4e0fc3440ff264b748a957d6f5a745acc318c55c925
source: Can't push refs to remote. Try running "Pull" first to integrate your changes.
uk: Не вдається надіслати посилання на віддалений репозиторій. Спробуйте спочатку виконати "Pull", щоб інтегрувати ваші зміни.

# ++CODE++df8b4cfae66d0bf08999ed2bb152f76e6e89aefae3dc21a212710782abed512c
source: Can't undo because HEAD doesn't point to any commit.
uk: Не можна скасувати, оскільки HEAD не вказує на жоден коміт.

# ++CODE++bbd4b6a86bc65b6ac8e79e97afc61499158edb40f7bb404c70637b46d80a7ad2
source: Changes
uk: Зміни

# ++CODE++c393643a0d2b8afb59b5368249e1aa94ac44dbd6aab25347a4c8788acf7065a1
source: Checking Out Branch/Tag...
uk: Перевірка гілки/тегу...

# ++CODE++06c1c85316f574170dfd57c5f7fde4af263c41616826fe806c2e032cc4ffed0a
source: Checking Out Changes...
uk: Перевірка змін...

# ++CODE++870cef993507d1e51e03f108fccd4ba158542d9d3617e0d6065fa9ff2957fea8
source: Checkout Branch/Tag...
uk: Перейти до гілки/тегу...

# ++CODE++ef12959262a90a02838d73d524e3dae6a0271a013f2017051508ce526016175d
source: Choose Folder...
uk: Вибрати папку...

# ++CODE++339efbb5f4e6a1cb79b21d625f068b11022acd5e37857d396d4d2a5fa5fce451
source: Choose a folder to clone {0} into
uk: Виберіть папку для клонування {0} в

# ++CODE++61cc7bd271a5a5b8784320285c1920a502420a5bef95f8a159323ddd4064a820
source: Choose a repository
uk: Виберіть репозиторій

# ++CODE++f0b79e95174d85877c16dd82f0c4d4d6f36a31c31c4b47419039da94dbd22ddd
source: Choose which repository to clone
uk: Виберіть, який репозиторій клонувати

# ++CODE++c7603b4751690aeae72662e14277aa1e80e68cfcb1376cd39cbb7fdc5c135e63
source: Clear whitespace characters
uk: Очистити символи пробілів

# ++CODE++d425c4cb46b4dbd6b73ee7bc369b63795cefbe0702c041f581fc0be71739c4b5
source: Clone from URL
uk: Клонувати з URL

# ++CODE++58987b3663ca5a076846d352605196819f81c5e118d93937d9480b26520120d7
source: Clone from {0}
uk: Клонувати з {0}

# ++CODE++dc4a4db67704a975c2d0d65338d136d6f9ad7336dec08ffe2dac1e42b42f21d0
source: Cloning git repository "{0}"...
uk: Клонування репозиторію git "{0}"...

# ++CODE++82a9c46ffa4789945d9f2359d75891558ef6faa8dee09e4b25e4e0597704f5bd
source: Commit
uk: Зобов'язатися

# ++CODE++d0018212c7ec56f7dec88df64cea48c03cd22fb7294f5a731061fb6fe037c171
source: Commit & Push Changes
uk: Зберегти та надіслати зміни

# ++CODE++8ee870c3b9de2b0f27c0b858a94a0d8b6e605caf6c1a481c5ee1fe1cafd73cd5
source: Commit & Sync Changes
uk: Зберегти та синхронізувати зміни

# ++CODE++6ead59e71e458fb4011c59193f4aca9b0c9aa84ae5be108386fbbf1527973788
source: Commit Anyway
uk: Зробити все одно

# ++CODE++749e00cf6618bc6ef3d0fbe34d822881466a634f5c7b85d166df2fb1460f0056
source: Commit Changes
uk: Зберегти зміни

# ++CODE++f1902e6bba725c6d3fcf51683aabc4686fb2a0f0dd682e1d6a9adf32fa0441d9
source: Commit Changes on "{0}"
uk: Зберегти зміни в "{0}"

# ++CODE++2a8cf21232f60e18a2463520f642e8744cbb02e52bf28da24679207e4302b447
source: Commit Changes to New Branch
uk: Зберегти зміни в новій гілці

# ++CODE++cb039e43bfd1824728db88aee47282a1362819ca8ccbfec5b311ee5af0e89760
source: Commit Hash
uk: Хеш коміту

# ++CODE++26306d203c4a6f1a77f32cd065d7d11593ba0c7a9b5c52c188b98f22b620941f
source: Commit message
uk: Повідомлення про коміт

# ++CODE++853333402637451d6aa3b25ece807151fc432e65654ef1a92683c08d2f469a08
source: Commit operation was cancelled due to empty commit message.
uk: Операцію коміту було скасовано через порожнє повідомлення коміту.

# ++CODE++c561966032532f5cb4e661520907ce9195227eab5a7a8502ed432c65d2cec33c
source: Commit to New Branch & Push Changes
uk: Зробити коміт до нового гілки та надіслати зміни

# ++CODE++3807b76456b337798395543fd7f71add47058cc837ec3ce97557869b96a5a178
source: Commit to New Branch & Synchronize Changes
uk: Зробити коміт у нову гілку та синхронізувати зміни

# ++CODE++c5803c644368982b5ba18930ba87da76d777035a01c0404d0a738689513da3c1
source: Commit to a New Branch
uk: Зробити коміт до нової гілки

# ++CODE++d713d959ee6b9ef81c29bf51aa9a1e02cd00557b1d256630a191495aef81788b
source: Commits without verification are not allowed, please enable them with the "git.allowNoVerifyCommit" setting.
uk: Коміти без перевірки не дозволені, будь ласка, увімкніть їх за допомогою налаштування "git.allowNoVerifyCommit".

# ++CODE++222889674324947cdb3d7362d9c932658d6035ca96fa1b2d03e8243c2a494ebe
source: Committing & Pushing Changes...
uk: Фіксація та відправка змін...

# ++CODE++0670568e2bce6ac7ba3dd75805187f7e4b7bf4660f663ce69edc04bcddaa6b79
source: Committing & Synchronizing Changes...
uk: Фіксація та синхронізація змін...

# ++CODE++094f485ef9934983ca0d9a7980a869fbf0b1cdc609a840d1eb2f0a13dacd8c11
source: Committing Changes to New Branch...
uk: Фіксація змін у новій гілці...

# ++CODE++e00dcd402be4da03cd33575153acf4ae2f39273fecefe7c78f13b743f4ca887a
source: Committing Changes...
uk: Збереження змін...

# ++CODE++7e9af1cefa5907c0ad11ae3d77a1116494026ffc9419dc3f9d51eee1e5c0f87c
source: Committing to New Branch & Pushing Changes...
uk: Фіксація нового гілки та відправка змін...

# ++CODE++c1de8d4fc91a72a414f95fb6e7ddaa42e846c3862560e6ad81ec2508c9c95542
source: Committing to New Branch & Synchronizing Changes...
uk: Фіксація нового гілки та синхронізація змін...

# ++CODE++26727a77b60784d2907788f4dcd2c528470f39420c7d89cf6b2fb7017bd0d973
source: Conflict: Added By Them
uk: Конфлікт: Додано ними

# ++CODE++e60a6686b1c40266a21a7fb54613a90683e298c8373488c8c9b09b9b696e7dc6
source: Conflict: Added By Us
uk: Конфлікт: Додано нами

# ++CODE++cf655e271c68cfa38a63d55a83b3f244fdf668f6102a8b2f7dedb774e1a53fcd
source: Conflict: Both Added
uk: Конфлікт: Обидва додано

# ++CODE++90a447188c3e8f03122432f6eadb32a86a3d3f2a7bfe47973c5268a43cfa482b
source: Conflict: Both Deleted
uk: Конфлікт: Обидва видалені

# ++CODE++9b10e40394e51ee85ee978d10dcd4e39508bc7b7dbfaca0ff1c0fb1d34a4f48b
source: Conflict: Both Modified
uk: Конфлікт: Обидва змінені

# ++CODE++a7f3173b4ff7b9d91eeae6f949c39727b52e7620a66d6f4335335fc762506332
source: Conflict: Deleted By Them
uk: Конфлікт: Видалено ними

# ++CODE++313cc973de4d5d23fd082327d53acce5fc69559e3a717dbac4fde62c7033f1bf
source: Conflict: Deleted By Us
uk: Конфлікт: Видалено нами

# ++CODE++c47794284720aef397915f8a497e57dd7ed2ae339c713293b73fce859b488a27
source: Continue Merge
uk: Продовжити злиття

# ++CODE++c38d012d028807fe8d3ac2fbc2fc2458388aeae57372a45be95c4357f48d3c34
source: Continue Rebase
uk: Продовжити ребейс

# ++CODE++1ca9ede3d24dc50729e6c7975bea971f4c257bda71748b4e62a1ff7c9d523284
source: Continuing Merge...
uk: Продовження злиття...

# ++CODE++416df53dc1046300db7c7db89015858f86d148ea5e66f0152592e046c04a100d
source: Continuing Rebase...
uk: Продовження ребейсу...

# ++CODE++ab480df9b105271e4e11fceac6652ee8d141b49d326f9e4dbc4239f2529d60f2
source: Copy Commit Hash
uk: Скопіювати хеш коміту

# ++CODE++c5422e509267a427656ce69d6d0aed53ffcfe5eb313def9a960db7cb5b8c9c4d
source: Could not clone your repository as Git is not installed.
uk: Не вдалося клонувати ваш репозиторій, оскільки Git не встановлено.

# ++CODE++978fa11dc34a758c8d99fce0d36a97740cb8abe19bd39a1be049b57bb9a98e57
source: Create Empty Commit
uk: Створити порожній коміт

# ++CODE++e0d1b68224bf0b31ef16b206c65b5f8f6b89d18161f4a7cdcb8d0ac8d952549a
source: Current
uk: Поточний

# ++CODE++d2c753607fd4607a83f71c14f48c474f08562ccb59c23e8799cfebaa2d15c655
source: Current commit message only contains whitespace characters
uk: Поточне повідомлення коміту містить лише пробільні символи

# ++CODE++5d1d556066f94734af9391a53e1cd80d79ecba01f0e5670941bd51f1d6522915
source: Delete All {0} Files
uk: Видалити всі {0} файли

# ++CODE++06da38448937c5ca3cf8a9a4e91edb8a50fcfb20885e7d93d5019bf591fdc5c0
source: Delete Branch
uk: Видалити гілку

# ++CODE++e1e5fe2043bd3003147a785a42a5edddccbf57d465ca32ad0f033cf7b64f04c8
source: Delete File
uk: Видалити файл

# ++CODE++b48ff39c2e0f5451b9b29b09c2a74d2760db230749ffd48a6e901cc91fef9a8d
source: Deleted
uk: Видалено

# ++CODE++92cbd25a58021e00fde8fe8247b6a62746304c19327ce600b1e3408922d43c10
source: Discard 1 Tracked File
uk: Видалити 1 відстежуваний файл

# ++CODE++da0cd4de5d64172a4fffefb1068f8644fb1c91e7247d3ad433f2d6b98a2d1a90
source: Discard All {0} Files
uk: Видалити всі {0} файли

# ++CODE++69180c81b03b11b94f696e8fb79f161caa8c6a1de40602cd3d0beefe5ab1fa1a
source: Discard All {0} Tracked Files
uk: Видалити всі {0} відслідковані файли

# ++CODE++e8c0ef8d06c3685f9886b57e423e2a0ec56105a176b63b92dc2e08916b73a337
source: Discard File
uk: Видалити файл

# ++CODE++3e270a42c9f3bc2695e8a8f365df1363401b99fc906863f25e00172acde65c29
source: Don't Pull
uk: Не тягни

# ++CODE++1d60d0cdcb5408b8e39ed364f675c9cad8a2f6174a413324d1e34437bd41269b
source: Don't Show Again
uk: Не показувати знову

# ++CODE++64488bcdbc42e52d74ab9bb817297e8e3c66c04011677d381ca0428664bb5f03
source: Download Git
uk: Завантажити Git

# ++CODE++969ccbd3cf6300ecd5c880459d81ae9027df7517563184a1b8b15282db230621
source: Email
uk: Електронна пошта

# ++CODE++975dd75001ae0d7c535f15e85326be3fc636a908ef77dcd64931d0564b64c7f5
source: Enables the following features: {0}
uk: Увімкнено такі функції: {0}

# ++CODE++f9e38e00f92b08ea1873eb83b3a80656bca1da49a4b862e70d1a34d654a052dd
source: Failed to authenticate to git remote.
uk: Не вдалося автентифікуватися до віддаленого git.

# ++CODE++d1212fc6b97b49a3d80ed311b0c518e476f0c378adf57cd70a1e8a54cd8a3469
source: Failed to authenticate to git remote: {0}
uk: Не вдалося аутентифікуватися до git remote: {0}

# ++CODE++26cc264ee3b80ee46273b591fbf36b42435793ccd2c9278e404148ff072744e1
source: File "{0}" was deleted by them and modified by us. What would you like to do?
uk: Файл "{0}" був видалений ними та змінений нами. Що ви хочете зробити?

# ++CODE++e58d7c7d22489d714e1a028530621f02e3e3c117a82e20e7d92e4dab0833a4cc
source: File "{0}" was deleted by us and modified by them. What would you like to do?
uk: Файл "{0}" був видалений нами та змінений ними. Що б ви хотіли зробити?

# ++CODE++c801735bdcbaef47f4f9fdc4e6db3ef65f65738dd91850477f7a4c89d4b5b60b
source: Force Checkout
uk: Примусове оформлення замовлення

# ++CODE++dea241f37f7b03284af862a9376f0b02d561af0bcaa05f80bec1226bc26c8bca
source: Force push is not allowed, please enable it with the "git.allowForcePush" setting.
uk: Примусовий пуш не дозволено, будь ласка, увімкніть його за допомогою налаштування "git.allowForcePush".

# ++CODE++d93eb63347c5d069a044d062be00728df9951ab8f02758240edf02590b05d62b
source: Git Blame Information
uk: Інформація про Git Blame

# ++CODE++a39de9d1a73052f9e82004d14cd2ac6cf1a4da3f959a50b5f5a7a9507c094ef8
source: Git History
uk: Історія Git

# ++CODE++6030c83165fb700fcca51c74a9940aeefaf8084c612f5b57eea3723737c5f57d
source: Git error
uk: Помилка Git

# ++CODE++d464cbf6599bbe85f6d7f76f6471655a2a1d8a0aecab6e529565a22b566bf620
source: Git local changes (working tree + index)
uk: Локальні зміни Git (робоче дерево + індекс)

# ++CODE++78f2a2886f2cb480b80ef972b1c7237e83e9288f032cdf76ebf8c4174dfa5f7e
source: Git local changes (working tree)
uk: Локальні зміни Git (робоче дерево)

# ++CODE++8982820c48292bced4accf28e84fa2f563665a822d10d9800697d5274e15e4d2
source: Git not found. Install it or configure it using the "git.path" setting.
uk: Git не знайдено. Встановіть його або налаштуйте за допомогою параметра "git.path".

# ++CODE++6a29332d3557881b20eb99f45dcbce35edccdb3f47128fbf67b1795e1b8c75c9
source: Git repositories were found in the parent folders of the workspace or the open file(s). Would you like to open the repositories?
uk: Git-репозиторії були знайдені в батьківських папках робочої області або у відкритих файлах. Чи хочете ви відкрити репозиторії?

# ++CODE++0c3b2f01bfd0bbe594a1e89ebf29c9ba17e93abd909f66330bf0ab7320d2b482
source: HEAD version of "{0}" is not available.
uk: HEAD версія "{0}" недоступна.

# ++CODE++7e591d656255588096760e1dcb8771b2c329236880d2c9a5f6734d71c552e553
source: Hard wrap all lines
uk: Жорстке обгортання всіх рядків

# ++CODE++e32e8450faff80788af6dc880ef3ec29b652ea51b7a65b55bd67600b43436275
source: Hard wrap line
uk: Жорстке обгортання рядка

# ++CODE++7d648f5b47f34afb32946011a07e32176ad966f44ad9efff8380c73dfc5c5b87
source: Ignored
uk: Ignored" - "Ігноровано

# ++CODE++e301820ac83931005088b32674481b184df58276cd0e79f0c8c8f7615dc023a6
source: Incoming
uk: Вхідний

# ++CODE++9dc7d287812e88f28710171d1a0278704309e66cf4064c81c046b25cbc06e374
source: Incoming Changes
uk: Вхідні зміни

# ++CODE++bf6b36b530b337558cacd7286dd46d1016bc3161a13b67d8240a3e4b40eb2119
source: Incoming Changes (added)
uk: Вхідні зміни (додано)

# ++CODE++5b4dba9abcfb482f685a676194aac45fccc84e9f4ca54ebe9d7e9a13e8e437ee
source: Incoming Changes (deleted)
uk: Вхідні зміни (видалено)

# ++CODE++c4d3222445760f9f465a17b024bc6780dc4defdd775846f2c0be4ae2504cd9f9
source: Incoming Changes (modified)
uk: Вхідні зміни (змінено)

# ++CODE++dae5db959b575cf2e6e7d36e0fb29ebe28731710f64d2999f77f167a2228a4af
source: Incoming Changes (renamed)
uk: Вхідні зміни (перейменовано)

# ++CODE++4bc49b7e3107933d6c3033c90e34518e26bf9af94ce830042b13eee60f0134d6
source: Index Added
uk: Індекс додано

# ++CODE++39520d0f752236ebe985a9ab539075bb3961e0b2b3d54494689e724aa460dbc7
source: Index Copied
uk: Індекс скопійовано

# ++CODE++606a5aedaa4178761d620b63ca8f7ddabd6cc481415cdbf64bc952f6a3d6fc8b
source: Index Deleted
uk: Індекс видалено

# ++CODE++26f13b9c8050f9ac86037d900a1aa7e429efa319836c75edcb5eb0857a1da984
source: Index Modified
uk: Індекс змінено

# ++CODE++0fab3d719bfe30418fa5b3301a3d2ea05178de4451bfe358cad5fc22ebdad0e6
source: Index Renamed
uk: Індекс перейменовано

# ++CODE++905dd9958f630cdc089ae37a56c186841863cb5192c59c886dede1fa4eba71ed
source: Initialize Repository
uk: Ініціалізувати репозиторій

# ++CODE++da5494fdeba5f3b5e1dd5b73c79aeab8c5d28830990fa85d01210710cfc805d5
source: Intent to Add
uk: Намір додати

# ++CODE++93c86a252e562f412c0322b6348bae591b3c1fe7f09460fb40083f9ec8011981
source: Intent to Rename
uk: Намір перейменувати

# ++CODE++96fb1f951270c90a70612cc71ad71290be1afd46011b51131a4954b898d66dcf
source: Invalid branch name
uk: Недійсна назва гілки

# ++CODE++cd20f59f1dd9f869d17a79e25727c8fb29fa0fb4514d93857985bde8ea3d0c8a
source: It looks like the current branch "{0}" might have been rebased. Are you sure you still want to pull into it?
uk: Схоже, що поточна гілка "{0}" могла бути перебазована. Ви впевнені, що все ще хочете зробити в неї pull?

# ++CODE++5d5cabe4050fdd7a47b6188df4bb4137acc7d06474495edcfa62d7a8fc4aad70
source: It looks like the current branch might have been rebased. Are you sure you still want to pull into it?
uk: Схоже, що поточну гілку могли перебазувати. Ви впевнені, що все ще хочете влити в неї?

# ++CODE++436fa828b9d4c693b023b1545d0ed999864b4bb5f6c93c5a406fdbb2edde85a7
source: It's not possible to change the commit message in the middle of a rebase. Please complete the rebase operation and use interactive rebase instead.
uk: Неможливо змінити повідомлення коміту посеред реабази. Будь ласка, заверште операцію реабази та використовуйте інтерактивну реабазу замість цього.

# ++CODE++60c138e94a1d502e1392e9ca62e5393e93e280a7f28e4f5a3ff4a575d56c388b
source: Keep Our Version
uk: Залишити нашу версію

# ++CODE++e9f8f78f902c9e4bbe0a5c91eb57172bbc53f6698bb4521006df79aa6b280dbe
source: Keep Their Version
uk: Зберегти їхню версію

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
uk: Дізнатися більше

# ++CODE++fa0f601f537c892e522505a224c5996f94857505214c507f5745273c327b3333
source: Make sure you configure your "user.name" and "user.email" in git.
uk: Переконайтеся, що ви налаштували "user.name" та "user.email" у git.

# ++CODE++4eaae38d7115a0c0cb42e2c87cc2043f6897eab74e688450588c109cbb2496ed
source: Manage Unsafe Repositories
uk: Керувати небезпечними репозиторіями

# ++CODE++c08f87c6bf2a44ca177005eb990385dde9b14cc5289bc4420a45c199ec474e90
source: Merge Changes
uk: Злити зміни

# ++CODE++2f77668a9dfbf8d5848b9eeb4a7145ca94c6ed9236e4a773f6dcafa5132b2f91
source: Message
uk: Повідомлення

# ++CODE++ad33f83890a4c1ba0086d4d728279e8e61d185c14352ea3d6663449460aad18d
source: Message (commit on "{0}")
uk: Повідомлення (коміт на "{0}")

# ++CODE++2ee8b430941cdf1bf2209d255c8463471ba4c3de2d94129c257ab035a1d42a8e
source: Message ({0} to commit on "{1}")
uk: Повідомлення ({0} для коміту на "{1}")

# ++CODE++f0f141c12a17f52bcd64321cf6969ffbc81f015b584641cd783d89904c1f72ea
source: Message ({0} to commit)
uk: Повідомлення ({0} для коміту)

# ++CODE++d45c9f6ecdd755947ace0120f734f99da7328ecb87b04c3b10d780117a94c2ed
source: Migrate Changes
uk: Міграція змін

# ++CODE++e8ce5dcaf408935ff76747226d2e8bee4319a2f593c1d7a838115e56183d1f37
source: Modified
uk: Модифіковано

# ++CODE++3cf394e0144532f9a5fc48d32429d44f863e8e4f2a01ad4483b660b17287ed6c
source: Move to Recycle Bin
uk: Перемістити до Кошика

# ++CODE++9adcdf33dce13da720c0c92684691d167ed7252cf15dcbfedd35ee5896b2fac1
source: Move to Trash
uk: Перемістити в кошик

# ++CODE++6300ef800bb884295b0b4b35682b75cecd7cc550d202db56d04a0643b8fb873f
source: Never
uk: Ніколи

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні
