Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.github-authentication.xlf
Languages: uk

# ++CODE++120ec0ffa190a8e7759483f35d54a335e265693733bd681f5edf54448861ffcf
source: A reload is required for the fetch setting change to take effect.
uk: Для того щоб зміни в налаштуванні отримання набрали чинності, потрібне перезавантаження.

# ++CODE++f223faa96f22916294922b171a2696d868fd1f9129302eb41a45b2a2ea2ebbfd
source: Apple
uk: Яблуко

# ++CODE++401c9d5938a3808b7f0f056710e8fea7bcceaca69b428cd9247eadda3b40be6b
source: Continue to GitHub
uk: Продовжити на GitHub

# ++CODE++b60aed3c58e6e5d2b56709f9cacbec0e9aa1acc8158597fe444c8778d2fdfb06
source: Continue to GitHub to create a Personal Access Token (PAT)
uk: Продовжте на GitHub, щоб створити Персональний Токен Доступу (PAT)

# ++CODE++2363daf3927d94f8a1e7964ac99b7f30f7df2009ca431f2d9edf2b5edc4f2073
source: Copy & Continue to {0}
uk: Копіювати та продовжити до {0}

# ++CODE++87fb8c7a5a4e4a2001d3556350d50560cd5f0d6423f0c780e0b447f0aefb0583
source: GitHub Authentication - Reload required
uk: GitHub Аутентифікація - Потрібне перезавантаження

# ++CODE++ec19f01de52b36689edfccd0fc86e8521bab59d83a3d611b35882f044d54d833
source: GitHub Enterprise Server URI is not a valid URI: {0}
uk: URI GitHub Enterprise Server не є дійсним URI: {0}

# ++CODE++2c1355b1b52e1bb108a7d638522f74ca3b7fe8aebbae36fda7902ccbdbe9e335
source: Having trouble logging in? Would you like to try a different way? ({0})
uk: Маєте проблеми з входом? Хотіли б спробувати інший спосіб? ({0})

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні

# ++CODE++54b9687194ef1807b08b011cd34280e34844af4f912562c2c9513ab8dc65695c
source: Open [{0}]({0}) in a new tab and paste your one-time code: {1}
uk: Відкрийте [{0}]({0}) в новій вкладці та вставте свій одноразовий код: {1}

# ++CODE++423e44de44431caef68c0c61968777e088fd50d2577feea60b9ba4a14b28a827
source: Reload Window
uk: Перезавантажити вікно

# ++CODE++c7bd7105f7c2bf98654930d6271e164cb935b377cf2d167bdb4fe8fff95d9336
source: Sign in failed: {0}
uk: Не вдалося увійти: {0}

# ++CODE++a093812fd21d65a4cd97e289705124445d735cd50ffb7f88f4abbac215c5d5a2
source: Sign out failed: {0}
uk: Вихід не вдався: {0}

# ++CODE++483548c44e4bd1ccd117f8087f641c1a392885d1378106b2a20e63cd2f23a4d2
source: Signing in to {0}...
uk: Увійти в {0}...

# ++CODE++de597b4537605540f77c1475713aa6a04c823bb6a8fda97d24705eccf184f18e
source: To finish authenticating, navigate to GitHub and paste in the above one-time code.
uk: Щоб завершити автентифікацію, перейдіть на GitHub і вставте вищезазначений одноразовий код.

# ++CODE++60609d4c011ba044569e8d990343f22439f06f4c2401c49fb4e1b7ff3cd49dcc
source: To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.
uk: Щоб завершити автентифікацію, перейдіть на GitHub, щоб створити PAT, а потім вставте PAT у поле введення.

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
uk: Так

# ++CODE++489a897c4d7e10b6db6824153c5bfa9256603e8d494f5af8524e349d6d7fa213
source: You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})
uk: Ви ще не завершили авторизацію цього розширення для використання GitHub. Чи хочете спробувати інший спосіб? ({0})

# ++CODE++5cd54bf182ab05afda0e219c101add4b96941dd2f851acc6d7e211136f05e26b
source: Your Code: {0}
uk: Ваш код: {0}

# ++CODE++030248d797725762fcfcadd8e0c074a04036fd678e4211f1d93102c47b934ad4
source: device code
uk: код пристрою

# ++CODE++f45eb99f1444e6011414403ea4059ccfe0952c1363288fd0bf4929975e12b83c
source: local server
uk: локальний сервер

# ++CODE++c5088ec1e7edb5a2484598d19d071f2549e71a5bb7525fc6d08b6f105bc7a743
source: personal access token
uk: персональний токен доступу

# ++CODE++7e9ae1524cde7a3fe3b4cb46067df4b27c189353cd4ed576f246293c5b457274
source: url handler
uk: обробник URL

# config.github-enterprise.title
source: GHE.com & GitHub Enterprise Server Authentication
uk: GHE.com та автентифікація GitHub Enterprise Server

# displayName
source: GitHub Authentication
uk: Автентифікація GitHub

# description
source: GitHub Authentication Provider
uk: Постачальник автентифікації GitHub

# config.github-enterprise.uri.description
source: The URI for your GHE.com or GitHub Enterprise Server instance. Examples: * GHE.com: `https://octocat.ghe.com` * GitHub Enterprise Server: `https://github.octocat.com` > **Note:** This should _not_ be set to a GitHub.com URI. If your account exists on GitHub.com or is a GitHub Enterprise Managed User, you do not need any additional configuration and can simply log in to GitHub.
uk: URI для вашої GHE.com або GitHub Enterprise Server інстанції. Приклади: * GHE.com: `https://octocat.ghe.com` * GitHub Enterprise Server: `https://github.octocat.com` > **Примітка:** Це _не_ повинно бути встановлено на URI GitHub.com. Якщо ваш обліковий запис існує на GitHub.com або є керованим користувачем GitHub Enterprise, вам не потрібно жодної додаткової конфігурації, і ви можете просто увійти в GitHub.

# config.github-authentication.useElectronFetch.description
source: When true, uses Electron's built-in fetch function for HTTP requests. When false, uses the Node.js global fetch function. This setting only applies when running in the Electron environment. **Note:** A restart is required for this setting to take effect.
uk: Коли істинно, використовує вбудовану функцію fetch Electron для HTTP-запитів. Коли хибно, використовує глобальну функцію fetch Node.js. Ця налаштування застосовується лише під час роботи в середовищі Electron. **Примітка:** Для того щоб це налаштування набрало чинності, потрібен перезапуск.
