Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.media-preview.xlf
Languages: uk

# ++CODE++33a0d6a1b6b09a1df187f4313cbeb6a506b462b668873981dda6a84466b236b7
source: An error occurred while loading the audio file.
uk: Сталася помилка під час завантаження аудіофайлу.

# ++CODE++faf6b56dfa9c424ead4e50cdde7f858d627d63f3594fce6c57dbe77e93c9f266
source: An error occurred while loading the image.
uk: Виникла помилка під час завантаження зображення.

# ++CODE++5098dcbf292210a7593a3b738485250bb8735f6dbcb7a089f16086c1bb5e95de
source: An error occurred while loading the video file.
uk: Виникла помилка під час завантаження відеофайлу.

# ++CODE++da7ddf10788ad8b2c59ce32996d4fbef5db2fec41b7b40d412ce5ff5a513ffb2
source: Image Binary Size
uk: Розмір бінарного зображення

# ++CODE++06894274016bb7385e9c2dc45278071dadc029f505dc03028c4c464aac549c0e
source: Image Size
uk: Розмір зображення

# ++CODE++6d2788804e695f990c6205ecbfb738e02b89e1b9e5ebb02d74fc5fef15dda328
source: Image Zoom
uk: Зум зображення

# ++CODE++644d41c066f3ea0ae7e89783f3b82f336af38aedc881ce101b0cb598a4d3942d
source: Open file using VS Code's standard text/binary editor?
uk: Відкрити файл за допомогою стандартного текстового/бінарного редактора VS Code?

# ++CODE++750941b985c890b110ce0302e53de3ddee350c0c867180643e65a822fd936977
source: Select zoom level
uk: Виберіть рівень збільшення

# ++CODE++7062794edbfb65fa1bd735820fc3f2608b7da8736d1d520753b8fbb7bca10772
source: Whole Image
uk: Весь образ

# ++CODE++cefcfd33df73bc95074f6696b04289b28a02b058aa075400d460de2a27a7a1f2
source: {0}GB
uk: {0}ГБ

# ++CODE++11d35b74d1a7beb613193a32b2bcc786a778ceba389fa44bf5bd1a2136e73874
source: {0}KB
uk: {0}КБ

# ++CODE++cc637c4f88151ee4066dc68170bc2e2d7a94ff8c915fe6e4a62a62a594ff1e46
source: {0}MB
uk: {0}МБ

# ++CODE++852c00689daa1f5267a1d153f218dbce0b667d9ac40b29120cebf7004670c555
source: {0}TB
uk: {0}ТБ

# customEditor.audioPreview.displayName
source: Audio Preview
uk: Аудіо Попередній перегляд

# command.copyImage
source: Copy
uk: Копіювати

# customEditor.imagePreview.displayName
source: Image Preview
uk: Попередній перегляд зображення

# videoPreviewerLoop
source: Loop videos over again automatically.
uk: Циклічно відтворюйте відео автоматично.

# displayName
source: Media Preview
uk: Попередній перегляд медіа

# description
source: Provides VS Code's built-in previews for images, audio, and video
uk: Надає вбудовані попередні перегляди зображень, аудіо та відео в VS Code

# videoPreviewerAutoPlay
source: Start playing videos on mute automatically.
uk: Автоматично починати відтворення відео без звуку.

# customEditor.videoPreview.displayName
source: Video Preview
uk: Попередній перегляд відео

# command.zoomIn
source: Zoom in
uk: Збільшити

# command.zoomOut
source: Zoom out
uk: Зменшити масштаб
