Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.debug-server-ready.xlf
Languages: uk

# ++CODE++504c07cf2208f8907b6a1d7673c2dfe1bd946277461131afb3064b9e93c6af3f
source: Format uri ('{0}') must contain exactly one substitution placeholder.
uk: Формат uri ('{0}') повинен містити точно один плейсхолдер для заміни.

# ++CODE++e4bdbedd7a7ce59b10b2285112be6dc791c5859e857f3924f9bedb92bd3aa424
source: Format uri ('{0}') uses a substitution placeholder but pattern did not capture anything.
uk: Формат uri ('{0}') використовує плейсхолдер для заміни, але шаблон нічого не захопив.

# debug.server.ready.uriFormat.description
source: A format string used when constructing the URI from a port number. The first '%s' is substituted with the port number.
uk: Рядок формату, що використовується при побудові URI з номера порту. Перший '%s' замінюється на номер порту.

# debug.server.ready.serverReadyAction.description
source: Act upon a URI when a server program under debugging is ready (indicated by sending output of the form 'listening on port 3000' or 'Now listening on: https://localhost:5001' to the debug console.)
uk: Дійте за URI, коли програма сервера, що підлягає налагодженню, готова (що вказується відправкою виходу у формі 'слухаючи на порту 3000' або 'Тепер слухаю на: https://localhost:5001' до консолі налагодження.)

# debug.server.ready.debugConfigName.description
source: Name of the launch configuration to run.
uk: Назва конфігурації запуску для виконання.

# debug.server.ready.action.openExternally.description
source: Open URI externally with the default application.
uk: Відкрити URI зовні за допомогою програми за замовчуванням.

# description
source: Open URI in browser if server under debugging is ready.
uk: Відкрийте URI в браузері, якщо сервер, що підлягає налагодженню, готовий.

# debug.server.ready.action.startDebugging.description
source: Run another launch configuration.
uk: Запустіть іншу конфігурацію запуску.

# displayName
source: Server Ready Action
uk: Дія готового сервера

# debug.server.ready.pattern.description
source: Server is ready if this pattern appears on the debug console. The first capture group must include a URI or a port number.
uk: Сервер готовий, якщо цей шаблон з'являється в консолі налагодження. Перша група захоплення повинна містити URI або номер порту.

# debug.server.ready.action.debugWithChrome.description
source: Start debugging with the 'Debugger for Chrome'.
uk: Почніть налагодження з 'Debugger for Chrome'.

# debug.server.ready.killOnServerStop.description
source: Stop the child session when the parent session stopped.
uk: Зупиніть сеанс дитини, коли сеанс батька зупинено.

# debug.server.ready.debugConfig.description
source: The debug configuration to run.
uk: Конфігурація налагодження для запуску.

# debug.server.ready.webRoot.description
source: Value passed to the debug configuration for the 'Debugger for Chrome'.
uk: Значення, передане до конфігурації налагодження для 'Налагоджувача для Chrome'.

# debug.server.ready.action.description
source: What to do with the URI when the server is ready.
uk: Що робити з URI, коли сервер готовий.
