Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.git.xlf
Languages: uk

# ++CODE++0d956bc1273b2c3663c075e95965229e067e6aa8baf635905a73feec866b0ce6
source: Would you like {0} to [periodically run "git fetch"]({1})?
uk: Чи хочете ви, щоб {0} [періодично виконував "git fetch"]({1})?

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
uk: Так

# ++CODE++b7574c507427572510fafa07a91288ef39adc6a9c9892311495777446419c0e9
source: Yes, Don't Show Again
uk: Так, не показувати знову

# ++CODE++08b041935798fbf6fd6ff51099ffedb140a475889986d14f5559ff8e7fc571dd
source: You
uk: Ви

# ++CODE++47875ce2a26a8c480d4dcd8cb2909680f4dfcde0c61af2c2cd73b4060efc531b
source: You are about to commit your changes without verification, this skips pre-commit hooks and can be undesirable. Are you sure to continue?
uk: Ви збираєтеся зафіксувати свої зміни без перевірки, це пропускає хуки перед фіксацією і може бути небажаним. Ви впевнені, що хочете продовжити?

# ++CODE++13e594fcc96a4ccf6489d00518d4d1f33b2da6945e9b0f42510739a1ab9bd495
source: You are about to force push your changes, this can be destructive and could inadvertently overwrite changes made by others. Are you sure to continue?
uk: Ви збираєтеся виконати примусове злиття ваших змін, це може бути руйнівним і випадково перезаписати зміни, внесені іншими. Ви впевнені, що хочете продовжити?

# ++CODE++6381ebc4662b0ef8b7baf39bfadd0dc9a0eb99d41197a856972e95b9d601bcf6
source: You are trying to commit to a protected branch and you might not have permission to push your commits to the remote. How would you like to proceed?
uk: Ви намагаєтеся зробити коміт до захищеної гілки, і у вас може не бути дозволу на відправку ваших комітів до віддаленого репозиторію. Як би ви хотіли продовжити?

# ++CODE++f68e4809fc65bd612c47b8183ca4ad4d72dd82321983cae49eeb791fd145b1e5
source: You seem to have git "{0}" installed. Code works best with git >= 2
uk: Схоже, у вас встановлено git "{0}". Код працює найкраще з git >= 2

# ++CODE++802759f1e5e53993fd0ea369ce7f0ae28138651ca90cffb363771432692e5630
source: Your local changes would be overwritten by checkout.
uk: Ваші локальні зміни будуть перезаписані при переході.

# ++CODE++4006ee78c8bf7a85704c33264a1bdfcce6e88144b698cccdfc9b73d259294da3
source: Your repository has no remotes configured to publish to.
uk: У вашому репозиторії не налаштовано жодних віддалених репозиторіїв для публікації.

# ++CODE++b85f634ce5d7b0c897cffccadc3bd1827a2b7d3022f77288e460892af9e561a2
source: Your repository has no remotes configured to pull from.
uk: У вашому репозиторії не налаштовано жодних віддалених репозиторіїв для отримання.

# ++CODE++b2cfea1b73b4855e2c9788d34218761d0345b040ca237bdc9d0d4fc2577e6be5
source: Your repository has no remotes configured to push to.
uk: У вашому репозиторії не налаштовано віддалених репозиторіїв для відправки.

# ++CODE++390f001b0ad6b35e9d11767949fbe88481014bff0abcdb95925ca74bcee7cd90
source: Your repository has no remotes.
uk: Ваш репозиторій не має віддалених.

# ++CODE++cb8ffd6d0f7ea9a6801fb00cbab832cef38984f81f5cb82e62466a34b03c6cec
source: [main] Log level: {0}
uk: [main] Рівень журналювання: {0}

# ++CODE++6d860c30453f46de10de65647895a077c88084afbadd1f9cc780ebe3e5da7c78
source: [main] Skipped found git in: "{0}"
uk: [main] Пропущено, знайдено git у: "{0}"

# ++CODE++5064b45ccbcffe9d1c7c67965efc3ae14aa199bc7278fda5bb54a022eea00c1a
source: [main] Using git "{0}" from "{1}"
uk: [main] Використання git "{0}" з "{1}"

# ++CODE++9ab88a116d4694891706a9c7377911628f9f9ef83a5a573c47afc8ea871bc9ed
source: [main] Validating found git in: "{0}"
uk: [main] Перевірка знайденого git у: "{0}"

# ++CODE++dce1905351040e792f97d8bba6273802f9053551866071596763170bc5331e12
source: branches
uk: гілки

# ++CODE++6b74890feee73b66d30aca9ed5b9946ecbdf2f3bca79be34f51737497c55a687
source: in {0}
uk: в {0}

# ++CODE++9390298f3fb0c5b160498935d79cb139aef28e1c47358b4bbba61862b9c26e59
source: no
uk: ні

# ++CODE++ed5eb9a37e2d8231af3388319b941995f6dc8755c56043d0cc52b5fe405a87de
source: now
uk: тепер

# ++CODE++4236af25239fd4c232079e761c65ed5df0edc7fbe714a18ee33d0a2f1d565c5a
source: remote branches
uk: віддалені гілки

# ++CODE++978c2f8941354cf552831bb8b5b648bb3748e83f5d0a69e3301569af01e1de93
source: tags
uk: теги

# ++CODE++8a798890fe93817163b10b5f7bd2ca4d25d84c52739a645a889c173eee7d9d3d
source: yes
uk: так

# ++CODE++87bd11c53118b1c7e013a7abab752a62a22b8ab546323fa0daa6ceae4474fadb
source: {0} (Deleted)
uk: {0} (Видалено)

# ++CODE++2902a2172b4cd18aff8b58fe9754a4d14b8f14caf5faee5f32b52092ecafbf05
source: {0} (Index)
uk: {0} (Індекс)

# ++CODE++d6bd8cfa8b318f8c3845ea4c575f6dfc48f3db10ebec956199cb5afe75ced8f7
source: {0} (Intent to add)
uk: {0} (Намір додати)

# ++CODE++aac7b4cbb9b0b84aa84433090d5b052e903003ebbe61d74bff4b1609e302f98f
source: {0} (Ours)
uk: {0} (Наші)

# ++CODE++84d560d3629f1574ce6136b005e80785cc48e18319cdaf6e8736dfdc9d5bf899
source: {0} (Theirs)
uk: {0} (Їхні)

# ++CODE++06d2d2cf7b10db10195c834f0403e5802aa68f6551afec39fdc6fb549ca73302
source: {0} (Type changed)
uk: {0} (Тип змінено)

# ++CODE++236384de21336e110098c378d5fbdee9628af5281f36a15d98daa43702757ff0
source: {0} (Untracked)
uk: {0} (Не відстежується)

# ++CODE++da0616325ba5bc9c1849caff89e19cc03b34b23ed3bc73ddfc6ac06a2db891d7
source: {0} (Working Tree)
uk: {0} (Робоче дерево)

# ++CODE++2dca5dc73e8ba33fc3d8cd45ec0b8623733b7955d43a9dafb0ed087516f1eee9
source: {0} Checkout detached...
uk: {0} Вихід з від'єднаного режиму...

# ++CODE++82a451fe75f2a900d68020e00d21556defd511eccbd8b2e5743ac8ec3168c9fa
source: {0} Commit
uk: {0} Коміт

# ++CODE++ba938268068ea08ae956bde42d00e5794a9213cfe5766936cacb2f3758b72dc0
source: {0} Commit & Push
uk: {0} Коміт та Пуш

# ++CODE++9e5f10ce1f838d861901ebb2c83f8824296843cff8472960cfafc0098182383c
source: {0} Commit & Sync
uk: {0} Коміт і синхронізація

# ++CODE++34f8bd615c01255a5815e862d415a991324737482a7d66c874f16a10427897a0
source: {0} Commit (Amend)
uk: {0} Коміт (Виправити)

# ++CODE++5ea8624f43aa58ee102eae1842f3ba8a08c5bc1e1541440e5fcf3d9c91f78463
source: {0} Continue
uk: {0} Продовжити

# ++CODE++4d6bf7edc6d9a7511de7bda9db83df69ab9da421048c20424b39ff79925096a4
source: {0} Create new branch from...
uk: {0} Створити нову гілку з...

# ++CODE++4d3bc698cc8781baf01a0d862b635b33737bfe96aa4f6e8b039b2aeb9528f4ea
source: {0} Create new branch...
uk: {0} Створити нову гілку...

# ++CODE++22b70b7e3d265ec2795798f823257aae227228dc4191a3cc85fd00bd2f368f3a
source: {0} Fetch all remotes
uk: {0} Отримати всі віддалені репозиторії

# ++CODE++81ad1e4c7e769dcad02d582dd25ee2810c51cc4989b92b5d32a2f1e5467d9927
source: {0} Publish Branch
uk: {0} Опублікувати Branch

# ++CODE++da089f5ddfe606c3dc6f961bcb1316e41e11cf382afe908f8371b88e97b89225
source: {0} Sync Changes{1}{2}
uk: {0} Синхронізувати зміни{1}{2}

# ++CODE++8de94f809d2ce26a9db6bd5c9e3fe247254b40c6888ad3044050a147374dbd91
source: {0} characters over {1} in current line
uk: {0} символів перевищує {1} в поточному рядку

# ++CODE++c77c42f325ee1fe3c04aa4061c5aadfd1bb0ac5ec72f3d2cf23c1933243ed847
source: {0} day
uk: {0} день

# ++CODE++f953a25f9feb9a437798b7f324364ceb56d05155c68c0f3e0ea69c38dfb6c715
source: {0} day ago
uk: {0} день тому

# ++CODE++af78beb0f18b89744fe85d078a800f5010eb99e137cae4c48d3108788192554c
source: {0} days
uk: {0} днів

# ++CODE++bef5eece28e55dc1d5ca78841c0df1d32bf45f71b3e599461ba7acd3e6d49aa3
source: {0} days ago
uk: {0} днів тому

# ++CODE++6c0d74a13b12a7fd7878aa459321c52c7c5489a54a9e85b4b25d160bb9ff68de
source: {0} deletions{1}
uk: {0} видалень{1}

# ++CODE++7e844d1e34e6b4bb70081f826c97b4baebdcb60b0e63067a8314829e5cf15268
source: {0} deletion{1}
uk: {0} видалення{1}

# ++CODE++497ca56904bbe28486e3f2b7cb5070a295e67e26b15cceb68677fc04f6c5b193
source: {0} file changed
uk: {0} файл змінено

# ++CODE++4591934f7b00a4bcd9220db0150152410fc736a0474c4c3a0ada9d7249fc09ff
source: {0} files changed
uk: {0} файлів змінено

# ++CODE++b98deb431995125e0676abe064424b71f2660d34a32506c9e5d8cee62cbde043
source: {0} hour
uk: {0} година

# ++CODE++27441a3a40ba18bf113af3c7488c4d1381343fee2fe43a3d2a155092d21db5d5
source: {0} hour ago
uk: {0} годину тому

# ++CODE++4d0aa096b452cc31a8af301c8be13f063e844ea9eb454fa6e721158ce6f685b1
source: {0} hours
uk: {0} годин

# ++CODE++d8431d4e0c7e77ad61b0df5e06cbef553b8f735e69523bfc9ac36624c95ec0f3
source: {0} hours ago
uk: {0} годин тому

# ++CODE++25e4773a530945af1d489ddcb2269dfe8a3758f1ed9f979539af80d9ece9403c
source: {0} hr
uk: {0} год

# ++CODE++b7fe402d9d103760660b462ecea28174a8cc732a5437a5788ae50a52d0b979b2
source: {0} hr ago
uk: {0} год тому

# ++CODE++cfcaa4ecc444284892ddd3e928b03e687f17c27ad94af7415eac1c60798f55d8
source: {0} hrs
uk: {0} год

# ++CODE++dd9d25fd4b15ca8a3427c076e80538dea69da78cbb551f388792906cf784826b
source: {0} hrs ago
uk: {0} годин тому

# ++CODE++176c98c9cce6ee97d7d4bc97074cb8543f1578c930e15a585a50b07c00bd619b
source: {0} insertions{1}
uk: {0} вставок{1}

# ++CODE++cf689a6c3a2752245a18bf2225f70a2cd798553864f75f0ab746776b4231cf0e
source: {0} insertion{1}
uk: {0} вставка{1}

# ++CODE++96d15cf84b61a585c303169c0cf02914bf046268787391b33df3ff8855f28e12
source: {0} min
uk: {0} хв

# ++CODE++dcf6607f29a2da310221d537903a5d56800db26d049851e4f6f970cdc011839e
source: {0} min ago
uk: {0} хв. тому

# ++CODE++f2911f0fca142b3d2605432eb380d1e19a2888246d639243ebf3c7b24035bc39
source: {0} mins
uk: {0} хв

# ++CODE++1d888811236b0e7981a424415e023fe2465c8c214292e68686168dc376f3da96
source: {0} mins ago
uk: {0} хв. тому

# ++CODE++e0ff44285501888d7b19b2a5c0ddc9015e91cac3b9fc8990281125289f2fd178
source: {0} minute
uk: {0} хвилина

# ++CODE++684688913a057a85a4b659213cd4184c77796ba3783ffd3065f13cea7b05414a
source: {0} minute ago
uk: {0} хвилину тому

# ++CODE++870861055d0ea88d5c10f1c312e5151ca9a4590e94a2370e689740f444707d0d
source: {0} minutes
uk: {0} хвилин

# ++CODE++e33faefcf9927365bfe1d9bc6ae4b21c7b93eeb5505c794fbef16da32eeb120c
source: {0} minutes ago
uk: {0} хвилин тому

# ++CODE++ab4fc08fa470f6fcb8e90da7281a4c9b021514b17207999ac19c018e4d142ba0
source: {0} mo
uk: {0} міс

# ++CODE++04b807500b72751d8ecf07d5240c5be8521a4fb10146b49c88e65871ddedb639
source: {0} mo ago
uk: {0} міс. тому

# ++CODE++78ea1e32280208c86318f74217e2f1740638e9438a16df75ba059b15fe27417c
source: {0} month
uk: {0} місяць

# ++CODE++570df6c7d5c4ec14a9bf2ee92695694371b10ef023e1422382aad0c45e51127c
source: {0} month ago
uk: {0} місяць тому

# ++CODE++89f61e00556da50f794abbdf7334b57ec49101d4879ef32cc58e8c46134256c5
source: {0} months
uk: {0} місяців

# ++CODE++545e225eab6195d29957f686b7aff3ac1d559934b09677d2747459c2ba720e1f
source: {0} months ago
uk: {0} місяців тому

# ++CODE++60a7ff2ea9d632a135b3de61a5847efbf090d292543904d11b8626b2f30181c5
source: {0} mos
uk: {0} міс

# ++CODE++7459888ba58a755dd23971ab9da39d080f0f166da8c21328b602e638679aeed7
source: {0} mos ago
uk: {0} міс. тому

# ++CODE++9685e9b68282af704b8ed36b2b9bc007461f0b31f6037276ebc6bf2e6851579f
source: {0} sec
uk: {0} сек

# ++CODE++c73785072b9ad566584477cf56c91a7f9088df94bde3494a379b5d6ca22fd805
source: {0} sec ago
uk: {0} сек тому

# ++CODE++2e07f3459763fa3bf8a47c728aac58754dbc91a5b970c3b53aff9e175747c7b8
source: {0} second
uk: {0} секунда

# ++CODE++c64fbda0715224a52bf58739a6d91815918d6bea9cdb6e5348ad635dfc7e485c
source: {0} second ago
uk: {0} секунду тому

# ++CODE++e549e94bc93ccaf7a5a9c81955f15a453eb0b35a7239e3b97d89a972b12aaf17
source: {0} seconds
uk: {0} секунд

# ++CODE++ae8728cb37fc106de415a7d267ef1a4b139f66bfc298a2149d38142e51ca6ddb
source: {0} seconds ago
uk: {0} секунд тому

# ++CODE++a141558f162aa73732c8423e2ccc3b348168d8847d7b6759eb4c15b788892245
source: {0} secs
uk: {0} сек

# ++CODE++053940c0cc955c65c9e1f05b3d7f9023a77d98950fe9e5cc252cd432e718e404
source: {0} secs ago
uk: {0} сек. тому

# ++CODE++e29acd5ebd8086962afd4a8a4f771d3b8ee2b13cffd9c9345ce6e859665006de
source: {0} week
uk: {0} тиждень

# ++CODE++a05c87789ba69a2fc300445b75e5222311c255d9bf2c0ed75914dfa020ac443f
source: {0} week ago
uk: {0} тиждень тому

# ++CODE++b5a2d2f7a2393284a7d3bb11539b0924e87634241d21813205564dc4edf0d453
source: {0} weeks
uk: {0} тижнів

# ++CODE++3b75f80451a8ed57c5ffaf6869ed8069e6defe09e5310fef5b849860a502a40f
source: {0} weeks ago
uk: {0} тижнів тому

# ++CODE++0477b98fa0aa7c6db9246ea5e17299612cf31abe4719693a6c9e32dedffecfe2
source: {0} wk
uk: {0} тиж

# ++CODE++fab70bb9a5b2ccc630b25ad0c48a7a577b69aaea6b74b71d280e41165ab03b0c
source: {0} wk ago
uk: {0} тиждень тому

# ++CODE++8a9199da8355324f704fbd68efd1760e4cd62004be2e10079711ec8d27a5355b
source: {0} wks
uk: {0} тиж.

# ++CODE++be91091cc8687f32bafe335c17f8aeacc7afb7799fc763556d2e77058c2f9911
source: {0} wks ago
uk: {0} тижнів тому

# ++CODE++7cff3769579b256223eb3bfaceed6da18f16085fef4f01a798cab6964d94ae8a
source: {0} year
uk: {0} рік

# ++CODE++b757861cb4c8796d60b82167dc5596cea0dbcc4b453ef3ad5b92e91a57df6781
source: {0} year ago
uk: {0} рік тому

# ++CODE++dc0676cebd7cc904c24f568c9a897096b21b53ac8548ec30b5e6b09c82b1de36
source: {0} years
uk: {0} років

# ++CODE++912509dcc5c8fb64ce0c630d1051f784d77fe16f87f6d8c3b606a7850117ca45
source: {0} years ago
uk: {0} років тому

# ++CODE++6b41836e10d658d5d77a1f4b28be63ae0e6e0f8f2ea23717b6997aa928063ee6
source: {0} yr
uk: {0} р.

# ++CODE++74473101bd35e187c89a4eb6d6dec4eaebc1ec9a97a27eeddb684962fa5f877d
source: {0} yr ago
uk: {0} р. тому

# ++CODE++892a0eaf0ac1f2cf390ebf2f2aec6d9e576aebfe5a76ce25c50921fe6ae9b61f
source: {0} yrs
uk: {0} років

# ++CODE++6bf6132dfe816dc6a2b022115ed31ed7692c605299b2912dab52a4eb8e4fb9b5
source: {0} yrs ago
uk: {0} р. тому

# view.workbench.scm.repositoryInParentFolders
source: A Git repository was found in the parent folders of the workspace or the open file(s). [Open Repository](command:git.openRepositoriesInParentFolders) Use the [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) setting to control whether Git repositories in parent folders of workspaces or open files are opened. To learn more [read our docs](https://aka.ms/vscode-git-repository-in-parent-folders).
uk: У батьківських папках робочого простору або відкритих файлів знайдено репозиторій Git. [Відкрити репозиторій](command:git.openRepositoriesInParentFolders) Використовуйте налаштування [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D), щоб контролювати, чи відкриваються репозиторії Git у батьківських папках робочих просторів або відкритих файлів. Щоб дізнатися більше, [прочитайте нашу документацію](https://aka.ms/vscode-git-repository-in-parent-folders).

# view.workbench.scm.closedRepository
source: A Git repository was found that was previously closed. [Reopen Closed Repository](command:git.reopenClosedRepositories) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Було знайдено репозиторій Git, який раніше був закритий. [Відкрити закритий репозиторій](command:git.reopenClosedRepositories) Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# config.branchRandomNameDictionary.adjectives
source: A random adjective
uk: Випадковий прикметник

# config.branchRandomNameDictionary.animals
source: A random animal name
uk: Випадкове ім'я тварини

# config.branchRandomNameDictionary.colors
source: A random color name
uk: Випадкова назва кольору

# config.branchRandomNameDictionary.numbers
source: A random number between 100 and 999
uk: Випадкове число між 100 і 999

# config.branchValidationRegex
source: A regular expression to validate new branch names.
uk: Регулярний вираз для валідації нових імен гілок.

# command.cherryPickAbort
source: Abort Cherry Pick
uk: Скасувати вибір вишні

# command.mergeAbort
source: Abort Merge
uk: Скасувати злиття

# command.rebaseAbort
source: Abort Rebase
uk: Скасувати перебазування

# command.commitMessageAccept
source: Accept Commit Message
uk: Прийняти повідомлення коміту

# command.addRemote
source: Add Remote...
uk: Додати віддалений...

# command.ignore
source: Add to .gitignore
uk: Додати до .gitignore

# config.untrackedChanges.mixed
source: All changes, tracked and untracked, appear together and behave equally.
uk: Усі зміни, відстежені та не відстежені, з'являються разом і поводяться однаково.

# config.branchProtectionPrompt.alwaysCommitToNewBranch
source: Always commit changes to a new branch.
uk: Завжди фіксуйте зміни в новій гілці.

# config.branchProtectionPrompt.alwaysCommit
source: Always commit changes to the protected branch.
uk: Завжди фіксуйте зміни в захищеній гілці.

# config.confirmEmptyCommits
source: Always confirm the creation of empty commits for the 'Git: Commit Empty' command.
uk: Завжди підтверджуйте створення порожніх комітів для команди 'Git: Commit Empty'.

# config.openRepositoryInParentFolders.always
source: Always open a repository in parent folders of workspaces or open files.
uk: Завжди відкривайте репозиторій у батьківських папках робочих просторів або відкритих файлів.

# config.openAfterClone.alwaysNewWindow
source: Always open in a new window.
uk: Завжди відкривати в новому вікні.

# config.openAfterClone.always
source: Always open in current window.
uk: Завжди відкривати в поточному вікні.

# config.branchProtectionPrompt.alwaysPrompt
source: Always prompt before changes are committed to a protected branch.
uk: Завжди запитувати перед внесенням змін до захищеної гілки.

# config.openAfterClone.prompt
source: Always prompt for action.
uk: Завжди запитуйте про дію.

# config.publishBeforeContinueOn.always
source: Always publish unpublished Git state when using Continue Working On from a Git repository
uk: Завжди публікуйте неопублікований стан Git при використанні Продовжити роботу з репозиторію Git

# config.alwaysShowStagedChangesResourceGroup
source: Always show the Staged Changes resource group.
uk: Завжди показувати групу ресурсів Змін, що стають.

# submenu.commit.amend
source: Amend
uk: Виправити

# command.stashApplyLatest
source: Apply Latest Stash
uk: Застосувати останній стеш

# command.stashApplyEditor
source: Apply Stash
uk: Застосувати Stash

# command.stashApply
source: Apply Stash...
uk: Застосувати Stash...

# config.replaceTagsWhenPull
source: Automatically replace the local tags with the remote tags in case of a conflict when running the pull command.
uk: Автоматично замінюйте локальні теги на віддалені теги у разі конфлікту під час виконання команди pull.

# config.smartCommitChanges.all
source: Automatically stage all changes.
uk: Автоматично підготувати всі зміни.

# config.smartCommitChanges.tracked
source: Automatically stage tracked changes only.
uk: Автоматично стадіювати лише відстежені зміни.

# submenu.branch
source: Branch
uk: Гілка

# submenu.changes
source: Changes
uk: Зміни

# config.promptToSaveFilesBeforeCommit.always
source: Check for any unsaved files.
uk: Перевірте наявність незбережених файлів.

# config.promptToSaveFilesBeforeStash.always
source: Check for any unsaved files.
uk: Перевірте наявність незбережених файлів.

# config.promptToSaveFilesBeforeCommit.staged
source: Check only for unsaved staged files.
uk: Перевірити лише незбережені підготовлені файли.

# config.promptToSaveFilesBeforeStash.staged
source: Check only for unsaved staged files.
uk: Перевіряти лише незбережені стадійовані файли.

# command.graphCheckout
source: Checkout
uk: Оформлення замовлення

# command.graphCheckoutDetached
source: Checkout (Detached)
uk: Оформлення замовлення (Відокремлене)

# command.checkoutDetached
source: Checkout to (Detached)...
uk: Перейти до (Відокремленого)...

# command.checkout
source: Checkout to...
uk: Оформлення замовлення до...

# command.graphCherryPick
source: Cherry Pick
uk: Вибірковий підбір

# command.cherryPick
source: Cherry Pick...
uk: Вибір вишень...

# command.clone
source: Clone
uk: Клон

# command.cloneRecursive
source: Clone (Recursive)
uk: Клонувати (рекурсивно)

# command.continueInLocalClone
source: Clone Repository Locally and Open on Desktop...
uk: Клонувати репозиторій локально та відкрити на робочому столі...

# command.closeAllDiffEditors
source: Close All Diff Editors
uk: Закрити всі редактори відмінностей

# command.closeAllUnmodifiedEditors
source: Close All Unmodified Editors
uk: Закрити всі незмінені редактори

# command.closeOtherRepositories
source: Close Other Repositories
uk: Закрити інші репозиторії

# command.close
source: Close Repository
uk: Закрити репозиторій

# colors.incomingAdded
source: Color for added incoming resource.
uk: Колір для доданого вхідного ресурсу.

# colors.added
source: Color for added resources.
uk: Колір для додаткових ресурсів.

# colors.incomingDeleted
source: Color for deleted incoming resource.
uk: Колір для видаленого вхідного ресурсу.

# colors.stageDeleted
source: Color for deleted resources which have been staged.
uk: Колір для видалених ресурсів, які були підготовлені.

# colors.deleted
source: Color for deleted resources.
uk: Колір для видалених ресурсів.

# colors.ignored
source: Color for ignored resources.
uk: Колір для ігнорованих ресурсів.

# colors.incomingModified
source: Color for modified incoming resource.
uk: Колір для зміненого вхідного ресурсу.

# colors.stageModified
source: Color for modified resources which have been staged.
uk: Колір для модифікованих ресурсів, які були підготовлені.

# colors.modified
source: Color for modified resources.
uk: Колір для модифікованих ресурсів.

# colors.incomingRenamed
source: Color for renamed incoming resource.
uk: Колір для перейменованого вхідного ресурсу.

# colors.renamed
source: Color for renamed or copied resources.
uk: Колір для перейменованих або скопійованих ресурсів.

# colors.conflict
source: Color for resources with conflicts.
uk: Колір для ресурсів з конфліктами.

# colors.submodule
source: Color for submodule resources.
uk: Колір для ресурсів підмодуля.

# colors.blameEditorDecoration
source: Color for the blame editor decoration.
uk: Колір для оформлення редактора провини.

# colors.untracked
source: Color for untracked resources.
uk: Колір для не відстежуваних ресурсів.

# submenu.commit
source: Commit
uk: Зобов'язатися

# command.commit
source: Commit
uk: Зобов'язатися

# command.commitAmend
source: Commit (Amend)
uk: Коміт (Виправити)

# command.commitAmendNoVerify
source: Commit (Amend, No Verify)
uk: Коміт (Змінити, Не перевіряти)

# command.commitNoVerify
source: Commit (No Verify)
uk: Зробити (Без перевірки)

# command.commitSigned
source: Commit (Signed Off)
uk: Коміт (Підписано)

# command.commitSignedNoVerify
source: Commit (Signed Off, No Verify)
uk: Коміт (Підписано, Без перевірки)

# command.commitAll
source: Commit All
uk: Зробити всі зміни

# command.commitAllAmend
source: Commit All (Amend)
uk: Зробити всі зміни (виправити)

# command.commitAllAmendNoVerify
source: Commit All (Amend, No Verify)
uk: Закомітити все (Виправити, Без перевірки)

# command.commitAllNoVerify
source: Commit All (No Verify)
uk: Зафіксувати все (без перевірки)

# command.commitAllSigned
source: Commit All (Signed Off)
uk: Затвердити все (підписано)

# command.commitAllSignedNoVerify
source: Commit All (Signed Off, No Verify)
uk: Закріпити все (Підписано, без перевірки)

# command.commitEmpty
source: Commit Empty
uk: Коміт порожній

# command.commitEmptyNoVerify
source: Commit Empty (No Verify)
uk: Зробити порожній коміт (без перевірки)

# command.commitStaged
source: Commit Staged
uk: Закріпити стадію

# command.commitStagedAmend
source: Commit Staged (Amend)
uk: Зберегти стадію (виправити)

# command.commitStagedAmendNoVerify
source: Commit Staged (Amend, No Verify)
uk: Закомітити підготовлене (Виправити, Без перевірки)

# command.commitStagedNoVerify
source: Commit Staged (No Verify)
uk: Закомітити стадійоване (без перевірки)

# command.commitStagedSigned
source: Commit Staged (Signed Off)
uk: Закріпити підготовлене (підписане)
