Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.github.xlf
Languages: uk

# ++CODE++d86a1fe1b9841b19a1bedb99698a98d1ace84c0691d23f72727c611d1dab9eb1
source: Checkout on vscode.dev
uk: Оформлення на vscode.dev

# ++CODE++749e00cf6618bc6ef3d0fbe34d822881466a634f5c7b85d166df2fb1460f0056
source: Commit Changes
uk: Зберегти зміни

# ++CODE++c3f7d962a484fc6852b9bb186da8ad49f8733ba8149dc2d1f1656f2395384d5f
source: Copy Anyway
uk: Скопіювати все одно

# ++CODE++1d7054c81ebbc585c4a95b53c549d3f3df3075479326124277b5d52323928c83
source: Copy vscode.dev Link
uk: Скопіювати посилання vscode.dev

# ++CODE++67bb3986d97428fb5b15a537d7be36e051138b64b6d34a464e34c161d20b5ef6
source: Create Fork
uk: Створити Fork

# ++CODE++72dbe6d87b077f33ab52e3c2aed214497c7136e2cdcf196e312aaf7dc42259b2
source: Create GitHub fork
uk: Створити GitHub форк

# ++CODE++3f86d646f909535716e9c7d67e2ec317acd999d263427edf7bc47371f352ab3e
source: Create PR
uk: Створити PR

# ++CODE++40714cb4c8d62cc25e4b7b09518364f294c7f8fa53930c9b62e1bb4346ff8fda
source: Creating GitHub Pull Request...
uk: Створення Pull Request на GitHub...

# ++CODE++8a30308060e629511f23b40e50fff6f3fe8c759c7805f10dcae852e557483ae2
source: Creating first commit
uk: Створення першого коміту

# ++CODE++74abb2f8b2a6b95d41d3fca2f339fe32113744a001d50d2f9787f83a554ead67
source: Forking "{0}/{1}"...
uk: Форк "{0}/{1}"...

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
uk: Дізнатися більше

# ++CODE++e3e4bd64cdeb80cce6901d2b155f16e51b36db5d01952c893be3e7fa3eb1b094
source: Log level: {0}
uk: Рівень журналу: {0}

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
uk: Ні

# ++CODE++28f685a1d1c3c15c06c6948afc8f2a0408b57bff6aab2c156de52d504da794a0
source: No GitHub remotes found that contain this commit.
uk: Не знайдено жодних віддалених репозиторіїв GitHub, які містять цей коміт.

# ++CODE++46b57ee92f038c976849af46defe76dce5b0d94bd5d5dd9aefd9c977168994d2
source: No template
uk: Немає шаблону

# ++CODE++04c24026b2f00d817b610318ab2e984393c65576e67b591fb8fb0467f5aef0cb
source: Open PR
uk: Відкрити PR

# ++CODE++03f69885814b5b7aa5e4758e46733da443a237e2ec63488bddd230f501ff166a
source: Open on GitHub
uk: Відкрити на GitHub

# ++CODE++c2d7034e0705b4fa8410131e09737dcc3bf100bfe7b2fd4e9bda19c8fdfcf706
source: Pick a folder to publish to GitHub
uk: Виберіть папку для публікації на GitHub

# ++CODE++315c9de4ac8d9c65a655c7ee97769a717d722f088cc57ae9e2bb31a6e13ed6b1
source: Publish Branch & Copy Link
uk: Опублікувати гілку та скопіювати посилання

# ++CODE++ff325a263ba2bf640ad310aac0157e2ab1e914af50b7c90aca33b3ec1a6418d2
source: Publishing to a private GitHub repository
uk: Публікація в приватному репозиторії GitHub

# ++CODE++402aca48e6c95d598db68ba033ba94a03d5c89bd1e4018b7f7d03cd80232e151
source: Publishing to a public GitHub repository
uk: Публікація в публічний репозиторій GitHub

# ++CODE++3efa2b693f70770f6b0a87a26c884aa1e33272cadec117475496d9b807289418
source: Pull Changes & Copy Link
uk: Витягти зміни та скопіювати посилання

# ++CODE++b1db51133e798b6d1e814ba3396efd34e25fd90d634d3fe2c45eb887339fd96d
source: Push Commits & Copy Link
uk: Відправити коміти та скопіювати посилання

# ++CODE++b4f88174aa8c81ad123aa91aab2874461815c0bee933bc0d8c4e425590502086
source: Pushing changes...
uk: Відправка змін...

# ++CODE++33ce05333fa741dd0941c98cd40653d0f01da6b0e9091fc514191492f081276f
source: Select the Pull Request template
uk: Виберіть шаблон Pull Request

# ++CODE++8665219a0ee368b5e103fa4351daa520381c62e6db8938587da5e56368932b34
source: Select which files should be included in the repository.
uk: Виберіть, які файли повинні бути включені до репозиторію.

# ++CODE++500a3a3913bda423aa30078afa5ccffaf65561e9d913466be1fd6ffb8b288ee1
source: Successfully published the "{0}" repository to GitHub.
uk: Успішно опубліковано репозиторій "{0}" на GitHub.

# ++CODE++c7d2450b4ee943c676686706a250f608f409c38bacb07091221859c4f7625cb8
source: The PR "{0}/{1}#{2}" was successfully created on GitHub.
uk: PR "{0}/{1}#{2}" був успішно створений на GitHub.

# ++CODE++f8c554ff7d1b19f8c47ee06111cc8398bc443e8f9eccbf59ef4fa1cfdb3a1691
source: The current branch has unpublished commits. Would you like to push your commits before copying a link?
uk: Поточна гілка має неопубліковані коміти. Ви хочете відправити свої коміти перед копіюванням посилання?

# ++CODE++3e99fa0c55e7526900c90544f722e0914a8e2e34d69b5b4e062230ba54d62a7d
source: The current branch is not published to the remote. Would you like to publish your branch before copying a link?
uk: Поточна гілка не опублікована на віддаленому сервері. Чи хочете ви опублікувати свою гілку перед копіюванням посилання?

# ++CODE++e36fdf5ef6c1feb4c8d6198b1ac9d9a01de718df7a5d1a2316dd6603d42835ba
source: The current branch is not up to date. Would you like to pull before copying a link?
uk: Поточна гілка не оновлена. Чи бажаєте ви виконати pull перед копіюванням посилання?

# ++CODE++cebb517f9a09a8ca58501c909babf47ba1f86d3086efc6994644e93ff130c3dc
source: The current file has uncommitted changes. Please commit your changes before copying a link.
uk: Поточний файл має незбережені зміни. Будь ласка, збережіть свої зміни перед копіюванням посилання.

# ++CODE++6fd938e4b7b191acdd17fcafcb51354060699d66484d1f8c8e8c1a968a047aa1
source: The fork "{0}" was successfully created on GitHub.
uk: Форк "{0}" був успішно створений на GitHub.

# ++CODE++37d313e3a81b51f2de476a8d103104ece5b840310539c67c6fcdc4b8b7ea9288
source: Uploading files
uk: Завантаження файлів

# ++CODE++118a91e39aa09dae8376164229e12d32da9b66b706deaf0106fec09727e7ed08
source: You don't have permissions to push to "{0}/{1}" on GitHub. Would you like to create a fork and push to it instead?
uk: У вас немає прав на пуш до "{0}/{1}" на GitHub. Чи хочете ви створити форк і пушити в нього замість цього?

# ++CODE++74eaf8e11b63d8588e44dd9f1c8b7002d0d6a18dcc2e6d6086e93ad3f5168f1b
source: Your push to "{0}/{1}" was rejected by GitHub because push protection is enabled and one or more secrets were detected.
uk: Ваше відправлення на "{0}/{1}" було відхилено GitHub, оскільки захист від відправлень увімкнено, і було виявлено один або кілька секретів.

# ++CODE++90cb41a4b595436757fc7759a09e7baec6dda9866085796767235cd904ec1b14
source: {0} Open on GitHub
uk: {0} Відкрити на GitHub

# config.gitAuthentication
source: Controls whether to enable automatic GitHub authentication for git commands within VS Code.
uk: Контролює, чи слід увімкнути автоматичну аутентифікацію GitHub для git-команд у VS Code.

# config.branchProtection
source: Controls whether to query repository rules for GitHub repositories
uk: Контролює, чи запитувати правила репозиторіїв для репозиторіїв GitHub

# config.showAvatar
source: Controls whether to show the GitHub avatar of the commit author in various hovers (ex: Git blame, Timeline, Source Control Graph, etc.)
uk: Контролює, чи показувати аватар GitHub автора коміту в різних підказках (наприклад: Git blame, Хронологія, Граф контролю версій тощо).

# config.gitProtocol
source: Controls which protocol is used to clone a GitHub repository
uk: Контролює, який протокол використовується для клонування репозиторію GitHub

# command.copyVscodeDevLink
source: Copy vscode.dev Link
uk: Скопіювати посилання vscode.dev

# description
source: GitHub features for VS Code
uk: Функції GitHub для VS Code

# command.openOnVscodeDev
source: Open in vscode.dev
uk: Відкрити в vscode.dev

# command.openOnGitHub
source: Open on GitHub
uk: Відкрити на GitHub

# command.publish
source: Publish to GitHub
uk: Опублікувати на GitHub

# welcome.publishWorkspaceFolder
source: You can directly publish a workspace folder to a GitHub repository. Once published, you'll have access to source control features powered by Git and GitHub. [$(github) Publish to GitHub](command:github.publish)
uk: Ви можете безпосередньо опублікувати папку робочого простору в репозиторії GitHub. Після публікації ви отримаєте доступ до функцій контролю версій, які забезпечуються Git та GitHub. [$(github) Опублікувати на GitHub](command:github.publish)

# welcome.publishFolder
source: You can directly publish this folder to a GitHub repository. Once published, you'll have access to source control features powered by Git and GitHub. [$(github) Publish to GitHub](command:github.publish)
uk: Ви можете безпосередньо опублікувати цю папку в репозиторій GitHub. Після публікації ви отримаєте доступ до функцій контролю версій, які забезпечуються Git та GitHub. [$(github) Опублікувати на GitHub](command:github.publish)
