Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-extensions/*/vscode.git.xlf
Languages: uk

# command.commitStagedSignedNoVerify
source: Commit Staged (Signed Off, No Verify)
uk: Закріпити стадію (Підписано, без перевірки)

# config.enableSmartCommit
source: Commit all changes when there are no staged changes.
uk: Зафіксуйте всі зміни, коли немає підготовлених змін.

# command.timelineCompareWithSelected
source: Compare with Selected
uk: Порівняти з обраним

# command.git.acceptMerge
source: Complete Merge
uk: Завершити злиття

# command.git.runGitMerge
source: Compute Conflicts With Git
uk: Обчислити конфлікти з Git

# command.git.runGitMergeDiff3
source: Compute Conflicts With Git (Diff3)
uk: Обчислити конфлікти з Git (Diff3)

# config.autoRepositoryDetection
source: Configures when repositories should be automatically detected.
uk: Налаштовує, коли репозиторії повинні бути автоматично виявлені.

# config.confirmSync
source: Confirm before synchronizing Git repositories.
uk: Підтвердіть перед синхронізацією репозиторіїв Git.

# command.continueInLocalClone.qualifiedName
source: Continue Working in New Local Clone
uk: Продовжити роботу в новому локальному клоні

# config.openRepositoryInParentFolders
source: Control whether a repository in parent folders of workspaces or open files should be opened.
uk: Контролюйте, чи слід відкривати репозиторій у батьківських папках робочих просторів або відкритих файлах.

# config.smartCommitChanges
source: Control which changes are automatically staged by Smart Commit.
uk: Контролюйте, які зміни автоматично підготовлені Smart Commit.

# config.statusLimit
source: Controls how to limit the number of changes that can be parsed from Git status command. Can be set to 0 for no limit.
uk: Контролює, як обмежити кількість змін, які можуть бути розібрані з команди Git status. Може бути встановлено на 0 для відсутності обмеження.

# config.untrackedChanges
source: Controls how untracked changes behave.
uk: Контролює, як поводяться непідраховані зміни.

# config.countBadge
source: Controls the Git count badge.
uk: Контролює значок лічильника Git.

# config.inputValidationLength
source: Controls the commit message length threshold for showing a warning.
uk: Контролює поріг довжини повідомлення коміту для відображення попередження.

# config.inputValidationSubjectLength
source: Controls the commit message subject length threshold for showing a warning. Unset it to inherit the value of `#git.inputValidationLength#`.
uk: Контролює поріг довжини заголовка повідомлення коміту для відображення попередження. Скиньте його, щоб успадкувати значення `#git.inputValidationLength#`.

# config.repositoryScanMaxDepth
source: Controls the depth used when scanning workspace folders for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`. Can be set to `-1` for no limit.
uk: Контролює глибину, що використовується під час сканування папок робочого простору на наявність Git-репозиторіїв, коли `#git.autoRepositoryDetection#` встановлено на `true` або `subFolders`. Може бути встановлено на `-1` для безмежного сканування.

# config.commitShortHashLength
source: Controls the length of the commit short hash.
uk: Контролює довжину короткого хешу коміту.

# config.detectSubmodulesLimit
source: Controls the limit of Git submodules detected.
uk: Контролює межу виявлених підмодулів Git.

# config.diagnosticsCommitHook.Sources
source: Controls the list of sources (**Item**) and the minimum severity (**Value**) to be considered before committing. **Note:** To ignore diagnostics from a particular source, add the source to the list and set the minimum severity to `none`.
uk: Контролює список джерел (**Item**) та мінімальну серйозність (**Value**), які потрібно врахувати перед комітом. **Примітка:** Щоб ігнорувати діагностику з певного джерела, додайте джерело до списку та встановіть мінімальну серйозність на `none`.

# config.alwaysSignOff
source: Controls the signoff flag for all commits.
uk: Контролює прапорець затвердження для всіх комітів.

# config.branchSortOrder
source: Controls the sort order for branches.
uk: Контролює порядок сортування для філій.

# config.similarityThreshold
source: Controls the threshold of the similarity index (the amount of additions/deletions compared to the file's size) for changes in a pair of added/deleted files to be considered a rename. **Note:** Requires Git version `2.18.0` or later.
uk: Контролює поріг індексу схожості (кількість додатків/видалень у порівнянні з розміром файлу) для того, щоб зміни в парі доданих/видалених файлів вважалися перейменуванням. **Примітка:** Потребує версії Git `2.18.0` або новішої.

# config.discardAllScope
source: Controls what changes are discarded by the `Discard all changes` command. `all` discards all changes. `tracked` discards only tracked files. `prompt` shows a prompt dialog every time the action is run.
uk: Контролює, які зміни скидаються командою `Скинути всі зміни`. `all` скидає всі зміни. `tracked` скидає лише відстежувані файли. `prompt` показує діалогове вікно запиту щоразу, коли виконується дія.

# config.checkoutType
source: Controls what type of Git refs are listed when running `Checkout to...`.
uk: Контролює, які типи Git refs відображаються під час виконання `Checkout to...`.

# config.useIntegratedAskPass
source: Controls whether GIT_ASKPASS should be overwritten to use the integrated version.
uk: Контролює, чи слід переписувати GIT_ASKPASS для використання інтегрованої версії.

# config.showProgress
source: Controls whether Git actions should show progress.
uk: Контролює, чи повинні дії Git показувати прогрес.

# config.decorations.enabled
source: Controls whether Git contributes colors and badges to the Explorer and the Open Editors view.
uk: Контролює, чи Git додає кольори та значки до перегляду Провідника та Відкритих редакторів.

# config.promptToSaveFilesBeforeCommit
source: Controls whether Git should check for unsaved files before committing.
uk: Контролює, чи повинен Git перевіряти наявність незбережених файлів перед комітом.

# config.promptToSaveFilesBeforeStash
source: Controls whether Git should check for unsaved files before stashing changes.
uk: Контролює, чи повинен Git перевіряти наявність незбережених файлів перед збереженням змін.

# config.pullBeforeCheckout
source: Controls whether a branch that does not have outgoing commits is fast-forwarded before it is checked out.
uk: Контролює, чи гілка, яка не має вихідних комітів, буде швидко переміщена вперед перед її перевіркою.

# config.useEditorAsCommitInput
source: Controls whether a full text editor will be used to author commit messages, whenever no message is provided in the commit input box.
uk: Контролює, чи буде використовуватися повноцінний текстовий редактор для написання повідомлень про коміти, коли жодне повідомлення не надано в полі введення коміту.

# config.supportCancellation
source: Controls whether a notification comes up when running the Sync action, which allows the user to cancel the operation.
uk: Контролює, чи з'являється сповіщення під час виконання дії синхронізації, що дозволяє користувачу скасувати операцію.

# config.branchProtectionPrompt
source: Controls whether a prompt is being shown before changes are committed to a protected branch.
uk: Контролює, чи відображається запит перед тим, як зміни будуть зафіксовані в захищеній гілці.

# config.branchRandomNameEnable
source: Controls whether a random name is generated when creating a new branch.
uk: Контролює, чи генерується випадкове ім'я при створенні нової гілки.

# config.showActionButton
source: Controls whether an action button is shown in the Source Control view.
uk: Контролює, чи відображається кнопка дії у вигляді джерела.

# config.allowNoVerifyCommit
source: Controls whether commits without running pre-commit and commit-msg hooks are allowed.
uk: Контролює, чи дозволені коміти без виконання хуків pre-commit та commit-msg.

# config.discardUntrackedChangesToTrash
source: Controls whether discarding untracked changes moves the file(s) to the Recycle Bin (Windows), Trash (macOS, Linux) instead of deleting them permanently. **Note:** This setting has no effect when connected to a remote or when running in Linux as a snap package.
uk: Контролює, чи скидання ненаглядованих змін переміщує файл(и) до Кошика (Windows), Смітника (macOS, Linux) замість їх постійного видалення. **Примітка:** Ця настройка не має жодного ефекту при підключенні до віддаленого або при запуску в Linux як пакет snap.

# config.allowForcePush
source: Controls whether force push (with or without lease) is enabled.
uk: Контролює, чи увімкнено примусове злиття (з або без оренди).

# config.useForcePushIfIncludes
source: Controls whether force pushing uses the safer force-if-includes variant. Note: This setting requires the `#git.useForcePushWithLease#` setting to be enabled, and Git version `2.30.0` or later.
uk: Контролює, чи використовує примусове злиття безпечніший варіант force-if-includes. Примітка: ця настройка вимагає, щоб настройка `#git.useForcePushWithLease#` була увімкнена, а версія Git була `2.30.0` або пізніше.

# config.useForcePushWithLease
source: Controls whether force pushing uses the safer force-with-lease variant.
uk: Контролює, чи використовує примусове відправлення безпечніший варіант force-with-lease.

# config.enableStatusBarSync
source: Controls whether the Git Sync command appears in the status bar.
uk: Контролює, чи з'являється команда Git Sync у рядку стану.

# config.closeDiffOnOperation
source: Controls whether the diff editor should be automatically closed when changes are stashed, committed, discarded, staged, or unstaged.
uk: Контролює, чи має диф-редактор автоматично закриватися, коли зміни зберігаються, комітяться, скасовуються, ставляться в чергу або не ставляться в чергу.

# config.openDiffOnClick
source: Controls whether the diff editor should be opened when clicking a change. Otherwise the regular editor will be opened.
uk: Контролює, чи має бути відкрито редактор змін при натисканні на зміни. В іншому випадку буде відкрито звичайний редактор.

# config.confirmNoVerifyCommit
source: Controls whether to ask for confirmation before committing without verification.
uk: Контролює, чи запитувати підтвердження перед виконанням без перевірки.

# config.confirmForcePush
source: Controls whether to ask for confirmation before force-pushing.
uk: Контролює, чи запитувати підтвердження перед примусовим пушем.

# config.detectSubmodules
source: Controls whether to automatically detect Git submodules.
uk: Контролює, чи автоматично виявляти підмодулі Git.

# config.diagnosticsCommitHook.Enabled
source: Controls whether to check for unresolved diagnostics before committing.
uk: Контролює, чи перевіряти наявність невирішених діагностик перед комітом.

# config.terminalGitEditor
source: Controls whether to enable VS Code to be the Git editor for Git processes spawned in the integrated terminal. Note: Terminals need to be restarted to pick up a change in this setting.
uk: Контролює, чи дозволити VS Code бути редактором Git для процесів Git, що запускаються в інтегрованому терміналі. Примітка: Термінали потрібно перезапустити, щоб застосувати зміни в цьому налаштуванні.

# config.terminalAuthentication
source: Controls whether to enable VS Code to be the authentication handler for Git processes spawned in the Integrated Terminal. Note: Terminals need to be restarted to pick up a change in this setting.
uk: Контролює, чи дозволити VS Code бути обробником аутентифікації для процесів Git, що запускаються в інтегрованому терміналі. Примітка: Термінали потрібно перезапустити, щоб застосувати зміни в цьому налаштуванні.

# config.openAfterClone
source: Controls whether to open a repository automatically after cloning.
uk: Контролює, чи відкривати репозиторій автоматично після клонування.

# config.optimisticUpdate
source: Controls whether to optimistically update the state of the Source Control view after running git commands.
uk: Контролює, чи оптимістично оновлювати стан перегляду джерела контролю після виконання команд git.

# config.publishBeforeContinueOn
source: Controls whether to publish unpublished Git state when using Continue Working On from a Git repository.
uk: Контролює, чи публікувати неопублікований стан Git при використанні Продовжити роботу з Git-репозиторію.

# config.requireGitUserConfig
source: Controls whether to require explicit Git user configuration or allow Git to guess if missing.
uk: Контролює, чи потрібно вимагати явну конфігурацію користувача Git, чи дозволити Git здогадуватися, якщо вона відсутня.

# config.showPushSuccessNotification
source: Controls whether to show a notification when a push is successful.
uk: Контролює, чи показувати сповіщення, коли пуш успішний.

# config.showInlineOpenFileAction
source: Controls whether to show an inline Open File action in the Git changes view.
uk: Контролює, чи показувати вбудовану дію Відкрити файл у вигляді змін Git.

# config.blameEditorDecoration.enabled
source: Controls whether to show blame information in the editor using editor decorations.
uk: Контролює, чи показувати інформацію про провину в редакторі, використовуючи декорації редактора.

# config.blameStatusBarItem.enabled
source: Controls whether to show blame information in the status bar.
uk: Контролює, чи відображати інформацію про провину в рядку стану.

# config.inputValidation
source: Controls whether to show commit message input validation diagnostics.
uk: Контролює, чи показувати діагностику валідації введення повідомлення коміту.

# config.timeline.showAuthor
source: Controls whether to show the commit author in the Timeline view.
uk: Контролює, чи показувати автора коміту в режимі перегляду Хронології.

# config.showCommitInput
source: Controls whether to show the commit input in the Git source control panel.
uk: Контролює, чи показувати введення коміту в панелі контролю версій Git.

# config.timeline.showUncommitted
source: Controls whether to show uncommitted changes in the Timeline view.
uk: Контролює, чи показувати незакріплені зміни у вигляді Хронології.

# config.useCommitInputAsStashMessage
source: Controls whether to use the message from the commit input box as the default stash message.
uk: Контролює, чи використовувати повідомлення з поля вводу коміту як повідомлення за замовчуванням для сховища.

# config.timeline.date
source: Controls which date to use for items in the Timeline view.
uk: Контролює, яку дату використовувати для елементів у вигляді Хронології.

# command.timelineCopyCommitId
source: Copy Commit ID
uk: Скопіювати ID коміту

# command.timelineCopyCommitMessage
source: Copy Commit Message
uk: Скопіювати повідомлення коміту

# config.countBadge.all
source: Count all changes.
uk: Підрахуйте всі зміни.

# config.countBadge.tracked
source: Count only tracked changes.
uk: Рахувати лише відстежені зміни.

# command.branchFrom
source: Create Branch From...
uk: Створити гілку з...

# command.branch
source: Create Branch...
uk: Створити гілку...

# command.createTag
source: Create Tag...
uk: Створити тег...

# command.graphDeleteBranch
source: Delete Branch
uk: Видалити гілку

# command.deleteBranch
source: Delete Branch...
uk: Видалити гілку...

# command.deleteRemoteBranch
source: Delete Remote Branch...
uk: Видалити віддалену гілку...

# command.deleteRemoteTag
source: Delete Remote Tag...
uk: Видалити віддалений тег...

# command.graphDeleteTag
source: Delete Tag
uk: Видалити тег

# command.deleteTag
source: Delete Tag...
uk: Видалити тег...

# config.autoRepositoryDetection.false
source: Disable automatic repository scanning.
uk: Вимкнути автоматичне сканування репозиторіїв.

# config.promptToSaveFilesBeforeCommit.never
source: Disable this check.
uk: Вимкнути цю перевірку.

# config.promptToSaveFilesBeforeStash.never
source: Disable this check.
uk: Вимкнути цю перевірку.

# command.cleanAll
source: Discard All Changes
uk: Відкинути всі зміни

# command.cleanAllTracked
source: Discard All Tracked Changes
uk: Видалити всі відстежені зміни

# command.cleanAllUntracked
source: Discard All Untracked Changes
uk: Видалити всі непідконтрольні зміни

# command.clean
source: Discard Changes
uk: Відкинути зміни

# command.commitMessageDiscard
source: Discard Commit Message
uk: Видалити повідомлення коміту

# config.postCommitCommand.none
source: Don't run any command after a commit.
uk: Не виконуйте жодної команди після коміту.

# command.stashDropAll
source: Drop All Stashes...
uk: Скинути всі сховища...

# command.stashDropEditor
source: Drop Stash
uk: Скинути запас

# command.stashDrop
source: Drop Stash...
uk: Скинути Stash...

# config.autofetchPeriod
source: Duration in seconds between each automatic git fetch, when `#git.autofetch#` is enabled.
uk: Тривалість у секундах між кожним автоматичним git fetch, коли увімкнено `#git.autofetch#`.

# config.verboseCommit
source: Enable verbose output when `#git.useEditorAsCommitInput#` is enabled.
uk: Увімкніть детальний вивід, коли `#git.useEditorAsCommitInput#` увімкнено.

# config.enableCommitSigning
source: Enables commit signing with GPG, X.509, or SSH.
uk: Дозволяє підписування комітів за допомогою GPG, X.509 або SSH.

# config.experimental.installGuide
source: Experimental improvements for the Git setup flow.
uk: Експериментальні покращення для процесу налаштування Git.

# command.fetch
source: Fetch
uk: Отримати

# command.fetchPrune
source: Fetch (Prune)
uk: Отримати (Обрізати)

# command.fetchAll
source: Fetch From All Remotes
uk: Отримати з усіх віддалених репозиторіїв

# config.pullTags
source: Fetch all tags when pulling.
uk: Отримати всі теги під час витягування.

# config.rebaseWhenSync
source: Force Git to use rebase when running the sync command.
uk: Змусьте Git використовувати rebase під час виконання команди sync.

# command.api.getRemoteSources
source: Get Remote Sources
uk: Отримати віддалені джерела

# command.api.getRepositories
source: Get Repositories
uk: Отримати репозиторії

# command.api.getRepositoryState
source: Get Repository State
uk: Отримати стан репозиторію

# description
source: Git SCM Integration
uk: Інтеграція Git SCM

# view.workbench.scm.repositoriesInParentFolders
source: Git repositories were found in the parent folders of the workspace or the open file(s). [Open Repository](command:git.openRepositoriesInParentFolders) Use the [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) setting to control whether Git repositories in parent folders of workspace or open files are opened. To learn more [read our docs](https://aka.ms/vscode-git-repository-in-parent-folders).
uk: У батьківських папках робочої області або відкритих файлів були знайдені репозиторії Git. [Відкрити репозиторій](command:git.openRepositoriesInParentFolders) Використовуйте налаштування [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D), щоб контролювати, чи відкриваються репозиторії Git у батьківських папках робочої області або відкритих файлів. Щоб дізнатися більше, [прочитайте нашу документацію](https://aka.ms/vscode-git-repository-in-parent-folders).

# view.workbench.scm.closedRepositories
source: Git repositories were found that were previously closed. [Reopen Closed Repositories](command:git.reopenClosedRepositories) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Було знайдено Git-репозиторії, які раніше були закриті. [Відкрити закриті репозиторії](command:git.reopenClosedRepositories) Щоб дізнатися більше про використання Git та контролю версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# view.workbench.scm.disabled
source: If you would like to use Git features, please enable Git in your [settings](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Якщо ви хочете використовувати функції Git, будь ласка, увімкніть Git у ваших [налаштуваннях](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# config.ignoreSubmodules
source: Ignore modifications to submodules in the file tree.
uk: Ігнорувати зміни в підмодулях у дереві файлів.

# config.ignoreLegacyWarning
source: Ignores the legacy Git warning.
uk: Ignoruє попередження про застарілий Git.

# config.ignoreWindowsGit27Warning
source: Ignores the warning when Git 2.25 - 2.26 is installed on Windows.
uk: Ігнорує попередження, коли Git 2.25 - 2.26 встановлено на Windows.

# config.ignoreMissingGitWarning
source: Ignores the warning when Git is missing.
uk: Ignoruє попередження, коли Git відсутній.

# config.ignoreRebaseWarning
source: Ignores the warning when it looks like the branch might have been rebased when pulling.
uk: Ignoruє попередження, коли виглядає так, ніби гілка могла бути перебазована під час витягування.

# config.ignoreLimitWarning
source: Ignores the warning when there are too many changes in a repository.
uk: Ignoruje попередження, коли в репозиторії занадто багато змін.

# view.workbench.scm.empty
source: In order to use Git features, you can open a folder containing a Git repository or clone from a URL. [Open Folder](command:vscode.openFolder) [Clone Repository](command:git.cloneRecursive) To learn more about how to use Git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
uk: Щоб використовувати функції Git, ви можете відкрити папку, що містить репозиторій Git, або клонувати з URL-адреси. [Відкрити папку](command:vscode.openFolder) [Клонувати репозиторій](command:git.cloneRecursive) Щоб дізнатися більше про те, як використовувати Git та контроль версій у VS Code, [прочитайте нашу документацію](https://aka.ms/vscode-scm).

# command.init
source: Initialize Repository
uk: Ініціалізувати репозиторій

# view.workbench.scm.missing
source: Install Git, a popular source control system, to track code changes and collaborate with others. Learn more in our [Git guides](https://aka.ms/vscode-scm).
uk: Встановіть Git, популярну систему контролю версій, щоб відстежувати зміни в коді та співпрацювати з іншими. Дізнайтеся більше в наших [посібниках з Git](https://aka.ms/vscode-scm).

# config.ignoredRepositories
source: List of Git repositories to ignore.
uk: Список репозиторіїв Git, які потрібно ігнорувати.

# config.branchRandomNameDictionary
source: List of dictionaries used for the randomly generated branch name. Each value represents the dictionary used to generate the segment of the branch name. Supported dictionaries: `adjectives`, `animals`, `colors` and `numbers`.
uk: Список словників, що використовуються для випадково згенерованого імені гілки. Кожне значення представляє словник, що використовується для генерації сегмента імені гілки. Підтримувані словники: `adjectives`, `animals`, `colors` та `numbers`.

# config.repositoryScanIgnoredFolders
source: List of folders that are ignored while scanning for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`.
uk: Список папок, які ігноруються під час сканування на наявність Git-репозиторіїв, коли `#git.autoRepositoryDetection#` встановлено на `true` або `subFolders`.
