Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-server/*/vs_server.xlf
Languages: uk

source: Remote CLI
uk: Віддалений CLI

# acceptLicenseTerms
source: If set, the user accepts the server license terms and the server will be started without a user prompt.
uk: Якщо встановлено, користувач приймає умови ліцензії сервера, і сервер буде запущено без запиту користувача.

# connection-token
source: A secret that must be included with all requests.
uk: Секрет, який повинен бути включений до всіх запитів.

# connection-token-file
source: Path to a file that contains the connection token.
uk: Шлях до файлу, що містить токен підключення.

# default-folder
source: The workspace folder to open when no input is specified in the browser URL. A relative or absolute path resolved against the current working directory.
uk: Папка робочого простору, яку потрібно відкрити, коли в URL браузера не вказано жодного вводу. Відносний або абсолютний шлях, що визначається відносно поточного робочого каталогу.

# default-workspace
source: The workspace to open when no input is specified in the browser URL. A relative or absolute path resolved against the current working directory.
uk: Робоча область, яка відкривається, коли в URL браузера не вказано жодного вводу. Відносний або абсолютний шлях, який розв'язується відносно поточного робочого каталогу.

# host
source: The host name or IP address the server should listen to. If not set, defaults to 'localhost'.
uk: Ім'я хоста або IP-адреса, на яку сервер має слухати. Якщо не вказано, за замовчуванням використовується 'localhost'.

# port
source: The port the server should listen to. If 0 is passed a random free port is picked. If a range in the format num-num is passed, a free port from the range (end inclusive) is selected.
uk: Порт, на якому сервер має слухати. Якщо передано 0, вибирається випадковий вільний порт. Якщо передано діапазон у форматі num-num, вибирається вільний порт з діапазону (включно з кінцем).

# server-base-path
source: The path under which the web UI and the code server is provided. Defaults to '/'.`
uk: Шлях, за яким надається веб-інтерфейс та сервер коду. За замовчуванням '/'.`

# serverDataDir
source: Specifies the directory that server data is kept in.
uk: Вказує каталог, в якому зберігаються дані сервера.

# socket-path
source: The path to a socket file for the server to listen to.
uk: Шлях до файлу сокета, на якому сервер буде слухати.

# start-server
source: Start the server when installing or uninstalling extensions. To be used in combination with 'install-extension', 'install-builtin-extension' and 'uninstall-extension'.
uk: Запустіть сервер під час встановлення або видалення розширень. Використовується в поєднанні з 'install-extension', 'install-builtin-extension' та 'uninstall-extension'.

# telemetry-level
source: Sets the initial telemetry level. Valid levels are: 'off', 'crash', 'error' and 'all'. If not specified, the server will send telemetry until a client connects, it will then use the clients telemetry setting. Setting this to 'off' is equivalent to --disable-telemetry
uk: Встановлює початковий рівень телеметрії. Дійсні рівні: 'off', 'crash', 'error' та 'all'. Якщо не вказано, сервер надсилатиме телеметрію, поки не підключиться клієнт, після чого він використовуватиме налаштування телеметрії клієнта. Встановлення цього значення на 'off' є еквівалентом --disable-telemetry.

# without-connection-token
source: Run without a connection token. Only use this if the connection is secured by other means.
uk: Запустіть без токена підключення. Використовуйте це лише в тому випадку, якщо підключення захищене іншими засобами.

# remoteExtensionLog
source: Server
uk: Сервер
