Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-setup/*/messages.xlf
Languages: uk

# AddContextMenuFiles
source: Add "Open with %1" action to Windows Explorer file context menu
uk: Додати дію "Відкрити з %1" до контекстного меню файлів Провідника Windows

# AddContextMenuFolders
source: Add "Open with %1" action to Windows Explorer directory context menu
uk: Додати дію "Відкрити з %1" до контекстного меню каталогу Провідника Windows

# AddToPath
source: Add to PATH (requires shell restart)
uk: Додати до PATH (потрібен перезапуск оболонки)

source: Additional icons:
uk: Додаткові значки:

# AssociateWithFiles
source: Register %1 as an editor for supported file types
uk: Зареєструйте %1 як редактора для підтримуваних типів файлів

# ConfirmUninstall
source: Are you sure you want to completely remove %1 and all of its components?
uk: Ви впевнені, що хочете повністю видалити %1 та всі його компоненти?

# CreateDesktopIcon
source: Create a &desktop icon
uk: Створити значок &на робочому столі

# CreateQuickLaunchIcon
source: Create a &Quick Launch icon
uk: Створити значок &Швидкого запуску

# FinishedLabel
source: Setup has finished installing [name] on your computer. The application may be launched by selecting the installed shortcuts.
uk: Встановлення [name] на вашому комп'ютері завершено. Додаток можна запустити, вибравши встановлені ярлики.

# OpenWithCodeContextMenu
source: Open w&ith %1
uk: Відкрити з %1

source: Other:
uk: Інше:

# RunAfter
source: Run %1 after installation
uk: Запустіть %1 після встановлення

# SourceFile
source: %1 Source File
uk: %1 Файл джерела

source: Updating Visual Studio Code...
uk: Оновлення Visual Studio Code...
