Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor_contrib.xlf
Languages: uk

# symbolIcon.nullForeground
source: The foreground color for null symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для нульових символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.numberForeground
source: The foreground color for number symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів номерів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.objectForeground
source: The foreground color for object symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів об'єктів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.operatorForeground
source: The foreground color for operator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів операторів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.packageForeground
source: The foreground color for package symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів пакета. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.propertyForeground
source: The foreground color for property symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів властивостей. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.referenceForeground
source: The foreground color for reference symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів посилання. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.snippetForeground
source: The foreground color for snippet symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів фрагментів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.stringForeground
source: The foreground color for string symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів рядка. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.structForeground
source: The foreground color for struct symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів структур. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.textForeground
source: The foreground color for text symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для текстових символів. Ці символи з'являються в контурах, хлібних крихтах та віджеті пропозицій.

# symbolIcon.typeParameterForeground
source: The foreground color for type parameter symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів параметрів типу. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.unitForeground
source: The foreground color for unit symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів одиниць. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.variableForeground
source: The foreground color for variable symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для змінних символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# tabMovesFocusDescriptions
source: Determines whether the tab key moves focus around the workbench or inserts the tab character in the current editor. This is also called tab trapping, tab navigation, or tab focus mode.
uk: Визначає, чи клавіша табуляції переміщує фокус по робочій області, чи вставляє символ табуляції в поточному редакторі. Це також називається захопленням табуляції, навігацією табуляції або режимом фокусу табуляції.

# toggle.tabMovesFocus
source: Toggle Tab Key Moves Focus
uk: Перемикання переміщення фокусу за допомогою клавіші Tab

# toggle.tabMovesFocus.off
source: Pressing Tab will now insert the tab character
uk: Тепер натискання Tab вставить символ табуляції

# toggle.tabMovesFocus.on
source: Pressing Tab will now move focus to the next focusable element
uk: Натискання Tab тепер перемістить фокус на наступний елемент, що може отримати фокус

# forceRetokenize
source: Developer: Force Retokenize
uk: Розробник: Примусова повторна токенізація

source: Close Banner
uk: Закрити банер

# action.unicodeHighlight.disableHighlightingInComments
source: Disable highlighting of characters in comments
uk: Вимкнути підсвічування символів у коментарях

# action.unicodeHighlight.disableHighlightingInStrings
source: Disable highlighting of characters in strings
uk: Вимкнути підсвічування символів у рядках

# action.unicodeHighlight.disableHighlightingOfAmbiguousCharacters
source: Disable highlighting of ambiguous characters
uk: Вимкнути підсвічування неоднозначних символів

# action.unicodeHighlight.disableHighlightingOfInvisibleCharacters
source: Disable highlighting of invisible characters
uk: Вимкнути підсвічування невидимих символів

# action.unicodeHighlight.disableHighlightingOfNonBasicAsciiCharacters
source: Disable highlighting of non basic ASCII characters
uk: Вимкнути підсвічування не базових ASCII-символів

# action.unicodeHighlight.showExcludeOptions
source: Show Exclude Options
uk: Показати параметри виключення

# unicodeHighlight.adjustSettings
source: Adjust settings
uk: Налаштувати параметри

# unicodeHighlight.allowCommonCharactersInLanguage
source: Allow unicode characters that are more common in the language "{0}".
uk: Дозволити символи юнікоду, які є більш поширеними в мові "{0}".

# unicodeHighlight.characterIsAmbiguous
source: The character {0} could be confused with the character {1}, which is more common in source code.
uk: Символ {0} може бути сплутаний з символом {1}, який є більш поширеним у вихідному коді.

# unicodeHighlight.characterIsAmbiguousASCII
source: The character {0} could be confused with the ASCII character {1}, which is more common in source code.
uk: Символ {0} може бути сплутаний з ASCII символом {1}, який є більш поширеним у вихідному коді.

# unicodeHighlight.characterIsInvisible
source: The character {0} is invisible.
uk: Персонаж {0} невидимий.

# unicodeHighlight.characterIsNonBasicAscii
source: The character {0} is not a basic ASCII character.
uk: Символ {0} не є базовим ASCII символом.

# unicodeHighlight.configureUnicodeHighlightOptions
source: Configure Unicode Highlight Options
uk: Налаштувати параметри підсвічування Unicode

# unicodeHighlight.disableHighlightingInComments.shortLabel
source: Disable Highlight In Comments
uk: Вимкнути виділення в коментарях

# unicodeHighlight.disableHighlightingInStrings.shortLabel
source: Disable Highlight In Strings
uk: Вимкнути виділення в рядках

# unicodeHighlight.disableHighlightingOfAmbiguousCharacters.shortLabel
source: Disable Ambiguous Highlight
uk: Вимкнути неоднозначне виділення

# unicodeHighlight.disableHighlightingOfInvisibleCharacters.shortLabel
source: Disable Invisible Highlight
uk: Вимкнути невидиме підсвічування

# unicodeHighlight.disableHighlightingOfNonBasicAsciiCharacters.shortLabel
source: Disable Non ASCII Highlight
uk: Вимкнути підсвічування не ASCII

# unicodeHighlight.excludeCharFromBeingHighlighted
source: Exclude {0} from being highlighted
uk: Виключити {0} з підсвічування

# unicodeHighlight.excludeInvisibleCharFromBeingHighlighted
source: Exclude {0} (invisible character) from being highlighted
uk: Виключити {0} (невидимий символ) з підсвічування

# unicodeHighlighting.thisDocumentHasManyAmbiguousUnicodeCharacters
source: This document contains many ambiguous unicode characters
uk: Цей документ містить багато неоднозначних символів unicode

# unicodeHighlighting.thisDocumentHasManyInvisibleUnicodeCharacters
source: This document contains many invisible unicode characters
uk: Цей документ містить багато невидимих символів юнікоду

# unicodeHighlighting.thisDocumentHasManyNonBasicAsciiUnicodeCharacters
source: This document contains many non-basic ASCII unicode characters
uk: Цей документ містить багато небазових ASCII юнікодних символів

# warningIcon
source: Icon shown with a warning message in the extensions editor.
uk: Іконка, що відображається з попереджувальним повідомленням у редакторі розширень.

# unusualLineTerminators.detail
source: The file '{0}' contains one or more unusual line terminator characters, like Line Separator (LS) or Paragraph Separator (PS). It is recommended to remove them from the file. This can be configured via `editor.unusualLineTerminators`.
uk: Файл '{0}' містить один або кілька незвичних символів завершення рядка, таких як Роздільник рядка (LS) або Роздільник абзацу (PS). Рекомендується видалити їх з файлу. Це можна налаштувати через `editor.unusualLineTerminators`.

# unusualLineTerminators.fix
source: &&Remove Unusual Line Terminators
uk: &&Видалити незвичайні термінатори рядків

# unusualLineTerminators.ignore
source: Ignore
uk: Ігнорувати

# unusualLineTerminators.message
source: Detected unusual line terminators
uk: Виявлено незвичайні термінатори рядків

# unusualLineTerminators.title
source: Unusual Line Terminators
uk: Незвичайні термінатори рядків

# overviewRulerWordHighlightForeground
source: Overview ruler marker color for symbol highlights. The color must not be opaque so as not to hide underlying decorations.
uk: Огляд кольору маркера лінійки для підсвічування символів. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# overviewRulerWordHighlightStrongForeground
source: Overview ruler marker color for write-access symbol highlights. The color must not be opaque so as not to hide underlying decorations.
uk: Огляд кольору маркера лінійки для підсвічування символів з правом запису. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# overviewRulerWordHighlightTextForeground
source: Overview ruler marker color of a textual occurrence for a symbol. The color must not be opaque so as not to hide underlying decorations.
uk: Огляд кольору маркера лінійки текстового випадку для символу. Колір не повинен бути непрозорим, щоб не приховувати підкладкові декорації.

# wordHighlight
source: Background color of a symbol during read-access, like reading a variable. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону символу під час доступу на читання, наприклад, при читанні змінної. Колір не повинен бути непрозорим, щоб не приховувати підлеглі елементи.

# wordHighlightBorder
source: Border color of a symbol during read-access, like reading a variable.
uk: Колір рамки символу під час доступу на читання, наприклад, при читанні змінної.

# wordHighlightStrong
source: Background color of a symbol during write-access, like writing to a variable. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону символу під час запису, наприклад, запису в змінну. Колір не повинен бути непрозорим, щоб не приховувати підкладкові елементи.

# wordHighlightStrongBorder
source: Border color of a symbol during write-access, like writing to a variable.
uk: Колір межі символу під час доступу на запис, наприклад, запису в змінну.

# wordHighlightText
source: Background color of a textual occurrence for a symbol. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону текстового елемента для символу. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# wordHighlightTextBorder
source: Border color of a textual occurrence for a symbol.
uk: Колір рамки текстового випадку для символу.

# wordHighlight.next.label
source: Go to Next Symbol Highlight
uk: Перейти до виділення наступного символу

# wordHighlight.previous.label
source: Go to Previous Symbol Highlight
uk: Перейти до попереднього виділення символу

# wordHighlight.trigger.label
source: Trigger Symbol Highlight
uk: Підсвічування символу тригера

# deleteInsideWord
source: Delete Word
uk: Видалити слово
