Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor_contrib.xlf
Languages: uk

# anchorSet
source: Anchor set at {0}:{1}
uk: Якір встановлено на {0}:{1}

source: Cancel Selection Anchor
uk: Скасувати якорь вибору

source: Go to Selection Anchor
uk: Перейти до якоря вибору

source: Select from Anchor to Cursor
uk: Вибрати від Якоря до Курсора

source: Selection Anchor
uk: Якір вибору

source: Set Selection Anchor
uk: Встановити якорь вибору

# miGoToBracket
source: Go to &&Bracket
uk: Перейти до &&дужки

# overviewRulerBracketMatchForeground
source: Overview ruler marker color for matching brackets.
uk: Огляд кольору маркера лінійки для відповідності дужкам.

# smartSelect.jumpBracket
source: Go to Bracket
uk: Перейти до дужки

# smartSelect.removeBrackets
source: Remove Brackets
uk: Видалити дужки

# smartSelect.selectToBracket
source: Select to Bracket
uk: Вибрати для дужки

# smartSelect.selectToBracketDescription
source: Select the text inside and including the brackets or curly braces
uk: Виберіть текст всередині та включно з дужками або фігурними дужками

# caret.moveLeft
source: Move Selected Text Left
uk: Перемістити вибраний текст вліво

# caret.moveRight
source: Move Selected Text Right
uk: Перемістити вибраний текст вправо

# transposeLetters.label
source: Transpose Letters
uk: Транспонувати літери

# actions.clipboard.copyLabel
source: Copy
uk: Копіювати

# actions.clipboard.copyWithSyntaxHighlightingLabel
source: Copy with Syntax Highlighting
uk: Копіювати з підсвічуванням синтаксису

# actions.clipboard.cutLabel
source: Cut
uk: Вирізати

# actions.clipboard.pasteLabel
source: Paste
uk: Вставити

source: Copy As
uk: Копіювати як

# miCopy
source: &&Copy
uk: &&Копіювати

# miCut
source: Cu&&t
uk: Виріза&&ти

# miPaste
source: &&Paste
uk: &&Вставити

source: Share
uk: Поділитися

# applyCodeActionFailed
source: An unknown error occurred while applying the code action
uk: Сталася невідома помилка під час застосування дії коду

# args.schema.apply
source: Controls when the returned actions are applied.
uk: Контролює, коли повернені дії застосовуються.

# args.schema.apply.first
source: Always apply the first returned code action.
uk: Завжди застосовуйте першу повернуту дію коду.

# args.schema.apply.ifSingle
source: Apply the first returned code action if it is the only one.
uk: Застосуйте першу повернуту дію коду, якщо вона є єдиною.

# args.schema.apply.never
source: Do not apply the returned code actions.
uk: Не застосовуйте повернені дії коду.

# args.schema.kind
source: Kind of the code action to run.
uk: Тип дії коду для виконання.

# args.schema.preferred
source: Controls if only preferred code actions should be returned.
uk: Контролює, чи слід повертати лише дії коду, що віддаються перевазі.

# autoFix.label
source: Auto Fix...
uk: Авто виправлення...

# editor.action.autoFix.noneMessage
source: No auto fixes available
uk: Немає доступних автоматичних виправлень

# editor.action.codeAction.noneMessage
source: No code actions available
uk: Доступні дії без коду

# editor.action.codeAction.noneMessage.kind
source: No code actions for '{0}' available
uk: Дії без коду для '{0}' недоступні

# editor.action.codeAction.noneMessage.preferred
source: No preferred code actions available
uk: Немає доступних рекомендованих дій коду

# editor.action.codeAction.noneMessage.preferred.kind
source: No preferred code actions for '{0}' available
uk: Немає доступних рекомендованих дій коду для '{0}'

# editor.action.organize.noneMessage
source: No organize imports action available
uk: Доступної дії організації імпортів немає

# editor.action.quickFix.noneMessage
source: No code actions available
uk: Доступні дії без коду

# editor.action.refactor.noneMessage
source: No refactorings available
uk: Немає доступних рефакторингів

# editor.action.refactor.noneMessage.kind
source: No refactorings for '{0}' available
uk: Немає рефакторингів для '{0}' доступних

# editor.action.refactor.noneMessage.preferred
source: No preferred refactorings available
uk: Немає доступних рекомендованих рефакторингів

# editor.action.refactor.noneMessage.preferred.kind
source: No preferred refactorings for '{0}' available
uk: Немає доступних рекомендованих рефакторингів для '{0}'

# editor.action.source.noneMessage
source: No source actions available
uk: Доступні дії джерела відсутні

# editor.action.source.noneMessage.kind
source: No source actions for '{0}' available
uk: Доступних дій джерела для '{0}' немає

# editor.action.source.noneMessage.preferred
source: No preferred source actions available
uk: Немає доступних дій з обраного джерела

# editor.action.source.noneMessage.preferred.kind
source: No preferred source actions for '{0}' available
uk: Немає доступних дій з джерела за замовчуванням для '{0}'

# fixAll.label
source: Fix All
uk: Виправити все

# fixAll.noneMessage
source: No fix all action available
uk: Немає доступних дій для виправлення всього

# organizeImports.description
source: Organize imports in the current file. Also called 'Optimize Imports' by some tools
uk: Організуйте імпорти у поточному файлі. Також називається 'Оптимізувати імпорти' деякими інструментами

# organizeImports.label
source: Organize Imports
uk: Організувати імпорти

# quickfix.trigger.label
source: Quick Fix...
uk: Швидке виправлення...

# refactor.label
source: Refactor...
uk: Рефакторинг...

# source.label
source: Source Action...
uk: Дія джерела...

# includeNearbyQuickFixes
source: Enable/disable showing nearest Quick Fix within a line when not currently on a diagnostic.
uk: Увімкнути/вимкнути показ найближчого швидкого виправлення в межах рядка, коли наразі не перебуваєте на діагностиці.

# showCodeActionHeaders
source: Enable/disable showing group headers in the Code Action menu.
uk: Увімкнути/вимкнути відображення заголовків груп у меню дій коду.

# triggerOnFocusChange
source: Enable triggering {0} when {1} is set to {2}. Code Actions must be set to {3} to be triggered for window and focus changes.
uk: Увімкніть спрацьовування {0}, коли {1} встановлено на {2}. Дії коду повинні бути встановлені на {3}, щоб спрацьовувати для змін вікна та фокуса.

# editingNewSelection
source: Context: {0} at line {1} and column {2}.
uk: Контекст: {0} на рядку {1} та колонці {2}.

# hideMoreActions
source: Hide Disabled
uk: Сховати вимкнені

# showMoreActions
source: Show Disabled
uk: Показати вимкнене

# codeAction.widget.id.convert
source: Rewrite
uk: Переписати

# codeAction.widget.id.extract
source: Extract
uk: Витягнути

# codeAction.widget.id.inline
source: Inline
uk: Вбудований

# codeAction.widget.id.more
source: More Actions...
uk: Більше дій...

# codeAction.widget.id.move
source: Move
uk: Перемістити

# codeAction.widget.id.quickfix
source: Quick Fix
uk: Швидке вирішення

# codeAction.widget.id.source
source: Source Action
uk: Джерело дії

# codeAction.widget.id.surround
source: Surround With
uk: Оточити з

# codeAction
source: Show Code Actions
uk: Показати дії коду

# codeActionAutoRun
source: Run: {0}
uk: Запустити: {0}

# codeActionWithKb
source: Show Code Actions ({0})
uk: Показати дії коду ({0})

# gutterLightbulbAIFixAutoFixWidget
source: Icon which spawns code actions menu from the gutter when there is no space in the editor and an AI fix and a quick fix is available.
uk: Іконка, яка викликає меню дій коду з бокової панелі, коли в редакторі немає місця, і доступне виправлення за допомогою ШІ та швидке виправлення.

# gutterLightbulbAIFixWidget
source: Icon which spawns code actions menu from the gutter when there is no space in the editor and an AI fix is available.
uk: Іконка, яка викликає меню дій коду з бокової панелі, коли в редакторі немає місця і доступне виправлення за допомогою ШІ.

# gutterLightbulbAutoFixWidget
source: Icon which spawns code actions menu from the gutter when there is no space in the editor and a quick fix is available.
uk: Іконка, яка відкриває меню дій коду з бокової панелі, коли в редакторі немає місця і доступне швидке виправлення.

# gutterLightbulbSparkleFilledWidget
source: Icon which spawns code actions menu from the gutter when there is no space in the editor and an AI fix and a quick fix is available.
uk: Іконка, яка відкриває меню дій коду з бокової панелі, коли в редакторі немає місця, і доступні виправлення за допомогою ШІ та швидке виправлення.

# gutterLightbulbWidget
source: Icon which spawns code actions menu from the gutter when there is no space in the editor.
uk: Іконка, яка викликає меню дій коду з бокової панелі, коли в редакторі немає місця.

# preferredcodeActionWithKb
source: Show Code Actions. Preferred Quick Fix Available ({0})
uk: Показати дії коду. Доступне бажане швидке виправлення ({0})

# placeHolder
source: Select a command
uk: Виберіть команду

# showLensOnLine
source: Show CodeLens Commands for Current Line
uk: Показати команди CodeLens для поточного рядка

# closeIcon
source: Icon to close the color picker
uk: Іконка для закриття вибору кольору

# clickToToggleColorOptions
source: Click to toggle color options (rgb/hsl/hex)
uk: Натисніть, щоб перемикати кольорові опції (rgb/hsl/hex)

# hoverAccessibilityColorParticipant
source: There is a color picker here.
uk: Тут є вибір кольору.

# hideColorPicker
source: Hide the Color Picker
uk: Сховати вибір кольору

# hideColorPickerDescription
source: Hide the standalone color picker.
uk: Сховати окремий вибір кольору.

source: Insert Color with Standalone Color Picker
uk: Вставити колір за допомогою автономного вибору кольору

# insertColorWithStandaloneColorPickerDescription
source: Insert hex/rgb/hsl colors with the focused standalone color picker.
uk: Вставте кольори hex/rgb/hsl за допомогою фокусованого окремого вибірника кольорів.

# mishowOrFocusStandaloneColorPicker
source: &&Show or Focus Standalone Color Picker
uk: &&Показати або зосередити окремий вибір кольору

source: Show or Focus Standalone Color Picker
uk: Показати або зосередити окремий вибір кольору

# showOrFocusStandaloneColorPickerDescription
source: Show or focus a standalone color picker which uses the default color provider. It displays hex/rgb/hsl colors.
uk: Показати або зосередити увагу на окремому вибірнику кольорів, який використовує стандартний постачальник кольорів. Він відображає кольори у форматах hex/rgb/hsl.

# comment.block
source: Toggle Block Comment
uk: Переключити блочний коментар

# comment.line
source: Toggle Line Comment
uk: Переключити коментар рядка

# comment.line.add
source: Add Line Comment
uk: Додати коментар до рядка

# comment.line.remove
source: Remove Line Comment
uk: Видалити коментар рядка

# miToggleBlockComment
source: Toggle &&Block Comment
uk: Переключити &&блок коментарів

# miToggleLineComment
source: &&Toggle Line Comment
uk: &&Переключити коментар рядка

# action.showContextMenu.label
source: Show Editor Context Menu
uk: Показати контекстне меню редактора

# context.minimap.minimap
source: Minimap
uk: Мінікарта

# context.minimap.renderCharacters
source: Render Characters
uk: Відобразити персонажів

# context.minimap.size
source: Vertical size
uk: Вертикальний розмір

# context.minimap.size.fill
source: Fill
uk: Заповнити

# context.minimap.size.fit
source: Fit
uk: Підходить

# context.minimap.size.proportional
source: Proportional
uk: Пропорційний

# context.minimap.slider
source: Slider
uk: Слайдер

# context.minimap.slider.always
source: Always
uk: Завжди

# context.minimap.slider.mouseover
source: Mouse Over
uk: Наведіть курсор

source: Cursor Redo
uk: Повторити курсор

source: Cursor Undo
uk: Скасування курсора

source: Paste As...
uk: Вставити як...

# pasteAs.kind
source: The kind of the paste edit to try pasting with. If there are multiple edits for this kind, the editor will show a picker. If there are no edits of this kind, the editor will show an error message.
uk: Тип редагування вставки, який слід спробувати вставити. Якщо є кілька редагувань цього типу, редактор відобразить вибір. Якщо редагувань цього типу немає, редактор відобразить повідомлення про помилку.

# pasteAs.preferences
source: List of preferred paste edit kind to try applying. The first edit matching the preferences will be applied.
uk: Список переважних видів редагування вставки для спроби застосування. Перше редагування, що відповідає перевагам, буде застосовано.

source: Paste as Text
uk: Вставити як текст

# noPreferences
source: empty
uk: порожній

# pasteAsDefault
source: Configure default paste action
uk: Налаштувати дію вставки за замовчуванням

# pasteAsError
source: No paste edits for '{0}' found
uk: Не знайдено редагувань вставки для '{0}'

# pasteAsPickerPlaceholder
source: Select Paste Action
uk: Виберіть дію вставки

# pasteAsProgress
source: Running paste handlers
uk: Запуск обробників пасти

# pasteIntoEditorProgress
source: Running paste handlers. Click to cancel and do basic paste
uk: Запуск обробників вставки. Натисніть, щоб скасувати та виконати базову вставку

# pasteWidgetVisible
source: Whether the paste widget is showing
uk: Чи відображається віджет вставки

# postPasteWidgetTitle
source: Show paste options...
uk: Показати параметри вставки...

# resolveProcess
source: Resolving paste edit for '{0}'. Click to cancel
uk: Вирішення редагування вставки для '{0}'. Натисніть, щоб скасувати

# defaultDropProvider.uriList.path
source: Insert Path
uk: Вставити шлях

# defaultDropProvider.uriList.paths
source: Insert Paths
uk: Вставити шляхи

# defaultDropProvider.uriList.relativePath
source: Insert Relative Path
uk: Вставити відносний шлях

# defaultDropProvider.uriList.relativePaths
source: Insert Relative Paths
uk: Вставити відносні шляхи

# defaultDropProvider.uriList.uri
source: Insert Uri
uk: Вставте Uri

# defaultDropProvider.uriList.uris
source: Insert Uris
uk: Вставте Uris

# pasteHtmlLabel
source: Insert HTML
uk: Вставити HTML

# text.label
source: Insert Plain Text
uk: Вставити простий текст

# dropIntoEditorProgress
source: Running drop handlers. Click to cancel
uk: Запуск обробників скидання. Натисніть, щоб скасувати

# dropWidgetVisible
source: Whether the drop widget is showing
uk: Чи відображається віджет випаду

# postDropWidgetTitle
source: Show drop options...
uk: Показати варіанти скидання...

# applyError
source: Error applying edit '{0}': {1}
uk: Помилка застосування редагування '{0}': {1}

# resolveError
source: Error resolving edit '{0}': {1}
uk: Помилка при вирішенні редагування '{0}': {1}

# cancellableOperation
source: Whether the editor runs a cancellable operation, e.g. like 'Peek References'
uk: Чи виконує редактор скасовувану операцію, наприклад, як 'Переглянути посилання'

# findMatchAction.goToMatch
source: Go to Match...
uk: Перейти до матчу...

# findMatchAction.inputPlaceHolder
source: Type a number to go to a specific match (between 1 and {0})
uk: Введіть номер, щоб перейти до конкретного матчу (між 1 та {0})

# findMatchAction.inputValidationMessage
source: Please type a number between 1 and {0}
uk: Будь ласка, введіть число між 1 та {0}

# findMatchAction.noResults
source: No matches. Try searching for something else.
uk: Немає збігів. Спробуйте пошукати щось інше.

# findNextMatchAction
source: Find Next
uk: Знайти далі

# findPreviousMatchAction
source: Find Previous
uk: Знайти попереднє

# miFind
source: &&Find
uk: &&Знайти

# miReplace
source: &&Replace
uk: &&Замінити

# nextSelectionMatchFindAction
source: Find Next Selection
uk: Знайти наступний вибір

# previousSelectionMatchFindAction
source: Find Previous Selection
uk: Знайти попередній вибір

# startFindAction
source: Find
uk: Знайти

# startFindWithArgsAction
source: Find with Arguments
uk: Знайти з аргументами

# startFindWithSelectionAction
source: Find with Selection
uk: Знайти з вибором

# startReplace
source: Replace
uk: Замінити

# too.large.for.replaceall
source: The file is too large to perform a replace all operation.
uk: Файл занадто великий, щоб виконати операцію заміни всіх.

# ariaSearchNoResult
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# ariaSearchNoResultEmpty
source: {0} found
uk: {0} знайдено

# ariaSearchNoResultWithLineNum
source: {0} found for '{1}', at {2}
uk: {0} знайдено для '{1}', на {2}

# ariaSearchNoResultWithLineNumNoCurrentMatch
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# findCollapsedIcon
source: Icon to indicate that the editor find widget is collapsed.
uk: Іконка, що вказує на те, що віджет пошуку редактора згорнутий.

# findExpandedIcon
source: Icon to indicate that the editor find widget is expanded.
uk: Іконка, що вказує на те, що віджет пошуку редактора розгорнуто.

# findNextMatchIcon
source: Icon for 'Find Next' in the editor find widget.
uk: Іконка для 'Знайти наступне' у віджеті пошуку редактора.

# findPreviousMatchIcon
source: Icon for 'Find Previous' in the editor find widget.
uk: Іконка для 'Знайти попередній' у віджеті пошуку редактора.

# findReplaceAllIcon
source: Icon for 'Replace All' in the editor find widget.
uk: Іконка для 'Замінити все' у віджеті пошуку редактора.

# findReplaceIcon
source: Icon for 'Replace' in the editor find widget.
uk: Іконка для 'Замінити' у віджеті пошуку редактора.

# findSelectionIcon
source: Icon for 'Find in Selection' in the editor find widget.
uk: Іконка для 'Знайти в виборі' у віджеті пошуку редактора.

# label.closeButton
source: Close
uk: Закрити

# label.find
source: Find
uk: Знайти

# label.findDialog
source: Find / Replace
uk: Знайти / Замінити

# label.matchesLocation
source: {0} of {1}
uk: {0} з {1}

# label.nextMatchButton
source: Next Match
uk: Наступний матч

# label.noResults
source: No results
uk: Немає результатів

# label.previousMatchButton
source: Previous Match
uk: Попередній матч

# label.replace
source: Replace
uk: Замінити

# label.replaceAllButton
source: Replace All
uk: Замінити все

# label.replaceButton
source: Replace
uk: Замінити

# label.toggleReplaceButton
source: Toggle Replace
uk: Переключити заміну

# label.toggleSelectionFind
source: Find in Selection
uk: Знайти у виборі

# placeholder.find
source: Find
uk: Знайти

# placeholder.replace
source: Replace
uk: Замінити

# title.matchesCountLimit
source: Only the first {0} results are highlighted, but all find operations work on the entire text.
uk: Тільки перші {0} результати виділені, але всі операції пошуку працюють з усім текстом.

# createManualFoldRange.label
source: Create Folding Range from Selection
uk: Створити згортальний діапазон з вибору

# foldAction.label
source: Fold
uk: Скласти

# foldAllAction.label
source: Fold All
uk: Сховати все

# foldAllBlockComments.label
source: Fold All Block Comments
uk: Згорнути всі блокові коментарі

# foldAllExcept.label
source: Fold All Except Selected
uk: Згорнути все, крім вибраного

# foldAllMarkerRegions.label
source: Fold All Regions
uk: Згорнути всі регіони

# foldLevelAction.label
source: Fold Level {0}
uk: Рівень складання {0}

# foldRecursivelyAction.label
source: Fold Recursively
uk: Складати рекурсивно

# gotoNextFold.label
source: Go to Next Folding Range
uk: Перейти до наступного діапазону складання

# gotoParentFold.label
source: Go to Parent Fold
uk: Перейти до батьківського блоку

# gotoPreviousFold.label
source: Go to Previous Folding Range
uk: Перейти до попереднього діапазону складання

# removeManualFoldingRanges.label
source: Remove Manual Folding Ranges
uk: Видалити ручні діапазони складання

# toggleFoldAction.label
source: Toggle Fold
uk: Переключити складання

# toggleFoldRecursivelyAction.label
source: Toggle Fold Recursively
uk: Перемикати складання рекурсивно

# toggleImportFold.label
source: Toggle Import Fold
uk: Перемкнути імпорт папки

# unFoldRecursivelyAction.label
source: Unfold Recursively
uk: Розгорнути рекурсивно

# unfoldAction.label
source: Unfold
uk: Розгорнути

# unfoldAllAction.label
source: Unfold All
uk: Розгорнути все

# unfoldAllExcept.label
source: Unfold All Except Selected
uk: Розгорнути все, крім вибраного

# unfoldAllMarkerRegions.label
source: Unfold All Regions
uk: Розгорнути всі регіони

# collapsedTextColor
source: Color of the collapsed text after the first line of a folded range.
uk: Колір згорнутого тексту після першого рядка складеного діапазону.

# editorGutter.foldingControlForeground
source: Color of the folding control in the editor gutter.
uk: Колір згинального контролю в бічній панелі редактора.

# foldBackgroundBackground
source: Background color behind folded ranges. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону за складеними діапазонами. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# foldingCollapsedIcon
source: Icon for collapsed ranges in the editor glyph margin.
uk: Іконка для згорнутого діапазону в маржі гліфів редактора.

# foldingExpandedIcon
source: Icon for expanded ranges in the editor glyph margin.
uk: Іконка для розширених діапазонів у полі гліфів редактора.

# foldingManualCollapedIcon
source: Icon for manually collapsed ranges in the editor glyph margin.
uk: Іконка для вручну згорнутого діапазону в межах редактора.

# foldingManualExpandedIcon
source: Icon for manually expanded ranges in the editor glyph margin.
uk: Іконка для вручну розширених діапазонів у полі гліфів редактора.

# linesCollapsed
source: Click to expand the range.
uk: Натисніть, щоб розгорнути діапазон.

# linesExpanded
source: Click to collapse the range.
uk: Натисніть, щоб згорнути діапазон.

# EditorFontZoomIn.label
source: Increase Editor Font Size
uk: Збільшити розмір шрифту редактора

# EditorFontZoomOut.label
source: Decrease Editor Font Size
uk: Зменшити розмір шрифту редактора

# EditorFontZoomReset.label
source: Reset Editor Font Size
uk: Скинути розмір шрифту редактора

# formatDocument.label
source: Format Document
uk: Форматувати документ

# formatSelection.label
source: Format Selection
uk: Вибір формату

# markerAction.next.label
source: Go to Next Problem (Error, Warning, Info)
uk: Перейти до наступної проблеми (Помилка, Попередження, Інформація)

# markerAction.nextInFiles.label
source: Go to Next Problem in Files (Error, Warning, Info)
uk: Перейти до наступної проблеми у файлах (Помилка, Попередження, Інформація)

# markerAction.previous.label
source: Go to Previous Problem (Error, Warning, Info)
uk: Перейти до попередньої проблеми (Помилка, Попередження, Інформація)

# markerAction.previousInFiles.label
source: Go to Previous Problem in Files (Error, Warning, Info)
uk: Перейти до попередньої проблеми у файлах (Помилка, Попередження, Інформація)

# miGotoNextProblem
source: Next &&Problem
uk: Наступна п&&роблема

# miGotoPreviousProblem
source: Previous &&Problem
uk: Попередня &&проблема

# nextMarkerIcon
source: Icon for goto next marker.
uk: Іконка для переходу до наступного маркера.

# previousMarkerIcon
source: Icon for goto previous marker.
uk: Іконка для переходу до попереднього маркера.

source: Error
uk: Помилка

source: Hint
uk: Підказка

source: Info
uk: Інформація

source: Warning
uk: Попередження

# change
source: {0} of {1} problem
uk: {0} з {1} проблеми

# editorMarkerNavigationBackground
source: Editor marker navigation widget background.
uk: Фон віджета навігації маркерів редактора.

# editorMarkerNavigationError
source: Editor marker navigation widget error color.
uk: Колір помилки віджета навігації маркерів редактора.

# editorMarkerNavigationErrorHeaderBackground
source: Editor marker navigation widget error heading background.
uk: Заголовок фону помилки віджета навігації маркерів редактора.

# editorMarkerNavigationInfo
source: Editor marker navigation widget info color.
uk: Колір інформаційного віджета навігації маркерів редактора.

# editorMarkerNavigationInfoHeaderBackground
source: Editor marker navigation widget info heading background.
uk: Фон заголовка інформаційного віджета навігації маркерів редактора.

# editorMarkerNavigationWarning
source: Editor marker navigation widget warning color.
uk: Колір попередження віджета навігації маркерів редактора.
