Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor_contrib.xlf
Languages: uk

# editorMarkerNavigationWarningBackground
source: Editor marker navigation widget warning heading background.
uk: Фонове заголовок попередження віджета навігації маркерів редактора.

# marker aria
source: {0} at {1}.
uk: {0} о {1}.

# problems
source: {0} of {1} problems
uk: {0} з {1} проблем

# actions.goToDecl.label
source: Go to Definition
uk: Перейти до визначення

# actions.goToDeclToSide.label
source: Open Definition to the Side
uk: Відкрити визначення збоку

# actions.goToDeclaration.label
source: Go to Declaration
uk: Перейти до декларації

# actions.goToImplementation.label
source: Go to Implementations
uk: Перейти до реалізацій

# actions.goToTypeDefinition.label
source: Go to Type Definition
uk: Перейти до визначення типу

# actions.peekDecl.label
source: Peek Declaration
uk: Оголошення Peek

# actions.peekImplementation.label
source: Peek Implementations
uk: Перегляд реалізацій

# actions.peekTypeDefinition.label
source: Peek Type Definition
uk: Перегляд визначення типу

# actions.previewDecl.label
source: Peek Definition
uk: Переглянути визначення

# decl.generic.noResults
source: No declaration found
uk: Не знайдено декларації

# decl.noResultWord
source: No declaration found for '{0}'
uk: Не знайдено декларації для '{0}'

# decl.title
source: Declarations
uk: Декларації

# def.title
source: Definitions
uk: Визначення

# generic.noResult
source: No results for '{0}'
uk: Немає результатів для '{0}'

# generic.noResults
source: No definition found
uk: Не знайдено визначення

# generic.title
source: Locations
uk: Локації

# goToImplementation.generic.noResults
source: No implementation found
uk: Не знайдено реалізації

# goToImplementation.noResultWord
source: No implementation found for '{0}'
uk: Не знайдено реалізації для '{0}'

# goToReferences.label
source: Go to References
uk: Перейти до посилань

# goToTypeDefinition.generic.noResults
source: No type definition found
uk: Не знайдено визначення типу

# goToTypeDefinition.noResultWord
source: No type definition found for '{0}'
uk: Не знайдено визначення типу для '{0}'

# impl.title
source: Implementations
uk: Впровадження

# label.generic
source: Go to Any Symbol
uk: Перейти до будь-якого символу

# miGotoDeclaration
source: Go to &&Declaration
uk: Перейти до &&декларації

# miGotoDefinition
source: Go to &&Definition
uk: Перейти до &&визначення

# miGotoImplementation
source: Go to &&Implementations
uk: Перейти до &&впроваджень

# miGotoReference
source: Go to &&References
uk: Перейти до &&посилань

# miGotoTypeDefinition
source: Go to &&Type Definition
uk: Перейти до &&опису типу

# noResultWord
source: No definition found for '{0}'
uk: Не знайдено визначення для '{0}'

# peek.submenu
source: Peek
uk: Погляд

# ref.title
source: References
uk: Посилання

# references.action.label
source: Peek References
uk: Перегляд посилань

# references.no
source: No references found for '{0}'
uk: Не знайдено жодних посилань для '{0}'

# references.noGeneric
source: No references found
uk: Не знайдено жодних посилань

# typedef.title
source: Type Definitions
uk: Визначення типів

# multipleResults
source: Click to show {0} definitions.
uk: Натисніть, щоб показати {0} визначень.

# labelLoading
source: Loading...
uk: Завантаження...

# referenceSearchVisible
source: Whether reference peek is visible, like 'Peek References' or 'Peek Definition'
uk: Чи видимий перегляд посилань, як 'Перегляд посилань' або 'Перегляд визначення'

# referenceCount
source: {0} reference
uk: {0} посилання

# referencesCount
source: {0} references
uk: {0} посилань

# treeAriaLabel
source: References
uk: Посилання

# missingPreviewMessage
source: no preview available
uk: попередній перегляд недоступний

source: No results
uk: Немає результатів

# peekView.alternateTitle
source: References
uk: Посилання

# aria.fileReferences.1
source: 1 symbol in {0}, full path {1}
uk: 1 символ у {0}, повний шлях {1}

# aria.fileReferences.N
source: {0} symbols in {1}, full path {2}
uk: {0} символів у {1}, повний шлях {2}

# aria.oneReference
source: in {0} on line {1} at column {2}
uk: в {0} на рядку {1} у стовпці {2}

# aria.oneReference.preview
source: {0} in {1} on line {2} at column {3}
uk: {0} у {1} на рядку {2} в колонці {3}

# aria.result.0
source: No results found
uk: Не знайдено жодних результатів

# aria.result.1
source: Found 1 symbol in {0}
uk: Знайдено 1 символ у {0}

# aria.result.n1
source: Found {0} symbols in {1}
uk: Знайдено {0} символів у {1}

# aria.result.nm
source: Found {0} symbols in {1} files
uk: Знайдено {0} символів у {1} файлах

# hasSymbols
source: Whether there are symbol locations that can be navigated via keyboard-only.
uk: Чи є місця символів, до яких можна перейти лише за допомогою клавіатури.

# location
source: Symbol {0} of {1}
uk: Символ {0} з {1}

# location.kb
source: Symbol {0} of {1}, {2} for next
uk: Символ {0} з {1}, {2} для наступного

# drawGlyph.label
source: Draw Glyph
uk: Намалювати гліф

# gpuDebug.label
source: Developer: Debug Editor GPU Renderer
uk: Розробник: Налагоджувач редактора GPU

# logTextureAtlasStats.label
source: Log Texture Atlas Stats
uk: Журнал статистики текстурного атласу

# saveTextureAtlas.label
source: Save Texture Atlas
uk: Зберегти Атлас Текстур

# hoverAccessibilityStatusBar
source: This is a hover status bar.
uk: Це панель стану при наведенні.

# hoverAccessibilityStatusBarActionWithKeybinding
source: It has an action with label {0} and keybinding {1}.
uk: Він має дію з міткою {0} та прив'язкою клавіші {1}.

# hoverAccessibilityStatusBarActionWithoutKeybinding
source: It has an action with label {0}.
uk: Він має дію з міткою {0}.

# decreaseVerbosity
source: - The focused hover part verbosity level can be decreased with the Decrease Hover Verbosity command.
uk: - Рівень детальності частини зосередженого наведення можна зменшити за допомогою команди Зменшити детальність наведення.

# increaseVerbosity
source: - The focused hover part verbosity level can be increased with the Increase Hover Verbosity command.
uk: - Рівень деталізації частини зосередженого наведення можна збільшити за допомогою команди Збільшити деталізацію наведення.

source: Decrease Hover Verbosity Level
uk: Зменшити рівень детальності наведення

source: Increase Hover Verbosity Level
uk: Збільшити рівень детальності наведення

source: Go To Bottom Hover
uk: Перейти до низу в ховері

# goToBottomHoverDescription
source: Go to the bottom of the editor hover.
uk: Перейдіть до нижньої частини наведення редактора.

source: Go To Top Hover
uk: Перейти до верхньої частини ховера

# goToTopHoverDescription
source: Go to the top of the editor hover.
uk: Перейдіть до верху панелі редагування.

source: Hide Hover
uk: Сховати наведену підказку

source: Page Down Hover
uk: Сторінка вниз при наведенні

# pageDownHoverDescription
source: Page down the editor hover.
uk: Прокрутіть вниз редактор при наведенні.

source: Page Up Hover
uk: Прокрутка вгору в ховері

# pageUpHoverDescription
source: Page up the editor hover.
uk: Сторінка вгору над редактором.

source: Scroll Down Hover
uk: Прокрутити вниз при наведенні

# scrollDownHoverDescription
source: Scroll down the editor hover.
uk: Прокрутіть вниз над панеллю редактора.

source: Scroll Left Hover
uk: Прокрутити вліво при наведенні

# scrollLeftHoverDescription
source: Scroll left the editor hover.
uk: Прокрутіть вліво, щоб навести курсор на редактор.

source: Scroll Right Hover
uk: Прокрутити вправо в ховері

# scrollRightHoverDescription
source: Scroll right the editor hover.
uk: Прокрутіть праворуч редактору при наведенні.

source: Scroll Up Hover
uk: Прокрутити вгору при наведенні

# scrollUpHoverDescription
source: Scroll up the editor hover.
uk: Прокрутіть вгору над редактором.

source: Show Definition Preview Hover
uk: Показати попередній перегляд визначення

# showDefinitionPreviewHoverDescription
source: Show the definition preview hover in the editor.
uk: Показати попередній перегляд визначення при наведенні в редакторі.

source: Show or Focus Hover
uk: Показати або зосередити наведення

# showOrFocusHover.focus.autoFocusImmediately
source: The hover will automatically take focus when it appears.
uk: Наведення автоматично отримає фокус, коли з'явиться.

# showOrFocusHover.focus.focusIfVisible
source: The hover will take focus only if it is already visible.
uk: Наведення набуде фокусу лише якщо воно вже видиме.

# showOrFocusHover.focus.noAutoFocus
source: The hover will not automatically take focus.
uk: Наведення не буде автоматично отримувати фокус.

# showOrFocusHoverDescription
source: Show or focus the editor hover which shows documentation, references, and other content for a symbol at the current cursor position.
uk: Показати або зосередити наведення редактора, яке відображає документацію, посилання та інший контент для символу в поточній позиції курсора.

# decreaseHoverVerbosity
source: Icon for decreasing hover verbosity.
uk: Іконка для зменшення детальності наведення.

# decreaseVerbosity
source: Decrease Hover Verbosity
uk: - Рівень детальності частини зосередженого наведення можна зменшити за допомогою команди Зменшити детальність наведення.

# decreaseVerbosityWithKb
source: Decrease Hover Verbosity ({0})
uk: Зменшити детальність наведення ({0})

# increaseHoverVerbosity
source: Icon for increaseing hover verbosity.
uk: Іконка для збільшення детальності наведення.

# increaseVerbosity
source: Increase Hover Verbosity
uk: - Рівень деталізації частини зосередженого наведення можна збільшити за допомогою команди Збільшити деталізацію наведення.

# increaseVerbosityWithKb
source: Increase Hover Verbosity ({0})
uk: Збільшити детальність наведення ({0})

# modesContentHover.loading
source: Loading...
uk: Завантаження...

# stopped rendering
source: Rendering paused for long line for performance reasons. This can be configured via `editor.stopRenderingLineAfter`.
uk: Відображення призупинено для довгого рядка з причин продуктивності. Це можна налаштувати через `editor.stopRenderingLineAfter`.

# too many characters
source: Tokenization is skipped for long lines for performance reasons. This can be configured via `editor.maxTokenizationLineLength`.
uk: Токенізація пропускається для довгих рядків з причин продуктивності. Це можна налаштувати через `editor.maxTokenizationLineLength`.

source: Checking for quick fixes...
uk: Перевірка на швидкі рішення...

# noQuickFixes
source: No quick fixes available
uk: Немає швидких рішень

# quick fixes
source: Quick Fix...
uk: Швидке виправлення...

source: View Problem
uk: Переглянути проблему

# InPlaceReplaceAction.next.label
source: Replace with Next Value
uk: Замінити на наступне значення

# InPlaceReplaceAction.previous.label
source: Replace with Previous Value
uk: Замінити на попереднє значення

source: Change Tab Display Size
uk: Змінити розмір відображення вкладки

# changeTabDisplaySizeDescription
source: Change the space size equivalent of the tab.
uk: Змініть розмір простору, еквівалентний вкладці.

source: Configured Tab Size
uk: Налаштований розмір вкладки

source: Current Tab Size
uk: Поточний розмір вкладки

source: Default Tab Size
uk: Розмір вкладки за замовчуванням

# detectIndentation
source: Detect Indentation from Content
uk: Визначити відступ з вмісту

# detectIndentationDescription
source: Detect the indentation from content.
uk: Визначте відступ з вмісту.

# editor.reindentlines
source: Reindent Lines
uk: Перемістити відступ рядків

# editor.reindentlinesDescription
source: Reindent the lines of the editor.
uk: Перемістіть відступи рядків редактора.

# editor.reindentselectedlines
source: Reindent Selected Lines
uk: Перемістити вибрані рядки

# editor.reindentselectedlinesDescription
source: Reindent the selected lines of the editor.
uk: Перемістіть відступ вибраних рядків редактора.

source: Indent Using Spaces
uk: Відступ за допомогою пробілів

# indentUsingSpacesDescription
source: Use indentation with spaces.
uk: Використовуйте відступи з пробілами.

source: Indent Using Tabs
uk: Відступ за допомогою табуляції

# indentUsingTabsDescription
source: Use indentation with tabs.
uk: Використовуйте відступи з табуляцією.

# indentationToSpaces
source: Convert Indentation to Spaces
uk: Перетворити відступи на пробіли

# indentationToSpacesDescription
source: Convert the tab indentation to spaces.
uk: Перетворіть відступи табуляції на пробіли.

# indentationToTabs
source: Convert Indentation to Tabs
uk: Перетворити відступи на табуляцію

# indentationToTabsDescription
source: Convert the spaces indentation to tabs.
uk: Перетворіть відступи з пробілів на табуляцію.

# selectTabWidth
source: Select Tab Size for Current File
uk: Виберіть розмір табуляції для поточного файлу

# hint.cmd
source: Execute Command
uk: Виконати команду

# hint.dbl
source: Double-click to insert
uk: Двічі клацніть, щоб вставити

# hint.def
source: Go to Definition ({0})
uk: Перейти до визначення ({0})

# hint.defAndCommand
source: Go to Definition ({0}), right click for more
uk: Перейти до визначення ({0}), клацніть правою кнопкою миші для додаткової інформації

# links.navigate.kb.alt
source: alt + click
uk: alt + клік

# links.navigate.kb.alt.mac
source: option + click
uk: option + клік

# links.navigate.kb.meta
source: ctrl + click
uk: ctrl + клік

# links.navigate.kb.meta.mac
source: cmd + click
uk: cmd + клік

source: Accept
uk: Прийняти

source: Accept Line
uk: Прийняти рядок

source: Accept Word
uk: Прийняти Word

# action.inlineSuggest.accept
source: Accept Inline Suggestion
uk: Прийняти вбудовану пропозицію

# action.inlineSuggest.acceptNextLine
source: Accept Next Line Of Inline Suggestion
uk: Прийняти наступний рядок вбудованої пропозиції

# action.inlineSuggest.acceptNextWord
source: Accept Next Word Of Inline Suggestion
uk: Прийняти наступне слово з вбудованої пропозиції

# action.inlineSuggest.alwaysShowToolbar
source: Always Show Toolbar
uk: Завжди показувати панель інструментів

# action.inlineSuggest.dev.extractRepro
source: Developer: Extract Inline Suggest State
uk: Розробник: Витягти стан вбудованих пропозицій

# action.inlineSuggest.hide
source: Hide Inline Suggestion
uk: Сховати вбудовану пропозицію

# action.inlineSuggest.jump
source: Jump to next inline edit
uk: Перейти до наступного редагування в рядку

# action.inlineSuggest.showNext
source: Show Next Inline Suggestion
uk: Показати наступну вбудовану пропозицію

# action.inlineSuggest.showPrevious
source: Show Previous Inline Suggestion
uk: Показати попередню вбудовану пропозицію

# action.inlineSuggest.toggleShowCollapsed
source: Toggle Inline Suggestions Show Collapsed
uk: Перемкнути вбудовані пропозиції Показати згорнуті

# action.inlineSuggest.trigger
source: Trigger Inline Suggestion
uk: Запустити вбудовану пропозицію

# action.inlineSuggest.trigger.explicitInlineEdit
source: Trigger Next Edit Suggestion
uk: Запустити наступну пропозицію редагування

source: Jump
uk: Стрибок

# noInlineEditAvailable
source: No inline edit is available.
uk: Редагування в рядку недоступне.

source: Reject
uk: Відхилити

# cursorAtInlineEdit
source: Whether the cursor is at an inline edit
uk: Чи курсор знаходиться в режимі вбудованого редагування

# cursorBeforeGhostText
source: Whether the cursor is at ghost text
uk: Чи курсор знаходиться на привидному тексті

# cursorInIndentation
source: Whether the cursor is in indentation
uk: Чи курсор знаходиться в відступі

# editor.hasSelection
source: Whether the editor has a selection
uk: Чи має редактор вибір

# inInlineEditsPreviewEditor
source: Whether the current code editor is showing an inline edits preview
uk: Чи показує поточний редактор коду попередній перегляд вбудованих змін

# inlineEditVisible
source: Whether an inline edit is visible
uk: Чи видима вбудована редакція

# inlineSuggestionHasIndentation
source: Whether the inline suggestion starts with whitespace
uk: Чи починається вбудована пропозиція з пробільного символу

# inlineSuggestionHasIndentationLessThanTabSize
source: Whether the inline suggestion starts with whitespace that is less than what would be inserted by tab
uk: Чи починається вбудована пропозиція з пробілів, які менші за ті, що будуть вставлені табуляцією

# inlineSuggestionVisible
source: Whether an inline suggestion is visible
uk: Чи видима вбудована пропозиція

# suppressSuggestions
source: Whether suggestions should be suppressed for the current suggestion
uk: Чи слід подавлення пропозицій для поточної пропозиції

# tabShouldAcceptInlineEdit
source: Whether tab should accept the inline edit.
uk: Чи повинна вкладка приймати вбудоване редагування.

# tabShouldJumpToInlineEdit
source: Whether tab should jump to an inline edit.
uk: Чи повинна вкладка переходити до вбудованого редагування.

# showAccessibleViewHint
source: Inspect this in the accessible view ({0})
uk: Перегляньте це в доступному вигляді ({0})

# hoverAccessibilityStatusBar
source: There are inline completions here
uk: Це панель стану при наведенні.

# inlineSuggestionFollows
source: Suggestion:
uk: Пропозиція:

source: Next
uk: Далі

# parameterHintsNextIcon
source: Icon for show next parameter hint.
uk: Іконка для показу підказки наступного параметра.

# parameterHintsPreviousIcon
source: Icon for show previous parameter hint.
uk: Іконка для показу підказки попереднього параметра.

source: Previous
uk: Попередній

source: Go To
uk: Перейти до

source: Settings
uk: Налаштування

source: Show Collapsed
uk: Показати згорнуте

source: Show Expanded
uk: Показати розширене

# inlineEdit.indicator.background
source: Background color for the inline edit indicator.
uk: Колір фону для індикатора редагування в рядку.

# inlineEdit.indicator.border
source: Border color for the inline edit indicator.
uk: Колір рамки для індикатора вбудованого редагування.

# inlineEdit.indicator.foreground
source: Foreground color for the inline edit indicator.
uk: Колір переднього плану для індикатора вбудованого редагування.

source: Inline Edit
uk: Редагування на місці

# inlineEdit.gutterIndicator.background
source: Background color for the inline edit gutter indicator.
uk: Колір фону для індикатора редагування в рядку.

# inlineEdit.gutterIndicator.primaryBackground
source: Background color for the primary inline edit gutter indicator.
uk: Колір фону для основного індикатора редагування в рядку.

# inlineEdit.gutterIndicator.primaryBorder
source: Border color for the primary inline edit gutter indicator.
uk: Колір рамки для основного індикатора редагування в рядку.

# inlineEdit.gutterIndicator.primaryForeground
source: Foreground color for the primary inline edit gutter indicator.
uk: Колір переднього плану для основного індикатора редагування в рядку.

# inlineEdit.gutterIndicator.secondaryBackground
source: Background color for the secondary inline edit gutter indicator.
uk: Колір фону для індикатора вторинного інлайн редагування.

# inlineEdit.gutterIndicator.secondaryBorder
source: Border color for the secondary inline edit gutter indicator.
uk: Колір рамки для індикатора вторинного інлайн редагування.

# inlineEdit.gutterIndicator.secondaryForeground
source: Foreground color for the secondary inline edit gutter indicator.
uk: Колір переднього плану для індикатора вторинного вбудованого редагування.

# inlineEdit.gutterIndicator.successfulBackground
source: Background color for the successful inline edit gutter indicator.
uk: Колір фону для індикатора успішного вбудованого редагування.

# inlineEdit.gutterIndicator.successfulBorder
source: Border color for the successful inline edit gutter indicator.
uk: Колір рамки для індикатора успішного вбудованого редагування.

# inlineEdit.gutterIndicator.successfulForeground
source: Foreground color for the successful inline edit gutter indicator.
uk: Колір переднього плану для індикатора успішного вбудованого редагування.

# inlineEdit.modifiedBackground
source: Background color for the modified text in inline edits.
uk: Колір фону для зміненого тексту в інтерактивних редагуваннях.

# inlineEdit.modifiedBorder
source: Border color for the modified text in inline edits.
uk: Колір межі для зміненого тексту в інтерактивних редагуваннях.

# inlineEdit.modifiedChangedLineBackground
source: Background color for the changed lines in the modified text of inline edits.
uk: Колір фону для змінених рядків у зміненому тексті вбудованих редагувань.

# inlineEdit.modifiedChangedTextBackground
source: Overlay color for the changed text in the modified text of inline edits.
uk: Колір накладки для зміненого тексту в модифікованому тексті вбудованих редагувань.

# inlineEdit.originalBackground
source: Background color for the original text in inline edits.
uk: Колір фону для оригінального тексту в інтерактивних редагуваннях.

# inlineEdit.originalBorder
source: Border color for the original text in inline edits.
uk: Колір рамки для оригінального тексту в інтерактивних редагуваннях.

# inlineEdit.originalChangedLineBackground
source: Background color for the changed lines in the original text of inline edits.
uk: Колір фону для змінених рядків в оригінальному тексті вбудованих редагувань.

# inlineEdit.originalChangedTextBackground
source: Overlay color for the changed text in the original text of inline edits.
uk: Колір накладки для зміненого тексту в оригінальному тексті вбудованих редагувань.

# inlineEdit.tabWillAcceptModifiedBorder
source: Modified border color for the inline edits widget when tab will accept it.
uk: Змінено колір рамки для віджета вбудованих редагувань, коли вкладка його прийме.

# inlineEdit.tabWillAcceptOriginalBorder
source: Original border color for the inline edits widget over the original text when tab will accept it.
uk: Оригінальний колір рамки для віджета вбудованих редагувань над оригінальним текстом, коли вкладка його прийме.

source: Insert Final New Line
uk: Вставити фінальний новий рядок

source: Expand Line Selection
uk: Розширити вибір рядка

source: Duplicate Selection
uk: Дублювати вибір

# editor.transformToCamelcase
source: Transform to Camel Case
uk: Перетворити на Camel Case

# editor.transformToKebabcase
source: Transform to Kebab Case
uk: Перетворити на Kebab Case

# editor.transformToLowercase
source: Transform to Lowercase
uk: Перетворити на маленькі літери

# editor.transformToPascalcase
source: Transform to Pascal Case
uk: Перетворити на Pascal Case

# editor.transformToSnakecase
source: Transform to Snake Case
uk: Перетворити на зміїний регістр

# editor.transformToTitlecase
source: Transform to Title Case
uk: Перетворити на заголовковий регістр

# editor.transformToUppercase
source: Transform to Uppercase
uk: Перетворити на великі літери

# editor.transpose
source: Transpose Characters around the Cursor
uk: Транспонувати символи навколо курсора

# lines.copyDown
source: Copy Line Down
uk: Копіювати рядок вниз

# lines.copyUp
source: Copy Line Up
uk: Скопіювати рядок

# lines.delete
source: Delete Line
uk: Видалити рядок

# lines.deleteAllLeft
source: Delete All Left
uk: Видалити все залишене

# lines.deleteAllRight
source: Delete All Right
uk: Видалити все правильно

# lines.deleteDuplicates
source: Delete Duplicate Lines
uk: Видалити дублікати рядків

# lines.indent
source: Indent Line
uk: Відступ рядка

# lines.insertAfter
source: Insert Line Below
uk: Вставити рядок нижче

# lines.insertBefore
source: Insert Line Above
uk: Вставити рядок вище

# lines.joinLines
source: Join Lines
uk: Об'єднати рядки

# lines.moveDown
source: Move Line Down
uk: Перемістити рядок вниз

# lines.moveUp
source: Move Line Up
uk: Перемістити рядок вгору

# lines.outdent
source: Outdent Line
uk: Видалити відступ

# lines.reverseLines
source: Reverse lines
uk: Зворотні рядки

# lines.sortAscending
source: Sort Lines Ascending
uk: Сортувати рядки за зростанням

# lines.sortDescending
source: Sort Lines Descending
uk: Сортувати рядки за спаданням

# lines.trimTrailingWhitespace
source: Trim Trailing Whitespace
uk: Видалити пробіли в кінці рядка
