Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

# autoClosingComments
source: Controls whether the editor should automatically close comments after the user adds an opening comment.
uk: Контролює, чи має редактор автоматично закривати коментарі після того, як користувач додасть відкриваючий коментар.

# autoClosingDelete
source: Controls whether the editor should remove adjacent closing quotes or brackets when deleting.
uk: Контролює, чи має редактор видаляти сусідні закриваючі лапки або дужки під час видалення.

# autoClosingOvertype
source: Controls whether the editor should type over closing quotes or brackets.
uk: Контролює, чи має редактор замінювати закриваючі лапки або дужки.

# autoClosingQuotes
source: Controls whether the editor should automatically close quotes after the user adds an opening quote.
uk: Контролює, чи повинен редактор автоматично закривати лапки після того, як користувач додасть відкриваючу лапку.

# autoIndent
source: Controls whether the editor should automatically adjust the indentation when users type, paste, move or indent lines.
uk: Контролює, чи має редактор автоматично налаштовувати відступ, коли користувачі вводять текст, вставляють, переміщують або задають відступ для рядків.

# autoIndentOnPaste
source: Controls whether the editor should automatically auto-indent the pasted content.
uk: Контролює, чи редактор має автоматично вирівнювати вставлений вміст.

# autoIndentOnPasteWithinString
source: Controls whether the editor should automatically auto-indent the pasted content when pasted within a string. This takes effect when autoIndentOnPaste is true.
uk: Контролює, чи має редактор автоматично вирівнювати вставлений вміст, коли він вставлений у рядок. Це набирає чинності, коли autoIndentOnPaste дорівнює true.

# autoSurround
source: Controls whether the editor should automatically surround selections when typing quotes or brackets.
uk: Контролює, чи має редактор автоматично оточувати вибрані фрагменти при введенні лапок або дужок.

# bracketPairColorization.enabled
source: Controls whether bracket pair colorization is enabled or not. Use {0} to override the bracket highlight colors.
uk: Контролює, чи увімкнено кольорове виділення пар дужок. Використовуйте {0}, щоб переопределити кольори виділення дужок.

# bracketPairColorization.independentColorPoolPerBracketType
source: Controls whether each bracket type has its own independent color pool.
uk: Контролює, чи має кожен тип дужок свій власний незалежний пул кольорів.

# codeLensFontFamily
source: Controls the font family for CodeLens.
uk: Контролює сімейство шрифтів для CodeLens.

# codeLensFontSize
source: Controls the font size in pixels for CodeLens. When set to 0, 90% of `#editor.fontSize#` is used.
uk: Контролює розмір шрифту в пікселях для CodeLens. Коли встановлено значення 0, використовується 90% від `#editor.fontSize#`.

# colorDecoratorActivatedOn
source: Controls the condition to make a color picker appear from a color decorator.
uk: Контролює умову для відображення вибірника кольорів з декоратора кольору.

# colorDecorators
source: Controls whether the editor should render the inline color decorators and color picker.
uk: Контролює, чи повинен редактор відображати вбудовані кольорові декоратори та вибір кольору.

# colorDecoratorsLimit
source: Controls the max number of color decorators that can be rendered in an editor at once.
uk: Контролює максимальну кількість кольорових декораторів, які можуть бути відображені в редакторі одночасно.

# columnSelection
source: Enable that the selection with the mouse and keys is doing column selection.
uk: Увімкніть, щоб виділення мишкою та клавішами виконувало вибір стовпців.

# comments.ignoreEmptyLines
source: Controls if empty lines should be ignored with toggle, add or remove actions for line comments.
uk: Контролює, чи слід ігнорувати порожні рядки з перемикачем, додати або видалити дії для коментарів рядків.

# comments.insertSpace
source: Controls whether a space character is inserted when commenting.
uk: Контролює, чи вставляється пробіл при коментуванні.

# copyWithSyntaxHighlighting
source: Controls whether syntax highlighting should be copied into the clipboard.
uk: Контролює, чи має синтаксичне підсвічування бути скопійоване в буфер обміну.

# cursorBlinking
source: Control the cursor animation style.
uk: Контролюйте стиль анімації курсора.

# cursorHeight
source: Controls the height of the cursor when `#editor.cursorStyle#` is set to `line`. Cursor's max height depends on line height.
uk: Контролює висоту курсора, коли `#editor.cursorStyle#` встановлено на `line`. Максимальна висота курсора залежить від висоти рядка.

# cursorSmoothCaretAnimation
source: Controls whether the smooth caret animation should be enabled.
uk: Контролює, чи має бути увімкнена плавна анімація курсора.

# cursorSmoothCaretAnimation.explicit
source: Smooth caret animation is enabled only when the user moves the cursor with an explicit gesture.
uk: Анімація курсора плавно активується лише тоді, коли користувач переміщує курсор явним жестом.

# cursorSmoothCaretAnimation.off
source: Smooth caret animation is disabled.
uk: Анімація курсора вимкнена.

# cursorSmoothCaretAnimation.on
source: Smooth caret animation is always enabled.
uk: Анімація курсора завжди активована.

# cursorStyle
source: Controls the cursor style in insert input mode.
uk: Контролює стиль курсора в режимі введення.

# cursorSurroundingLines
source: Controls the minimal number of visible leading lines (minimum 0) and trailing lines (minimum 1) surrounding the cursor. Known as 'scrollOff' or 'scrollOffset' in some other editors.
uk: Контролює мінімальну кількість видимих провідних рядків (мінімум 0) та рядків, що йдуть за курсором (мінімум 1). Відомий як 'scrollOff' або 'scrollOffset' в деяких інших редакторах.

# cursorSurroundingLinesStyle
source: Controls when `#editor.cursorSurroundingLines#` should be enforced.
uk: Контролює, коли `#editor.cursorSurroundingLines#` має бути застосовано.

# cursorSurroundingLinesStyle.all
source: `cursorSurroundingLines` is enforced always.
uk: `cursorSurroundingLines` завжди застосовується.

# cursorSurroundingLinesStyle.default
source: `cursorSurroundingLines` is enforced only when triggered via the keyboard or API.
uk: `cursorSurroundingLines` застосовується лише тоді, коли викликано через клавіатуру або API.

# cursorWidth
source: Controls the width of the cursor when `#editor.cursorStyle#` is set to `line`.
uk: Контролює ширину курсора, коли `#editor.cursorStyle#` встановлено на `line`.

# defaultColorDecorators
source: Controls whether inline color decorations should be shown using the default document color provider.
uk: Контролює, чи слід відображати вбудовані кольорові декорації, використовуючи стандартний постачальник кольорів документа.

# definitionLinkOpensInPeek
source: Controls whether the Go to Definition mouse gesture always opens the peek widget.
uk: Контролює, чи завжди жест миші 'Перейти до визначення' відкриває віджет попереднього перегляду.

# deprecated
source: This setting is deprecated, please use separate settings like 'editor.suggest.showKeywords' or 'editor.suggest.showSnippets' instead.
uk: Це налаштування застаріло, будь ласка, використовуйте окремі налаштування, такі як 'editor.suggest.showKeywords' або 'editor.suggest.showSnippets'.

# dragAndDrop
source: Controls whether the editor should allow moving selections via drag and drop.
uk: Контролює, чи повинен редактор дозволяти переміщення виборів за допомогою перетягування.

# dropIntoEditor.enabled
source: Controls whether you can drag and drop a file into a text editor by holding down the `Shift` key (instead of opening the file in an editor).
uk: Контролює, чи можна перетягувати файл у текстовий редактор, утримуючи клавішу `Shift` (замість того, щоб відкривати файл у редакторі).

# dropIntoEditor.showDropSelector
source: Controls if a widget is shown when dropping files into the editor. This widget lets you control how the file is dropped.
uk: Контролює, чи віджет відображається при скиданні файлів в редактор. Цей віджет дозволяє вам контролювати, як файл скидається.

# dropIntoEditor.showDropSelector.afterDrop
source: Show the drop selector widget after a file is dropped into the editor.
uk: Показати віджет вибору спадного списку після того, як файл буде скинуто в редактор.

# dropIntoEditor.showDropSelector.never
source: Never show the drop selector widget. Instead the default drop provider is always used.
uk: Ніколи не показуйте віджет вибору дропу. Замість цього завжди використовується постачальник дропу за замовчуванням.

# editContext
source: Sets whether the EditContext API should be used instead of the text area to power input in the editor.
uk: Встановлює, чи слід використовувати API EditContext замість текстової області для введення в редакторі.

# editor.autoClosingBrackets.beforeWhitespace
source: Autoclose brackets only when the cursor is to the left of whitespace.
uk: Автоматично закривати дужки лише тоді, коли курсор знаходиться ліворуч від пробілу.

# editor.autoClosingBrackets.languageDefined
source: Use language configurations to determine when to autoclose brackets.
uk: Використовуйте налаштування мови, щоб визначити, коли автоматично закривати дужки.

# editor.autoClosingComments.beforeWhitespace
source: Autoclose comments only when the cursor is to the left of whitespace.
uk: Автоматично закривати коментарі лише тоді, коли курсор знаходиться ліворуч від пробілів.

# editor.autoClosingComments.languageDefined
source: Use language configurations to determine when to autoclose comments.
uk: Використовуйте мовні налаштування, щоб визначити, коли автоматично закривати коментарі.

# editor.autoClosingDelete.auto
source: Remove adjacent closing quotes or brackets only if they were automatically inserted.
uk: Видаліть сусідні закриваючі лапки або дужки лише якщо вони були автоматично вставлені.

# editor.autoClosingOvertype.auto
source: Type over closing quotes or brackets only if they were automatically inserted.
uk: Вводьте закриваючі лапки або дужки лише в тому випадку, якщо вони були вставлені автоматично.

# editor.autoClosingQuotes.beforeWhitespace
source: Autoclose quotes only when the cursor is to the left of whitespace.
uk: Автоматично закривати лапки тільки тоді, коли курсор знаходиться ліворуч від пробілу.

# editor.autoClosingQuotes.languageDefined
source: Use language configurations to determine when to autoclose quotes.
uk: Використовуйте налаштування мови, щоб визначити, коли автоматично закривати лапки.

# editor.autoIndent.advanced
source: The editor will keep the current line's indentation, honor language defined brackets and invoke special onEnterRules defined by languages.
uk: Редактор зберігатиме відступи поточного рядка, враховуватиме дужки, визначені мовою, та викликатиме спеціальні правила onEnterRules, визначені мовами.

# editor.autoIndent.brackets
source: The editor will keep the current line's indentation and honor language defined brackets.
uk: Редактор зберігатиме відступи поточного рядка та враховуватиме дужки, визначені мовою.

# editor.autoIndent.full
source: The editor will keep the current line's indentation, honor language defined brackets, invoke special onEnterRules defined by languages, and honor indentationRules defined by languages.
uk: Редактор зберігатиме відступи поточного рядка, враховуватиме дужки, визначені мовою, викликатиме спеціальні правила onEnterRules, визначені мовами, та враховуватиме правила відступів, визначені мовами.

# editor.autoIndent.keep
source: The editor will keep the current line's indentation.
uk: Редактор зберігатиме відступ поточного рядка.

# editor.autoIndent.none
source: The editor will not insert indentation automatically.
uk: Редактор не вставлятиме відступ автоматично.

# editor.autoSurround.brackets
source: Surround with brackets but not quotes.
uk: Окружте дужками, але не лапками.

# editor.autoSurround.languageDefined
source: Use language configurations to determine when to automatically surround selections.
uk: Використовуйте конфігурації мови, щоб визначити, коли автоматично оточувати вибрані елементи.

# editor.autoSurround.quotes
source: Surround with quotes but not brackets.
uk: Оточте лапками, але не дужками.

# editor.colorDecoratorActivatedOn.click
source: Make the color picker appear on click of the color decorator
uk: Зробіть так, щоб вибір кольору з'являвся при натисканні на декоратор кольору

# editor.colorDecoratorActivatedOn.clickAndHover
source: Make the color picker appear both on click and hover of the color decorator
uk: Зробіть так, щоб вибір кольору з'являвся як при натисканні, так і при наведенні на декоратор кольору

# editor.colorDecoratorActivatedOn.hover
source: Make the color picker appear on hover of the color decorator
uk: Зробіть так, щоб вибір кольору з'являвся при наведенні на декоратор кольору

# editor.defaultColorDecorators.always
source: Always show default color decorators.
uk: Завжди показувати декоратори кольору за замовчуванням.

# editor.defaultColorDecorators.auto
source: Show default color decorators only when no extension provides colors decorators.
uk: Показувати стандартні кольорові декоратори лише тоді, коли жодне розширення не надає кольорові декоратори.

# editor.defaultColorDecorators.never
source: Never show default color decorators.
uk: Ніколи не показувати стандартні кольорові декоратори.

# editor.editor.gotoLocation.multipleDeclarations
source: Controls the behavior the 'Go to Declaration'-command when multiple target locations exist.
uk: Контролює поведінку команди 'Перейти до оголошення', коли існує кілька цільових місць.

# editor.editor.gotoLocation.multipleDefinitions
source: Controls the behavior the 'Go to Definition'-command when multiple target locations exist.
uk: Контролює поведінку команди 'Перейти до визначення', коли існує кілька цільових місць.

# editor.editor.gotoLocation.multipleImplemenattions
source: Controls the behavior the 'Go to Implementations'-command when multiple target locations exist.
uk: Контролює поведінку команди 'Перейти до реалізацій', коли існує кілька цільових місць.

# editor.editor.gotoLocation.multipleReferences
source: Controls the behavior the 'Go to References'-command when multiple target locations exist.
uk: Контролює поведінку команди 'Перейти до посилань', коли існує кілька цільових місць.

# editor.editor.gotoLocation.multipleTypeDefinitions
source: Controls the behavior the 'Go to Type Definition'-command when multiple target locations exist.
uk: Контролює поведінку команди 'Перейти до визначення типу', коли існує кілька цільових місць.

# editor.find.autoFindInSelection.always
source: Always turn on Find in Selection automatically.
uk: Завжди автоматично вмикати Пошук у виборі.

# editor.find.autoFindInSelection.multiline
source: Turn on Find in Selection automatically when multiple lines of content are selected.
uk: Увімкнути пошук у виборі автоматично, коли вибрано кілька рядків вмісту.

# editor.find.autoFindInSelection.never
source: Never turn on Find in Selection automatically (default).
uk: Ніколи не вмикайте Знайти в виборі автоматично (за замовчуванням).

# editor.find.history.never
source: Do not store search history from the find widget.
uk: Не зберігайте історію пошуку з віджета пошуку.

# editor.find.history.workspace
source: Store search history across the active workspace
uk: Зберігати історію пошуку в активному робочому просторі

# editor.find.replaceHistory.never
source: Do not store history from the replace widget.
uk: Не зберігайте історію з віджету заміни.

# editor.find.replaceHistory.workspace
source: Store replace history across the active workspace
uk: Зберігати історію замін у активному робочому просторі

# editor.find.seedSearchStringFromSelection.always
source: Always seed search string from the editor selection, including word at cursor position.
uk: Завжди заповнюйте рядок пошуку з вибору редактора, включаючи слово в позиції курсора.

# editor.find.seedSearchStringFromSelection.never
source: Never seed search string from the editor selection.
uk: Ніколи не зберігайте рядок пошуку з вибору редактора.

# editor.find.seedSearchStringFromSelection.selection
source: Only seed search string from the editor selection.
uk: Тільки рядок пошуку насіння з вибору редактора.

# editor.gotoLocation.multiple.deprecated
source: This setting is deprecated, please use separate settings like 'editor.editor.gotoLocation.multipleDefinitions' or 'editor.editor.gotoLocation.multipleImplementations' instead.
uk: Це налаштування застаріле, будь ласка, використовуйте окремі налаштування, такі як 'editor.editor.gotoLocation.multipleDefinitions' або 'editor.editor.gotoLocation.multipleImplementations'.

# editor.gotoLocation.multiple.goto
source: Go to the primary result and enable Peek-less navigation to others
uk: Перейдіть до основного результату та увімкніть навігацію без попереднього перегляду для інших

# editor.gotoLocation.multiple.gotoAndPeek
source: Go to the primary result and show a Peek view
uk: Перейдіть до основного результату та покажіть перегляд Peek

# editor.gotoLocation.multiple.peek
source: Show Peek view of the results (default)
uk: Показати попередній перегляд результатів (за замовчуванням)

# editor.guides.bracketPairs
source: Controls whether bracket pair guides are enabled or not.
uk: Контролює, чи увімкнені підказки пар дужок.

# editor.guides.bracketPairs.active
source: Enables bracket pair guides only for the active bracket pair.
uk: Увімкнути посібники пар дужок лише для активної пари дужок.

# editor.guides.bracketPairs.false
source: Disables bracket pair guides.
uk: Вимикає посібники пар дужок.

# editor.guides.bracketPairs.true
source: Enables bracket pair guides.
uk: Увімкнути направляючі для пар дужок.

# editor.guides.bracketPairsHorizontal
source: Controls whether horizontal bracket pair guides are enabled or not.
uk: Контролює, чи увімкнені горизонтальні направляючі пари дужок.

# editor.guides.bracketPairsHorizontal.active
source: Enables horizontal guides only for the active bracket pair.
uk: Увімкнути горизонтальні направляючі лише для активної пари дужок.

# editor.guides.bracketPairsHorizontal.false
source: Disables horizontal bracket pair guides.
uk: Вимикає направляючі пари горизонтальних дужок.

# editor.guides.bracketPairsHorizontal.true
source: Enables horizontal guides as addition to vertical bracket pair guides.
uk: Увімкнення горизонтальних направляючих як доповнення до вертикальних направляючих пар кронштинів.

# editor.guides.highlightActiveBracketPair
source: Controls whether the editor should highlight the active bracket pair.
uk: Контролює, чи повинен редактор підсвічувати активну пару дужок.

# editor.guides.highlightActiveIndentation
source: Controls whether the editor should highlight the active indent guide.
uk: Контролює, чи повинен редактор підсвічувати активний індент-гід.

# editor.guides.highlightActiveIndentation.always
source: Highlights the active indent guide even if bracket guides are highlighted.
uk: Підсвічує активний відступний гід, навіть якщо підсвічені гіди дужок.

# editor.guides.highlightActiveIndentation.false
source: Do not highlight the active indent guide.
uk: Не підсвічуйте активний індикатор відступу.

# editor.guides.highlightActiveIndentation.true
source: Highlights the active indent guide.
uk: Підсвічує активний індент-гід.

# editor.guides.indentation
source: Controls whether the editor should render indent guides.
uk: Контролює, чи повинен редактор відображати індикатори відступів.

# editor.inlayHints.off
source: Inlay hints are disabled
uk: Підказки вставки вимкнені

# editor.inlayHints.offUnlessPressed
source: Inlay hints are hidden by default and show when holding {0}
uk: Підказки вставки за замовчуванням приховані і з'являються при утримуванні {0}

# editor.inlayHints.on
source: Inlay hints are enabled
uk: Підказки вставки увімкнені

# editor.inlayHints.onUnlessPressed
source: Inlay hints are showing by default and hide when holding {0}
uk: Підказки вставки відображаються за замовчуванням і ховаються при утримуванні {0}

# editor.inlineSuggest.edits.renderSideBySide.auto
source: Larger suggestions will show side by side if there is enough space, otherwise they will be shown below.
uk: Більші пропозиції будуть показані поруч, якщо є достатньо місця, в іншому випадку вони будуть показані нижче.

# editor.inlineSuggest.edits.renderSideBySide.never
source: Larger suggestions are never shown side by side and will always be shown below.
uk: Більші пропозиції ніколи не відображаються поруч і завжди будуть показані нижче.

# editor.lightbulb.enabled.off
source: Disable the code action menu.
uk: Вимкнути меню дій коду.

# editor.lightbulb.enabled.on
source: Show the code action menu when the cursor is on lines with code or on empty lines.
uk: Показати меню дій коду, коли курсор знаходиться на рядках з кодом або на порожніх рядках.

# editor.lightbulb.enabled.onCode
source: Show the code action menu when the cursor is on lines with code.
uk: Показати меню дій коду, коли курсор знаходиться на рядках з кодом.

# editor.stickyScroll.defaultModel
source: Defines the model to use for determining which lines to stick. If the outline model does not exist, it will fall back on the folding provider model which falls back on the indentation model. This order is respected in all three cases.
uk: Визначає модель, яку слід використовувати для визначення, які рядки закріпити. Якщо модель контурів не існує, вона перейде на модель постачальника складання, яка, у свою чергу, перейде на модель відступів. Цей порядок дотримується в усіх трьох випадках.

# editor.stickyScroll.enabled
source: Shows the nested current scopes during the scroll at the top of the editor.
uk: Показує вкладені поточні області під час прокрутки вгорі редактора.

# editor.stickyScroll.maxLineCount
source: Defines the maximum number of sticky lines to show.
uk: Визначає максимальну кількість закріплених рядків для відображення.

# editor.stickyScroll.scrollWithEditor
source: Enable scrolling of Sticky Scroll with the editor's horizontal scrollbar.
uk: Увімкніть прокручування Sticky Scroll за допомогою горизонтальної смуги прокрутки редактора.

# editor.suggest.matchOnWordStartOnly
source: When enabled IntelliSense filtering requires that the first character matches on a word start. For example, `c` on `Console` or `WebContext` but _not_ on `description`. When disabled IntelliSense will show more results but still sorts them by match quality.
uk: Коли увімкнено, фільтрація IntelliSense вимагає, щоб перший символ збігався з початком слова. Наприклад, `c` у `Console` або `WebContext`, але _не_ у `description`. Коли вимкнено, IntelliSense покаже більше результатів, але все ще сортує їх за якістю збігу.

# editor.suggest.showClasss
source: When enabled IntelliSense shows `class`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `class`.

# editor.suggest.showColors
source: When enabled IntelliSense shows `color`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `color`.

# editor.suggest.showConstants
source: When enabled IntelliSense shows `constant`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `constant`.

# editor.suggest.showConstructors
source: When enabled IntelliSense shows `constructor`-suggestions.
uk: Коли ввімкнено, IntelliSense показує пропозиції для `constructor`.

# editor.suggest.showCustomcolors
source: When enabled IntelliSense shows `customcolor`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `customcolor`.

# editor.suggest.showDeprecated
source: When enabled IntelliSense shows `deprecated`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції з позначкою `deprecated`.

# editor.suggest.showEnumMembers
source: When enabled IntelliSense shows `enumMember`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `enumMember`.
