Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

# unicodeHighlight.invisibleCharacters
source: Controls whether characters that just reserve space or have no width at all are highlighted.
uk: Контролює, чи виділяються символи, які просто резервують місце або зовсім не мають ширини.

# unicodeHighlight.nonBasicASCII
source: Controls whether all non-basic ASCII characters are highlighted. Only characters between U+0020 and U+007E, tab, line-feed and carriage-return are considered basic ASCII.
uk: Контролює, чи всі неосновні ASCII-символи підсвічуються. Лише символи між U+0020 та U+007E, табуляція, переведення рядка та повернення каретки вважаються основними ASCII.

# unusualLineTerminators
source: Remove unusual line terminators that might cause problems.
uk: Видаліть незвичайні символи завершення рядка, які можуть спричинити проблеми.

# unusualLineTerminators.auto
source: Unusual line terminators are automatically removed.
uk: Незвичайні символи завершення рядка автоматично видаляються.

# unusualLineTerminators.off
source: Unusual line terminators are ignored.
uk: Незвичайні символи завершення рядка ігноруються.

# unusualLineTerminators.prompt
source: Unusual line terminators prompt to be removed.
uk: Незвичайні символи завершення рядка потрібно видалити.

# useTabStops
source: Spaces and tabs are inserted and deleted in alignment with tab stops.
uk: Пробіли та табуляції вставляються та видаляються відповідно до табуляційних зупинок.

# wordBreak
source: Controls the word break rules used for Chinese/Japanese/Korean (CJK) text.
uk: Контролює правила переносу слів, що використовуються для китайського/японського/корейського (CJK) тексту.

# wordBreak.keepAll
source: Word breaks should not be used for Chinese/Japanese/Korean (CJK) text. Non-CJK text behavior is the same as for normal.
uk: Переноси слів не повинні використовуватися для китайського/японського/корейського (CJK) тексту. Поведінка не-CJK тексту така ж, як для звичайного.

# wordBreak.normal
source: Use the default line break rule.
uk: Використовуйте правило переносу рядка за замовчуванням.

# wordSegmenterLocales
source: Locales to be used for word segmentation when doing word related navigations or operations. Specify the BCP 47 language tag of the word you wish to recognize (e.g., ja, zh-CN, zh-Hant-TW, etc.).
uk: Місцевості, які будуть використовуватися для сегментації слів під час виконання навігацій або операцій, пов'язаних зі словами. Вкажіть мітку мови BCP 47 слова, яке ви бажаєте розпізнати (наприклад, ja, zh-CN, zh-Hant-TW тощо).

# wordSeparators
source: Characters that will be used as word separators when doing word related navigations or operations.
uk: Символи, які будуть використовуватися як роздільники слів під час виконання навігацій або операцій, пов'язаних зі словами.

# wordWrap
source: Controls how lines should wrap.
uk: Контролює, як рядки повинні обгортатися.

# wordWrap.bounded
source: Lines will wrap at the minimum of viewport and `#editor.wordWrapColumn#`.
uk: Рядки будуть переноситися на мінімальному значенні між viewport та `#editor.wordWrapColumn#`.

# wordWrap.wordWrapColumn
source: Lines will wrap at `#editor.wordWrapColumn#`.
uk: Рядки будуть переноситися на `#editor.wordWrapColumn#`.

# wordWrapColumn
source: Controls the wrapping column of the editor when `#editor.wordWrap#` is `wordWrapColumn` or `bounded`.
uk: Контролює стовпець обгортання редактора, коли `#editor.wordWrap#` є `wordWrapColumn` або `bounded`.

# wrapOnEscapedLineFeeds
source: Controls whether literal `\n` shall trigger a wordWrap when `#editor.wordWrap#` is enabled. For example: ```c char* str="hello\nworld" ``` will be displayed as ```c char* str="hello\n world" ```
uk: Контролює, чи літерал `\n` викликатиме перенесення слів, коли увімкнено `#editor.wordWrap#`. Наприклад: ```c char* str="hello\nworld" ``` буде відображено як ```c char* str="hello\n world" ```

# wrappingIndent
source: Controls the indentation of wrapped lines.
uk: Контролює відступ обгорнених рядків.

# wrappingIndent.deepIndent
source: Wrapped lines get +2 indentation toward the parent.
uk: Обгорнуті рядки отримують +2 відступи від батьківського елемента.

# wrappingIndent.indent
source: Wrapped lines get +1 indentation toward the parent.
uk: Згорнуті рядки отримують +1 відступ до батьківського елемента.

# wrappingIndent.none
source: No indentation. Wrapped lines begin at column 1.
uk: Без відступів. Обгорнуті рядки починаються з колонки 1.

# wrappingIndent.same
source: Wrapped lines get the same indentation as the parent.
uk: Обгорнуті рядки отримують таку ж відступ, як і батьківський.

# wrappingStrategy
source: Controls the algorithm that computes wrapping points. Note that when in accessibility mode, advanced will be used for the best experience.
uk: Контролює алгоритм, який обчислює точки обгортання. Зверніть увагу, що в режимі доступності буде використовуватися розширений для найкращого досвіду.

# wrappingStrategy.advanced
source: Delegates wrapping points computation to the browser. This is a slow algorithm, that might cause freezes for large files, but it works correctly in all cases.
uk: Делегати обчислення точок обгортки до браузера. Це повільний алгоритм, який може спричинити зависання для великих файлів, але він працює правильно у всіх випадках.

# wrappingStrategy.simple
source: Assumes that all characters are of the same width. This is a fast algorithm that works correctly for monospace fonts and certain scripts (like Latin characters) where glyphs are of equal width.
uk: Припускає, що всі символи мають однакову ширину. Це швидкий алгоритм, який працює правильно для моноширинних шрифтів та певних скриптів (наприклад, латинських символів), де гліфи мають однакову ширину.

# caret
source: Color of the editor cursor.
uk: Колір курсора редактора.

# deprecatedEditorActiveIndentGuide
source: 'editorIndentGuide.activeBackground' is deprecated. Use 'editorIndentGuide.activeBackground1' instead.
uk: 'editorIndentGuide.activeBackground' застарілий. Використовуйте 'editorIndentGuide.activeBackground1' замість цього.

# deprecatedEditorActiveLineNumber
source: Id is deprecated. Use 'editorLineNumber.activeForeground' instead.
uk: Id застаріло. Використовуйте 'editorLineNumber.activeForeground' замість цього.

# deprecatedEditorIndentGuides
source: 'editorIndentGuide.background' is deprecated. Use 'editorIndentGuide.background1' instead.
uk: 'editorIndentGuide.background' застаріло. Використовуйте замість цього 'editorIndentGuide.background1'.

# editorActiveIndentGuide
source: Color of the active editor indentation guides.
uk: Колір індикаторів відступу активного редактора.

# editorActiveIndentGuide1
source: Color of the active editor indentation guides (1).
uk: Колір активних напрямних відступу редактора (1).

# editorActiveIndentGuide2
source: Color of the active editor indentation guides (2).
uk: Колір активних направляючих відступів редактора (2).

# editorActiveIndentGuide3
source: Color of the active editor indentation guides (3).
uk: Колір індикаторів відступу активного редактора (3).

# editorActiveIndentGuide4
source: Color of the active editor indentation guides (4).
uk: Колір індикаторів відступу активного редактора (4).

# editorActiveIndentGuide5
source: Color of the active editor indentation guides (5).
uk: Колір індикаторів відступу активного редактора (5).

# editorActiveIndentGuide6
source: Color of the active editor indentation guides (6).
uk: Колір активних індикаторів відступу редактора (6).

# editorActiveLineNumber
source: Color of editor active line number
uk: Колір активного номера рядка редактора

# editorBracketHighlightForeground1
source: Foreground color of brackets (1). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (1). Потрібно увімкнути кольоризацію пар дужок.

# editorBracketHighlightForeground2
source: Foreground color of brackets (2). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (2). Потрібно увімкнути кольорову парну дужку.

# editorBracketHighlightForeground3
source: Foreground color of brackets (3). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (3). Потрібно увімкнути кольоризацію пар дужок.

# editorBracketHighlightForeground4
source: Foreground color of brackets (4). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (4). Потрібно увімкнути кольорову парну дужку.

# editorBracketHighlightForeground5
source: Foreground color of brackets (5). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (5). Потрібно увімкнути кольоризацію пар дужок.

# editorBracketHighlightForeground6
source: Foreground color of brackets (6). Requires enabling bracket pair colorization.
uk: Колір переднього плану дужок (6). Потрібно увімкнути кольоризацію пар дужок.

# editorBracketHighlightUnexpectedBracketForeground
source: Foreground color of unexpected brackets.
uk: Колір переднього плану несподіваних дужок.

# editorBracketMatchBackground
source: Background color behind matching brackets
uk: Колір фону за відповідними дужками

# editorBracketMatchBorder
source: Color for matching brackets boxes
uk: Колір для відповідності рамок дужок

# editorBracketPairGuide.activeBackground1
source: Background color of active bracket pair guides (1). Requires enabling bracket pair guides.
uk: Колір фону активних підказок пар дужок (1). Потрібно увімкнути підказки пар дужок.

# editorBracketPairGuide.activeBackground2
source: Background color of active bracket pair guides (2). Requires enabling bracket pair guides.
uk: Колір фону активних напрямних пар дужок (2). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.activeBackground3
source: Background color of active bracket pair guides (3). Requires enabling bracket pair guides.
uk: Колір фону активних вказівок пар дужок (3). Потрібно увімкнути вказівки пар дужок.

# editorBracketPairGuide.activeBackground4
source: Background color of active bracket pair guides (4). Requires enabling bracket pair guides.
uk: Колір фону активних посібників пар дужок (4). Потрібно увімкнути посібники пар дужок.

# editorBracketPairGuide.activeBackground5
source: Background color of active bracket pair guides (5). Requires enabling bracket pair guides.
uk: Колір фону активних напрямних пар дужок (5). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.activeBackground6
source: Background color of active bracket pair guides (6). Requires enabling bracket pair guides.
uk: Колір фону активних напрямних пар дужок (6). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.background1
source: Background color of inactive bracket pair guides (1). Requires enabling bracket pair guides.
uk: Колір фону неактивних напрямних пар дужок (1). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.background2
source: Background color of inactive bracket pair guides (2). Requires enabling bracket pair guides.
uk: Колір фону неактивних вказівників пар дужок (2). Потрібно увімкнути вказівники пар дужок.

# editorBracketPairGuide.background3
source: Background color of inactive bracket pair guides (3). Requires enabling bracket pair guides.
uk: Колір фону неактивних вказівок пар дужок (3). Потрібно увімкнути вказівки пар дужок.

# editorBracketPairGuide.background4
source: Background color of inactive bracket pair guides (4). Requires enabling bracket pair guides.
uk: Колір фону неактивних напрямних пар дужок (4). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.background5
source: Background color of inactive bracket pair guides (5). Requires enabling bracket pair guides.
uk: Колір фону неактивних напрямних пар дужок (5). Потрібно увімкнути напрямні пар дужок.

# editorBracketPairGuide.background6
source: Background color of inactive bracket pair guides (6). Requires enabling bracket pair guides.
uk: Колір фону неактивних напрямних пар дужок (6). Потрібно увімкнути напрямні пар дужок.

# editorCodeLensForeground
source: Foreground color of editor CodeLens
uk: Колір переднього плану редактора CodeLens

# editorCursorBackground
source: The background color of the editor cursor. Allows customizing the color of a character overlapped by a block cursor.
uk: Колір фону курсора редактора. Дозволяє налаштовувати колір символу, перекритого блочним курсором.

# editorDimmedLineNumber
source: Color of the final editor line when editor.renderFinalNewline is set to dimmed.
uk: Колір фінального рядка редактора, коли editor.renderFinalNewline встановлено на dimmed.

# editorGhostTextBackground
source: Background color of the ghost text in the editor.
uk: Колір фону тексту-привида в редакторі.

# editorGhostTextBorder
source: Border color of ghost text in the editor.
uk: Колір рамки примарного тексту в редакторі.

# editorGhostTextForeground
source: Foreground color of the ghost text in the editor.
uk: Колір переднього плану тексту-привида в редакторі.

# editorGutter
source: Background color of the editor gutter. The gutter contains the glyph margins and the line numbers.
uk: Колір фону панелі редактора. Панель містить поля гліфів та номери рядків.

# editorIndentGuides
source: Color of the editor indentation guides.
uk: Колір направляючих відступів редактора.

# editorIndentGuides1
source: Color of the editor indentation guides (1).
uk: Колір індикаторів відступу редактора (1).

# editorIndentGuides2
source: Color of the editor indentation guides (2).
uk: Колір індикаторів відступу редактора (2).

# editorIndentGuides3
source: Color of the editor indentation guides (3).
uk: Колір направляючих відступів редактора (3).

# editorIndentGuides4
source: Color of the editor indentation guides (4).
uk: Колір індикаторів відступу редактора (4).

# editorIndentGuides5
source: Color of the editor indentation guides (5).
uk: Колір направляючих відступів редактора (5).

# editorIndentGuides6
source: Color of the editor indentation guides (6).
uk: Колір направляючих відступів редактора (6).

# editorLineNumbers
source: Color of editor line numbers.
uk: Колір номерів рядків редактора.

# editorMultiCursorPrimaryBackground
source: The background color of the primary editor cursor when multiple cursors are present. Allows customizing the color of a character overlapped by a block cursor.
uk: Колір фону основного курсора редактора, коли присутні кілька курсорів. Дозволяє налаштувати колір символу, який перекривається блочним курсором.

# editorMultiCursorPrimaryForeground
source: Color of the primary editor cursor when multiple cursors are present.
uk: Колір курсора основного редактора, коли присутні кілька курсорів.

# editorMultiCursorSecondaryBackground
source: The background color of secondary editor cursors when multiple cursors are present. Allows customizing the color of a character overlapped by a block cursor.
uk: Колір фону вторинних курсорів редактора, коли присутні кілька курсорів. Дозволяє налаштувати колір символу, який перекривається блочним курсором.

# editorMultiCursorSecondaryForeground
source: Color of secondary editor cursors when multiple cursors are present.
uk: Колір курсорів вторинного редактора, коли присутні кілька курсорів.

# editorOverviewRulerBackground
source: Background color of the editor overview ruler.
uk: Колір фону лінійки огляду редактора.

# editorOverviewRulerBorder
source: Color of the overview ruler border.
uk: Колір рамки оглядового лінійки.

# editorRuler
source: Color of the editor rulers.
uk: Колір лінійок редактора.

# editorUnicodeHighlight.background
source: Background color used to highlight unicode characters.
uk: Колір фону, що використовується для підсвічування юнікодних символів.

# editorUnicodeHighlight.border
source: Border color used to highlight unicode characters.
uk: Колір рамки, що використовується для підсвічування юнікодних символів.

# editorWhitespaces
source: Color of whitespace characters in the editor.
uk: Колір пробільних символів в редакторі.

# lineHighlight
source: Background color for the highlight of line at the cursor position.
uk: Колір фону для виділення рядка в позиції курсора.

# lineHighlightBorderBox
source: Background color for the border around the line at the cursor position.
uk: Колір фону для рамки навколо рядка в позиції курсора.

# overviewRuleError
source: Overview ruler marker color for errors.
uk: Огляд кольору маркера лінійки для помилок.

# overviewRuleInfo
source: Overview ruler marker color for infos.
uk: Огляд кольору маркера лінійки для інформації.

# overviewRuleWarning
source: Overview ruler marker color for warnings.
uk: Огляд кольору маркера лінійки для попереджень.

# overviewRulerRangeHighlight
source: Overview ruler marker color for range highlights. The color must not be opaque so as not to hide underlying decorations.
uk: Огляд кольору маркера лінійки для підсвічування діапазону. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# rangeHighlight
source: Background color of highlighted ranges, like by quick open and find features. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону виділених діапазонів, як у функціях швидкого відкриття та пошуку. Колір не повинен бути непрозорим, щоб не приховувати підкладкові елементи.

# rangeHighlightBorder
source: Background color of the border around highlighted ranges.
uk: Колір фону рамки навколо виділених діапазонів.

# symbolHighlight
source: Background color of highlighted symbol, like for go to definition or go next/previous symbol. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону виділеного символу, наприклад, для переходу до визначення або переходу до наступного/попереднього символу. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# symbolHighlightBorder
source: Background color of the border around highlighted symbols.
uk: Колір фону рамки навколо виділених символів.

# unnecessaryCodeBorder
source: Border color of unnecessary (unused) source code in the editor.
uk: Колір рамки непотрібного (невикористаного) вихідного коду в редакторі.

# unnecessaryCodeOpacity
source: Opacity of unnecessary (unused) source code in the editor. For example, "#000000c0" will render the code with 75% opacity. For high contrast themes, use the 'editorUnnecessaryCode.border' theme color to underline unnecessary code instead of fading it out.
uk: Непрозорість непотрібного (невикористаного) вихідного коду в редакторі. Наприклад, "#000000c0" відобразить код з 75% непрозорістю. Для тем з високим контрастом використовуйте колір теми 'editorUnnecessaryCode.border', щоб підкреслити непотрібний код замість його затемнення.

# accessibleDiffViewerVisible
source: Whether the accessible diff viewer is visible
uk: Чи видимий доступний переглядач змін

# comparingMovedCode
source: Whether a moved code block is selected for comparison
uk: Чи вибрано переміщений блок коду для порівняння

# diffEditorHasChanges
source: Whether the diff editor has changes
uk: Чи має редактор відмінностей зміни

# diffEditorInlineMode
source: Whether inline mode is active
uk: Чи активний режим вбудованого відображення

# diffEditorModifiedUri
source: The uri of the modified document
uk: URI зміненого документа

# diffEditorModifiedWritable
source: Whether modified is writable in the diff editor
uk: Чи є модифіковане записуваним у редакторі різниць

# diffEditorOriginalUri
source: The uri of the original document
uk: URI оригінального документа

# diffEditorOriginalWritable
source: Whether modified is writable in the diff editor
uk: Чи є модифіковане записуваним у редакторі змін

# diffEditorRenderSideBySideInlineBreakpointReached
source: Whether the diff editor render side by side inline breakpoint is reached
uk: Чи досягнуто візуалізації редактора відмінностей з боковим вбудованим зупинкою

# editorColumnSelection
source: Whether `editor.columnSelection` is enabled
uk: Чи увімкнено `editor.columnSelection`

# editorFocus
source: Whether the editor or an editor widget has focus (e.g. focus is in the find widget)
uk: Чи має фокус редактор або віджет редактора (наприклад, фокус знаходиться у віджеті пошуку)

# editorHasCodeActionsProvider
source: Whether the editor has a code actions provider
uk: Чи має редактор постачальника кодових дій

# editorHasCodeLensProvider
source: Whether the editor has a code lens provider
uk: Чи має редактор постачальника коду лінзи

# editorHasCompletionItemProvider
source: Whether the editor has a completion item provider
uk: Чи має редактор постачальника елементів завершення

# editorHasDeclarationProvider
source: Whether the editor has a declaration provider
uk: Чи має редактор постачальника декларацій

# editorHasDefinitionProvider
source: Whether the editor has a definition provider
uk: Чи має редактор постачальника визначень

# editorHasDocumentFormattingProvider
source: Whether the editor has a document formatting provider
uk: Чи має редактор постачальника форматування документів

# editorHasDocumentHighlightProvider
source: Whether the editor has a document highlight provider
uk: Чи має редактор постачальника підсвічування документів

# editorHasDocumentSelectionFormattingProvider
source: Whether the editor has a document selection formatting provider
uk: Чи має редактор постачальника форматування вибору документа

# editorHasDocumentSymbolProvider
source: Whether the editor has a document symbol provider
uk: Чи має редактор постачальника символів документа

# editorHasHoverProvider
source: Whether the editor has a hover provider
uk: Чи має редактор постачальника наведення

# editorHasImplementationProvider
source: Whether the editor has an implementation provider
uk: Чи має редактор постачальника реалізації

# editorHasInlayHintsProvider
source: Whether the editor has an inline hints provider
uk: Чи має редактор постачальника підказок в рядку

# editorHasMultipleDocumentFormattingProvider
source: Whether the editor has multiple document formatting providers
uk: Чи має редактор кілька постачальників форматування документів

# editorHasMultipleDocumentSelectionFormattingProvider
source: Whether the editor has multiple document selection formatting providers
uk: Чи має редактор кілька постачальників форматування вибору документів

# editorHasMultipleSelections
source: Whether the editor has multiple selections
uk: Чи має редактор кілька виборів

# editorHasReferenceProvider
source: Whether the editor has a reference provider
uk: Чи має редактор постачальника посилань

# editorHasRenameProvider
source: Whether the editor has a rename provider
uk: Чи має редактор постачальника перейменування

# editorHasSelection
source: Whether the editor has text selected
uk: Чи вибрано текст редактором

# editorHasSignatureHelpProvider
source: Whether the editor has a signature help provider
uk: Чи має редактор постачальника підпису допомоги

# editorHasTypeDefinitionProvider
source: Whether the editor has a type definition provider
uk: Чи має редактор постачальника визначення типу

# editorHoverFocused
source: Whether the editor hover is focused
uk: Чи сфокусований наведений курсор редактора

# editorHoverVisible
source: Whether the editor hover is visible
uk: Чи видимий ховер редактора

# editorLangId
source: The language identifier of the editor
uk: Ідентифікатор мови редактора

# editorReadonly
source: Whether the editor is read-only
uk: Чи редактор є лише для читання

# editorTabMovesFocus
source: Whether `Tab` will move focus out of the editor
uk: Чи перемістить `Tab` фокус за межі редактора

# editorTextFocus
source: Whether the editor text has focus (cursor is blinking)
uk: Чи має текст редактора фокус (курсор блимає)

# inCompositeEditor
source: Whether the editor is part of a larger editor (e.g. notebooks)
uk: Чи є редактор частиною більшого редактора (наприклад, блокноти)

# inDiffEditor
source: Whether the context is a diff editor
uk: Чи є контекстом редактор відмінностей
