Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

source: editor
uk: редактор

# accessibilityModeOff
source: The editor is not accessible at this time.
uk: Редактор наразі недоступний.

# accessibilityOffAriaLabel
source: {0} To enable screen reader optimized mode, use {1}
uk: {0} Щоб увімкнути режим, оптимізований для екранних читалок, використовуйте {1}

# accessibilityOffAriaLabelNoKb
source: {0} To enable screen reader optimized mode, open the quick pick with {1} and run the command Toggle Screen Reader Accessibility Mode, which is currently not triggerable via keyboard.
uk: {0} Щоб увімкнути режим, оптимізований для екранних читалок, відкрийте швидкий вибір за допомогою {1} і виконайте команду Перемикання режиму доступності для екранних читалок, яка наразі не може бути активована за допомогою клавіатури.

# accessibilityOffAriaLabelNoKbs
source: {0} Please assign a keybinding for the command Toggle Screen Reader Accessibility Mode by accessing the keybindings editor with {1} and run it.
uk: {0} Будь ласка, призначте комбінацію клавіш для команди Переключити режим доступності для екранного зчитувача, відкривши редактор комбінацій клавіш за допомогою {1} і запустіть її.

# removedCursor
source: Removed secondary cursors
uk: Видалено вторинні курсори

# stickydesc
source: Stick to the end even when going to longer lines
uk: Тримайтеся до кінця, навіть коли переходите на довші рядки

# miRedo
source: &&Redo
uk: &&Відновити

# miSelectAll
source: &&Select All
uk: &&Вибрати все

# miUndo
source: &&Undo
uk: &&Скасувати

source: Redo
uk: Відновити

source: Select All
uk: Вибрати все

source: Undo
uk: Скасувати

# editor.dom.render
source: Use DOM-based rendering
uk: Використовуйте рендеринг на основі DOM

# hoverhint
source: Hold {0} key to mouse over
uk: Утримуйте {0} клавішу, щоб навести курсор миші

# iconLabel.loading
source: Loading...
uk: Завантаження...

# action.inlineSuggest.cancelSnooze
source: Cancel Snooze Inline Suggestions
uk: Скасувати пропозиції на зупинку

# action.inlineSuggest.snooze
source: Snooze Inline Suggestions
uk: Вимкнути вбудовані пропозиції

# inlineCompletions.snoozed
source: Whether inline completions are currently snoozed
uk: Чи наразі вимкнені вбудовані завершення

# snooze.placeholder
source: Select snooze duration for Code completions and NES
uk: Виберіть тривалість відкладання для завершення коду та NES

# cursors.maximum
source: The number of cursors has been limited to {0}. Consider using [find and replace](https://code.visualstudio.com/docs/editor/codebasics#_find-and-replace) for larger changes or increase the editor multi cursor limit setting.
uk: Кількість курсорів обмежена до {0}. Розгляньте можливість використання [знайти та замінити](https://code.visualstudio.com/docs/editor/codebasics#_find-and-replace) для більших змін або збільште налаштування обмеження кількох курсорів редактора.

# goToSetting
source: Increase Multi Cursor Limit
uk: Збільшити обмеження багатокурсора

source: Accessible Diff Viewer
uk: Доступний переглядач дифів

source: Collapse All Unchanged Regions
uk: Згорнути всі незмінені області

source: Diff Editor
uk: Редактор відмінностей

# editor.action.accessibleDiffViewer.next
source: Go to Next Difference
uk: Перейти до наступної різниці

# editor.action.accessibleDiffViewer.prev
source: Go to Previous Difference
uk: Перейти до попередньої різниці

source: Exit Compare Move
uk: Вихід Порівняти Перемістити

source: Revert
uk: Повернути

source: Show All Unchanged Regions
uk: Показати всі незмінені області

source: Switch Side
uk: Переключити сторону

source: Toggle Collapse Unchanged Regions
uk: Переключити згортання незмінних регіонів

source: Toggle Show Moved Code Blocks
uk: Перемкнути показ переміщених блоків коду

source: Toggle Use Inline View When Space Is Limited
uk: Переключити використання вбудованого перегляду, коли простір обмежений

# accessibleDiffViewerCloseIcon
source: Icon for 'Close' in accessible diff viewer.
uk: Іконка для 'Закрити' в доступному переглядачі змін.

# accessibleDiffViewerInsertIcon
source: Icon for 'Insert' in accessible diff viewer.
uk: Іконка для 'Вставити' в доступному переглядачі змін.

# accessibleDiffViewerRemoveIcon
source: Icon for 'Remove' in accessible diff viewer.
uk: Іконка для 'Видалити' в доступному переглядачі змін.

# ariaLabel
source: Accessible Diff Viewer. Use arrow up and down to navigate.
uk: Доступний переглядач дифів. Використовуйте стрілки вгору та вниз для навігації.

# blankLine
source: blank
uk: порожньо

# deleteLine
source: - {0} original line {1}
uk: - {0} оригінальний рядок {1}

# equalLine
source: {0} original line {1} modified line {2}
uk: {0} оригінальний рядок {1} змінений рядок {2}

# header
source: Difference {0} of {1}: original line {2}, {3}, modified line {4}, {5}
uk: Різниця {0} з {1}: оригінальний рядок {2}, {3}, змінений рядок {4}, {5}

# insertLine
source: + {0} modified line {1}
uk: + {0} змінений рядок {1}

# label.close
source: Close
uk: Закрити

# more_lines_changed
source: {0} lines changed
uk: {0} рядків змінено

source: no lines changed
uk: жодних рядків не змінено

# one_line_changed
source: 1 line changed
uk: 1 рядок змінено

# unchangedLine
source: {0} unchanged line {1}
uk: {0} незмінний рядок {1}

# diff-aria-navigation-tip
source: use {0} to open the accessibility help.
uk: використовуйте {0}, щоб відкрити допомогу з доступності.

# diff.clipboard.copyChangedLineContent.label
source: Copy changed line ({0})
uk: Скопіювати змінену лінію ({0})

# diff.clipboard.copyChangedLinesContent.label
source: Copy changed lines
uk: Скопіювати змінені рядки

# diff.clipboard.copyChangedLinesContent.single.label
source: Copy changed line
uk: Скопіювати змінену лінію

# diff.clipboard.copyDeletedLineContent.label
source: Copy deleted line ({0})
uk: Скопійована видалена лінія ({0})

# diff.clipboard.copyDeletedLinesContent.label
source: Copy deleted lines
uk: Скопіювати видалені рядки

# diff.clipboard.copyDeletedLinesContent.single.label
source: Copy deleted line
uk: Скопіювати видалений рядок

# diff.inline.revertChange.label
source: Revert this change
uk: Скасувати цю зміну

source: Open Accessible Diff Viewer
uk: Відкрити доступний переглядач дифів

# revertHunk
source: Revert Block
uk: Скасувати блок

source: Revert Selection
uk: Скасувати вибір

# showMoves
source: Show Moved Code Blocks
uk: Показати переміщені блоки коду

source: Use Inline View When Space Is Limited
uk: Використовуйте вбудований вигляд, коли місця обмаль

# diff.bottom
source: Click or drag to show more below
uk: Натисніть або перетягніть, щоб показати більше нижче

# diff.hiddenLines.expandAll
source: Double click to unfold
uk: Двічі клацніть, щоб розгорнути

# diff.hiddenLines.top
source: Click or drag to show more above
uk: Натисніть або перетягніть, щоб показати більше вище

# foldUnchanged
source: Fold Unchanged Region
uk: Скласти незмінений регіон

# hiddenLines
source: {0} hidden lines
uk: {0} прихованих рядків

source: Show Unchanged Region
uk: Показати незмінений регіон

# codeMovedFrom
source: Code moved from line {0}-{1}
uk: Код переміщено з рядка {0}-{1}

# codeMovedFromWithChanges
source: Code moved with changes from line {0}-{1}
uk: Код переміщено з змінами з рядка {0}-{1}

# codeMovedTo
source: Code moved to line {0}-{1}
uk: Код переміщено на рядки {0}-{1}

# codeMovedToWithChanges
source: Code moved with changes to line {0}-{1}
uk: Код переміщено з змінами до рядків {0}-{1}

source: Revert Change
uk: Скасувати зміни

source: Revert Selected Changes
uk: Відмінити вибрані зміни

# diffEditor.move.border
source: The border color for text that got moved in the diff editor.
uk: Колір рамки для тексту, який був переміщений у редакторі змін.

# diffEditor.moveActive.border
source: The active border color for text that got moved in the diff editor.
uk: Активний колір рамки для тексту, який був переміщений у редакторі змін.

# diffEditor.unchangedRegionShadow
source: The color of the shadow around unchanged region widgets.
uk: Колір тіні навколо віджетів незміненої області.

# diffInsertIcon
source: Line decoration for inserts in the diff editor.
uk: Декорація рядка для вставок у редакторі змін.

# diffRemoveIcon
source: Line decoration for removals in the diff editor.
uk: Оздоблення рядка для видалень у редакторі відмінностей.

# multiDiffEditor.background
source: The background color of the multi file diff editor
uk: Колір фону редактора багатофайлових відмінностей

# multiDiffEditor.border
source: The border color of the multi file diff editor
uk: Колір межі редактора порівняння кількох файлів

# multiDiffEditor.headerBackground
source: The background color of the diff editor's header
uk: Колір фону заголовка редактора порівняння

source: Loading...
uk: Завантаження...

source: No Changed Files
uk: Немає змінених файлів

# codeLens
source: Controls whether the editor shows CodeLens.
uk: Контролює, чи редактор показує CodeLens.

# detectIndentation
source: Controls whether {0} and {1} will be automatically detected when a file is opened based on the file contents.
uk: Контролює, чи {0} та {1} будуть автоматично виявлені при відкритті файлу на основі вмісту файлу.

# diffAlgorithm.advanced
source: Uses the advanced diffing algorithm.
uk: Використовує вдосконалений алгоритм порівняння.

# diffAlgorithm.legacy
source: Uses the legacy diffing algorithm.
uk: Використовує застарілий алгоритм порівняння.

# editor.experimental.asyncTokenization
source: Controls whether the tokenization should happen asynchronously on a web worker.
uk: Контролює, чи має токенізація відбуватися асинхронно на веб-робітнику.

# editor.experimental.asyncTokenizationLogging
source: Controls whether async tokenization should be logged. For debugging only.
uk: Контролює, чи слід реєструвати асинхронну токенізацію. Тільки для налагодження.

# editor.experimental.asyncTokenizationVerification
source: Controls whether async tokenization should be verified against legacy background tokenization. Might slow down tokenization. For debugging only.
uk: Контролює, чи слід перевіряти асинхронну токенізацію на відповідність застарілій фоновій токенізації. Може сповільнити токенізацію. Тільки для налагодження.

# editor.experimental.preferTreeSitter.css
source: Controls whether tree sitter parsing should be turned on for css. This will take precedence over `#editor.experimental.treeSitterTelemetry#` for css.
uk: Контролює, чи слід увімкнути парсинг tree sitter для css. Це матиме пріоритет над `#editor.experimental.treeSitterTelemetry#` для css.

# editor.experimental.preferTreeSitter.ini
source: Controls whether tree sitter parsing should be turned on for ini. This will take precedence over `#editor.experimental.treeSitterTelemetry#` for ini.
uk: Контролює, чи має бути увімкнено парсинг tree sitter для ini. Це матиме пріоритет над `#editor.experimental.treeSitterTelemetry#` для ini.

# editor.experimental.preferTreeSitter.regex
source: Controls whether tree sitter parsing should be turned on for regex. This will take precedence over `#editor.experimental.treeSitterTelemetry#` for regex.
uk: Контролює, чи має бути увімкнено парсинг tree sitter для regex. Це матиме пріоритет над `#editor.experimental.treeSitterTelemetry#` для regex.

# editor.experimental.preferTreeSitter.typescript
source: Controls whether tree sitter parsing should be turned on for typescript. This will take precedence over `#editor.experimental.treeSitterTelemetry#` for typescript.
uk: Контролює, чи має бути увімкнено парсинг tree sitter для typescript. Це матиме пріоритет над `#editor.experimental.treeSitterTelemetry#` для typescript.

# editor.experimental.treeSitterTelemetry
source: Controls whether tree sitter parsing should be turned on and telemetry collected. Setting `#editor.experimental.preferTreeSitter#` for specific languages will take precedence.
uk: Контролює, чи має бути увімкнено парсинг tree sitter та зібрано телеметрію. Налаштування `#editor.experimental.preferTreeSitter#` для конкретних мов матиме пріоритет.

# editorConfigurationTitle
source: Editor
uk: Редактор

# hideUnchangedRegions.contextLineCount
source: Controls how many lines are used as context when comparing unchanged regions.
uk: Контролює, скільки рядків використовується як контекст під час порівняння незмінних областей.

# hideUnchangedRegions.enabled
source: Controls whether the diff editor shows unchanged regions.
uk: Контролює, чи показує редактор змін незмінені області.

# hideUnchangedRegions.minimumLineCount
source: Controls how many lines are used as a minimum for unchanged regions.
uk: Контролює, скільки рядків використовується як мінімум для незмінних регіонів.

# hideUnchangedRegions.revealLineCount
source: Controls how many lines are used for unchanged regions.
uk: Контролює, скільки рядків використовується для незмінних ділянок.

# ignoreTrimWhitespace
source: When enabled, the diff editor ignores changes in leading or trailing whitespace.
uk: Коли увімкнено, редактор різниць ігнорує зміни в провідному або кінцевому пробілі.

# indentSize
source: The number of spaces used for indentation or `"tabSize"` to use the value from `#editor.tabSize#`. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.
uk: Кількість пробілів, що використовуються для відступу, або `"tabSize"` для використання значення з `#editor.tabSize#`. Ця налаштування перекривається на основі вмісту файлу, коли `#editor.detectIndentation#` увімкнено.

# insertSpaces
source: Insert spaces when pressing `Tab`. This setting is overridden based on the file contents when {0} is on.
uk: Вставляти пробіли при натисканні `Tab`. Ця настройка переважає на основі вмісту файлу, коли {0} увімкнено.

# largeFileOptimizations
source: Special handling for large files to disable certain memory intensive features.
uk: Спеціальна обробка великих файлів для вимкнення певних ресурсомістких функцій.

# maxComputationTime
source: Timeout in milliseconds after which diff computation is cancelled. Use 0 for no timeout.
uk: Час в мілісекундах, після якого обчислення різниці скасовується. Використовуйте 0 для відсутності тайм-ауту.

# maxFileSize
source: Maximum file size in MB for which to compute diffs. Use 0 for no limit.
uk: Максимальний розмір файлу в МБ, для якого потрібно обчислити різниці. Використовуйте 0 для відсутності обмеження.

# maxTokenizationLineLength
source: Lines above this length will not be tokenized for performance reasons
uk: Рядки, що перевищують цю довжину, не будуть токенізовані з причин продуктивності

# renderGutterMenu
source: When enabled, the diff editor shows a special gutter for revert and stage actions.
uk: Коли увімкнено, редактор змін показує спеціальну панель для дій скасування та стадіювання.

# renderIndicators
source: Controls whether the diff editor shows +/- indicators for added/removed changes.
uk: Контролює, чи показує редактор змін індикатори +/- для доданих/видалених змін.

# renderMarginRevertIcon
source: When enabled, the diff editor shows arrows in its glyph margin to revert changes.
uk: Коли увімкнено, редактор змін показує стрілки в його маржі гліфів для скасування змін.

# renderSideBySideInlineBreakpoint
source: If the diff editor width is smaller than this value, the inline view is used.
uk: Якщо ширина редактора відмінностей менша за це значення, використовується вбудований вигляд.

# schema.brackets
source: Defines the bracket symbols that increase or decrease the indentation.
uk: Визначає символи дужок, які збільшують або зменшують відступ.

# schema.closeBracket
source: The closing bracket character or string sequence.
uk: Закриваючий символ дужки або рядкова послідовність.

# schema.colorizedBracketPairs
source: Defines the bracket pairs that are colorized by their nesting level if bracket pair colorization is enabled.
uk: Визначає пари дужок, які кольорові за їхнім рівнем вкладеності, якщо кольорове оформлення пар дужок увімкнено.

# schema.openBracket
source: The opening bracket character or string sequence.
uk: Символ відкриваючої дужки або рядкова послідовність.

# semanticHighlighting.configuredByTheme
source: Semantic highlighting is configured by the current color theme's `semanticHighlighting` setting.
uk: Семантичне підсвічування налаштовується за допомогою параметра `semanticHighlighting` поточної кольорової теми.

# semanticHighlighting.enabled
source: Controls whether the semanticHighlighting is shown for the languages that support it.
uk: Контролює, чи відображається семантичне підсвічування для мов, які його підтримують.

# semanticHighlighting.false
source: Semantic highlighting disabled for all color themes.
uk: Семантичне підсвічування вимкнено для всіх кольорових тем.

# semanticHighlighting.true
source: Semantic highlighting enabled for all color themes.
uk: Семантичне підсвічування увімкнено для всіх кольорових тем.

# showEmptyDecorations
source: Controls whether the diff editor shows empty decorations to see where characters got inserted or deleted.
uk: Контролює, чи показує редактор відмінностей порожні декорації, щоб бачити, де були вставлені або видалені символи.

# showMoves
source: Controls whether the diff editor should show detected code moves.
uk: Показати переміщені блоки коду

# sideBySide
source: Controls whether the diff editor shows the diff side by side or inline.
uk: Контролює, чи показує редактор порівняння різницю поруч або в ряд.

# stablePeek
source: Keep peek editors open even when double-clicking their content or when hitting `Escape`.
uk: Тримайте редактори попереднього перегляду відкритими навіть при двократному клацанні на їхньому вмісті або при натисканні `Escape`.

# tabSize
source: The number of spaces a tab is equal to. This setting is overridden based on the file contents when {0} is on.
uk: Кількість пробілів, які дорівнюють табуляції. Ця настройка переважає на основі вмісту файлу, коли {0} увімкнено.

# trimAutoWhitespace
source: Remove trailing auto inserted whitespace.
uk: Видалити зайві пробіли, які були автоматично вставлені.

# useInlineViewWhenSpaceIsLimited
source: If enabled and the editor width is too small, the inline view is used.
uk: Використовуйте вбудований вигляд, коли місця обмаль

# useTrueInlineView
source: If enabled and the editor uses the inline view, word changes are rendered inline.
uk: Якщо увімкнено і редактор використовує вбудований режим, зміни слів відображаються вбудовано.

# wordBasedSuggestions
source: Controls whether completions should be computed based on words in the document and from which documents they are computed.
uk: Контролює, чи повинні завершення обчислюватися на основі слів у документі та з яких документів вони обчислюються.

# wordBasedSuggestions.allDocuments
source: Suggest words from all open documents.
uk: Пропонуйте слова з усіх відкритих документів.

# wordBasedSuggestions.currentDocument
source: Only suggest words from the active document.
uk: Пропонувати лише слова з активного документа.

# wordBasedSuggestions.matchingDocuments
source: Suggest words from all open documents of the same language.
uk: Пропонуйте слова з усіх відкритих документів тієї ж мови.

# wordBasedSuggestions.off
source: Turn off Word Based Suggestions.
uk: Вимкнути пропозиції на основі слів.

# wordWrap.inherit
source: Lines will wrap according to the {0} setting.
uk: Рядки будуть обгортатися відповідно до налаштування {0}.

# wordWrap.off
source: Lines will never wrap.
uk: Рядки ніколи не переносяться.

# wordWrap.on
source: Lines will wrap at the viewport width.
uk: Рядки будуть переноситися на ширині вікна перегляду.

# acceptSuggestionOnCommitCharacter
source: Controls whether suggestions should be accepted on commit characters. For example, in JavaScript, the semi-colon (`;`) can be a commit character that accepts a suggestion and types that character.
uk: Контролює, чи слід приймати пропозиції на символах коміту. Наприклад, у JavaScript крапка з комою (`;`) може бути символом коміту, який приймає пропозицію і вводить цей символ.

# acceptSuggestionOnEnter
source: Controls whether suggestions should be accepted on `Enter`, in addition to `Tab`. Helps to avoid ambiguity between inserting new lines or accepting suggestions.
uk: Контролює, чи слід приймати пропозиції за допомогою `Enter`, на додаток до `Tab`. Допомагає уникнути неоднозначності між вставкою нових рядків або прийняттям пропозицій.

# acceptSuggestionOnEnterSmart
source: Only accept a suggestion with `Enter` when it makes a textual change.
uk: Приймайте пропозицію лише з `Enter`, коли вона вносить текстову зміну.

# accessibilityPageSize
source: Controls the number of lines in the editor that can be read out by a screen reader at once. When we detect a screen reader we automatically set the default to be 500. Warning: this has a performance implication for numbers larger than the default.
uk: Контролює кількість рядків у редакторі, які можуть бути прочитані одночасно екранним читачем. Коли ми виявляємо екранний читач, ми автоматично встановлюємо значення за замовчуванням на 500. Увага: це має вплив на продуктивність для чисел, більших за значення за замовчуванням.

# accessibilitySupport
source: Controls if the UI should run in a mode where it is optimized for screen readers.
uk: Контролює, чи інтерфейс користувача повинен працювати в режимі, оптимізованому для програм читання з екрану.

# accessibilitySupport.auto
source: Use platform APIs to detect when a Screen Reader is attached.
uk: Використовуйте API платформи, щоб виявити, коли екранний читач підключено.

# accessibilitySupport.off
source: Assume a screen reader is not attached.
uk: Припустимо, що екранний зчитувач не підключений.

# accessibilitySupport.on
source: Optimize for usage with a Screen Reader.
uk: Оптимізувати для використання з екранним читачем.

# allowVariableFonts
source: Controls whether to allow using variable fonts in the editor.
uk: Контролює, чи дозволяти використання змінних шрифтів в редакторі.

# allowVariableFontsInAccessibilityMode
source: Controls whether to allow using variable fonts in the editor in the accessibility mode.
uk: Контролює, чи дозволити використання змінних шрифтів в редакторі в режимі доступності.

# allowVariableLineHeights
source: Controls whether to allow using variable line heights in the editor.
uk: Контролює, чи дозволяти використання змінних висот рядків в редакторі.

# alternativeDeclarationCommand
source: Alternative command id that is being executed when the result of 'Go to Declaration' is the current location.
uk: Альтернативний ідентифікатор команди, який виконується, коли результатом 'Перейти до оголошення' є поточне місце.

# alternativeDefinitionCommand
source: Alternative command id that is being executed when the result of 'Go to Definition' is the current location.
uk: Альтернативний ідентифікатор команди, який виконується, коли результатом 'Перейти до визначення' є поточне місце.

# alternativeImplementationCommand
source: Alternative command id that is being executed when the result of 'Go to Implementation' is the current location.
uk: Альтернативний ідентифікатор команди, який виконується, коли результат 'Перейти до реалізації' є поточним місцем.

# alternativeReferenceCommand
source: Alternative command id that is being executed when the result of 'Go to Reference' is the current location.
uk: Ідентифікатор альтернативної команди, яка виконується, коли результат 'Перейти до посилання' є поточним місцем.

# alternativeTypeDefinitionCommand
source: Alternative command id that is being executed when the result of 'Go to Type Definition' is the current location.
uk: Альтернативний ідентифікатор команди, який виконується, коли результат 'Перейти до визначення типу' є поточним місцем.

# autoClosingBrackets
source: Controls whether the editor should automatically close brackets after the user adds an opening bracket.
uk: Контролює, чи має редактор автоматично закривати дужки після того, як користувач додає відкриваючу дужку.
