Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

# mouseWheelZoom.mac
source: Zoom the font of the editor when using mouse wheel and holding `Cmd`.
uk: Масштабувати шрифт редактора, використовуючи колесо миші та утримуючи `Cmd`.

# multiCursorLimit
source: Controls the max number of cursors that can be in an active editor at once.
uk: Контролює максимальну кількість курсорів, які можуть бути в активному редакторі одночасно.

# multiCursorMergeOverlapping
source: Merge multiple cursors when they are overlapping.
uk: Об'єднайте кілька курсорів, коли вони перекриваються.

# multiCursorModifier
source: The modifier to be used to add multiple cursors with the mouse. The Go to Definition and Open Link mouse gestures will adapt such that they do not conflict with the [multicursor modifier](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).
uk: Модифікатор, який буде використовуватися для додавання кількох курсорів за допомогою миші. Жести миші Перейти до визначення та Відкрити посилання адаптуються так, щоб не конфліктувати з [модифікатором для кількох курсорів](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).

# multiCursorModifier.alt
source: Maps to `Alt` on Windows and Linux and to `Option` on macOS.
uk: Відповідає `Alt` на Windows та Linux і `Option` на macOS.

# multiCursorModifier.ctrlCmd
source: Maps to `Control` on Windows and Linux and to `Command` on macOS.
uk: Відповідає `Control` на Windows і Linux та `Command` на macOS.

# multiCursorPaste
source: Controls pasting when the line count of the pasted text matches the cursor count.
uk: Контролює вставку, коли кількість рядків вставленого тексту відповідає кількості курсорів.

# multiCursorPaste.full
source: Each cursor pastes the full text.
uk: Кожен курсор вставляє повний текст.

# multiCursorPaste.spread
source: Each cursor pastes a single line of the text.
uk: Кожен курсор вставляє одну лінію тексту.

# occurrencesHighlight
source: Controls whether occurrences should be highlighted across open files.
uk: Контролює, чи слід виділяти випадки в відкритих файлах.

# occurrencesHighlight.multiFile
source: Experimental: Highlights occurrences across all valid open files.
uk: Експериментально: Підсвічує випадки у всіх дійсних відкритих файлах.

# occurrencesHighlight.off
source: Does not highlight occurrences.
uk: Не підсвічує випадки.

# occurrencesHighlight.singleFile
source: Highlights occurrences only in the current file.
uk: Підсвічує випадки тільки в поточному файлі.

# occurrencesHighlightDelay
source: Controls the delay in milliseconds after which occurrences are highlighted.
uk: Контролює затримку в мілісекундах, після якої події підсвічуються.

# off
source: Quick suggestions are disabled
uk: Швидкі пропозиції вимкнені

# on
source: Quick suggestions show inside the suggest widget
uk: Швидкі пропозиції відображаються всередині віджету пропозицій

# overtypeCursorStyle
source: Controls the cursor style in overtype input mode.
uk: Контролює стиль курсора в режимі надписування.

# overtypeOnPaste
source: Controls whether pasting should overtype.
uk: Контролює, чи потрібно вставляти з перезаписом.

# overviewRulerBorder
source: Controls whether a border should be drawn around the overview ruler.
uk: Контролює, чи має бути намальована рамка навколо оглядового лінійки.

# padding.bottom
source: Controls the amount of space between the bottom edge of the editor and the last line.
uk: Контролює кількість простору між нижнім краєм редактора та останнім рядком.

# padding.top
source: Controls the amount of space between the top edge of the editor and the first line.
uk: Контролює кількість простору між верхнім краєм редактора та першим рядком.

# parameterHints.cycle
source: Controls whether the parameter hints menu cycles or closes when reaching the end of the list.
uk: Контролює, чи меню підказок параметрів циклічно прокручується або закривається при досягненні кінця списку.

# parameterHints.enabled
source: Enables a pop-up that shows parameter documentation and type information as you type.
uk: Увімкнення спливаючого вікна, яке показує документацію параметрів та інформацію про типи під час введення.

# pasteAs.enabled
source: Controls whether you can paste content in different ways.
uk: Контролює, чи можете ви вставляти вміст різними способами.

# pasteAs.showPasteSelector
source: Controls if a widget is shown when pasting content in to the editor. This widget lets you control how the file is pasted.
uk: Контролює, чи віджет відображається при вставці вмісту в редактор. Цей віджет дозволяє вам контролювати, як файл вставляється.

# pasteAs.showPasteSelector.afterPaste
source: Show the paste selector widget after content is pasted into the editor.
uk: Показати віджет вибору вставки після того, як вміст буде вставлено в редактор.

# pasteAs.showPasteSelector.never
source: Never show the paste selector widget. Instead the default pasting behavior is always used.
uk: Ніколи не показувати віджет вибору вставки. Замість цього завжди використовується поведінка вставки за замовчуванням.

# peekWidgetDefaultFocus
source: Controls whether to focus the inline editor or the tree in the peek widget.
uk: Контролює, чи фокусувати інлайн-редактор, чи дерево у віджеті попереднього перегляду.

# peekWidgetDefaultFocus.editor
source: Focus the editor when opening peek
uk: Зосередьте редактор при відкритті попереднього перегляду

# peekWidgetDefaultFocus.tree
source: Focus the tree when opening peek
uk: Зосередьтеся на дереві при відкритті попереднього перегляду

# quickSuggestions
source: Controls whether suggestions should automatically show up while typing. This can be controlled for typing in comments, strings, and other code. Quick suggestion can be configured to show as ghost text or with the suggest widget. Also be aware of the {0}-setting which controls if suggestions are triggered by special characters.
uk: Контролює, чи повинні пропозиції автоматично з'являтися під час введення. Це можна контролювати для введення в коментарях, рядках та іншому коді. Швидкі пропозиції можна налаштувати на відображення як текст-привид або з віджетом пропозицій. Також зверніть увагу на налаштування {0}, яке контролює, чи викликаються пропозиції спеціальними символами.

# quickSuggestions.comments
source: Enable quick suggestions inside comments.
uk: Увімкніть швидкі пропозиції всередині коментарів.

# quickSuggestions.other
source: Enable quick suggestions outside of strings and comments.
uk: Увімкніть швидкі підказки поза рядками та коментарями.

# quickSuggestions.strings
source: Enable quick suggestions inside strings.
uk: Увімкніть швидкі підказки всередині рядків.

# quickSuggestionsDelay
source: Controls the delay in milliseconds after which quick suggestions will show up.
uk: Контролює затримку в мілісекундах, після якої з'являться швидкі пропозиції.

# renameOnType
source: Controls whether the editor auto renames on type.
uk: Контролює, чи редактор автоматично перейменовує під час введення.

# renameOnTypeDeprecate
source: Deprecated, use `#editor.linkedEditing#` instead.
uk: Застаріло, використовуйте `#editor.linkedEditing#` замість цього.

# renderControlCharacters
source: Controls whether the editor should render control characters.
uk: Контролює, чи має редактор відображати контрольні символи.

# renderFinalNewline
source: Render last line number when the file ends with a newline.
uk: Відображати останній номер рядка, коли файл закінчується новим рядком.

# renderLineHighlight
source: Controls how the editor should render the current line highlight.
uk: Контролює, як редактор повинен відображати виділення поточного рядка.

# renderLineHighlight.all
source: Highlights both the gutter and the current line.
uk: Виділяє як жолоб, так і поточний рядок.

# renderLineHighlightOnlyWhenFocus
source: Controls if the editor should render the current line highlight only when the editor is focused.
uk: Контролює, чи редактор повинен підсвічувати поточний рядок лише тоді, коли редактор має фокус.

# renderRichScreenReaderContent
source: Whether to render rich screen reader content when the `#editor.editContext#` setting is enabled.
uk: Чи потрібно відображати багатий контент для читачів екрану, коли увімкнено налаштування `#editor.editContext#`.

# renderWhitespace
source: Controls how the editor should render whitespace characters.
uk: Контролює, як редактор повинен відображати символи пробілів.

# renderWhitespace.boundary
source: Render whitespace characters except for single spaces between words.
uk: Відображати символи пробілів, за винятком одиничних пробілів між словами.

# renderWhitespace.selection
source: Render whitespace characters only on selected text.
uk: Відображати символи пробілів лише на вибраному тексті.

# renderWhitespace.trailing
source: Render only trailing whitespace characters.
uk: Відображати лише пробіли в кінці рядка.

# roundedSelection
source: Controls whether selections should have rounded corners.
uk: Контролює, чи вибрані елементи повинні мати закруглені кути.

# rulers
source: Render vertical rulers after a certain number of monospace characters. Use multiple values for multiple rulers. No rulers are drawn if array is empty.
uk: Відображати вертикальні лінійки після певної кількості символів моноширинного шрифту. Використовуйте кілька значень для кількох лінійок. Лінійки не малюються, якщо масив порожній.

# rulers.color
source: Color of this editor ruler.
uk: Колір лінійки цього редактора.

# rulers.size
source: Number of monospace characters at which this editor ruler will render.
uk: Кількість моноширинних символів, при якій цей редакторський лінійка буде відображатися.

# screenReaderAnnounceInlineSuggestion
source: Control whether inline suggestions are announced by a screen reader.
uk: Контролюйте, чи оголошуються вбудовані пропозиції за допомогою екранного зчитувача.

# scrollBeyondLastColumn
source: Controls the number of extra characters beyond which the editor will scroll horizontally.
uk: Контролює кількість додаткових символів, після яких редактор буде прокручуватися горизонтально.

# scrollBeyondLastLine
source: Controls whether the editor will scroll beyond the last line.
uk: Контролює, чи буде редактор прокручуватися за межі останнього рядка.

# scrollOnMiddleClick
source: Controls whether the editor will scroll when the middle button is pressed.
uk: Контролює, чи буде редактор прокручуватися, коли натиснуто середню кнопку.

# scrollPredominantAxis
source: Scroll only along the predominant axis when scrolling both vertically and horizontally at the same time. Prevents horizontal drift when scrolling vertically on a trackpad.
uk: Прокручуйте лише вздовж переважної осі, коли прокручуєте одночасно вертикально та горизонтально. Запобігає горизонтальному зсуву під час вертикальної прокрутки на трекпаді.

# scrollbar.horizontal
source: Controls the visibility of the horizontal scrollbar.
uk: Контролює видимість горизонтальної смуги прокрутки.

# scrollbar.horizontal.auto
source: The horizontal scrollbar will be visible only when necessary.
uk: Горизонтальна смуга прокрутки буде видима лише коли це необхідно.

# scrollbar.horizontal.fit
source: The horizontal scrollbar will always be hidden.
uk: Горизонтальна смуга прокрутки завжди буде прихована.

# scrollbar.horizontal.visible
source: The horizontal scrollbar will always be visible.
uk: Горизонтальна смуга прокрутки завжди буде видимою.

# scrollbar.horizontalScrollbarSize
source: The height of the horizontal scrollbar.
uk: Висота горизонтальної смуги прокрутки.

# scrollbar.ignoreHorizontalScrollbarInContentHeight
source: When set, the horizontal scrollbar will not increase the size of the editor's content.
uk: Коли встановлено, горизонтальна смуга прокрутки не збільшить розмір вмісту редактора.

# scrollbar.scrollByPage
source: Controls whether clicks scroll by page or jump to click position.
uk: Контролює, чи кліки прокручують сторінку або стрибають до позиції кліку.

# scrollbar.vertical
source: Controls the visibility of the vertical scrollbar.
uk: Контролює видимість вертикальної смуги прокрутки.

# scrollbar.vertical.auto
source: The vertical scrollbar will be visible only when necessary.
uk: Вертикальна смуга прокрутки буде видима лише коли це необхідно.

# scrollbar.vertical.fit
source: The vertical scrollbar will always be hidden.
uk: Вертикальний скроллбар завжди буде прихований.

# scrollbar.vertical.visible
source: The vertical scrollbar will always be visible.
uk: Вертикальна смуга прокрутки завжди буде видимою.

# scrollbar.verticalScrollbarSize
source: The width of the vertical scrollbar.
uk: Ширина вертикальної смуги прокрутки.

# selectLeadingAndTrailingWhitespace
source: Whether leading and trailing whitespace should always be selected.
uk: Чи слід завжди вибирати провідний та кінцевий пробіли.

# selectSubwords
source: Whether subwords (like 'foo' in 'fooBar' or 'foo_bar') should be selected.
uk: Чи слід вибирати підслова (як 'foo' у 'fooBar' або 'foo_bar').

# selectionClipboard
source: Controls whether the Linux primary clipboard should be supported.
uk: Контролює, чи слід підтримувати основний буфер обміну Linux.

# selectionHighlight
source: Controls whether the editor should highlight matches similar to the selection.
uk: Контролює, чи повинен редактор підсвічувати збіги, подібні до вибору.

# selectionHighlightMaxLength
source: Controls how many characters can be in the selection before similiar matches are not highlighted. Set to zero for unlimited.
uk: Контролює, скільки символів може бути в виборі, перш ніж подібні збіги не будуть підсвічені. Встановіть на нуль для необмеженої кількості.

# selectionHighlightMultiline
source: Controls whether the editor should highlight selection matches that span multiple lines.
uk: Контролює, чи повинен редактор підсвічувати збіги вибору, які охоплюють кілька рядків.

# showDeprecated
source: Controls strikethrough deprecated variables.
uk: Контролює перекреслені застарілі змінні.

# showFoldingControls
source: Controls when the folding controls on the gutter are shown.
uk: Контролює, коли елементи управління складання на жолобі відображаються.

# showFoldingControls.always
source: Always show the folding controls.
uk: Завжди показувати елементи управління складанням.

# showFoldingControls.mouseover
source: Only show the folding controls when the mouse is over the gutter.
uk: Показувати елементи управління складанням лише тоді, коли миша знаходиться над відступом.

# showFoldingControls.never
source: Never show the folding controls and reduce the gutter size.
uk: Ніколи не показувати елементи управління згортанням і зменшити розмір міжстовпцевого простору.

# showUnused
source: Controls fading out of unused code.
uk: Контролює зникнення невикористаного коду.

# smoothScrolling
source: Controls whether the editor will scroll using an animation.
uk: Контролює, чи буде редактор прокручувати з анімацією.

# snippetSuggestions
source: Controls whether snippets are shown with other suggestions and how they are sorted.
uk: Контролює, чи відображаються фрагменти з іншими пропозиціями та як вони сортуються.

# snippetSuggestions.bottom
source: Show snippet suggestions below other suggestions.
uk: Показати пропозиції фрагментів нижче інших пропозицій.

# snippetSuggestions.inline
source: Show snippets suggestions with other suggestions.
uk: Показати фрагменти пропозицій з іншими пропозиціями.

# snippetSuggestions.none
source: Do not show snippet suggestions.
uk: Не показувати пропозиції фрагментів.

# snippetSuggestions.top
source: Show snippet suggestions on top of other suggestions.
uk: Показувати пропозиції фрагментів поверх інших пропозицій.

# stickyTabStops
source: Emulate selection behavior of tab characters when using spaces for indentation. Selection will stick to tab stops.
uk: Емулація поведінки вибору символів табуляції при використанні пробілів для відступу. Вибір буде прив'язаний до зупинок табуляції.

# suggest.filterGraceful
source: Controls whether filtering and sorting suggestions accounts for small typos.
uk: Контролює, чи враховують пропозиції фільтрації та сортування незначні помилки друку.

# suggest.insertMode
source: Controls whether words are overwritten when accepting completions. Note that this depends on extensions opting into this feature.
uk: Контролює, чи будуть слова перезаписані під час прийняття завершень. Зверніть увагу, що це залежить від розширень, які обирають цю функцію.

# suggest.insertMode.always
source: Always select a suggestion when automatically triggering IntelliSense.
uk: Завжди обирайте пропозицію при автоматичному виклику IntelliSense.

# suggest.insertMode.insert
source: Insert suggestion without overwriting text right of the cursor.
uk: Вставити пропозицію без перезапису тексту праворуч від курсора.

# suggest.insertMode.never
source: Never select a suggestion when automatically triggering IntelliSense.
uk: Ніколи не вибирайте пропозицію при автоматичному виклику IntelliSense.

# suggest.insertMode.replace
source: Insert suggestion and overwrite text right of the cursor.
uk: Вставте пропозицію та перезапишіть текст праворуч від курсора.

# suggest.insertMode.whenQuickSuggestion
source: Select a suggestion only when triggering IntelliSense as you type.
uk: Вибирайте пропозицію лише під час виклику IntelliSense під час введення.

# suggest.insertMode.whenTriggerCharacter
source: Select a suggestion only when triggering IntelliSense from a trigger character.
uk: Виберіть пропозицію лише при активації IntelliSense з символу тригера.

# suggest.localityBonus
source: Controls whether sorting favors words that appear close to the cursor.
uk: Контролює, чи сортування віддає перевагу словам, які з'являються близько до курсора.

# suggest.maxVisibleSuggestions.dep
source: This setting is deprecated. The suggest widget can now be resized.
uk: Це налаштування застаріло. Віджет пропозицій тепер можна змінювати за розміром.

# suggest.preview
source: Controls whether to preview the suggestion outcome in the editor.
uk: Контролює, чи потрібно попередньо переглядати результат пропозиції в редакторі.

# suggest.selectionMode
source: Controls whether a suggestion is selected when the widget shows. Note that this only applies to automatically triggered suggestions ({0} and {1}) and that a suggestion is always selected when explicitly invoked, e.g via `Ctrl+Space`.
uk: Контролює, чи вибрано пропозицію, коли віджет відображається. Зверніть увагу, що це стосується лише автоматично викликаних пропозицій ({0} та {1}), і що пропозиція завжди вибирається, коли її явно викликано, наприклад, через `Ctrl+Space`.

# suggest.shareSuggestSelections
source: Controls whether remembered suggestion selections are shared between multiple workspaces and windows (needs `#editor.suggestSelection#`).
uk: Контролює, чи збережені вибори пропозицій діляться між кількома робочими просторами та вікнами (потрібно `#editor.suggestSelection#`).

# suggest.showIcons
source: Controls whether to show or hide icons in suggestions.
uk: Контролює, чи показувати або приховувати значки в пропозиціях.

# suggest.showInlineDetails
source: Controls whether suggest details show inline with the label or only in the details widget.
uk: Контролює, чи деталі пропозиції відображаються в рядку з міткою, чи лише у віджеті деталей.

# suggest.showStatusBar
source: Controls the visibility of the status bar at the bottom of the suggest widget.
uk: Контролює видимість панелі стану внизу віджета пропозицій.

# suggest.snippetsPreventQuickSuggestions
source: Controls whether an active snippet prevents quick suggestions.
uk: Контролює, чи активний фрагмент запобігає швидким підказкам.

# suggestFontSize
source: Font size for the suggest widget. When set to {0}, the value of {1} is used.
uk: Розмір шрифту для віджета пропозицій. Коли встановлено {0}, використовується значення {1}.

# suggestLineHeight
source: Line height for the suggest widget. When set to {0}, the value of {1} is used. The minimum value is 8.
uk: Висота рядка для віджета пропозицій. Коли встановлено {0}, використовується значення {1}. Мінімальне значення - 8.

# suggestOnTriggerCharacters
source: Controls whether suggestions should automatically show up when typing trigger characters.
uk: Контролює, чи повинні пропозиції автоматично з'являтися при введенні тригерних символів.

# suggestSelection
source: Controls how suggestions are pre-selected when showing the suggest list.
uk: Контролює, як пропозиції попередньо вибираються під час відображення списку пропозицій.

# suggestSelection.first
source: Always select the first suggestion.
uk: Завжди обирайте першу пропозицію.

# suggestSelection.recentlyUsed
source: Select recent suggestions unless further typing selects one, e.g. `console.| -> console.log` because `log` has been completed recently.
uk: Виберіть останні пропозиції, якщо подальший набір тексту не вибирає одну, наприклад, `console.| -> console.log`, оскільки `log` було завершено нещодавно.

# suggestSelection.recentlyUsedByPrefix
source: Select suggestions based on previous prefixes that have completed those suggestions, e.g. `co -> console` and `con -> const`.
uk: Виберіть пропозиції на основі попередніх префіксів, які завершили ці пропозиції, наприклад, `co -> console` та `con -> const`.

# tabCompletion
source: Enables tab completions.
uk: Увімкнення автозаповнення вкладок.

# tabCompletion.off
source: Disable tab completions.
uk: Вимкнути автозаповнення вкладок.

# tabCompletion.on
source: Tab complete will insert the best matching suggestion when pressing tab.
uk: Автозаповнення вставить найкращу відповідну пропозицію при натисканні клавіші tab.

# tabCompletion.onlySnippets
source: Tab complete snippets when their prefix match. Works best when 'quickSuggestions' aren't enabled.
uk: Додайте фрагменти за допомогою табуляції, коли їх префікс збігається. Найкраще працює, коли 'quickSuggestions' не ввімкнено.

# tabFocusMode
source: Controls whether the editor receives tabs or defers them to the workbench for navigation.
uk: Контролює, чи редактор отримує вкладки, чи передає їх на робочу панель для навігації.

# trimWhitespaceOnDelete
source: Controls whether the editor will also delete the next line's indentation whitespace when deleting a newline.
uk: Контролює, чи редактор також видалятиме пробіли відступу наступного рядка при видаленні нового рядка.

# unfoldOnClickAfterEndOfLine
source: Controls whether clicking on the empty content after a folded line will unfold the line.
uk: Контролює, чи клацання на порожньому контенті після складеної лінії розгорне цю лінію.

# unicodeHighlight.allowedCharacters
source: Defines allowed characters that are not being highlighted.
uk: Визначає дозволені символи, які не підсвічуються.

# unicodeHighlight.allowedLocales
source: Unicode characters that are common in allowed locales are not being highlighted.
uk: Символи Unicode, які є загальними в дозволених локалях, не підсвічуються.

# unicodeHighlight.ambiguousCharacters
source: Controls whether characters are highlighted that can be confused with basic ASCII characters, except those that are common in the current user locale.
uk: Контролює, чи виділяються символи, які можуть бути сплутані з базовими ASCII-символами, за винятком тих, що є поширеними в поточній локалі користувача.

# unicodeHighlight.includeComments
source: Controls whether characters in comments should also be subject to Unicode highlighting.
uk: Контролює, чи повинні символи в коментарях також підлягати підсвічуванню Unicode.

# unicodeHighlight.includeStrings
source: Controls whether characters in strings should also be subject to Unicode highlighting.
uk: Контролює, чи повинні символи в рядках також підлягати підсвічуванню Unicode.
