Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor_contrib.xlf
Languages: uk

# miCopyLinesDown
source: Co&&py Line Down
uk: С&&копіювати рядок вниз

# miCopyLinesUp
source: &&Copy Line Up
uk: &&Копіювати рядок вгору

# miDuplicateSelection
source: &&Duplicate Selection
uk: &&Дублювати вибір

# miMoveLinesDown
source: Move &&Line Down
uk: П&&еремістити рядок вниз

# miMoveLinesUp
source: Mo&&ve Line Up
uk: Пе&&ремістити рядок вверх

# editorLinkedEditingBackground
source: Background color when the editor auto renames on type.
uk: Колір фону, коли редактор автоматично перейменовує під час введення.

# linkedEditing.label
source: Start Linked Editing
uk: Почати спільне редагування

# invalid.url
source: Failed to open this link because it is not well-formed: {0}
uk: Не вдалося відкрити це посилання, оскільки воно неправильно сформоване: {0}

# label
source: Open Link
uk: Відкрити посилання

# links.navigate.executeCmd
source: Execute command
uk: Виконати команду

# links.navigate.follow
source: Follow link
uk: Слідувати за посиланням

# missing.url
source: Failed to open this link because its target is missing.
uk: Не вдалося відкрити це посилання, оскільки його ціль відсутня.

# tooltip.explanation
source: Execute command {0}
uk: Виконати команду {0}

# messageVisible
source: Whether the editor is currently showing an inline message
uk: Чи редактор наразі показує вбудоване повідомлення

source: Add Selection to Next Find Match
uk: Додати вибір до наступного збігу

source: Add Selection to Previous Find Match
uk: Додати вибір до попереднього збігу пошуку

# changeAll.label
source: Change All Occurrences
uk: Змінити всі випадки

# cursorAdded
source: Cursor added: {0}
uk: Курсор додано: {0}

# cursorsAdded
source: Cursors added: {0}
uk: Додано курсорів: {0}

# miAddSelectionToNextFindMatch
source: Add &&Next Occurrence
uk: Додати &&наступний випадок

# miAddSelectionToPreviousFindMatch
source: Add P&&revious Occurrence
uk: Додати п&&опередній випадок

# miInsertCursorAbove
source: &&Add Cursor Above
uk: &&Додати курсор вище

# miInsertCursorAtEndOfEachLineSelected
source: Add C&&ursors to Line Ends
uk: Додати к&&урсори до кінців рядків

# miInsertCursorBelow
source: A&&dd Cursor Below
uk: Д&&одати курсор нижче

# miSelectHighlights
source: Select All &&Occurrences
uk: Вибрати всі &&випадки

# moveSelectionToNextFindMatch
source: Move Last Selection to Next Find Match
uk: Перемістити останній вибір до наступного збігу знайдення

# moveSelectionToPreviousFindMatch
source: Move Last Selection to Previous Find Match
uk: Перемістити останній вибір до попереднього збігу пошуку

# mutlicursor.addCursorsToBottom
source: Add Cursors to Bottom
uk: Додати курсори до низу

# mutlicursor.addCursorsToTop
source: Add Cursors to Top
uk: Додати курсори до верху

# mutlicursor.focusNextCursor
source: Focus Next Cursor
uk: Фокус наступного курсора

# mutlicursor.focusNextCursor.description
source: Focuses the next cursor
uk: Фокусується на наступному курсорі

# mutlicursor.focusPreviousCursor
source: Focus Previous Cursor
uk: Зосередити попередній курсор

# mutlicursor.focusPreviousCursor.description
source: Focuses the previous cursor
uk: Фокусується на попередньому курсорі

# mutlicursor.insertAbove
source: Add Cursor Above
uk: Додати курсор вище

# mutlicursor.insertAtEndOfEachLineSelected
source: Add Cursors to Line Ends
uk: Додати курсори до кінців рядків

# mutlicursor.insertBelow
source: Add Cursor Below
uk: Додати курсор нижче

source: Select All Occurrences of Find Match
uk: Вибрати всі збіги знайденого

# parameterHints.trigger.label
source: Trigger Parameter Hints
uk: Параметри підказок тригера

# editorHoverWidgetHighlightForeground
source: Foreground color of the active item in the parameter hint.
uk: Колір переднього плану активного елемента в підказці параметра.

# hint
source: {0}, hint
uk: {0}, підказка

# inReferenceSearchEditor
source: Whether the current code editor is embedded inside peek
uk: Чи вбудований поточний редактор коду всередині peek

# label.close
source: Close
uk: Закрити

# peekViewBorder
source: Color of the peek view borders and arrow.
uk: Колір меж попереднього перегляду та стрілки.

# peekViewEditorBackground
source: Background color of the peek view editor.
uk: Колір фону редактора попереднього перегляду.

# peekViewEditorGutterBackground
source: Background color of the gutter in the peek view editor.
uk: Колір фону жолоба в редакторі попереднього перегляду.

# peekViewEditorMatchHighlight
source: Match highlight color in the peek view editor.
uk: Відповідність кольору підсвічування в редакторі попереднього перегляду.

# peekViewEditorMatchHighlightBorder
source: Match highlight border in the peek view editor.
uk: Виділити межу матчу в редакторі попереднього перегляду.

# peekViewEditorStickScrollBackground
source: Background color of sticky scroll in the peek view editor.
uk: Колір фону липкого прокручування в редакторі попереднього перегляду.

# peekViewEditorStickyScrollGutterBackground
source: Background color of the gutter part of sticky scroll in the peek view editor.
uk: Колір фону частини жолоба липкого прокручування в редакторі попереднього перегляду.

# peekViewResultsBackground
source: Background color of the peek view result list.
uk: Колір фону списку результатів перегляду.

# peekViewResultsFileForeground
source: Foreground color for file nodes in the peek view result list.
uk: Колір переднього плану для вузлів файлів у списку результатів перегляду.

# peekViewResultsMatchForeground
source: Foreground color for line nodes in the peek view result list.
uk: Колір переднього плану для лінійних вузлів у списку результатів перегляду.

# peekViewResultsMatchHighlight
source: Match highlight color in the peek view result list.
uk: Відповідність кольору виділення в списку результатів попереднього перегляду.

# peekViewResultsSelectionBackground
source: Background color of the selected entry in the peek view result list.
uk: Колір фону вибраного запису в списку результатів перегляду.

# peekViewResultsSelectionForeground
source: Foreground color of the selected entry in the peek view result list.
uk: Колір переднього плану вибраного елемента в списку результатів перегляду.

# peekViewTitleBackground
source: Background color of the peek view title area.
uk: Колір фону області заголовка попереднього перегляду.

# peekViewTitleForeground
source: Color of the peek view title.
uk: Колір заголовка попереднього перегляду.

# peekViewTitleInfoForeground
source: Color of the peek view title info.
uk: Колір заголовка інформації попереднього перегляду.

# placeholderForeground
source: Foreground color of the placeholder text in the editor.
uk: Колір переднього плану тексту підказки в редакторі.

# cannotRunGotoLine
source: Open a text editor first to go to a line.
uk: Спочатку відкрийте текстовий редактор, щоб перейти до рядка.

# gotoLineColumnLabel
source: Go to line {0} and character {1}.
uk: Перейдіть до рядка {0} і символу {1}.

# gotoLineLabel
source: Go to line {0}.
uk: Перейти до рядка {0}.

# gotoLineLabelEmpty
source: Current Line: {0}, Character: {1}. Type a line number to navigate to.
uk: Поточний рядок: {0}, Символ: {1}. Введіть номер рядка, щоб перейти до нього.

# gotoLineLabelEmptyWithLimit
source: Current Line: {0}, Character: {1}. Type a line number between 1 and {2} to navigate to.
uk: Поточний рядок: {0}, Символ: {1}. Введіть номер рядка від 1 до {2}, щоб перейти до нього.

# _constructor
source: constructors ({0})
uk: конструктори ({0})

# array
source: arrays ({0})
uk: масиви ({0})

# boolean
source: booleans ({0})
uk: логічні значення ({0})

# cannotRunGotoSymbolWithoutEditor
source: To go to a symbol, first open a text editor with symbol information.
uk: Щоб перейти до символу, спочатку відкрийте текстовий редактор з інформацією про символ.

# cannotRunGotoSymbolWithoutSymbolProvider
source: The active text editor does not provide symbol information.
uk: Активний текстовий редактор не надає інформацію про символи.

# class
source: classes ({0})
uk: класи ({0})

# constant
source: constants ({0})
uk: константи ({0})

# enum
source: enumerations ({0})
uk: перерахування ({0})

# enumMember
source: enumeration members ({0})
uk: члени перерахування ({0})

# event
source: events ({0})
uk: події ({0})

# field
source: fields ({0})
uk: поля ({0})

# file
source: files ({0})
uk: файли ({0})

# function
source: functions ({0})
uk: функції ({0})

# interface
source: interfaces ({0})
uk: інтерфейси ({0})

# key
source: keys ({0})
uk: ключі ({0})

# method
source: methods ({0})
uk: методи ({0})

# modules
source: modules ({0})
uk: модулі ({0})

# namespace
source: namespaces ({0})
uk: простори імен ({0})

# noMatchingSymbolResults
source: No matching editor symbols
uk: Немає відповідних символів редактора

# noSymbolResults
source: No editor symbols
uk: Немає символів редактора

# number
source: numbers ({0})
uk: числа ({0})

# object
source: objects ({0})
uk: об'єкти ({0})

# openToBottom
source: Open to the Bottom
uk: Відкрито до низу

# openToSide
source: Open to the Side
uk: Відкрити вбік

# operator
source: operators ({0})
uk: оператори ({0})

# package
source: packages ({0})
uk: пакунки ({0})

# property
source: properties ({0})
uk: властивості ({0})

# string
source: strings ({0})
uk: рядки ({0})

# struct
source: structs ({0})
uk: структури ({0})

# symbols
source: symbols ({0})
uk: символи ({0})

# typeParameter
source: type parameters ({0})
uk: параметри типу ({0})

# variable
source: variables ({0})
uk: змінні ({0})

# editor.readonly
source: Cannot edit in read-only editor
uk: Не можна редагувати в редакторі тільки для читання

# editor.simple.readonly
source: Cannot edit in read-only input
uk: Не можна редагувати в полі введення лише для читання

# aria
source: Successfully renamed '{0}' to '{1}'. Summary: {2}
uk: Успішно перейменовано '{0}' на '{1}'. Резюме: {2}

# enablePreview
source: Enable/disable the ability to preview changes before renaming
uk: Увімкнути/вимкнути можливість попереднього перегляду змін перед перейменуванням

source: Focus Next Rename Suggestion
uk: Зосередити наступну пропозицію перейменування

source: Focus Previous Rename Suggestion
uk: Зосередити попередню пропозицію перейменування

# label
source: Renaming '{0}' to '{1}'
uk: Відкрити посилання

source: No result.
uk: Немає результату.

# quotableLabel
source: Renaming {0} to {1}
uk: Перейменування {0} на {1}

# rename.failed
source: Rename failed to compute edits
uk: Не вдалося обчислити зміни

# rename.failedApply
source: Rename failed to apply edits
uk: Не вдалося застосувати зміни до перейменування

# rename.label
source: Rename Symbol
uk: Перейменувати символ

# resolveRenameLocationFailed
source: An unknown error occurred while resolving rename location
uk: Сталася невідома помилка під час вирішення місця перейменування

# cancelRenameSuggestionsButton
source: Cancel
uk: Скасувати

# generateRenameSuggestionsButton
source: Generate new name suggestions
uk: Генерувати нові пропозиції імен

# label
source: {0} to Rename, {1} to Preview
uk: Відкрити посилання

# renameAriaLabel
source: Rename input. Type new name and press Enter to commit.
uk: Перейменуйте вхід. Введіть нову назву і натисніть Enter, щоб підтвердити.

# renameInputFocused
source: Whether the rename input widget is focused
uk: Чи сфокусовано віджет введення перейменування

# renameInputVisible
source: Whether the rename input widget is visible
uk: Чи видимий віджет введення для перейменування

# renameSuggestionsReceivedAria
source: Received {0} rename suggestions
uk: Отримано {0} пропозицій щодо перейменування

# miSmartSelectGrow
source: &&Expand Selection
uk: &&Розгорнути вибір

# miSmartSelectShrink
source: &&Shrink Selection
uk: &&Зменшити вибір

# smartSelect.expand
source: Expand Selection
uk: Розширити вибір

# smartSelect.shrink
source: Shrink Selection
uk: Зменшити вибір

# hasNextTabstop
source: Whether there is a next tab stop when in snippet mode
uk: Чи є наступна зупинка табуляції в режимі фрагмента

# hasPrevTabstop
source: Whether there is a previous tab stop when in snippet mode
uk: Чи є попередня позиція табуляції в режимі фрагмента

# inSnippetMode
source: Whether the editor in current in snippet mode
uk: Чи редактор у поточному режимі фрагмента

# next
source: Go to next placeholder...
uk: Далі

source: April
uk: Квітень

# AprilShort
source: Apr
uk: Квіт

source: August
uk: Серпень

# AugustShort
source: Aug
uk: Сер

source: December
uk: Грудень

# DecemberShort
source: Dec
uk: Груд

source: February
uk: Лютий

# FebruaryShort
source: Feb
uk: Лют

source: Friday
uk: П'ятниця

# FridayShort
source: Fri
uk: Пт

source: January
uk: Січень

# JanuaryShort
source: Jan
uk: Січ

source: July
uk: Липень

# JulyShort
source: Jul
uk: Лип

source: June
uk: Червень

# JuneShort
source: Jun
uk: Черв

source: March
uk: Березень

# MarchShort
source: Mar
uk: Бер

source: May
uk: Травень

# MayShort
source: May
uk: Травень

source: Monday
uk: Понеділок

# MondayShort
source: Mon
uk: Пн

source: November
uk: Листопад

# NovemberShort
source: Nov
uk: Лис

source: October
uk: Жовтень

# OctoberShort
source: Oct
uk: Жовт

source: Saturday
uk: Субота

# SaturdayShort
source: Sat
uk: Субота

source: September
uk: Вересень

# SeptemberShort
source: Sep
uk: Вер

source: Sunday
uk: Неділя

# SundayShort
source: Sun
uk: Сонце

source: Thursday
uk: Четвер

# ThursdayShort
source: Thu
uk: Чт

source: Tuesday
uk: Вівторок

# TuesdayShort
source: Tue
uk: Вт

source: Wednesday
uk: Середа

# WednesdayShort
source: Wed
uk: Ср

# focusStickyScroll
source: Focus Editor Sticky Scroll
uk: Редактор фокусу Липке прокручування

# goToFocusedStickyScrollLine.title
source: Go to the focused sticky scroll line
uk: Перейдіть до фокусованої липкої смуги прокрутки

# miStickyScroll
source: &&Sticky Scroll
uk: &&Липке прокручування

# mifocusEditorStickyScroll
source: &&Focus Editor Sticky Scroll
uk: &&Зосередити редактор на липкому прокручуванні

# mitoggleStickyScroll
source: &&Toggle Editor Sticky Scroll
uk: &&Перемкнути закріплення прокрутки редактора

# selectEditor.title
source: Select Editor
uk: Вибрати редактор

# selectNextStickyScrollLine.title
source: Select the next editor sticky scroll line
uk: Виберіть наступний рядок фіксованого прокручування редактора

# selectPreviousStickyScrollLine.title
source: Select the previous sticky scroll line
uk: Виберіть попередній закріплений рядок прокрутки

source: Sticky Scroll
uk: Липке прокручування

source: Toggle Editor Sticky Scroll
uk: Перемикання фіксованого прокручування редактора

# toggleEditorStickyScroll.description
source: Toggle/enable the editor sticky scroll which shows the nested scopes at the top of the viewport
uk: Перемкніть/увімкніть фіксований прокручування редактора, яке показує вкладені області вгорі області перегляду

# acceptSuggestionOnEnter
source: Whether suggestions are inserted when pressing Enter
uk: Чи вставляються пропозиції при натисканні Enter

# suggestWidgetDetailsVisible
source: Whether suggestion details are visible
uk: Чи видимі деталі пропозиції

# suggestWidgetHasSelection
source: Whether any suggestion is focused
uk: Чи зосереджена будь-яка пропозиція

# suggestWidgetMultipleSuggestions
source: Whether there are multiple suggestions to pick from
uk: Чи є кілька пропозицій на вибір

# suggestionCanResolve
source: Whether the current suggestion supports to resolve further details
uk: Чи підтримує поточна пропозиція вирішення подальших деталей

# suggestionHasInsertAndReplaceRange
source: Whether the current suggestion has insert and replace behaviour
uk: Чи має поточна пропозиція поведінку вставки та заміни

# suggestionInsertMode
source: Whether the default behaviour is to insert or replace
uk: Чи є поведінка за замовчуванням вставкою чи заміною

# suggestionMakesTextEdit
source: Whether inserting the current suggestion yields in a change or has everything already been typed
uk: Чи вставка поточної пропозиції призводить до зміни, чи все вже було введено

# accept.insert
source: Insert
uk: Вставити

# accept.replace
source: Replace
uk: Замінити

# aria.alert.snippet
source: Accepting '{0}' made {1} additional edits
uk: Прийняття '{0}' внесло {1} додаткових правок

# detail.less
source: Show More
uk: Показати більше

# detail.more
source: Show Less
uk: Показати менше

# suggest.reset.label
source: Reset Suggest Widget Size
uk: Скинути розмір віджета пропозицій

# suggest.trigger.label
source: Trigger Suggest
uk: Запустити пропозицію

# ariaCurrenttSuggestionReadDetails
source: {0}, docs: {1}
uk: {0}, документи: {1}

# editorSuggestWidgetBackground
source: Background color of the suggest widget.
uk: Колір фону віджету пропозицій.

# editorSuggestWidgetBorder
source: Border color of the suggest widget.
uk: Колір рамки віджета пропозицій.

# editorSuggestWidgetFocusHighlightForeground
source: Color of the match highlights in the suggest widget when an item is focused.
uk: Колір підсвічування матчу в віджеті пропозицій, коли елемент має фокус.

# editorSuggestWidgetForeground
source: Foreground color of the suggest widget.
uk: Колір переднього плану віджета пропозицій.

# editorSuggestWidgetHighlightForeground
source: Color of the match highlights in the suggest widget.
uk: Колір моментів матчу у віджеті пропозицій.

# editorSuggestWidgetSelectedBackground
source: Background color of the selected entry in the suggest widget.
uk: Колір фону вибраного елемента у віджеті пропозицій.

# editorSuggestWidgetSelectedForeground
source: Foreground color of the selected entry in the suggest widget.
uk: Колір переднього плану вибраного елемента в віджеті пропозицій.

# editorSuggestWidgetSelectedIconForeground
source: Icon foreground color of the selected entry in the suggest widget.
uk: Колір переднього плану значка вибраного елемента в віджеті пропозицій.

# editorSuggestWidgetStatusForeground
source: Foreground color of the suggest widget status.
uk: Колір переднього плану статусу віджета пропозицій.

source: Suggest
uk: Пропонувати

# suggestWidget.loading
source: Loading...
uk: Завантаження...

# suggestWidget.noSuggestions
source: No suggestions.
uk: Немає пропозицій.

# details.close
source: Close
uk: Закрити

source: Loading...
uk: Завантаження...

source: Read More
uk: Читати далі

# suggestMoreInfoIcon
source: Icon for more information in the suggest widget.
uk: Іконка для отримання додаткової інформації у віджеті пропозицій.

# desc
source: A context key that is true when at the end of a word. Note that this is only defined when tab-completions are enabled
uk: Ключ контексту, який є істинним, коли в кінці слова. Зверніть увагу, що це визначено лише тоді, коли увімкнено автозавершення.

# symbolIcon.arrayForeground
source: The foreground color for array symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів масиву. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.booleanForeground
source: The foreground color for boolean symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для булевих символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.classForeground
source: The foreground color for class symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів класу. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.colorForeground
source: The foreground color for color symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для кольорових символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.constantForeground
source: The foreground color for constant symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для постійних символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.constructorForeground
source: The foreground color for constructor symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів конструктора. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.enumeratorForeground
source: The foreground color for enumerator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів перерахувача. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.enumeratorMemberForeground
source: The foreground color for enumerator member symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів членів перерахування. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.eventForeground
source: The foreground color for event symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів подій. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.fieldForeground
source: The foreground color for field symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів полів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.fileForeground
source: The foreground color for file symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів файлів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.folderForeground
source: The foreground color for folder symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів папок. Ці символи з'являються в структурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.functionForeground
source: The foreground color for function symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів функцій. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.interfaceForeground
source: The foreground color for interface symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів інтерфейсу. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.keyForeground
source: The foreground color for key symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для ключових символів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.keywordForeground
source: The foreground color for keyword symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів ключових слів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.methodForeground
source: The foreground color for method symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів методів. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.moduleForeground
source: The foreground color for module symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів модуля. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.

# symbolIcon.namespaceForeground
source: The foreground color for namespace symbols. These symbols appear in the outline, breadcrumb, and suggest widget.
uk: Колір переднього плану для символів простору імен. Ці символи з'являються в контурі, хлібних крихтах та віджеті пропозицій.
