Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

# editor.suggest.showEnums
source: When enabled IntelliSense shows `enum`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `enum`.

# editor.suggest.showEvents
source: When enabled IntelliSense shows `event`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `event`.

# editor.suggest.showFields
source: When enabled IntelliSense shows `field`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `field`.

# editor.suggest.showFiles
source: When enabled IntelliSense shows `file`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `file`.

# editor.suggest.showFolders
source: When enabled IntelliSense shows `folder`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `folder`.

# editor.suggest.showFunctions
source: When enabled IntelliSense shows `function`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `function`.

# editor.suggest.showInterfaces
source: When enabled IntelliSense shows `interface`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `interface`.

# editor.suggest.showIssues
source: When enabled IntelliSense shows `issues`-suggestions.
uk: Коли увімкнено, IntelliSense показує `issues`-пропозиції.

# editor.suggest.showKeywords
source: When enabled IntelliSense shows `keyword`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `keyword`.

# editor.suggest.showMethods
source: When enabled IntelliSense shows `method`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `method`.

# editor.suggest.showModules
source: When enabled IntelliSense shows `module`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `module`.

# editor.suggest.showOperators
source: When enabled IntelliSense shows `operator`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `operator`.

# editor.suggest.showPropertys
source: When enabled IntelliSense shows `property`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `property`.

# editor.suggest.showReferences
source: When enabled IntelliSense shows `reference`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `reference`.

# editor.suggest.showSnippets
source: When enabled IntelliSense shows `snippet`-suggestions.
uk: Коли ввімкнено, IntelliSense показує пропозиції `snippet`.

# editor.suggest.showStructs
source: When enabled IntelliSense shows `struct`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `struct`.

# editor.suggest.showTexts
source: When enabled IntelliSense shows `text`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `text`.

# editor.suggest.showTypeParameters
source: When enabled IntelliSense shows `typeParameter`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `typeParameter`.

# editor.suggest.showUnits
source: When enabled IntelliSense shows `unit`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `unit`.

# editor.suggest.showUsers
source: When enabled IntelliSense shows `user`-suggestions.
uk: Коли ввімкнено, IntelliSense показує пропозиції для `user`.

# editor.suggest.showValues
source: When enabled IntelliSense shows `value`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції `value`.

# editor.suggest.showVariables
source: When enabled IntelliSense shows `variable`-suggestions.
uk: Коли увімкнено, IntelliSense показує пропозиції для `variable`.

# editorViewAccessibleLabel
source: Editor content
uk: Вміст редактора

# emptySelectionClipboard
source: Controls whether copying without a selection copies the current line.
uk: Контролює, чи копіювання без вибору копіює поточний рядок.

# enabled
source: Enables the Code Action lightbulb in the editor.
uk: Увімкнення світлодіода дії коду в редакторі.

# experimentalGpuAcceleration
source: Controls whether to use the experimental GPU acceleration to render the editor.
uk: Контролює, чи використовувати експериментальне прискорення GPU для рендерингу редактора.

# experimentalGpuAcceleration.off
source: Use regular DOM-based rendering.
uk: Використовуйте звичайне рендеринг на основі DOM.

# experimentalGpuAcceleration.on
source: Use GPU acceleration.
uk: Використовуйте прискорення GPU.

# experimentalWhitespaceRendering
source: Controls whether whitespace is rendered with a new, experimental method.
uk: Контролює, чи пробіли відображаються новим, експериментальним методом.

# experimentalWhitespaceRendering.font
source: Use a new rendering method with font characters.
uk: Використовуйте новий метод рендерингу з символами шрифтів.

# experimentalWhitespaceRendering.off
source: Use the stable rendering method.
uk: Використовуйте стабільний метод рендерингу.

# experimentalWhitespaceRendering.svg
source: Use a new rendering method with svgs.
uk: Використовуйте новий метод рендерингу з svg.

# fastScrollSensitivity
source: Scrolling speed multiplier when pressing `Alt`.
uk: Множник швидкості прокрутки при натисканні `Alt`.

# find.addExtraSpaceOnTop
source: Controls whether the Find Widget should add extra lines on top of the editor. When true, you can scroll beyond the first line when the Find Widget is visible.
uk: Контролює, чи повинен віджет пошуку додавати додаткові рядки над редактором. Коли це значення істинне, ви можете прокручувати за перший рядок, коли віджет пошуку видимий.

# find.autoFindInSelection
source: Controls the condition for turning on Find in Selection automatically.
uk: Контролює умову для автоматичного ввімкнення функції 'Знайти в виборі'.

# find.cursorMoveOnType
source: Controls whether the cursor should jump to find matches while typing.
uk: Контролює, чи повинен курсор стрибати для пошуку збігів під час введення.

# find.findOnType
source: Controls whether the Find Widget should search as you type.
uk: Контролює, чи має віджет пошуку шукати під час введення.

# find.globalFindClipboard
source: Controls whether the Find Widget should read or modify the shared find clipboard on macOS.
uk: Контролює, чи повинен віджет пошуку читати або змінювати спільний буфер обміну пошуку на macOS.

# find.history
source: Controls how the find widget history should be stored
uk: Контролює, як історія віджета пошуку повинна зберігатися

# find.loop
source: Controls whether the search automatically restarts from the beginning (or the end) when no further matches can be found.
uk: Контролює, чи пошук автоматично перезапускається з початку (або з кінця), коли більше не можна знайти збігів.

# find.replaceHistory
source: Controls how the replace widget history should be stored
uk: Контролює, як історія віджета заміни повинна зберігатися

# find.seedSearchStringFromSelection
source: Controls whether the search string in the Find Widget is seeded from the editor selection.
uk: Контролює, чи рядок пошуку у віджеті пошуку заповнюється вибором з редактора.

# folding
source: Controls whether the editor has code folding enabled.
uk: Контролює, чи увімкнено складання коду в редакторі.

# foldingHighlight
source: Controls whether the editor should highlight folded ranges.
uk: Контролює, чи повинен редактор підсвічувати складені діапазони.

# foldingImportsByDefault
source: Controls whether the editor automatically collapses import ranges.
uk: Контролює, чи редактор автоматично згортатиме діапазони імпорту.

# foldingMaximumRegions
source: The maximum number of foldable regions. Increasing this value may result in the editor becoming less responsive when the current source has a large number of foldable regions.
uk: Максимальна кількість згинальних областей. Збільшення цього значення може призвести до зменшення чутливості редактора, коли поточне джерело має велику кількість згинальних областей.

# foldingStrategy
source: Controls the strategy for computing folding ranges.
uk: Контролює стратегію обчислення діапазонів згортання.

# foldingStrategy.auto
source: Use a language-specific folding strategy if available, else the indentation-based one.
uk: Використовуйте специфічну для мови стратегію згортання, якщо вона доступна, інакше - на основі відступів.

# foldingStrategy.indentation
source: Use the indentation-based folding strategy.
uk: Використовуйте стратегію згортання на основі відступів.

# fontFamily
source: Controls the font family.
uk: Контролює сімейство шрифтів.

# fontFeatureSettings
source: Explicit 'font-feature-settings' CSS property. A boolean can be passed instead if one only needs to turn on/off ligatures.
uk: Явна CSS властивість 'font-feature-settings'. Замість цього можна передати булеве значення, якщо потрібно лише вмикати/вимикати лігатури.

# fontLigatures
source: Enables/Disables font ligatures ('calt' and 'liga' font features). Change this to a string for fine-grained control of the 'font-feature-settings' CSS property.
uk: Увімкнення/вимкнення лігатур шрифтів ('calt' та 'liga' функції шрифтів). Змініть це на рядок для детального контролю над CSS-властивістю 'font-feature-settings'.

# fontLigaturesGeneral
source: Configures font ligatures or font features. Can be either a boolean to enable/disable ligatures or a string for the value of the CSS 'font-feature-settings' property.
uk: Налаштовує лігатури шрифтів або особливості шрифтів. Може бути або булевим значенням для увімкнення/вимкнення лігатур, або рядком для значення властивості CSS 'font-feature-settings'.

# fontSize
source: Controls the font size in pixels.
uk: Контролює розмір шрифту в пікселях.

# fontVariationSettings
source: Explicit 'font-variation-settings' CSS property. A boolean can be passed instead if one only needs to translate font-weight to font-variation-settings.
uk: Явна CSS-властивість 'font-variation-settings'. Якщо потрібно лише перевести font-weight у font-variation-settings, можна передати булеве значення.

# fontVariations
source: Enables/Disables the translation from font-weight to font-variation-settings. Change this to a string for fine-grained control of the 'font-variation-settings' CSS property.
uk: Увімкнення/вимкнення перекладу з font-weight на font-variation-settings. Змініть це на рядок для детального контролю над CSS-властивістю 'font-variation-settings'.

# fontVariationsGeneral
source: Configures font variations. Can be either a boolean to enable/disable the translation from font-weight to font-variation-settings or a string for the value of the CSS 'font-variation-settings' property.
uk: Налаштовує варіації шрифтів. Може бути або булевим значенням для увімкнення/вимкнення перетворення з font-weight на font-variation-settings, або рядком для значення властивості CSS 'font-variation-settings'.

# fontWeight
source: Controls the font weight. Accepts "normal" and "bold" keywords or numbers between 1 and 1000.
uk: Контролює товщину шрифту. Приймає ключові слова "normal" та "bold" або числа від 1 до 1000.

# fontWeightErrorMessage
source: Only "normal" and "bold" keywords or numbers between 1 and 1000 are allowed.
uk: Дозволені лише "нормальні" та "жирні" ключові слова або числа від 1 до 1000.

# formatOnPaste
source: Controls whether the editor should automatically format the pasted content. A formatter must be available and the formatter should be able to format a range in a document.
uk: Контролює, чи повинен редактор автоматично форматувати вставлений вміст. Форматувач повинен бути доступний, і форматувач має бути здатний форматувати діапазон у документі.

# formatOnType
source: Controls whether the editor should automatically format the line after typing.
uk: Контролює, чи повинен редактор автоматично форматувати рядок після введення.

# glyphMargin
source: Controls whether the editor should render the vertical glyph margin. Glyph margin is mostly used for debugging.
uk: Контролює, чи повинен редактор відображати вертикальний маргін гліфів. Маргін гліфів в основному використовується для налагодження.

# hideCursorInOverviewRuler
source: Controls whether the cursor should be hidden in the overview ruler.
uk: Контролює, чи повинен курсор бути прихованим у панелі огляду.

# hover.above
source: Prefer showing hovers above the line, if there's space.
uk: Вибрати показувати наведення над лінією, якщо є місце.

# hover.delay
source: Controls the delay in milliseconds after which the hover is shown.
uk: Контролює затримку в мілісекундах, після якої з'являється підказка.

# hover.enabled
source: Controls whether the hover is shown.
uk: Контролює, чи відображається наведення.

# hover.hidingDelay
source: Controls the delay in milliseconds after which the hover is hidden. Requires `#editor.hover.sticky#` to be enabled.
uk: Контролює затримку в мілісекундах, після якої ховер приховується. Потрібно, щоб `#editor.hover.sticky#` був увімкнений.

# hover.sticky
source: Controls whether the hover should remain visible when mouse is moved over it.
uk: Контролює, чи має залишатися видимим елемент при наведенні миші на нього.

# inertialScroll
source: Make scrolling inertial - mostly useful with touchpad on linux.
uk: Зробіть прокрутку інерційною - в основному корисно з тачпадом на linux.

# inlayHints.enable
source: Enables the inlay hints in the editor.
uk: Увімкнення підказок у редакторі.

# inlayHints.fontFamily
source: Controls font family of inlay hints in the editor. When set to empty, the {0} is used.
uk: Контролює сімейство шрифтів підказок у редакторі. Коли встановлено на порожнє, використовується {0}.

# inlayHints.fontSize
source: Controls font size of inlay hints in the editor. As default the {0} is used when the configured value is less than {1} or greater than the editor font size.
uk: Контролює розмір шрифту підказок у редакторі. За замовчуванням використовується {0}, коли налаштоване значення менше {1} або більше розміру шрифту редактора.

# inlayHints.maximumLength
source: Maximum overall length of inlay hints, for a single line, before they get truncated by the editor. Set to `0` to never truncate
uk: Максимальна загальна довжина підказок вставки для одного рядка, перш ніж вони будуть обрізані редактором. Встановіть `0`, щоб ніколи не обрізати

# inlayHints.padding
source: Enables the padding around the inlay hints in the editor.
uk: Увімкнення відступу навколо підказок вставки в редакторі.

# inline
source: Quick suggestions show as ghost text
uk: Швидкі пропозиції відображаються як текст-привид

# inlineCompletionsAccessibilityVerbose
source: Controls whether the accessibility hint should be provided to screen reader users when an inline completion is shown.
uk: Контролює, чи має бути надано підказку доступності користувачам зчитувачів екрана, коли відображається вбудоване завершення.

# inlineSuggest.edits.allowCodeShifting
source: Controls whether showing a suggestion will shift the code to make space for the suggestion inline.
uk: Контролює, чи показування пропозиції змістить код, щоб звільнити місце для пропозиції в рядку.

# inlineSuggest.edits.renderSideBySide
source: Controls whether larger suggestions can be shown side by side.
uk: Контролює, чи можуть бути показані більші пропозиції поруч.

# inlineSuggest.edits.showCollapsed
source: Controls whether the suggestion will show as collapsed until jumping to it.
uk: Контролює, чи буде пропозиція показуватися у згорнутому вигляді, поки не буде здійснено перехід до неї.

# inlineSuggest.enabled
source: Controls whether to automatically show inline suggestions in the editor.
uk: Контролює, чи автоматично показувати вбудовані пропозиції в редакторі.

# inlineSuggest.fontFamily
source: Controls the font family of the inline suggestions.
uk: Контролює сімейство шрифтів вбудованих пропозицій.

# inlineSuggest.minShowDelay
source: Controls the minimal delay in milliseconds after which inline suggestions are shown after typing.
uk: Контролює мінімальну затримку в мілісекундах, після якої вбудовані підказки з'являються після введення тексту.

# inlineSuggest.showOnSuggestConflict
source: Controls whether to show inline suggestions when there is a suggest conflict.
uk: Контролює, чи показувати вбудовані пропозиції, коли виникає конфлікт пропозицій.

# inlineSuggest.showToolbar
source: Controls when to show the inline suggestion toolbar.
uk: Контролює, коли показувати панель вбудованих підказок.

# inlineSuggest.showToolbar.always
source: Show the inline suggestion toolbar whenever an inline suggestion is shown.
uk: Показувати панель інлайн-підказок щоразу, коли відображається інлайн-підказка.

# inlineSuggest.showToolbar.never
source: Never show the inline suggestion toolbar.
uk: Ніколи не показувати панель інструментів вбудованих пропозицій.

# inlineSuggest.showToolbar.onHover
source: Show the inline suggestion toolbar when hovering over an inline suggestion.
uk: Показати панель пропозицій в рядку при наведенні на пропозицію в рядку.

# inlineSuggest.suppressInlineSuggestions
source: Suppresses inline completions for specified extension IDs -- comma separated.
uk: Приховує вбудовані завершення для вказаних ідентифікаторів розширень -- через кому.

# inlineSuggest.suppressSuggestions
source: Controls how inline suggestions interact with the suggest widget. If enabled, the suggest widget is not shown automatically when inline suggestions are available.
uk: Контролює, як інлайн-пропозиції взаємодіють з віджетом пропозицій. Якщо ввімкнено, віджет пропозицій не відображається автоматично, коли доступні інлайн-пропозиції.

# inlineSuggest.syntaxHighlightingEnabled
source: Controls whether to show syntax highlighting for inline suggestions in the editor.
uk: Контролює, чи показувати підсвічування синтаксису для вбудованих пропозицій в редакторі.

# inlineSuggest.triggerCommandOnProviderChange
source: Controls whether to trigger a command when the inline suggestion provider changes.
uk: Контролює, чи слід активувати команду, коли змінюється постачальник вбудованих пропозицій.

# letterSpacing
source: Controls the letter spacing in pixels.
uk: Контролює міжбуквений інтервал у пікселях.

# lineHeight
source: Controls the line height. - Use 0 to automatically compute the line height from the font size. - Values between 0 and 8 will be used as a multiplier with the font size. - Values greater than or equal to 8 will be used as effective values.
uk: Контролює висоту рядка. - Використовуйте 0, щоб автоматично обчислити висоту рядка з розміру шрифту. - Значення між 0 і 8 будуть використовуватися як множник з розміром шрифту. - Значення, що дорівнюють або перевищують 8, будуть використовуватися як ефективні значення.

# lineNumbers
source: Controls the display of line numbers.
uk: Контролює відображення номерів рядків.

# lineNumbers.interval
source: Line numbers are rendered every 10 lines.
uk: Номери рядків відображаються кожні 10 рядків.

# lineNumbers.off
source: Line numbers are not rendered.
uk: Номери рядків не відображаються.

# lineNumbers.on
source: Line numbers are rendered as absolute number.
uk: Номери рядків відображаються як абсолютні числа.

# lineNumbers.relative
source: Line numbers are rendered as distance in lines to cursor position.
uk: Номери рядків відображаються як відстань у рядках до позиції курсора.

# linkedEditing
source: Controls whether the editor has linked editing enabled. Depending on the language, related symbols such as HTML tags, are updated while editing.
uk: Контролює, чи увімкнено зв'язане редагування в редакторі. Залежно від мови, пов'язані символи, такі як HTML-теги, оновлюються під час редагування.

# links
source: Controls whether the editor should detect links and make them clickable.
uk: Контролює, чи повинен редактор виявляти посилання та робити їх клікабельними.

# matchBrackets
source: Highlight matching brackets.
uk: Підсвітити відповідні дужки.

# minimap.autohide
source: Controls whether the minimap is hidden automatically.
uk: Контролює, чи міні-карта прихована автоматично.

# minimap.autohide.mouseover
source: The minimap is hidden when mouse is not over the minimap and shown when mouse is over the minimap.
uk: Мінімапа прихована, коли курсор миші не над мінімапою, і показується, коли курсор миші над мінімапою.

# minimap.autohide.none
source: The minimap is always shown.
uk: Мінікарта завжди відображається.

# minimap.autohide.scroll
source: The minimap is only shown when the editor is scrolled
uk: Міні-карта відображається лише тоді, коли редактор прокручений.

# minimap.enabled
source: Controls whether the minimap is shown.
uk: Контролює, чи відображається міні-карта.

# minimap.markSectionHeaderRegex
source: Defines the regular expression used to find section headers in comments. The regex must contain a named match group `label` (written as `(?<label>.+)`) that encapsulates the section header, otherwise it will not work. Optionally you can include another match group named `separator`. Use \n in the pattern to match multi-line headers.
uk: Визначає регулярний вираз, який використовується для знаходження заголовків секцій у коментарях. Регулярний вираз повинен містити іменовану групу збігу `label` (записану як `(?<label>.+)`), яка охоплює заголовок секції, інакше він не буде працювати. Додатково ви можете включити ще одну групу збігу з назвою `separator`. Використовуйте \n у шаблоні для збігу багаторядкових заголовків.

# minimap.maxColumn
source: Limit the width of the minimap to render at most a certain number of columns.
uk: Обмежте ширину міні-карти, щоб відображати не більше певної кількості стовпців.

# minimap.renderCharacters
source: Render the actual characters on a line as opposed to color blocks.
uk: Відображайте фактичні символи на рядку, а не кольорові блоки.

# minimap.scale
source: Scale of content drawn in the minimap: 1, 2 or 3.
uk: Масштаб контенту, зображеного на міні-карті: 1, 2 або 3.

# minimap.sectionHeaderFontSize
source: Controls the font size of section headers in the minimap.
uk: Контролює розмір шрифту заголовків секцій у міні-карті.

# minimap.sectionHeaderLetterSpacing
source: Controls the amount of space (in pixels) between characters of section header. This helps the readability of the header in small font sizes.
uk: Контролює кількість простору (в пікселях) між символами заголовка секції. Це допомагає покращити читабельність заголовка при малих розмірах шрифту.

# minimap.showMarkSectionHeaders
source: Controls whether MARK: comments are shown as section headers in the minimap.
uk: Контролює, чи відображаються коментарі MARK: як заголовки секцій у міні-карті.

# minimap.showRegionSectionHeaders
source: Controls whether named regions are shown as section headers in the minimap.
uk: Контролює, чи відображаються іменовані області як заголовки секцій у міні-карті.

# minimap.showSlider
source: Controls when the minimap slider is shown.
uk: Контролює, коли показується слайдер міні-карти.

# minimap.side
source: Controls the side where to render the minimap.
uk: Контролює сторону, де відображати міні-карту.

# minimap.size
source: Controls the size of the minimap.
uk: Контролює розмір міні-карти.

# minimap.size.fill
source: The minimap will stretch or shrink as necessary to fill the height of the editor (no scrolling).
uk: Мінікарта буде розтягуватися або зменшуватися за необхідності, щоб заповнити висоту редактора (без прокручування).

# minimap.size.fit
source: The minimap will shrink as necessary to never be larger than the editor (no scrolling).
uk: Мінікарта буде зменшуватися за необхідності, щоб ніколи не бути більшою за редактор (без прокрутки).

# minimap.size.proportional
source: The minimap has the same size as the editor contents (and might scroll).
uk: Міні-карта має такий же розмір, як вміст редактора (і може прокручуватися).

# mouseWheelScrollSensitivity
source: A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events.
uk: Множник, який буде використовуватися для `deltaX` та `deltaY` подій прокрутки колеса миші.

# mouseWheelZoom
source: Zoom the font of the editor when using mouse wheel and holding `Ctrl`.
uk: Збільшуйте шрифт редактора, використовуючи колесо миші та утримуючи `Ctrl`.
