Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_editor.xlf
Languages: uk

# isEmbeddedDiffEditor
source: Whether the context is an embedded diff editor
uk: Чи є контекстом вбудований редактор відмінностей

# multiDiffEditorAllCollapsed
source: Whether all files in multi diff editor are collapsed
uk: Чи всі файли в редакторі багатократних відмінностей згорнуті

# standaloneColorPickerFocused
source: Whether the standalone color picker is focused
uk: Чи сфокусовано окремий вибір кольору

# standaloneColorPickerVisible
source: Whether the standalone color picker is visible
uk: Чи видимий окремий вибір кольору

# stickyScrollFocused
source: Whether the sticky scroll is focused
uk: Чи зосереджено прокручування з фіксацією

# stickyScrollVisible
source: Whether the sticky scroll is visible
uk: Чи видимий липкий скролл

# textInputFocus
source: Whether an editor or a rich text input has focus (cursor is blinking)
uk: Чи має фокус редактор або поле введення з форматом Rich Text (курсор блимає)

source: array
uk: масив

source: boolean
uk: логічний

source: class
uk: клас

source: constant
uk: константа

source: constructor
uk: конструктор

# Enum
source: enumeration
uk: перерахування

# EnumMember
source: enumeration member
uk: член перерахування

source: event
uk: подія

source: field
uk: поле

source: file
uk: файл

source: function
uk: функція

source: interface
uk: інтерфейс

source: key
uk: ключ

source: method
uk: метод

source: module
uk: модуль

source: namespace
uk: простір імен

source: null
uk: нуль

source: number
uk: номер

source: object
uk: об'єкт

source: operator
uk: оператор

source: package
uk: пакет

source: property
uk: власність

source: string
uk: рядок

source: struct
uk: структура

source: type parameter
uk: параметр типу

source: variable
uk: змінна

# suggestWidget.kind.class
source: Class
uk: Клас

# suggestWidget.kind.color
source: Color
uk: Колір

# suggestWidget.kind.constant
source: Constant
uk: Константа

# suggestWidget.kind.constructor
source: Constructor
uk: Конструктор

# suggestWidget.kind.customcolor
source: Custom Color
uk: Користувацький колір

# suggestWidget.kind.enum
source: Enum
uk: Перерахування

# suggestWidget.kind.enumMember
source: Enum Member
uk: Член переліку

# suggestWidget.kind.event
source: Event
uk: Подія

# suggestWidget.kind.field
source: Field
uk: Поле

# suggestWidget.kind.file
source: File
uk: Файл

# suggestWidget.kind.folder
source: Folder
uk: Папка

# suggestWidget.kind.function
source: Function
uk: Функція

# suggestWidget.kind.interface
source: Interface
uk: Інтерфейс

# suggestWidget.kind.issue
source: Issue
uk: Проблема

# suggestWidget.kind.keyword
source: Keyword
uk: Ключове слово

# suggestWidget.kind.method
source: Method
uk: Метод

# suggestWidget.kind.module
source: Module
uk: Модуль

# suggestWidget.kind.operator
source: Operator
uk: Оператор

# suggestWidget.kind.property
source: Property
uk: Власність

# suggestWidget.kind.reference
source: Reference
uk: Посилання

# suggestWidget.kind.snippet
source: Snippet
uk: Фрагмент

# suggestWidget.kind.struct
source: Struct
uk: Структура

# suggestWidget.kind.text
source: Text
uk: Текст

# suggestWidget.kind.tool
source: Tool
uk: Інструмент

# suggestWidget.kind.typeParameter
source: Type Parameter
uk: Тип параметра

# suggestWidget.kind.unit
source: Unit
uk: Одиниця

# suggestWidget.kind.user
source: User
uk: Користувач

# suggestWidget.kind.value
source: Value
uk: Значення

# suggestWidget.kind.variable
source: Variable
uk: Змінна

# plainText.alias
source: Plain Text
uk: Звичайний текст

# edit
source: Typing
uk: Набір тексту

# acceptSuggestAction
source: Accept suggestion{0} to accept the currently selected suggestion.
uk: Прийняти пропозицію{0}, щоб прийняти наразі вибрану пропозицію.

# accessibilityHelpTitle
source: Accessibility Help
uk: Допомога з доступністю

# auto_off
source: The application is configured to never be optimized for usage with a Screen Reader.
uk: Застосунок налаштовано так, щоб ніколи не оптимізуватися для використання з екранним читачем.

# auto_on
source: The application is configured to be optimized for usage with a Screen Reader.
uk: Застосунок налаштовано для оптимізації використання з екранним читачем.

# bulkEditServiceSummary
source: Made {0} edits in {1} files
uk: Зроблено {0} змін у {1} файлах

# changeConfigToOnMac
source: Configure the application to be optimized for usage with a Screen Reader (Command+E).
uk: Налаштуйте додаток для оптимізації використання з екранним читачем (Command+E).

# changeConfigToOnWinLinux
source: Configure the application to be optimized for usage with a Screen Reader (Control+E).
uk: Налаштуйте застосунок для оптимізації використання з екранним читачем (Control+E).

# chatEditing.navigation
source: Navigate between edits in the editor with navigate previous{0} and next{1} and accept{2}, reject{3} or view the diff{4} for the current change. Accept edits across all files{5}.
uk: Переміщуйтеся між редагуваннями в редакторі за допомогою navigate previous{0} і next{1} та прийміть{2}, відхиліть{3} або перегляньте різницю{4} для поточної зміни. Прийміть редагування у всіх файлах{5}.

# chatEditorModification
source: The editor contains pending modifications that have been made by chat.
uk: Редактор містить очікуючі зміни, які були внесені чатом.

# chatEditorRequestInProgress
source: The editor is currently waiting for modifications to be made by chat.
uk: Редактор наразі чекає, поки зміни будуть внесені через чат.

# codeFolding
source: Use code folding to collapse blocks of code and focus on the code you're interested in via the Toggle Folding Command{0}.
uk: Використовуйте згортання коду, щоб згорнути блоки коду та зосередитися на коді, який вас цікавить, через команду Toggle Folding{0}.

# debug.startDebugging
source: The Debug: Start Debugging command{0} will start a debug session.
uk: Команда Налагодження: Запустити сеанс налагодження{0} розпочне сеанс налагодження.

# debugConsole.addToWatch
source: The Debug: Add to Watch command{0} will add the selected text to the watch view.
uk: Налагодження: команда Додати до спостереження{0} додасть вибраний текст до вигляду спостереження.

# debugConsole.executeSelection
source: The Debug: Execute Selection command{0} will execute the selected text in the debug console.
uk: Команда Debug: Виконати вибір{0} виконає вибраний текст у консолі налагодження.

# debugConsole.setBreakpoint
source: The Debug: Inline Breakpoint command{0} will set or unset a breakpoint at the current cursor position in the active editor.
uk: Команда Debug: Inline Breakpoint{0} встановить або зніме точку зупинки в поточній позиції курсора в активному редакторі.

# defaultWindowTitleExcludingEditorState
source: activeEditorState - such as modified, problems, and more, is currently not included as a part of the window.title setting by default. Enable it with accessibility.windowTitleOptimized.
uk: activeEditorState - такі як змінений, проблеми та інше, наразі не включено до налаштування window.title за замовчуванням. Увімкніть його за допомогою accessibility.windowTitleOptimized.

# defaultWindowTitleIncludesEditorState
source: activeEditorState - such as modified, problems, and more, is included as a part of the window.title setting by default. Disable it with accessibility.windowTitleOptimized.
uk: activeEditorState - такі як змінений, проблеми та інше, включено за замовчуванням як частина налаштування window.title. Вимкніть його за допомогою accessibility.windowTitleOptimized.

# editableDiffEditor
source: You are in a pane of a diff editor.
uk: Ви в панелі редактора відмінностей.

# editableEditor
source: You are in a code editor.
uk: Ви в редакторі коду.

# goToSymbol
source: Go to Symbol{0} to quickly navigate between symbols in the current file.
uk: Перейдіть до Symbol{0}, щоб швидко переміщатися між символами в поточному файлі.

# gotoLineActionLabel
source: Go to Line/Column...
uk: Перейти до рядка/стовпця...

# helpQuickAccess
source: Show all Quick Access Providers
uk: Показати всіх постачальників швидкого доступу

# inspectTokens
source: Developer: Inspect Tokens
uk: Розробник: Перевірити токени

# intellisense
source: Use Intellisense to improve coding efficiency and reduce errors. Trigger suggestions{0}.
uk: Використовуйте Intellisense для підвищення ефективності кодування та зменшення помилок. Викликайте пропозиції{0}.

# listAnnouncementsCommand
source: Run the command: List Signal Announcements for an overview of announcements and their current status.
uk: Виконайте команду: List Signal Announcements для огляду оголошень та їх поточного статусу.

# listSignalSoundsCommand
source: Run the command: List Signal Sounds for an overview of all sounds and their current status.
uk: Виконайте команду: List Signal Sounds для огляду всіх звуків та їхнього поточного статусу.

# openingDocs
source: Opening the Accessibility documentation page.
uk: Відкриття сторінки документації з доступності.

# quickChatCommand
source: Toggle quick chat{0} to open or close a chat session.
uk: Перемкніть швидкий чат{0}, щоб відкрити або закрити сесію чату.

# quickCommandActionHelp
source: Show And Run Commands
uk: Показати та виконати команди

# quickCommandActionLabel
source: Command Palette
uk: Палітра команд

# quickOutlineActionLabel
source: Go to Symbol...
uk: Перейти до символу...

# quickOutlineByCategoryActionLabel
source: Go to Symbol by Category...
uk: Перейти до символу за категорією...

# readonlyDiffEditor
source: You are in a read-only pane of a diff editor.
uk: Ви знаходитесь у режимі лише для читання в панелі редактора порівняння.

# readonlyEditor
source: You are in a read-only code editor.
uk: Ви в редакторі коду лише для читання.

# screenReaderModeDisabled
source: Screen Reader Optimized Mode disabled.
uk: Режим оптимізації для екранних читалок вимкнено.

# screenReaderModeEnabled
source: Screen Reader Optimized Mode enabled.
uk: Увімкнено режим, оптимізований для екранних рідерів.

# showAccessibilityHelpAction
source: Show Accessibility Help
uk: Показати допомогу з доступності

# showOrFocusHover
source: Show or focus the hover{0} to read information about the current symbol.
uk: Показати або зосередити увагу на hover{0}, щоб прочитати інформацію про поточний символ.

# startInlineChatCommand
source: Start inline chat{0} to create an in editor chat session.
uk: Почніть інлайн-чат{0}, щоб створити сеанс чату в редакторі.

# stickScrollKb
source: Focus Sticky Scroll{0} to focus the currently nested scopes.
uk: Зосередьтеся на Sticky Scroll{0}, щоб зосередитися на поточних вкладених областях.

# suggestActionsKb
source: Trigger the suggest widget{0} to show possible code completions.
uk: Запустіть віджет пропозицій{0}, щоб показати можливі завершення коду.

# tabFocusModeOffMsg
source: Pressing Tab in the current editor will insert the tab character. Toggle this behavior{0}.
uk: Натискання Tab у поточному редакторі вставить символ табуляції. Перемкніть цю поведінку{0}.

# tabFocusModeOnMsg
source: Pressing Tab in the current editor will move focus to the next focusable element. Toggle this behavior{0}.
uk: Натискання Tab у поточному редакторі перемістить фокус на наступний елемент, що може отримати фокус. Перемкніть цю поведінку{0}.

# toggleHighContrast
source: Toggle High Contrast Theme
uk: Перемкнути режим високого контрасту

# toggleSuggestionFocus
source: Toggle focus between the suggest widget and the editor{0} and toggle details focus with{1} to learn more about the suggestion.
uk: Перемикайте фокус між віджетом пропозицій та редактором{0} і перемикайте фокус деталей з{1}, щоб дізнатися більше про пропозицію.

# toolbar
source: Around the workbench, when the screen reader announces you've landed in a toolbar, use narrow keys to navigate between the toolbar's actions.
uk: Навколо робочого столу, коли екранний рідер оголошує, що ви потрапили на панель інструментів, використовуйте вузькі клавіші для навігації між діями панелі інструментів.

# overflow.chars
source: {0} chars
uk: {0} символів

# showMore
source: Show more ({0})
uk: Показати більше ({0})
