Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_platform.xlf
Languages: uk

# binFailed
source: Failed to move '{0}' to the recycle bin ({1})
uk: Не вдалося перемістити '{0}' до кошика ({1})

# trashFailed
source: Failed to move '{0}' to the trash ({1})
uk: Не вдалося перемістити '{0}' до кошика ({1})

# copyError
source: Unable to copy '{0}' into '{1}' ({2}).
uk: Неможливо скопіювати '{0}' у '{1}' ({2}).

# fileCopyErrorPathCase
source: File cannot be copied to same path with different path case
uk: Файл не може бути скопійований до того ж шляху з іншим регістром шляху

# fileExists
source: File already exists
uk: Неможливо створити файл '{0}', який вже існує, коли прапорець перезапису не встановлений

# fileMoveCopyErrorExists
source: File at target already exists and thus will not be moved/copied to unless overwrite is specified
uk: Файл за вказаною адресою вже існує і тому не буде переміщено/скопійовано, якщо не вказано перезапис.

# fileMoveCopyErrorNotFound
source: File to move/copy does not exist
uk: Файл для переміщення/копіювання не існує

# moveError
source: Unable to move '{0}' into '{1}' ({2}).
uk: Неможливо перемістити '{0}' у '{1}' ({2}).

# suggestWidgetVisible
source: Whether suggestion are visible
uk: Чи видимі пропозиції

# first.chord
source: ({0}) was pressed. Waiting for second key of chord...
uk: ({0}) був натиснутий. Очікування на другу клавішу акорду...

# missing.chord
source: The key combination ({0}, {1}) is not a command.
uk: Комбінація клавіш ({0}, {1}) не є командою.

# next.chord
source: ({0}) was pressed. Waiting for next key of chord...
uk: ({0}) був натиснутий. Очікування наступної клавіші акорду...

# dispatch
source: Controls the dispatching logic for key presses to use either `code` (recommended) or `keyCode`.
uk: Контролює логіку відправки для натискань клавіш, використовуючи або `code` (рекомендується), або `keyCode`.

# keyboardConfigurationTitle
source: Keyboard
uk: Клавіатура

# mapAltGrToCtrlAlt
source: Controls if the AltGraph+ modifier should be treated as Ctrl+Alt+.
uk: Контролює, чи модифікатор AltGraph+ слід розглядати як Ctrl+Alt+.

# currentDisplayLanguage
source: (Current)
uk: (Поточний)

source: close
uk: закрити

source: find
uk: знайти

source: open
uk: Відкрити

# Fast Scroll Sensitivity
source: Scrolling speed multiplier when pressing `Alt`.
uk: Множник швидкості прокручування при натисканні `Alt`.

# Mouse Wheel Scroll Sensitivity
source: A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events.
uk: Множник, який буде використовуватися для `deltaX` та `deltaY` подій прокрутки колеса миші.

# defaultFindMatchTypeSettingKey
source: Controls the type of matching used when searching lists and trees in the workbench.
uk: Контролює тип зіставлення, що використовується при пошуку списків і дерев у робочій області.

# defaultFindMatchTypeSettingKey.contiguous
source: Use contiguous matching when searching.
uk: Використовуйте безперервне співпадіння під час пошуку.

# defaultFindMatchTypeSettingKey.fuzzy
source: Use fuzzy matching when searching.
uk: Використовуйте нечітке співпадіння під час пошуку.

# defaultFindModeSettingKey
source: Controls the default find mode for lists and trees in the workbench.
uk: Контролює режим пошуку за замовчуванням для списків і дерев у робочій області.

# defaultFindModeSettingKey.filter
source: Filter elements when searching.
uk: Фільтруйте елементи під час пошуку.

# defaultFindModeSettingKey.highlight
source: Highlight elements when searching. Further up and down navigation will traverse only the highlighted elements.
uk: Підсвічуйте елементи під час пошуку. Подальша навігація вгору та вниз буде проходити лише через підсвічені елементи.

# expand mode
source: Controls how tree folders are expanded when clicking the folder names. Note that some trees and lists might choose to ignore this setting if it is not applicable.
uk: Контролює, як розгортаються папки дерева при натисканні на назви папок. Зверніть увагу, що деякі дерева та списки можуть вирішити ігнорувати цю настройку, якщо вона не застосовна.

# horizontalScrolling setting
source: Controls whether lists and trees support horizontal scrolling in the workbench. Warning: turning on this setting has a performance implication.
uk: Контролює, чи списки та дерева підтримують горизонтальну прокрутку в робочій області. Увага: увімкнення цього налаштування має вплив на продуктивність.

# keyboardNavigationSettingKey
source: Controls the keyboard navigation style for lists and trees in the workbench. Can be simple, highlight and filter.
uk: Контролює стиль навігації клавіатурою для списків та дерев у робочій області. Може бути простим, підсвічуванням та фільтрацією.

# keyboardNavigationSettingKey.filter
source: Filter keyboard navigation will filter out and hide all the elements which do not match the keyboard input.
uk: Фільтр навігації клавіатури відфільтрує та сховає всі елементи, які не відповідають введенню з клавіатури.

# keyboardNavigationSettingKey.highlight
source: Highlight keyboard navigation highlights elements which match the keyboard input. Further up and down navigation will traverse only the highlighted elements.
uk: Підсвічування навігації за допомогою клавіатури підсвічує елементи, які відповідають введенню з клавіатури. Подальша навігація вгору та вниз буде проходити лише через підсвічені елементи.

# keyboardNavigationSettingKey.simple
source: Simple keyboard navigation focuses elements which match the keyboard input. Matching is done only on prefixes.
uk: Проста навігація за допомогою клавіатури фокусується на елементах, які відповідають введенню з клавіатури. Відповідність здійснюється лише за префіксами.

# keyboardNavigationSettingKeyDeprecated
source: Please use 'workbench.list.defaultFindMode' and 'workbench.list.typeNavigationMode' instead.
uk: Будь ласка, використовуйте 'workbench.list.defaultFindMode' та 'workbench.list.typeNavigationMode' замість цього.

# list smoothScrolling setting
source: Controls whether lists and trees have smooth scrolling.
uk: Контролює, чи списки та дерева мають плавну прокрутку.

# list.scrollByPage
source: Controls whether clicks in the scrollbar scroll page by page.
uk: Контролює, чи кліки на смузі прокрутки прокручують сторінку по сторінці.

# multiSelectModifier
source: The modifier to be used to add an item in trees and lists to a multi-selection with the mouse (for example in the explorer, open editors and scm view). The 'Open to Side' mouse gestures - if supported - will adapt such that they do not conflict with the multiselect modifier.
uk: Модифікатор, який використовується для додавання елемента в деревах і списках до багатократного вибору за допомогою миші (наприклад, в провіднику, відкритих редакторах і перегляді scm). Жести миші 'Відкрити збоку' - якщо підтримуються - будуть адаптовані так, щоб не конфліктувати з модифікатором багатократного вибору.

# multiSelectModifier.alt
source: Maps to `Alt` on Windows and Linux and to `Option` on macOS.
uk: Картки до `Alt` на Windows та Linux і до `Option` на macOS.

# multiSelectModifier.ctrlCmd
source: Maps to `Control` on Windows and Linux and to `Command` on macOS.
uk: Відповідає `Control` на Windows та Linux і `Command` на macOS.

# openModeModifier
source: Controls how to open items in trees and lists using the mouse (if supported). Note that some trees and lists might choose to ignore this setting if it is not applicable.
uk: Контролює, як відкривати елементи в деревах і списках за допомогою миші (якщо підтримується). Зверніть увагу, що деякі дерева і списки можуть вирішити ігнорувати це налаштування, якщо воно не застосовне.

# render tree indent guides
source: Controls whether the tree should render indent guides.
uk: Контролює, чи дерево повинно відображати відступи.

# sticky scroll
source: Controls whether sticky scrolling is enabled in trees.
uk: Контролює, чи увімкнено липке прокручування в деревах.

# sticky scroll maximum items
source: Controls the number of sticky elements displayed in the tree when {0} is enabled.
uk: Контролює кількість закріплених елементів, що відображаються в дереві, коли {0} увімкнено.

# tree indent setting
source: Controls tree indentation in pixels.
uk: Контролює відступ дерева в пікселях.

# typeNavigationMode2
source: Controls how type navigation works in lists and trees in the workbench. When set to `trigger`, type navigation begins once the `list.triggerTypeNavigation` command is run.
uk: Контролює, як працює навігація за типом у списках і деревах у робочій області. Коли встановлено значення `trigger`, навігація за типом починається після виконання команди `list.triggerTypeNavigation`.

# workbenchConfigurationTitle
source: Workbench
uk: Робоча станція

source: Debug
uk: Виправлення помилок

source: Error
uk: Помилка

source: Info
uk: Інформація

source: Off
uk: Вимкнено

source: Trace
uk: Слід

# warn
source: Warning
uk: Попередження

# filtered
source: Problems are paused because: "{0}"
uk: Проблеми призупинені через: "{0}"

# filtered.network
source: Problems are paused because: "{0}" and {1} more
uk: Проблеми призупинені через: "{0}" та ще {1}

# sev.error
source: Error
uk: Помилка

# sev.errors
source: Errors
uk: Помилки

# sev.info
source: Info
uk: Інформація

# sev.infos
source: Infos
uk: Інформація

# sev.warning
source: Warning
uk: Попередження

# sev.warnings
source: Warnings
uk: Попередження

# mcp servers are not allowed
source: Model Context Protocol servers are disabled in the Editor. Please check your [settings]({0}).
uk: Сервери протоколу контексту моделі вимкнені в редакторі. Будь ласка, перевірте свої [налаштування]({0}).

# noReadme
source: No README available
uk: Немає доступного README

# readme.viewInBrowser
source: You can find information about this server [here]({0})
uk: Ви можете знайти інформацію про цей сервер [тут]({0})

# not allowed to install
source: This mcp server cannot be installed because {0}
uk: Цю розширення не можна встановити, оскільки {0}

source: Cancel
uk: Скасувати

source: &&Exit
uk: &&Вихід

# mAbout
source: About {0}
uk: Про {0}

# mBringToFront
source: Bring All to Front
uk: Перенести все на передній план

# mEdit
source: &&Edit
uk: &&Редагувати

# mFile
source: &&File
uk: &&Файл

# mGoto
source: &&Go
uk: &&Перейти

# mHelp
source: &&Help
uk: &&Допомога

# mHide
source: Hide {0}
uk: Сховати {0}

# mHideOthers
source: Hide Others
uk: Сховати інших

# mMergeAllWindows
source: Merge All Windows
uk: Об'єднати всі вікна

# mMinimize
source: Minimize
uk: Зменшити

# mMoveTabToNewWindow
source: Move Tab to New Window
uk: Перемістити вкладку в нове вікно

# mNewTab
source: New Tab
uk: Нова вкладка

# mRun
source: &&Run
uk: &&Запустити

# mSelection
source: &&Selection
uk: &&Вибір

# mServices
source: Services
uk: Послуги

# mShowAll
source: Show All
uk: Показати всі

# mShowNextTab
source: Show Next Tab
uk: Показати наступну вкладку

# mShowPreviousTab
source: Show Previous Tab
uk: Показати попередню вкладку

# mTerminal
source: &&Terminal
uk: &&Термінал

# mView
source: &&View
uk: &&Перегляд

# mWindow
source: Window
uk: Вікно

# miCheckForUpdates
source: Check for &&Updates...
uk: Перевірити &&оновлення...

# miCheckingForUpdates
source: Checking for Updates...
uk: Перевірка оновлень...

# miDownloadUpdate
source: D&&ownload Available Update
uk: З&&авантажити доступне оновлення

# miDownloadingUpdate
source: Downloading Update...
uk: Завантаження оновлення...

# miInstallUpdate
source: Install &&Update...
uk: Встановити &&оновлення...

# miInstallingUpdate
source: Installing Update...
uk: Встановлення оновлення...

# miNewWindow
source: New &&Window
uk: Нове &&вікно

# miPreferences
source: &&Preferences
uk: &&Налаштування

# miQuit
source: Quit {0}
uk: Вийти {0}

# miRestartToUpdate
source: Restart to &&Update
uk: Перезавантажити для &&оновлення

# miSwitchWindow
source: Switch &&Window...
uk: Перемикнути &&вікно...

source: &&Quit
uk: &&Вихід

# quitMessage
source: Are you sure you want to exit?
uk: Ви впевнені, що хочете вийти?

# quitMessageMac
source: Are you sure you want to quit?
uk: Ви впевнені, що хочете вийти?

# cantCreateBinFolder
source: Unable to install the shell command '{0}'.
uk: Неможливо встановити команду оболонки '{0}'.

# cantUninstall
source: Unable to uninstall the shell command '{0}'.
uk: Неможливо видалити команду оболонки '{0}'.

source: &&Copy Link
uk: &&Скопіювати посилання

source: &&OK
uk: &&Гаразд

# openExternalErrorLinkMessage
source: An error occurred opening a link in your default browser.
uk: Виникла помилка при відкритті посилання у вашому браузері за замовчуванням.

# openExternalProgramErrorMessage
source: An error occurred opening an external program.
uk: Виникла помилка при відкритті зовнішньої програми.

# sourceMissing
source: Unable to find shell script in '{0}'
uk: Неможливо знайти скрипт оболонки в '{0}'

# trace.detail
source: Please create an issue and manually attach the following file: {0}
uk: Будь ласка, створіть проблему та вручну прикріпіть наступний файл: {0}

# trace.message
source: Successfully created the trace file
uk: Успішно створено файл трасування

# trace.ok
source: &&OK
uk: &&Готово

# warnEscalation
source: {0} will now prompt with 'osascript' for Administrator privileges to install the shell command.
uk: {0} тепер запитає 'osascript' про права адміністратора для встановлення командного рядка.

# warnEscalationUninstall
source: {0} will now prompt with 'osascript' for Administrator privileges to uninstall the shell command.
uk: {0} тепер запитає 'osascript' для отримання прав адміністратора для видалення командного рядка.

# severityPrefix.error
source: Error: {0}
uk: Помилка: {0}

# severityPrefix.info
source: Info: {0}
uk: Інформація: {0}

# severityPrefix.warning
source: Warning: {0}
uk: Увага: {0}

source: Local
uk: Локальний

# canNotRun
source: Command '{0}' resulted in an error
uk: Команда '{0}' призвела до помилки

source: commonly used
uk: зазвичай використовуваний

# morecCommands
source: other commands
uk: інші команди

source: recently used
uk: нещодавно використані

# suggested
source: similar commands
uk: схожі команди

# cursorAtEndOfQuickInputBox
source: Whether the cursor in the quick input is at the end of the input box
uk: Чи курсор у швидкому введенні знаходиться в кінці поля введення

# inQuickInput
source: Whether keyboard focus is inside the quick input control
uk: Чи знаходиться фокус клавіатури всередині елемента швидкого введення

# inputModeEntry
source: Press 'Enter' to confirm your input or 'Escape' to cancel
uk: Натисніть 'Enter', щоб підтвердити введення, або 'Escape', щоб скасувати.

# inputModeEntryDescription
source: {0} (Press 'Enter' to confirm or 'Escape' to cancel)
uk: {0} (Натисніть 'Enter', щоб підтвердити, або 'Escape', щоб скасувати)

source: OK
uk: &&Гаразд

# quickInput.back
source: Back
uk: Назад

# quickInputAlignment
source: The alignment of the quick input
uk: Вирівнювання швидкого вводу

# quickInputBox.ariaLabel
source: Type to narrow down results.
uk: Введіть текст для звуження результатів.

# quickInputType
source: The type of the currently visible quick input
uk: Тип поточного видимого швидкого вводу

# nonQuickWidget
source: Used while in the context of some quick input. If you change one keybinding for this command, you should change all of the other keybindings (modifier variants) of this command as well.
uk: Використовується в контексті швидкого введення. Якщо ви змінюєте одну комбінацію клавіш для цієї команди, ви також повинні змінити всі інші комбінації клавіш (варіанти з модифікаторами) цієї команди.

# quickInput
source: Used while in the context of any kind of quick input. If you change one keybinding for this command, you should change all of the other keybindings (modifier variants) of this command as well.
uk: Використовується в контексті будь-якого швидкого введення. Якщо ви змінюєте одну клавішу для цієї команди, ви також повинні змінити всі інші клавіші (варіанти модифікаторів) цієї команди.

# quickInput.nextSeparatorWithQuickAccessFallback
source: If we're in quick access mode, this will navigate to the next item. If we are not in quick access mode, this will navigate to the next separator.
uk: Якщо ми в режимі швидкого доступу, це перемістить до наступного елемента. Якщо ми не в режимі швидкого доступу, це перемістить до наступного роздільника.

# quickInput.previousSeparatorWithQuickAccessFallback
source: If we're in quick access mode, this will navigate to the previous item. If we are not in quick access mode, this will navigate to the previous separator.
uk: Якщо ми в режимі швидкого доступу, це перемістить до попереднього елемента. Якщо ми не в режимі швидкого доступу, це перемістить до попереднього роздільника.

# quickPick
source: Used while in the context of the quick pick. If you change one keybinding for this command, you should change all of the other keybindings (modifier variants) of this command as well.
uk: Використовується в контексті швидкого вибору. Якщо ви змінюєте одну прив'язку клавіші для цієї команди, ви повинні змінити всі інші прив'язки клавіші (варіанти модифікаторів) цієї команди також.

source: Custom
uk: Користувацький

# quickInput.backWithKeybinding
source: Back ({0})
uk: Назад ({0})

# quickInput.checkAll
source: Toggle all checkboxes
uk: Перемкнути всі прапорці

# quickInput.countSelected
source: {0} Selected
uk: {0} Вибрано

# quickInput.visibleCount
source: {0} Results
uk: {0} Результатів

source: Quick Input
uk: Використовується в контексті будь-якого швидкого введення. Якщо ви змінюєте одну клавішу для цієї команди, ви також повинні змінити всі інші клавіші (варіанти модифікаторів) цієї команди.

# executeCommand
source: Click to execute command '{0}'
uk: Натисніть, щоб виконати команду '{0}'

source: Pin command
uk: Команда закріплення

source: Pinned command
uk: Закріплена команда

# terminal.commands.pinned
source: pinned
uk: закріплено

source: Quick Tree
uk: Швидке дерево

# remoteTunnelLog
source: Remote Tunnel Service
uk: Служба віддаленого тунелю

# remoteTunnelService.authorizing
source: Connecting as {0} ({1})
uk: Підключення як {0} ({1})

# remoteTunnelService.building
source: Building CLI from sources
uk: Складання CLI з вихідних кодів

# remoteTunnelService.openTunnel
source: Opening tunnel
uk: Відкриття тунелю

# remoteTunnelService.openTunnelWithName
source: Opening tunnel {0}
uk: Відкриття тунелю {0}

# remoteTunnelService.serviceInstallFailed
source: Failed to install tunnel as a service, starting in session...
uk: Не вдалося встановити тунель як службу, починаючи сесію...

# electronFetch
source: Controls whether use of Electron's fetch implementation instead of Node.js' should be enabled. All local extensions will get Electron's fetch implementation for the global fetch API.
uk: Контролює, чи слід увімкнути використання реалізації fetch Electron замість Node.js. Усі локальні розширення отримають реалізацію fetch Electron для глобального API fetch.

# fetchAdditionalSupport
source: Controls whether Node.js' fetch implementation should be extended with additional support. Currently proxy support ({1}) and system certificates ({2}) are added when the corresponding settings are enabled. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Контролює, чи повинна реалізація fetch у Node.js бути розширена додатковою підтримкою. В даний час підтримка проксі ({1}) та системних сертифікатів ({2}) додаються, коли відповідні налаштування увімкнені. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# networkInterfaceCheckInterval
source: Controls the interval in seconds for checking network interface changes to invalidate the proxy cache. Set to -1 to disable. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Контролює інтервал у секундах для перевірки змін мережевого інтерфейсу для анулювання кешу проксі. Встановіть на -1, щоб вимкнути. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних і віддалених налаштуваннях.

# noProxy
source: Specifies domain names for which proxy settings should be ignored for HTTP/HTTPS requests. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Вказує доменні імена, для яких налаштування проксі повинні ігноруватися для HTTP/HTTPS запитів. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# proxy
source: The proxy setting to use. If not set, will be inherited from the `http_proxy` and `https_proxy` environment variables. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Налаштування проксі для використання. Якщо не встановлено, буде успадковано з змінних середовища `http_proxy` та `https_proxy`. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# proxyAuthorization
source: The value to send as the `Proxy-Authorization` header for every network request. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Значення, яке потрібно надіслати як заголовок `Proxy-Authorization` для кожного мережевого запиту. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних і віддалених налаштуваннях.

# proxyKerberosServicePrincipal
source: Overrides the principal service name for Kerberos authentication with the HTTP proxy. A default based on the proxy hostname is used when this is not set. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Перезаписує основну назву служби для аутентифікації Kerberos з HTTP-проксі. За замовчуванням використовується значення, основане на імені хоста проксі, коли це не встановлено. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна конфігурувати окремо в локальних і віддалених налаштуваннях.

# proxySupport
source: Use the proxy support for extensions. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Використовуйте підтримку проксі для розширень. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнено, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# proxySupportFallback
source: Enable proxy support for extensions, fall back to request options, when no proxy found.
uk: Увімкніть підтримку проксі для розширень, використовуйте параметри запиту, коли проксі не знайдено.

# proxySupportOff
source: Disable proxy support for extensions.
uk: Вимкнути підтримку проксі для розширень.

# proxySupportOn
source: Enable proxy support for extensions.
uk: Увімкніть підтримку проксі для розширень.

# proxySupportOverride
source: Enable proxy support for extensions, override request options.
uk: Увімкніть підтримку проксі для розширень, переопреділяйте параметри запиту.
