Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_platform.xlf
Languages: uk

# strictSSL
source: Controls whether the proxy server certificate should be verified against the list of supplied CAs. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Контролює, чи слід перевіряти сертифікат проксі-сервера проти списку наданих ЦС. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних і віддалених налаштуваннях.

# systemCertificates
source: Controls whether CA certificates should be loaded from the OS. On Windows and macOS, a reload of the window is required after turning this off. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Контролює, чи слід завантажувати сертифікати CA з ОС. На Windows та macOS після вимкнення цієї опції необхідно перезавантажити вікно. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# systemCertificatesV2
source: Controls whether experimental loading of CA certificates from the OS should be enabled. This uses a more general approach than the default implementation. When during [remote development](https://aka.ms/vscode-remote) the {0} setting is disabled this setting can be configured in the local and the remote settings separately.
uk: Контролює, чи слід увімкнути експериментальне завантаження CA сертифікатів з ОС. Це використовує більш загальний підхід, ніж реалізація за замовчуванням. Коли під час [віддаленої розробки](https://aka.ms/vscode-remote) налаштування {0} вимкнене, це налаштування можна налаштувати окремо в локальних та віддалених налаштуваннях.

# useLocalProxy
source: Controls whether in the remote extension host the local proxy configuration should be used. This setting only applies as a remote setting during [remote development](https://aka.ms/vscode-remote).
uk: Контролює, чи слід використовувати локальну конфігурацію проксі в віддаленому хості розширення. Ця настройка застосовується лише як віддалена настройка під час [віддаленої розробки](https://aka.ms/vscode-remote).

# resolveShellEnvError
source: Unable to resolve your shell environment: {0}
uk: Не вдалося вирішити ваше середовище оболонки: {0}

# resolveShellEnvExitError
source: Unexpected exit code from spawned shell (code {0}, signal {1})
uk: Несподіваний код виходу з запущеного шеллу (код {0}, сигнал {1})

# resolveShellEnvTimeout
source: Unable to resolve your shell environment in a reasonable time. Please review your shell configuration and restart.
uk: Не вдалося вирішити вашу оболонку середовища за розумний час. Будь ласка, перегляньте конфігурацію вашої оболонки та перезапустіть.

# telemetryLog
source: Telemetry{0}
uk: Телеметрія{0}

# enableTelemetryDeprecated
source: If this setting is false, no telemetry will be sent regardless of the new setting's value. Deprecated in favor of the {0} setting.
uk: Якщо ця настройка є хибною, жодна телеметрія не буде надіслана, незалежно від значення нової настройки. Відмінену на користь настройки {0}.

# telemetry.crashReports
source: Crash Reports
uk: Звіти про збої

# telemetry.docsAndPrivacyStatement
source: Read more about the [data we collect]({0}) and our [privacy statement]({1}).
uk: Дізнайтеся більше про [дані, які ми збираємо]({0}) та нашу [політику конфіденційності]({1}).

# telemetry.docsStatement
source: Read more about the [data we collect]({0}).
uk: Дізнайтеся більше про [дані, які ми збираємо]({0}).

# telemetry.enableTelemetry
source: Enable diagnostic data to be collected. This helps us to better understand how {0} is performing and where improvements need to be made.
uk: Увімкніть збір діагностичних даних. Це допомагає нам краще зрозуміти, як {0} працює і де потрібно внести покращення.

# telemetry.enableTelemetryMd
source: Enable diagnostic data to be collected. This helps us to better understand how {0} is performing and where improvements need to be made. [Read more]({1}) about what we collect and our privacy statement.
uk: Увімкніть збір діагностичних даних. Це допомагає нам краще зрозуміти, як {0} працює і де потрібно внести покращення. [Дізнатися більше]({1}) про те, що ми збираємо, та нашу політику конфіденційності.

# telemetry.errors
source: Error Telemetry
uk: Телеметрія помилок

# telemetry.feedback.enabled
source: Enable feedback mechanisms such as the issue reporter, surveys, and other feedback options.
uk: Увімкніть механізми зворотного зв'язку, такі як репортер проблем, опитування та інші варіанти зворотного зв'язку.

# telemetry.restart
source: A full restart of the application is necessary for crash reporting changes to take effect.
uk: Повний перезапуск програми необхідний для того, щоб зміни в звітуванні про збої набрали чинності.

# telemetry.telemetryLevel.crash
source: Sends OS level crash reports.
uk: Надсилає звіти про аварії на рівні ОС.

# telemetry.telemetryLevel.default
source: Sends usage data, errors, and crash reports.
uk: Надсилає дані використання, помилки та звіти про збої.

# telemetry.telemetryLevel.deprecated
source: ****Note:*** If this setting is 'off', no telemetry will be sent regardless of other telemetry settings. If this setting is set to anything except 'off' and telemetry is disabled with deprecated settings, no telemetry will be sent.*
uk: ****Примітка:*** Якщо ця настройка вимкнена, жодна телеметрія не буде надіслана, незалежно від інших налаштувань телеметрії. Якщо ця настройка встановлена на будь-яке значення, окрім 'вимкнено', і телеметрія вимкнена за допомогою застарілих налаштувань, жодна телеметрія не буде надіслана.*

# telemetry.telemetryLevel.error
source: Sends general error telemetry and crash reports.
uk: Надсилає загальну телеметрію помилок і звіти про аварії.

# telemetry.telemetryLevel.off
source: Disables all product telemetry.
uk: Вимикає всю телеметрію продукту.

# telemetry.telemetryLevel.policyDescription
source: Controls the level of telemetry.
uk: Контролює рівень телеметрії.

# telemetry.telemetryLevel.tableDescription
source: The following table outlines the data sent with each setting:
uk: Наступна таблиця описує дані, надіслані з кожним налаштуванням:

# telemetry.telemetryLevelMd
source: Controls {0} telemetry, first-party extension telemetry, and participating third-party extension telemetry. Some third party extensions might not respect this setting. Consult the specific extension's documentation to be sure. Telemetry helps us better understand how {0} is performing, where improvements need to be made, and how features are being used.
uk: Контролює телеметрію {0}, телеметрію розширень першої сторони та телеметрію розширень третіх сторін, які беруть участь. Деякі розширення третіх сторін можуть не дотримуватися цього налаштування. Ознайомтеся з документацією конкретного розширення, щоб бути впевненими. Телеметрія допомагає нам краще зрозуміти, як {0} працює, де потрібно вносити покращення та як використовуються функції.

# telemetry.usage
source: Usage Data
uk: Дані використання

# telemetryConfigurationTitle
source: Telemetry
uk: Телеметрія

# telemetryLogName
source: Telemetry
uk: Телеметрія

# terminalLoggerName
source: Terminal
uk: Термінал

# terminal.integrated.automationProfile.linux
source: The terminal profile to use on Linux for automation-related terminal usage like tasks and debug.
uk: Профіль терміналу, який слід використовувати на Linux для автоматизації, пов'язаної з використанням терміналу, як-от завдання та налагодження.

# terminal.integrated.automationProfile.osx
source: The terminal profile to use on macOS for automation-related terminal usage like tasks and debug.
uk: Профіль терміналу, який слід використовувати на macOS для автоматизації, пов'язаної з використанням терміналу, як-от завдання та налагодження.

# terminal.integrated.automationProfile.windows
source: The terminal profile to use for automation-related terminal usage like tasks and debug. This setting will currently be ignored if {0} (now deprecated) is set.
uk: Профіль терміналу, який слід використовувати для автоматизаційних завдань, таких як завдання та налагодження. Ця настройка наразі буде проігнорована, якщо встановлено {0} (тепер застаріле).

# terminal.integrated.confirmIgnoreProcesses
source: A set of process names to ignore when using the {0} setting.
uk: Набір імен процесів, які потрібно ігнорувати при використанні налаштування {0}.

# terminal.integrated.defaultProfile.linux
source: The default terminal profile on Linux.
uk: Профіль терміналу за замовчуванням на Linux.

# terminal.integrated.defaultProfile.osx
source: The default terminal profile on macOS.
uk: Профіль терміналу за замовчуванням на macOS.

# terminal.integrated.defaultProfile.windows
source: The default terminal profile on Windows.
uk: Профіль терміналу за замовчуванням у Windows.

# terminal.integrated.inheritEnv
source: Whether new shells should inherit their environment from VS Code, which may source a login shell to ensure $PATH and other development variables are initialized. This has no effect on Windows.
uk: Чи повинні нові оболонки успадковувати своє середовище з VS Code, яке може використовувати вхідну оболонку для забезпечення ініціалізації $PATH та інших змінних розробки. Це не має жодного впливу на Windows.

# terminal.integrated.persistentSessionScrollback
source: Controls the maximum amount of lines that will be restored when reconnecting to a persistent terminal session. Increasing this will restore more lines of scrollback at the cost of more memory and increase the time it takes to connect to terminals on start up. This setting requires a restart to take effect and should be set to a value less than or equal to `#terminal.integrated.scrollback#`.
uk: Контролює максимальну кількість рядків, які будуть відновлені при повторному підключенні до постійної сесії терміналу. Збільшення цього значення відновить більше рядків прокрутки за рахунок більшого використання пам'яті та збільшить час, необхідний для підключення до терміналів при запуску. Це налаштування вимагає перезапуску для набуття чинності і повинно бути встановлено на значення, менше або рівне `#terminal.integrated.scrollback#`.

# terminal.integrated.profile
source: A set of terminal profile customizations for {0} which allows adding, removing or changing how terminals are launched. Profiles are made up of a mandatory path, optional arguments and other presentation options. To override an existing profile use its profile name as the key, for example: {1} {2}Read more about configuring profiles{3}.
uk: Набір налаштувань профілю терміналу для {0}, який дозволяє додавати, видаляти або змінювати спосіб запуску терміналів. Профілі складаються з обов'язкового шляху, необов'язкових аргументів та інших параметрів представлення. Щоб переоприділити існуючий профіль, використовуйте його ім'я профілю як ключ, наприклад: {1} {2}Дізнайтеся більше про налаштування профілів{3}.

# terminal.integrated.showLinkHover
source: Whether to show hovers for links in the terminal output.
uk: Чи показувати наведення для посилань у виході терміналу.

# terminal.integrated.useWslProfiles
source: Controls whether or not WSL distros are shown in the terminal dropdown
uk: Контролює, чи відображаються дистрибутиви WSL у випадаючому меню терміналу

# terminalAutomationProfile.path
source: A path to a shell executable.
uk: Шлях до виконуваного файлу оболонки.

# terminalIntegratedConfigurationTitle
source: Integrated Terminal
uk: Інтегрований термінал

# terminalProfile.args
source: An optional set of arguments to run the shell executable with.
uk: Необов'язковий набір аргументів для запуску виконуваного файлу оболонки.

# terminalProfile.color
source: A theme color ID to associate with the terminal icon.
uk: Ідентифікатор кольору теми для асоціації з іконкою терміналу.

# terminalProfile.env
source: An object with environment variables that will be added to the terminal profile process. Set to `null` to delete environment variables from the base environment.
uk: Об'єкт з змінними середовища, які будуть додані до процесу профілю терміналу. Встановіть на `null`, щоб видалити змінні середовища з базового середовища.

# terminalProfile.icon
source: A codicon ID to associate with the terminal icon.
uk: ID codicon для асоціації з іконкою терміналу.

# terminalProfile.linuxExtensionId
source: The id of the extension terminal
uk: Ідентифікатор терміналу розширення

# terminalProfile.linuxExtensionIdentifier
source: The extension that contributed this profile.
uk: Розширення, яке внесло цей профіль.

# terminalProfile.linuxExtensionTitle
source: The name of the extension terminal
uk: Назва терміналу розширення

# terminalProfile.osxExtensionId
source: The id of the extension terminal
uk: Ідентифікатор терміналу розширення

# terminalProfile.osxExtensionIdentifier
source: The extension that contributed this profile.
uk: Розширення, яке внесло цей профіль.

# terminalProfile.osxExtensionTitle
source: The name of the extension terminal
uk: Назва терміналу розширення

# terminalProfile.overrideName
source: Whether or not to replace the dynamic terminal title that detects what program is running with the static profile name.
uk: Чи замінити динамічний заголовок терміналу, який визначає, яка програма виконується, на статичну назву профілю.

# terminalProfile.path
source: A single path to a shell executable or an array of paths that will be used as fallbacks when one fails.
uk: Один шлях до виконуваного файлу оболонки або масив шляхів, які будуть використовуватися як резервні варіанти, коли один з них не спрацює.

# terminalProfile.windowsExtensionId
source: The id of the extension terminal
uk: Ідентифікатор терміналу розширення

# terminalProfile.windowsExtensionIdentifier
source: The extension that contributed this profile.
uk: Розширення, яке внесло цей профіль.

# terminalProfile.windowsExtensionTitle
source: The name of the extension terminal
uk: Назва терміналу розширення

# terminalProfile.windowsSource
source: A profile source that will auto detect the paths to the shell. Note that non-standard executable locations are not supported and must be created manually in a new profile.
uk: Джерело профілю, яке автоматично виявлятиме шляхи до оболонки. Зверніть увагу, що нестандартні місця розташування виконуваних файлів не підтримуються і повинні бути створені вручну в новому профілі.

# terminalAutomaticProfile
source: Automatically detect the default
uk: Автоматично виявити за замовчуванням

# terminal-history-restored
source: History restored
uk: Історію відновлено

# launchFail.cwdDoesNotExist
source: Starting directory (cwd) "{0}" does not exist
uk: Початковий каталог (cwd) "{0}" не існує

# launchFail.cwdNotDirectory
source: Starting directory (cwd) "{0}" is not a directory
uk: Початкова директорія (cwd) "{0}" не є директорією

# launchFail.executableDoesNotExist
source: Path to shell executable "{0}" does not exist
uk: Шлях до виконуваного файлу оболонки "{0}" не існує

# launchFail.executableIsNotFileOrSymlink
source: Path to shell executable "{0}" is not a file or a symlink
uk: Шлях до виконуваного файлу оболонки "{0}" не є файлом або символічним посиланням

# transparecyRequired
source: This color must be transparent or it will obscure content
uk: Цей колір повинен бути прозорим, інакше він закриє вміст

# useDefault
source: Use the default color.
uk: Використовуйте колір за замовчуванням.

# activeContrastBorder
source: An extra border around active elements to separate them from others for greater contrast.
uk: Додаткова рамка навколо активних елементів, щоб відокремити їх від інших для більшого контрасту.

# contrastBorder
source: An extra border around elements to separate them from others for greater contrast.
uk: Додаткова рамка навколо елементів, щоб відокремити їх від інших для більшого контрасту.

# descriptionForeground
source: Foreground color for description text providing additional information, for example for a label.
uk: Колір переднього плану для тексту опису, що надає додаткову інформацію, наприклад, для мітки.

# disabledForeground
source: Overall foreground for disabled elements. This color is only used if not overridden by a component.
uk: Загальний передній план для елементів з обмеженими можливостями. Цей колір використовується лише в тому випадку, якщо не переопреділений компонентом.

# errorForeground
source: Overall foreground color for error messages. This color is only used if not overridden by a component.
uk: Загальний колір переднього плану для повідомлень про помилки. Цей колір використовується тільки в тому випадку, якщо не переопреділений компонентом.

# focusBorder
source: Overall border color for focused elements. This color is only used if not overridden by a component.
uk: Загальний колір рамки для елементів у фокусі. Цей колір використовується лише в тому випадку, якщо не переважений компонентом.

# foreground
source: Overall foreground color. This color is only used if not overridden by a component.
uk: Загальний колір переднього плану. Цей колір використовується лише в тому випадку, якщо не перекритий компонентом.

# iconForeground
source: The default color for icons in the workbench.
uk: Колір за замовчуванням для значків у робочій області.

# selectionBackground
source: The background color of text selections in the workbench (e.g. for input fields or text areas). Note that this does not apply to selections within the editor.
uk: Колір фону вибраних текстів у робочій області (наприклад, для полів введення або текстових областей). Зверніть увагу, що це не стосується виборів у редакторі.

# textBlockQuoteBackground
source: Background color for block quotes in text.
uk: Колір фону для блочних цитат у тексті.

# textBlockQuoteBorder
source: Border color for block quotes in text.
uk: Колір рамки для блочних цитат у тексті.

# textCodeBlockBackground
source: Background color for code blocks in text.
uk: Колір фону для блоків коду в тексті.

# textLinkActiveForeground
source: Foreground color for links in text when clicked on and on mouse hover.
uk: Колір переднього плану для посилань у тексті при натисканні та при наведенні миші.

# textLinkForeground
source: Foreground color for links in text.
uk: Колір переднього плану для посилань у тексті.

# textPreformatBackground
source: Background color for preformatted text segments.
uk: Колір фону для сегментів попередньо відформатованого тексту.

# textPreformatForeground
source: Foreground color for preformatted text segments.
uk: Колір переднього плану для сегментів попередньо відформатованого тексту.

# textSeparatorForeground
source: Color for text separators.
uk: Колір для текстових роздільників.

# chartsBlue
source: The blue color used in chart visualizations.
uk: Синій колір, використаний у візуалізаціях графіків.

# chartsForeground
source: The foreground color used in charts.
uk: Колір переднього плану, що використовується в графіках.

# chartsGreen
source: The green color used in chart visualizations.
uk: Зелений колір, використаний у візуалізаціях графіків.

# chartsLines
source: The color used for horizontal lines in charts.
uk: Колір, що використовується для горизонтальних ліній у графіках.

# chartsOrange
source: The orange color used in chart visualizations.
uk: Оранжевий колір, використаний у візуалізаціях графіків.

# chartsPurple
source: The purple color used in chart visualizations.
uk: Фіолетовий колір, використаний у візуалізаціях графіків.

# chartsRed
source: The red color used in chart visualizations.
uk: Червоний колір, використаний у візуалізаціях графіків.

# chartsYellow
source: The yellow color used in chart visualizations.
uk: Жовтий колір, використаний у візуалізаціях графіків.

# activeLinkForeground
source: Color of active links.
uk: Колір активних посилань.

# breadcrumbsBackground
source: Background color of breadcrumb items.
uk: Колір фону елементів хлібних крихт.

# breadcrumbsFocusForeground
source: Color of focused breadcrumb items.
uk: Колір фокусованих елементів хлібних крихт.

# breadcrumbsSelectedBackground
source: Background color of breadcrumb item picker.
uk: Колір фону вибору елемента хлібних крихт.

# breadcrumbsSelectedForeground
source: Color of selected breadcrumb items.
uk: Колір вибраних елементів хлібних крихт.

# diffDiagonalFill
source: Color of the diff editor's diagonal fill. The diagonal fill is used in side-by-side diff views.
uk: Колір діагонального заповнення редактора відмінностей. Діагональне заповнення використовується в режимах перегляду відмінностей поруч.

# diffEditor.unchangedCodeBackground
source: The background color of unchanged code in the diff editor.
uk: Колір фону незмінного коду в редакторі порівняння.

# diffEditor.unchangedRegionBackground
source: The background color of unchanged blocks in the diff editor.
uk: Колір фону незмінних блоків у редакторі порівняння.

# diffEditor.unchangedRegionForeground
source: The foreground color of unchanged blocks in the diff editor.
uk: Колір переднього плану незмінних блоків у редакторі порівняння.

# diffEditorBorder
source: Border color between the two text editors.
uk: Колір межі між двома текстовими редакторами.

# diffEditorInserted
source: Background color for text that got inserted. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону для тексту, який був вставлений. Колір не повинен бути непрозорим, щоб не приховувати підкладкові декорації.

# diffEditorInsertedLineGutter
source: Background color for the margin where lines got inserted.
uk: Колір фону для поля, де були вставлені рядки.

# diffEditorInsertedLines
source: Background color for lines that got inserted. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону для рядків, які були вставлені. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# diffEditorInsertedOutline
source: Outline color for the text that got inserted.
uk: Колір контуру для тексту, який був вставлений.

# diffEditorOverviewInserted
source: Diff overview ruler foreground for inserted content.
uk: Передній план лінійки огляду різниці для вставленого контенту.

# diffEditorOverviewRemoved
source: Diff overview ruler foreground for removed content.
uk: Передній план лінійки огляду різниць для видаленого контенту.

# diffEditorRemoved
source: Background color for text that got removed. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону для тексту, який було видалено. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# diffEditorRemovedLineGutter
source: Background color for the margin where lines got removed.
uk: Колір фону для поля, де були видалені рядки.

# diffEditorRemovedLines
source: Background color for lines that got removed. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону для рядків, які були видалені. Колір не повинен бути непрозорим, щоб не приховувати підлеглі декорації.

# diffEditorRemovedOutline
source: Outline color for text that got removed.
uk: Колір контуру для тексту, який було видалено.

# editorBackground
source: Editor background color.
uk: Колір фону редактора.

# editorCompositionBorder
source: The border color for an IME composition.
uk: Колір рамки для складання IME.

# editorError.background
source: Background color of error text in the editor. The color must not be opaque so as not to hide underlying decorations.
uk: Колір фону тексту помилки в редакторі. Колір не повинен бути непрозорим, щоб не приховувати підкладкові елементи.

# editorError.foreground
source: Foreground color of error squigglies in the editor.
uk: Колір переднього плану помилкових хвилястих ліній в редакторі.
