Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_platform.xlf
Languages: uk

# accessibility.signals.chatEditModifiedFile
source: File Modified from Chat Edits
uk: Файл змінено з редагувань чату

# accessibility.signals.chatRequestSent
source: Chat Request Sent
uk: Запит на чат надіслано

# accessibility.signals.chatUserActionRequired
source: Chat User Action Required
uk: Дія користувача чату потрібна

# accessibility.signals.clear
source: Clear
uk: Очистити

# accessibility.signals.codeActionRequestTriggered
source: Code Action Request Triggered
uk: Запит на виконання коду ініційовано

# accessibility.signals.editsKept
source: Edits Kept
uk: Збережені редагування

# accessibility.signals.editsUndone
source: Edits Undone
uk: Виправлення скасовано

# accessibility.signals.format
source: Format
uk: Формат

# accessibility.signals.lineHasBreakpoint
source: Breakpoint
uk: Точка зупинки

# accessibility.signals.lineHasError
source: Error on Line
uk: Помилка на рядку

# accessibility.signals.lineHasFoldedArea
source: Folded
uk: Складений

# accessibility.signals.lineHasWarning
source: Warning on Line
uk: Попередження на лінії

# accessibility.signals.nextEditSuggestion
source: Next Edit Suggestion
uk: Наступна пропозиція редагування

# accessibility.signals.noInlayHints
source: No Inlay Hints
uk: Без вставок підказок

# accessibility.signals.notebookCellCompleted
source: Notebook Cell Completed
uk: Комірка блокнота завершена

# accessibility.signals.notebookCellFailed
source: Notebook Cell Failed
uk: Не вдалося виконати клітинку ноутбука

# accessibility.signals.onDebugBreak
source: Breakpoint
uk: Точка зупинки

# accessibility.signals.positionHasError
source: Error
uk: Помилка

# accessibility.signals.positionHasWarning
source: Warning
uk: Попередження

# accessibility.signals.progress
source: Progress
uk: Прогрес

# accessibility.signals.save
source: Save
uk: Зберегти

# accessibility.signals.taskCompleted
source: Task Completed
uk: Завдання виконано

# accessibility.signals.taskFailed
source: Task Failed
uk: Завдання не виконано

# accessibility.signals.terminalBell
source: Terminal Bell
uk: Термінальний дзвінок

# accessibility.signals.terminalCommandFailed
source: Command Failed
uk: Команда не виконана

# accessibility.signals.terminalCommandSucceeded
source: Command Succeeded
uk: Команда виконана успішно

# accessibility.signals.terminalQuickFix
source: Quick Fix
uk: Швидке вирішення

# accessibilitySignals.chatEditModifiedFile
source: Chat Edit Modified File
uk: Чат Редагувати змінений файл

# accessibilitySignals.chatRequestSent
source: Chat Request Sent
uk: Запит на чат надіслано

# accessibilitySignals.chatResponseReceived
source: Chat Response Received
uk: Отримано відповідь чату

# accessibilitySignals.chatUserActionRequired
source: Chat User Action Required
uk: Дія користувача чату потрібна

# accessibilitySignals.clear
source: Clear
uk: Очистити

# accessibilitySignals.codeActionApplied
source: Code Action Applied
uk: Застосовано дію коду

# accessibilitySignals.codeActionRequestTriggered
source: Code Action Request Triggered
uk: Запит на виконання коду ініційовано

# accessibilitySignals.diffLineDeleted
source: Diff Line Deleted
uk: Рядок зміни видалено

# accessibilitySignals.diffLineInserted
source: Diff Line Inserted
uk: Вставлено рядок змін

# accessibilitySignals.diffLineModified
source: Diff Line Modified
uk: Змінено рядок порівняння

# accessibilitySignals.editsKept
source: Edits Kept
uk: Збережені редагування

# accessibilitySignals.editsUndone
source: Undo Edits
uk: Скасувати зміни

# accessibilitySignals.format
source: Format
uk: Формат

# accessibilitySignals.lineHasBreakpoint.name
source: Breakpoint on Line
uk: Точка зупинки на рядку

# accessibilitySignals.lineHasError.name
source: Error on Line
uk: Помилка на рядку

# accessibilitySignals.lineHasFoldedArea.name
source: Folded Area on Line
uk: Складена область на лінії

# accessibilitySignals.lineHasInlineSuggestion.name
source: Inline Suggestion on Line
uk: Вбудована пропозиція в рядку

# accessibilitySignals.lineHasWarning.name
source: Warning on Line
uk: Попередження в рядку

# accessibilitySignals.nextEditSuggestion.name
source: Next Edit Suggestion on Line
uk: Наступна пропозиція редагування на рядку

# accessibilitySignals.noInlayHints
source: No Inlay Hints on Line
uk: Немає підказок вставки на лінії

# accessibilitySignals.notebookCellCompleted
source: Notebook Cell Completed
uk: Комірка блокнота завершена

# accessibilitySignals.notebookCellFailed
source: Notebook Cell Failed
uk: Не вдалося виконати клітинку нотатника

# accessibilitySignals.onDebugBreak.name
source: Debugger Stopped on Breakpoint
uk: Дебаггер зупинився на точці зупинки

# accessibilitySignals.positionHasError.name
source: Error at Position
uk: Помилка на позиції

# accessibilitySignals.positionHasWarning.name
source: Warning at Position
uk: Попередження на позиції

# accessibilitySignals.progress
source: Progress
uk: Прогрес

# accessibilitySignals.save
source: Save
uk: Зберегти

# accessibilitySignals.taskCompleted
source: Task Completed
uk: Завдання виконано

# accessibilitySignals.taskFailed
source: Task Failed
uk: Завдання не виконано

# accessibilitySignals.terminalBell
source: Terminal Bell
uk: Термінальний дзвінок

# accessibilitySignals.terminalCommandFailed
source: Terminal Command Failed
uk: Не вдалося виконати команду терміналу

# accessibilitySignals.terminalCommandSucceeded
source: Terminal Command Succeeded
uk: Команда терміналу виконана успішно

# accessibilitySignals.terminalQuickFix.name
source: Terminal Quick Fix
uk: Швидке виправлення терміналу

# accessibilitySignals.voiceRecordingStarted
source: Voice Recording Started
uk: Запис голосу розпочато

# accessibilitySignals.voiceRecordingStopped
source: Voice Recording Stopped
uk: Запис голосу зупинено

source: Developer
uk: Розробник

source: File
uk: Файл

source: Help
uk: Допомога

source: Preferences
uk: Налаштування

source: Test
uk: Тест

source: View
uk: Перегляд

# customQuickFixWidget
source: Action Widget
uk: Віджет дій

# customQuickFixWidget.labels
source: {0}, Disabled Reason: {1}
uk: {0}, Причина відключення: {1}

# label
source: {0} to Apply
uk: {0} для застосування

# label-preview
source: {0} to Apply, {1} to Preview
uk: {0} для застосування, {1} для попереднього перегляду

# acceptSelected.title
source: Accept selected action
uk: Прийняти вибрану дію

# actionBar.toggledBackground
source: Background color for toggled action items in action bar.
uk: Колір фону для переключених елементів дії в панелі дій.

# codeActionMenuVisible
source: Whether the action widget list is visible
uk: Чи видимий список віджетів дій

# hideCodeActionWidget.title
source: Hide action widget
uk: Сховати віджет дії

# previewSelected.title
source: Preview selected action
uk: Попередній перегляд вибраної дії

# selectNextCodeAction.title
source: Select next action
uk: Виберіть наступну дію

# selectPrevCodeAction.title
source: Select previous action
uk: Вибрати попередню дію

source: More Actions
uk: Більше дій

# content2
source: {1} to {0}
uk: {1} для {0}

source: Hide
uk: Сховати

# resetThisMenu
source: Reset Menu
uk: Скинути меню

# title
source: Reset All Menus
uk: Скинути всі меню

source: Configure Keybinding
uk: Налаштувати клавішу швидкого доступу

# hide.label
source: Hide '{0}'
uk: Сховати '{0}'

# config.policy.duplicate
source: Cannot register '{0}'. The associated policy {1} is already registered with {2}.
uk: Не вдається зареєструвати '{0}'. Пов'язана політика {1} вже зареєстрована з {2}.

# config.property.duplicate
source: Cannot register '{0}'. This property is already registered.
uk: Не вдається зареєструвати '{0}'. Ця властивість вже зареєстрована.

# config.property.empty
source: Cannot register an empty property
uk: Не можна зареєструвати порожню властивість

# config.property.languageDefault
source: Cannot register '{0}'. This matches property pattern '\\[.*\\]$' for describing language specific editor settings. Use 'configurationDefaults' contribution.
uk: Не вдається зареєструвати '{0}'. Це відповідає шаблону властивості '\\[.*\\]$' для опису специфічних для мови налаштувань редактора. Використовуйте внесок 'configurationDefaults'.

# defaultLanguageConfiguration.description
source: Configure settings to be overridden for {0}.
uk: Налаштуйте параметри, які будуть перекриті для {0}.

# defaultLanguageConfigurationOverrides.title
source: Default Language Configuration Overrides
uk: Перевизначення конфігурації мови за замовчуванням

# overrideSettings.defaultDescription
source: Configure editor settings to be overridden for a language.
uk: Налаштуйте параметри редактора, щоб їх можна було переоприділити для мови.

# overrideSettings.errorMessage
source: This setting does not support per-language configuration.
uk: Ця налаштування не підтримує конфігурацію для кожної мови.

# getContextKeyInfo
source: A command that returns information about context keys
uk: Команда, яка повертає інформацію про ключі контексту

# contextkey.parser.error.closingParenthesis
source: closing parenthesis ')'
uk: закриваюча дужка ')'

# contextkey.parser.error.emptyString
source: Empty context key expression
uk: Порожній вираз ключа контексту

# contextkey.parser.error.emptyString.hint
source: Did you forget to write an expression? You can also put 'false' or 'true' to always evaluate to false or true, respectively.
uk: Ви забули написати вираз? Ви також можете вказати 'false' або 'true', щоб завжди отримувати значення false або true відповідно.

# contextkey.parser.error.expectedButGot
source: Expected: {0} Received: '{1}'.
uk: Очікується: {0} Отримано: '{1}'.

# contextkey.parser.error.noInAfterNot
source: 'in' after 'not'.
uk: 'in' після 'not'.

# contextkey.parser.error.unexpectedEOF
source: Unexpected end of expression
uk: Несподіваний кінець виразу

# contextkey.parser.error.unexpectedEOF.hint
source: Did you forget to put a context key?
uk: Ви забули вказати ключ контексту?

# contextkey.parser.error.unexpectedToken
source: Unexpected token
uk: Несподіваний токен

# contextkey.parser.error.unexpectedToken.hint
source: Did you forget to put && or || before the token?
uk: Ви забули поставити && або || перед токеном?

# contextkey.scanner.errorForLinter
source: Unexpected token.
uk: Несподіваний токен.

# contextkey.scanner.errorForLinterWithHint
source: Unexpected token. Hint: {0}
uk: Несподіваний токен. Підказка: {0}

# inputFocus
source: Whether keyboard focus is inside an input box
uk: Чи знаходиться фокус клавіатури всередині поля введення

# isIOS
source: Whether the operating system is iOS
uk: Чи є операційна система iOS

# isLinux
source: Whether the operating system is Linux
uk: Чи є операційна система Linux

# isMac
source: Whether the operating system is macOS
uk: Чи є операційна система macOS

# isMacNative
source: Whether the operating system is macOS on a non-browser platform
uk: Чи є операційна система macOS на непереглядовій платформі

# isMobile
source: Whether the platform is a mobile web browser
uk: Чи є платформа мобільним веб-браузером

# isWeb
source: Whether the platform is a web browser
uk: Чи є платформа веб-браузером

# isWindows
source: Whether the operating system is Windows
uk: Чи є операційна система Windows

# productQualityType
source: Quality type of VS Code
uk: Якісний тип VS Code

# contextkey.scanner.hint.didYouForgetToEscapeSlash
source: Did you forget to escape the '/' (slash) character? Put two backslashes before it to escape, e.g., '\\/'.
uk: Ви забули екранувати символ '/' (косу риску)? Додайте два зворотні слеші перед ним для екранування, наприклад, '\\/'.

# contextkey.scanner.hint.didYouForgetToOpenOrCloseQuote
source: Did you forget to open or close the quote?
uk: Ви забули відкрити або закрити лапки?

# contextkey.scanner.hint.didYouMean1
source: Did you mean {0}?
uk: Ви мали на увазі {0}?

# contextkey.scanner.hint.didYouMean2
source: Did you mean {0} or {1}?
uk: Ви мали на увазі {0} чи {1}?

# contextkey.scanner.hint.didYouMean3
source: Did you mean {0}, {1} or {2}?
uk: Ви мали на увазі {0}, {1} чи {2}?

# aboutDetail
source: Version: {0} Commit: {1} Date: {2} Browser: {3}
uk: Версія: {0} Коміт: {1} Дата: {2} Браузер: {3}

# cancelButton
source: Cancel
uk: Скасувати

# moreFile
source: ...1 additional file not shown
uk: ...1 додатковий файл не показано

# moreFiles
source: ...{0} additional files not shown
uk: ...{0} додаткових файлів не показано

# okButton
source: &&OK
uk: &&Гаразд

# yesButton
source: &&Yes
uk: &&Так

# aboutDetail
source: Version: {0} Commit: {1} Date: {2} Electron: {3} ElectronBuildId: {4} Chromium: {5} Node.js: {6} V8: {7} OS: {8}
uk: Версія: {0} Коміт: {1} Дата: {2} Браузер: {3}

source: Open
uk: Відкрити

source: Open File
uk: Відкрити файл

source: Open Folder
uk: Відкрити папку

# openWorkspace
source: &&Open
uk: &&Відкрити

# openWorkspaceTitle
source: Open Workspace from File
uk: Відкрити робочий простір з файлу

# fileTooLarge
source: File is too large to open as untitled editor. Please upload it first into the file explorer and then try again.
uk: Файл занадто великий, щоб відкрити його як неназваний редактор. Будь ласка, спочатку завантажте його у файловий провідник, а потім спробуйте ще раз.

# add
source: Add folder(s) to the last active window.
uk: Додати папку(и) до останнього активного вікна.

# addFile
source: Add files as context to the chat session.
uk: Додайте файли як контекст до сесії чату.

# addMcp
source: Adds a Model Context Protocol server definition to the user profile. Accepts JSON input in the form '{"name":"server-name","command":...}'
uk: Додає визначення сервера протоколу контексту моделі до профілю користувача. Приймає JSON-вхід у формі '{"name":"server-name","command":...}'

# category
source: Filters installed extensions by provided category, when using --list-extensions.
uk: Фільтрує встановлені розширення за наданою категорією, коли використовується --list-extensions.

# chatMaximize
source: Maximize the chat session view.
uk: Максимізуйте перегляд сеансу чату.

# chatMode
source: The mode to use for the chat session. Available options: 'ask', 'edit', 'agent', or the identifier of a custom mode. Defaults to 'agent'.
uk: Режим, який використовувати для сеансу чату. Доступні варіанти: 'ask', 'edit', 'agent' або ідентифікатор користувацького режиму. За замовчуванням - 'agent'.

# cliDataDir
source: Directory where CLI metadata should be stored.
uk: Каталог, де повинні зберігатися метадані CLI.

# cliPrompt
source: prompt
uk: підказка

# deprecated.useInstead
source: Use {0} instead.
uk: Використовуйте {0} замість цього.

# diff
source: Compare two files with each other.
uk: Порівняйте два файли один з одним.

# disableChromiumSandbox
source: Use this option only when there is requirement to launch the application as sudo user on Linux or when running as an elevated user in an applocker environment on Windows.
uk: Використовуйте цю опцію лише тоді, коли є необхідність запустити додаток як користувач sudo на Linux або коли ви працюєте як підвищений користувач в середовищі applocker на Windows.

# disableExtension
source: Disable the provided extension. This option is not persisted and is effective only when the command opens a new window.
uk: Вимкніть надане розширення. Ця опція не зберігається і діє лише тоді, коли команда відкриває нове вікно.

# disableExtensions
source: Disable all installed extensions. This option is not persisted and is effective only when the command opens a new window.
uk: Вимкнути всі встановлені розширення. Ця опція не зберігається і діє лише тоді, коли команда відкриває нове вікно.

# disableGPU
source: Disable GPU hardware acceleration.
uk: Вимкнути апаратне прискорення GPU.

# disableLCDText
source: Disable LCD font rendering.
uk: Вимкнути рендеринг шрифтів LCD.

# experimentalApis
source: Enables proposed API features for extensions. Can receive one or more extension IDs to enable individually.
uk: Увімкнення запропонованих функцій API для розширень. Може приймати один або кілька ідентифікаторів розширень для індивідуального увімкнення.

# extensionHomePath
source: Set the root path for extensions.
uk: Встановіть кореневий шлях для розширень.

source: Extensions Management
uk: Управління розширеннями

# goto
source: Open a file at the path on the specified line and character position.
uk: Відкрийте файл за шляхом на вказаному рядку та позиції символу.

# help
source: Print usage.
uk: Допомога

# inspect-brk-extensions
source: Allow debugging and profiling of extensions with the extension host being paused after start. Check the developer tools for the connection URI.
uk: Дозвольте налагодження та профілювання розширень з призупиненим хостом розширень після запуску. Перевірте інструменти розробника для URI з'єднання.

# inspect-extensions
source: Allow debugging and profiling of extensions. Check the developer tools for the connection URI.
uk: Дозволити налагодження та профілювання розширень. Перевірте інструменти розробника для URI з'єднання.

# install prerelease
source: Installs the pre-release version of the extension, when using --install-extension
uk: Встановлює версію розширення до випуску, коли використовується --install-extension

# installExtension
source: Installs or updates an extension. The argument is either an extension id or a path to a VSIX. The identifier of an extension is '${publisher}.${name}'. Use '--force' argument to update to latest version. To install a specific version provide '@${version}'. For example: 'vscode.csharp@1.2.3'.
uk: Встановлює або оновлює розширення. Аргументом є або ідентифікатор розширення, або шлях до VSIX. Ідентифікатор розширення - '${publisher}.${name}'. Використовуйте аргумент '--force', щоб оновити до останньої версії. Щоб встановити конкретну версію, вкажіть '@${version}'. Наприклад: 'vscode.csharp@1.2.3'.

# listExtensions
source: List the installed extensions.
uk: Перерахуйте встановлені розширення.

# locale
source: The locale to use (e.g. en-US or zh-TW).
uk: Локаль для використання (наприклад, en-US або zh-TW).

# locateShellIntegrationPath
source: Print the path to a terminal shell integration script. Allowed values are 'bash', 'pwsh', 'zsh' or 'fish'.
uk: Друкуйте шлях до скрипта інтеграції терміналу. Дозволені значення: 'bash', 'pwsh', 'zsh' або 'fish'.

# log
source: Log level to use. Default is 'info'. Allowed values are 'critical', 'error', 'warn', 'info', 'debug', 'trace', 'off'. You can also configure the log level of an extension by passing extension id and log level in the following format: '${publisher}.${name}:${logLevel}'. For example: 'vscode.csharp:trace'. Can receive one or more such entries.
uk: Рівень журналювання, який потрібно використовувати. За замовчуванням - 'info'. Дозволені значення: 'critical', 'error', 'warn', 'info', 'debug', 'trace', 'off'. Ви також можете налаштувати рівень журналювання розширення, передавши ідентифікатор розширення та рівень журналювання у наступному форматі: '${publisher}.${name}:${logLevel}'. Наприклад: 'vscode.csharp:trace'. Може приймати одну або кілька таких записів.

# mcp
source: Model Context Protocol
uk: Модель контекстного протоколу

# merge
source: Perform a three-way merge by providing paths for two modified versions of a file, the common origin of both modified versions and the output file to save merge results.
uk: Виконайте трьохстороннє злиття, надавши шляхи до двох змінених версій файлу, спільного походження обох змінених версій та вихідного файлу для збереження результатів злиття.

# newWindow
source: Force to open a new window.
uk: Примусити відкрити нове вікно.

# newWindowForChat
source: Force to open an empty window for the chat session.
uk: Примусити відкрити порожнє вікно для сеансу чату.

source: options
uk: опції

# optionsUpperCase
source: Options
uk: Опції

source: paths
uk: шляхи

# prof-startup
source: Run CPU profiler during startup.
uk: Запустіть профайлер ЦП під час старту.

# profileName
source: Opens the provided folder or workspace with the given profile and associates the profile with the workspace. If the profile does not exist, a new empty one is created.
uk: Відкриває надану папку або робоче середовище з вказаним профілем і асоціює профіль з робочим середовищем. Якщо профіль не існує, створюється новий порожній.

# prompt
source: The prompt to use as chat.
uk: Запит для використання в чаті.

# remove
source: Remove folder(s) from the last active window.
uk: Видалити папку(и) з останнього активного вікна.

# reuseWindow
source: Force to open a file or folder in an already opened window.
uk: Примусово відкрити файл або папку в уже відкритому вікні.

# reuseWindowForChat
source: Force to use the last active window for the chat session.
uk: Примусити використовувати останнє активне вікно для сеансу чату.

# showVersions
source: Show versions of installed extensions, when using --list-extensions.
uk: Показати версії встановлених розширень, коли використовується --list-extensions.

# status
source: Print process usage and diagnostics information.
uk: Друкувати інформацію про використання процесу та діагностику.

# stdinUsage
source: To read from stdin, append '-' (e.g. '{0}')
uk: Щоб читати з stdin, додайте '-' (наприклад, '{0}')

source: Subcommands
uk: Підкоманди

# telemetry
source: Shows all telemetry events which VS code collects.
uk: Показує всі події телеметрії, які збирає VS Code.

# transient
source: Run with temporary data and extension directories, as if launched for the first time.
uk: Запустіть з тимчасовими даними та каталогами розширень, ніби запущено вперше.

source: Troubleshooting
uk: Виправлення несправностей

# turn sync
source: Turn sync on or off.
uk: Увімкніть або вимкніть синхронізацію.

# uninstallExtension
source: Uninstalls an extension.
uk: Видаляє розширення.

source: Unknown commit
uk: Невідомий коміт

source: Unknown version
uk: Невідома версія

# updateExtensions
source: Update the installed extensions.
uk: Оновіть встановлені розширення.

source: Usage
uk: Використання

# userDataDir
source: Specifies the directory that user data is kept in. Can be used to open multiple distinct instances of Code.
uk: Вказує директорію, в якій зберігаються дані користувача. Може бути використано для відкриття кількох окремих екземплярів Code.

# verbose
source: Print verbose output (implies --wait).
uk: Друкувати детальний вивід (означає --wait).

# version
source: Print version.
uk: Друкована версія.

# wait
source: Wait for the files to be closed before returning.
uk: Зачекайте, поки файли будуть закриті, перш ніж повертатися.

# deprecatedArgument
source: Option '{0}' is deprecated: {1}
uk: Опція '{0}' застаріла: {1}

# emptyValue
source: Option '{0}' requires a non empty value. Ignoring the option.
uk: Опція '{0}' вимагає непорожнього значення. Ігноруємо опцію.

# gotoValidation
source: Arguments in `--goto` mode should be in the format of `FILE(:LINE(:CHARACTER))`.
uk: Аргументи в режимі `--goto` повинні мати формат `FILE(:LINE(:CHARACTER))`.

# multipleValues
source: Option '{0}' is defined more than once. Using value '{1}'.
uk: Опція '{0}' визначена більше ніж один раз. Використовується значення '{1}'.

# unknownOption
source: Warning: '{0}' is not in the list of known options, but still passed to Electron/Chromium.
uk: Попередження: '{0}' не входить до списку відомих опцій, але все ж передано до Electron/Chromium.

# unknownSubCommandOption
source: Warning: '{0}' is not in the list of known options for subcommand '{1}'
uk: Попередження: '{0}' не входить до списку відомих опцій для підкоманди '{1}'

# MarketPlaceDisabled
source: Marketplace is not enabled
uk: Маркетплейс не активовано

# incompatible platform
source: The '{0}' extension is not available in {1} for the {2}.
uk: Розширення '{0}' недоступне в {1} для {2}.

# incompatibleAPI
source: Can't install '{0}' extension. {1}
uk: Не вдається встановити розширення '{0}'. {1}

source: Learn Why
uk: Дізнайтеся чому
