Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_platform.xlf
Languages: uk

# malicious extension
source: Can't install '{0}' extension since it was reported to be problematic.
uk: Не вдається встановити розширення '{0}', оскільки було повідомлено про його проблемність.

# multipleDependentsError
source: Cannot uninstall '{0}' extension. '{1}', '{2}' and other extension depend on this.
uk: Не вдається видалити розширення '{0}'. '{1}', '{2}' та інші розширення залежать від цього.

# multipleIndirectDependentsError
source: Cannot uninstall '{0}' extension. It includes uninstalling '{1}' extension and '{2}', '{3}' and other extensions depend on this.
uk: Не вдається видалити розширення '{0}'. Це включає видалення розширення '{1}', а також '{2}', '{3}' та інших розширень, які залежать від цього.

# not allowed to install
source: This extension cannot be installed because {0}
uk: Цю розширення не можна встановити, оскільки {0}

# notFoundCompatibleDependency
source: Can't install '{0}' extension because it is not compatible with the current version of {1} (version {2}).
uk: Не вдається встановити розширення '{0}', оскільки воно не сумісне з поточною версією {1} (версія {2}).

# notFoundDeprecatedReplacementExtension
source: Can't install '{0}' extension since it was deprecated and the replacement extension '{1}' can't be found.
uk: Не вдається встановити розширення '{0}', оскільки воно було застаріле, а розширення-замінник '{1}' не знайдено.

# notFoundReleaseExtension
source: Can't install release version of '{0}' extension because it has no release version.
uk: Не вдається встановити випускну версію розширення '{0}', оскільки вона не має випускної версії.

# singleDependentError
source: Cannot uninstall '{0}' extension. '{1}' extension depends on this.
uk: Не вдається видалити розширення '{0}'. Розширення '{1}' залежить від цього.

# singleIndirectDependentError
source: Cannot uninstall '{0}' extension . It includes uninstalling '{1}' extension and '{2}' extension depends on this.
uk: Не вдається видалити розширення '{0}'. Це включає видалення розширення '{1}', і розширення '{2}' залежить від цього.

# twoDependentsError
source: Cannot uninstall '{0}' extension. '{1}' and '{2}' extensions depend on this.
uk: Не вдалося видалити розширення '{0}'. Розширення '{1}' та '{2}' залежать від цього.

# twoIndirectDependentsError
source: Cannot uninstall '{0}' extension. It includes uninstalling '{1}' extension and '{2}' and '{3}' extensions depend on this.
uk: Не вдається видалити розширення '{0}'. Це включає видалення розширення '{1}', і розширення '{2}' та '{3}' залежать від цього.

# extension prerelease not allowed
source: the pre-release versions of this extension are not in the [allowed list]({0})
uk: попередні версії цього розширення не входять до [дозволеного списку]({0})

# prerelease versions from this publisher not allowed
source: the pre-release versions from this publisher are not in the [allowed list]({1})
uk: версії перед випуском від цього видавця не входять до [дозволеного списку]({1})

# publisher not allowed
source: the extensions from this publisher are not in the [allowed list]({1})
uk: розширення від цього видавця не в [дозволеному списку]({1})

# specific extension not allowed
source: it is not in the [allowed list]({0})
uk: це не в [дозволеному списку]({0})

# specific version of extension not allowed
source: the version {0} of this extension is not in the [allowed list]({1})
uk: версія {0} цього розширення не входить до [дозволеного списку]({1})

# extension.publisher.allow.description
source: Allow or disallow all extensions from the publisher.
uk: Дозволити або заборонити всі розширення від видавця.

source: Extensions
uk: Розширення

# extensions.allow.all.description
source: Allow or disallow all extensions.
uk: Дозволити або заборонити всі розширення.

# extensions.allow.all.disable
source: Disallow all extensions.
uk: Заборонити всі розширення.

# extensions.allow.all.enable
source: Allow all extensions.
uk: Дозволити всі розширення.

# extensions.allow.description
source: Allow or disallow the extension.
uk: Дозволити або заборонити розширення.

# extensions.allow.version.description
source: Allow or disallow specific versions of the extension. To specifcy a platform specific version, use the format `platform@1.2.3`, e.g. `win32-x64@1.2.3`. Supported platforms are `win32-x64`, `win32-arm64`, `linux-x64`, `linux-arm64`, `linux-armhf`, `alpine-x64`, `alpine-arm64`, `darwin-x64`, `darwin-arm64`
uk: Дозволити або заборонити конкретні версії розширення. Щоб вказати платформо-специфічну версію, використовуйте формат `platform@1.2.3`, наприклад, `win32-x64@1.2.3`. Підтримувані платформи: `win32-x64`, `win32-arm64`, `linux-x64`, `linux-arm64`, `linux-armhf`, `alpine-x64`, `alpine-arm64`, `darwin-x64`, `darwin-arm64`.

# extensions.allowed
source: Specify a list of extensions that are allowed to use. This helps maintain a secure and consistent development environment by restricting the use of unauthorized extensions. For more information on how to configure this setting, please visit the [Configure Allowed Extensions](https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions) section.
uk: Вкажіть список розширень, які дозволено використовувати. Це допомагає підтримувати безпечне та послідовне середовище розробки, обмежуючи використання несанкціонованих розширень. Для отримання додаткової інформації про налаштування цього параметра, будь ласка, відвідайте розділ [Налаштування дозволених розширень](https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions).

# extensions.allowed.all
source: All extensions are allowed.
uk: Усі розширення дозволені.

# extensions.allowed.disable.desc
source: Extension is not allowed.
uk: Розширення не дозволено.

# extensions.allowed.disable.stable.desc
source: Allow only stable versions of the extension.
uk: Дозволити лише стабільні версії розширення.

# extensions.allowed.enable.desc
source: Extension is allowed.
uk: Розширення дозволено.

# extensions.allowed.none
source: No extensions are allowed.
uk: Розширення не дозволяються.

# extensions.allowed.policy
source: Specify a list of extensions that are allowed to use. This helps maintain a secure and consistent development environment by restricting the use of unauthorized extensions. More information: https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions
uk: Вкажіть список розширень, які дозволено використовувати. Це допомагає підтримувати безпечне та послідовне середовище розробки, обмежуючи використання несанкціонованих розширень. Більше інформації: https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions

# extensions.publisher.allowed.disable.desc
source: All extensions from the publisher are not allowed.
uk: Усі розширення від видавця не дозволені.

# extensions.publisher.allowed.disable.stable.desc
source: Allow only stable versions of the extensions from the publisher.
uk: Дозволити лише стабільні версії розширень від видавця.

# extensions.publisher.allowed.enable.desc
source: All extensions from the publisher are allowed.
uk: Усі розширення від видавця дозволені.

# extensionsConfigurationTitle
source: Extensions
uk: Розширення

# alreadyInstalled
source: Extension '{0}' is already installed.
uk: Розширення '{0}' вже встановлено.

# alreadyInstalled-checkAndUpdate
source: Extension '{0}' v{1} is already installed. Use '--force' option to update to latest version or provide '@<version>' to install a specific version, for example: '{2}@1.2.3'.
uk: Розширення '{0}' v{1} вже встановлено. Використайте опцію '--force', щоб оновити до останньої версії, або надайте '@<version>', щоб встановити конкретну версію, наприклад: '{2}@1.2.3'.

# builtin
source: Extension '{0}' is a Built-in extension and cannot be uninstalled
uk: Розширення '{0}' є вбудованим розширенням і не може бути видалено

# cancelVsixInstall
source: Cancelled installing extension '{0}'.
uk: Скасовано встановлення розширення '{0}'.

# error while installing extensions
source: Error while installing extensions: {0}
uk: Помилка під час встановлення розширень: {0}

# errorInstallingExtension
source: Error while installing extension {0}: {1}
uk: Помилка під час встановлення розширення {0}: {1}

# errorUpdatingExtension
source: Error while updating extension {0}: {1}
uk: Помилка під час оновлення розширення {0}: {1}

# forceDowngrade
source: A newer version of extension '{0}' v{1} is already installed. Use '--force' option to downgrade to older version.
uk: Нова версія розширення '{0}' v{1} вже встановлена. Використайте опцію '--force', щоб понизити версію до старішої.

# forceUninstall
source: Extension '{0}' is marked as a Built-in extension by user. Please use '--force' option to uninstall it.
uk: Розширення '{0}' позначено як вбудоване розширення користувачем. Будь ласка, використайте опцію '--force', щоб видалити його.

# installation failed
source: Failed Installing Extensions: {0}
uk: Не вдалося встановити розширення: {0}

# installing
source: Installing extension '{0}'...
uk: Встановлення розширення '{0}'...

# installing builtin
source: Installing builtin extension '{0}'...
uk: Встановлення вбудованого розширення '{0}'...

# installing builtin with version
source: Installing builtin extension '{0}' v{1}...
uk: Встановлення вбудованого розширення '{0}' версії {1}...

# installing with version
source: Installing extension '{0}' v{1}...
uk: Встановлення розширення '{0}' версії {1}...

source: Installing extensions...
uk: Встановлення розширень...

# installingExtensionsOnLocation
source: Installing extensions on {0}...
uk: Встановлення розширень на {0}...

# listFromLocation
source: Extensions installed on {0}:
uk: Розширення, встановлені на {0}:

# notFound
source: Extension '{0}' not found.
uk: Розширення '{0}' не знайдено.

# notInstalled
source: Extension '{0}' is not installed.
uk: Розширення '{0}' не встановлено.

# notInstalleddOnLocation
source: Extension '{0}' is not installed on {1}.
uk: Розширення '{0}' не встановлено на {1}.

# successInstall
source: Extension '{0}' v{1} was successfully installed.
uk: Розширення '{0}' v{1} було успішно встановлено.

# successUninstall
source: Extension '{0}' was successfully uninstalled!
uk: Розширення '{0}' було успішно видалено!

# successUninstallFromLocation
source: Extension '{0}' was successfully uninstalled from {1}!
uk: Розширення '{0}' було успішно видалено з {1}!

# successUpdate
source: Extension '{0}' v{1} was successfully updated.
uk: Розширення '{0}' v{1} було успішно оновлено.

# successVsixInstall
source: Extension '{0}' was successfully installed.
uk: Розширення '{0}' було успішно встановлено.

# uninstalling
source: Uninstalling {0}...
uk: Видалення {0}...

# updateExtensionsNewVersionsAvailable
source: Updating extensions: {0}
uk: Оновлення розширень: {0}

# updateExtensionsNoExtensions
source: No extension to update
uk: Немає розширення для оновлення

# updateExtensionsQuery
source: Fetching latest versions for {0} extensions
uk: Отримання останніх версій для {0} розширень

# updateMessage
source: Updating the extension '{0}' to the version {1}
uk: Оновлення розширення '{0}' до версії {1}

# useId
source: Make sure you use the full extension ID, including the publisher, e.g.: {0}
uk: Переконайтеся, що ви використовуєте повний ідентифікатор розширення, включаючи видавця, наприклад: {0}

# missingNLSKey
source: Couldn't find message for key {0}.
uk: Не вдалося знайти повідомлення для ключа {0}.

# fileReadFail
source: Cannot read file {0}: {1}.
uk: Не вдається прочитати файл {0}: {1}.

# jsonInvalidFormat
source: Invalid format {0}: JSON object expected.
uk: Невірний формат {0}: очікується об'єкт JSON.

# jsonParseFail
source: Failed to parse {0}: [{1}, {2}] {3}.
uk: Не вдалося розібрати {0}: [{1}, {2}] {3}.

# jsonParseInvalidType
source: Invalid manifest file {0}: Not a JSON object.
uk: Неправильний файл маніфесту {0}: Не є об'єктом JSON.

# jsonsParseReportErrors
source: Failed to parse {0}: {1}.
uk: Не вдалося розібрати {0}: {1}.

# cannot read
source: Cannot read the extension from {0}
uk: Не вдається прочитати розширення з {0}

# errorDeleting
source: Unable to delete the existing folder '{0}' while installing the extension '{1}'. Please delete the folder manually and try again
uk: Не вдалося видалити існуючу папку '{0}' під час встановлення розширення '{1}'. Будь ласка, видаліть папку вручну і спробуйте ще раз.

# incompatible
source: Unable to install extension '{0}' as it is not compatible with VS Code '{1}'.
uk: Неможливо встановити розширення '{0}', оскільки воно не сумісне з VS Code '{1}'.

# invalidManifest
source: Cannot install '{0}' extension because of manifest mismatch with Marketplace
uk: Не вдалося встановити розширення '{0}' через невідповідність маніфесту з Marketplace

# notAllowed
source: This extension cannot be installed because {0}
uk: Цю розширення не можна встановити, оскільки {0}

# restartCode
source: Please restart VS Code before reinstalling {0}.
uk: Будь ласка, перезапустіть VS Code перед повторною установкою {0}.

# signature verification failed
source: Signature verification failed with '{0}' error.
uk: Перевірка підпису не вдалася з помилкою '{0}'.

# signature verification not executed
source: Signature verification was not executed.
uk: Перевірка підпису не була виконана.

# invalidManifest
source: VSIX invalid: package.json is not a JSON file.
uk: Не вдалося встановити розширення '{0}' через невідповідність маніфесту з Marketplace

# apiProposalMismatch1
source: This extension is using the API proposal '{0}' that is not compatible with the current version of VS Code.
uk: Ця розширення використовує API пропозицію '{0}', яка не сумісна з поточною версією VS Code.

# apiProposalMismatch2
source: This extension is using the API proposals {0} and '{1}' that are not compatible with the current version of VS Code.
uk: Ця розширення використовує API пропозиції {0} та '{1}', які не сумісні з поточною версією VS Code.

# extensionDescription.activationEvents1
source: property `{0}` can be omitted or must be of type `string[]`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string[]`

# extensionDescription.activationEvents2
source: property `{0}` should be omitted if the extension doesn't have a `{1}` or `{2}` property.
uk: властивість `{0}` повинна бути пропущена, якщо розширення не має властивості `{1}` або `{2}`.

# extensionDescription.browser1
source: property `{0}` can be omitted or must be of type `string`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string`

# extensionDescription.browser2
source: Expected `browser` ({0}) to be included inside extension's folder ({1}). This might make the extension non-portable.
uk: Очікувалося, що `browser` ({0}) буде включено в папку розширення ({1}). Це може зробити розширення непортативним.

# extensionDescription.engines
source: property `{0}` is mandatory and must be of type `object`
uk: властивість `{0}` є обов'язковою і повинна бути типу `object`

# extensionDescription.engines.vscode
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# extensionDescription.extensionDependencies
source: property `{0}` can be omitted or must be of type `string[]`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string[]`

# extensionDescription.extensionKind
source: property `{0}` can be defined only if property `main` is also defined.
uk: властивість `{0}` може бути визначена лише якщо властивість `main` також визначена.

# extensionDescription.main1
source: property `{0}` can be omitted or must be of type `string`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string`

# extensionDescription.main2
source: Expected `main` ({0}) to be included inside extension's folder ({1}). This might make the extension non-portable.
uk: Очікувалося, що `main` ({0}) буде включено в папку розширення ({1}). Це може зробити розширення непортативним.

# extensionDescription.name
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# extensionDescription.publisher
source: property publisher must be of type `string`.
uk: властивість publisher повинна бути типу `string`.

# extensionDescription.version
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# notSemver
source: Extension version is not semver compatible.
uk: Версія розширення не є сумісною з semver.

# versionMismatch
source: Extension is not compatible with Code {0}. Extension requires: {1}.
uk: Розширення не сумісне з кодом {0}. Розширення вимагає: {1}.

# versionSpecificity1
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions before 1.0.0, please define at a minimum the major and minor desired version. E.g. ^0.10.0, 0.10.x, 0.11.0, etc.
uk: Версія, вказана в `engines.vscode` ({0}), недостатньо специфічна. Для версій vscode до 1.0.0, будь ласка, визначте принаймні основну та незначну бажану версію. Наприклад, ^0.10.0, 0.10.x, 0.11.0 тощо.

# versionSpecificity2
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions after 1.0.0, please define at a minimum the major desired version. E.g. ^1.10.0, 1.10.x, 1.x.x, 2.x.x, etc.
uk: Версія, вказана в `engines.vscode` ({0}), недостатньо специфічна. Для версій vscode після 1.0.0, будь ласка, визначте принаймні основну бажану версію. Наприклад, ^1.10.0, 1.10.x, 1.x.x, 2.x.x тощо.

# versionSyntax
source: Could not parse `engines.vscode` value {0}. Please use, for example: ^1.22.0, ^1.22.x, etc.
uk: Не вдалося розібрати значення `engines.vscode` {0}. Будь ласка, використовуйте, наприклад: ^1.22.0, ^1.22.x тощо.

# console.title
source: VS Code Console
uk: Консоль VS Code

# ext.term.app.not.found
source: can't find terminal application '{0}'
uk: не можу знайти термінальну програму '{0}'

# linux.term.failed
source: '{0}' failed with exit code {1}
uk: '{0}' завершився з кодом виходу {1}

# mac.terminal.script.failed
source: Script '{0}' failed with exit code {1}
uk: Скрипт '{0}' завершився з кодом виходу {1}

# mac.terminal.type.not.supported
source: '{0}' not supported
uk: '{0}' не підтримується

# press.any.key
source: Press any key to continue...
uk: Натисніть будь-яку клавішу, щоб продовжити...

# fileSystemNotAllowedError
source: Insufficient permissions. Please retry and allow the operation.
uk: Недостатньо прав. Будь ласка, спробуйте ще раз і надайте дозвіл на виконання операції.

# fileSystemRenameError
source: Rename is only supported for files.
uk: Перейменування підтримується лише для файлів.

# dirIsNotEmpty
source: Directory is not empty
uk: Каталог не порожній

# fileExceedsStorageQuota
source: File exceeds available storage quota
uk: Файл перевищує доступну квоту зберігання

source: File is Directory
uk: Файл є директорією

# fileNotDirectory
source: File is not a directory
uk: Файл не є директорією

# fileNotExists
source: File does not exist
uk: Файл не існує

# internal
source: Internal error occurred in IndexedDB File System Provider. ({0})
uk: Внутрішня помилка сталася в IndexedDB File System Provider. ({0})

# deleteFailedAtomicUnsupported
source: Unable to delete file '{0}' atomically because provider does not support it.
uk: Не вдалося видалити файл '{0}' атомарно, оскільки постачальник цього не підтримує.

# deleteFailedNonEmptyFolder
source: Unable to delete non-empty folder '{0}'.
uk: Неможливо видалити непорожню папку '{0}'.

# deleteFailedNotFound
source: Unable to delete nonexistent file '{0}'
uk: Неможливо видалити неіснуючий файл '{0}'

# deleteFailedTrashAndAtomicUnsupported
source: Unable to atomically delete file '{0}' because using trash is enabled.
uk: Не вдалося атомарно видалити файл '{0}', оскільки використання кошика увімкнено.

# deleteFailedTrashUnsupported
source: Unable to delete file '{0}' via trash because provider does not support it.
uk: Неможливо видалити файл '{0}' через кошик, оскільки постачальник не підтримує цю функцію.

# err.read
source: Unable to read file '{0}' ({1})
uk: Неможливо прочитати файл '{0}' ({1})

# err.readonly
source: Unable to modify read-only file '{0}'
uk: Неможливо змінити файл тільки для читання '{0}'

# err.write
source: Unable to write file '{0}' ({1})
uk: Неможливо записати файл '{0}' ({1})

# fileExists
source: Unable to create file '{0}' that already exists when overwrite flag is not set
uk: Неможливо створити файл '{0}', який вже існує, коли прапорець перезапису не встановлений

# fileIsDirectoryReadError
source: Unable to read file '{0}' that is actually a directory
uk: Неможливо прочитати файл '{0}', який насправді є директорією

# fileIsDirectoryWriteError
source: Unable to write file '{0}' that is actually a directory
uk: Неможливо записати файл '{0}', який насправді є каталогом

# fileModifiedError
source: File Modified Since
uk: Файл змінено з

# fileNotFoundError
source: Unable to resolve nonexistent file '{0}'
uk: Неможливо знайти неіснуючий файл '{0}'

# fileNotModifiedError
source: File not modified since
uk: Файл не змінювався з

# fileTooLargeError
source: Unable to read file '{0}' that is too large to open
uk: Неможливо прочитати файл '{0}', який занадто великий для відкриття

# invalidPath
source: Unable to resolve filesystem provider with relative file path '{0}'
uk: Неможливо визначити постачальника файлової системи з відносним шляхом до файлу '{0}'

# mkdirExistsError
source: Unable to create folder '{0}' that already exists but is not a directory
uk: Неможливо створити папку '{0}', яка вже існує, але не є директорією

# noProviderFound
source: ENOPRO: No file system provider found for resource '{0}'
uk: ENOPRO: Не знайдено постачальника файлової системи для ресурсу '{0}'

# unableToMoveCopyError1
source: Unable to copy when source '{0}' is same as target '{1}' with different path case on a case insensitive file system
uk: Неможливо скопіювати, коли джерело '{0}' таке ж, як і ціль '{1}', з різним регістром шляху на файловій системі без урахування регістру

# unableToMoveCopyError2
source: Unable to move/copy when source '{0}' is parent of target '{1}'.
uk: Неможливо перемістити/скопіювати, коли джерело '{0}' є батьківським для цілі '{1}'.

# unableToMoveCopyError3
source: Unable to move/copy '{0}' because target '{1}' already exists at destination.
uk: Неможливо перемістити/скопіювати '{0}', оскільки ціль '{1}' вже існує в місці призначення.

# unableToMoveCopyError4
source: Unable to move/copy '{0}' into '{1}' since a file would replace the folder it is contained in.
uk: Не вдається перемістити/скопіювати '{0}' у '{1}', оскільки файл замінив би папку, в якій він міститься.

# writeFailedAtomicUnlock
source: Unable to unlock file '{0}' because atomic write is enabled.
uk: Не вдається розблокувати файл '{0}', оскільки увімкнено атомарне записування.

# writeFailedAtomicUnsupported1
source: Unable to atomically write file '{0}' because provider does not support it.
uk: Неможливо атомарно записати файл '{0}', оскільки постачальник цього не підтримує.

# writeFailedAtomicUnsupported2
source: Unable to atomically write file '{0}' because provider does not support unbuffered writes.
uk: Неможливо атомарно записати файл '{0}', оскільки постачальник не підтримує небудовані записи.

# writeFailedUnlockUnsupported
source: Unable to unlock file '{0}' because provider does not support it.
uk: Не вдалося розблокувати файл '{0}', оскільки постачальник не підтримує це.

# sizeGB
source: {0}GB
uk: {0}ГБ

# sizeKB
source: {0}KB
uk: {0}КБ

# sizeMB
source: {0}MB
uk: {0}МБ

# sizeTB
source: {0}TB
uk: {0}ТБ

source: Unknown Error
uk: Невідома помилка

# fileTooLargeError
source: File is too large to open
uk: Неможливо прочитати файл '{0}', який занадто великий для відкриття
