Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-editor/*/vs_platform.xlf
Languages: uk

# appStalled
source: The window is not responding
uk: Вікно не відповідає

# appStalledDetail
source: You can reopen or close the window or keep waiting.
uk: Ви можете повторно відкрити або закрити вікно, або продовжувати чекати.

source: &&Close
uk: закрити

# doNotRestoreEditors
source: Don't restore editors
uk: Не відновлювати редактори

# hiddenMenuBar
source: You can still access the menu bar by pressing the Alt-key.
uk: Ви все ще можете отримати доступ до панелі меню, натиснувши клавішу Alt.

source: &&New Window
uk: Примусити відкрити нове вікно.

source: &&Reopen
uk: &&Відкрити знову

# wait
source: &&Keep Waiting
uk: Зачекайте, поки файли будуть закриті, перш ніж повертатися.

source: &&Allow
uk: &&Дозволити

source: &&Cancel
uk: Скасувати

# confirmOpenDetail
source: The path '{0}' uses a host that is not allowed. Unless you trust the host, you should press 'Cancel'
uk: Шлях '{0}' використовує хост, який не дозволено. Якщо ви не довіряєте хосту, вам слід натиснути 'Скасувати'

# confirmOpenMessage
source: The host '{0}' was not found in the list of allowed hosts. Do you want to allow it anyway?
uk: Хост '{0}' не знайдено у списку дозволених хостів. Ви все ж хочете його дозволити?

# doNotAskAgain
source: Permanently allow host '{0}'
uk: Постійно дозволити хост '{0}'

source: &&Learn More
uk: &&Дізнатися більше

# pathNotExistDetail
source: The path '{0}' does not exist on this computer.
uk: Шлях '{0}' не існує на цьому комп'ютері.

# pathNotExistTitle
source: Path does not exist
uk: Шлях не існує

# uriInvalidDetail
source: The URI '{0}' is not valid and can not be opened.
uk: URI '{0}' недійсний і не може бути відкритий.

# uriInvalidTitle
source: URI can not be opened
uk: URI не може бути відкрито

source: Code Workspace
uk: Кодове середовище

# clearButtonLabel
source: &&Clear
uk: &&Очистити

# confirmClearDetail
source: This action is irreversible!
uk: Цю дію неможливо скасувати!

# confirmClearRecentsMessage
source: Do you want to clear all recently opened files and workspaces?
uk: Ви хочете очистити всі нещодавно відкриті файли та робочі простори?

source: New Window
uk: Примусити відкрити нове вікно.

# newWindowDesc
source: Opens a new window
uk: Відкриває нове вікно

source: Recent Folders
uk: Недавні папки

# recentFoldersAndWorkspaces
source: Recent Folders & Workspaces
uk: Недавні папки та робочі простори

source: Untitled (Workspace)
uk: Без назви (Робоча область)

# workspaceName
source: {0} (Workspace)
uk: {0} (Робочий простір)

# workspaceOpenedDetail
source: The workspace is already opened in another window. Please close that window first and then try again.
uk: Робоче середовище вже відкрите в іншому вікні. Будь ласка, спочатку закрийте це вікно, а потім спробуйте ще раз.

# workspaceOpenedMessage
source: Unable to save workspace '{0}'
uk: Неможливо зберегти робочу область '{0}'
