Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_themes.xlf
Languages: uk

# editorColors.semanticHighlighting
source: Whether semantic highlighting should be enabled for this theme.
uk: Чи слід увімкнути семантичне підсвічування для цієї теми.

# editorColors.semanticHighlighting.deprecationMessage
source: Use `enabled` in `editor.semanticTokenColorCustomizations` setting instead.
uk: Використовуйте `enabled` у налаштуванні `editor.semanticTokenColorCustomizations`.

# editorColors.semanticHighlighting.deprecationMessageMarkdown
source: Use `enabled` in {0} setting instead.
uk: Використовуйте `enabled` в налаштуванні {0} замість цього.

# editorColors.semanticHighlighting.enabled
source: Whether semantic highlighting is enabled or disabled for this theme
uk: Чи увімкнено або вимкнено семантичне підсвічування для цієї теми

# editorColors.semanticHighlighting.rules
source: Semantic token styling rules for this theme.
uk: Семантичні правила стилізації токенів для цієї теми.

# editorColors.strings
source: Sets the colors and styles for strings literals.
uk: Встановлює кольори та стилі для рядкових літералів.

# editorColors.textMateRules
source: Sets colors and styles using textmate theming rules (advanced).
uk: Встановлює кольори та стилі, використовуючи правила темізації TextMate (просунуто).

# editorColors.types
source: Sets the colors and styles for type declarations and references.
uk: Встановлює кольори та стилі для оголошень типів і посилань.

# editorColors.variables
source: Sets the colors and styles for variables declarations and references.
uk: Встановлює кольори та стилі для оголошень змінних та посилань.

# iconTheme
source: Specifies the file icon theme used in the workbench or 'null' to not show any file icons.
uk: Визначає тему значків файлів, що використовується в робочій області, або 'null', щоб не показувати жодних значків файлів.

# iconThemeError
source: File icon theme is unknown or not installed.
uk: Тема значків файлів невідома або не встановлена.

# noIconThemeDesc
source: No file icons
uk: Немає значків файлів

# noIconThemeLabel
source: None
uk: Немає

# preferredDarkColorTheme
source: Specifies the color theme when system color mode is dark and {0} is enabled.
uk: Вказує колірну тему, коли режим кольору системи темний і {0} увімкнено.

# preferredHCDarkColorTheme
source: Specifies the color theme when in high contrast dark mode and {0} is enabled.
uk: Вказує колірну тему, коли увімкнено режим високого контрасту з темною темою і {0} активовано.

# preferredHCLightColorTheme
source: Specifies the color theme when in high contrast light mode and {0} is enabled.
uk: Вказує колірну тему, коли увімкнено режим високого контрасту та {0}.

# preferredLightColorTheme
source: Specifies the color theme when system color mode is light and {0} is enabled.
uk: Визначає колірну тему, коли режим кольору системи світлий, і {0} увімкнено.

# productIconTheme
source: Specifies the product icon theme used.
uk: Вказує тему значка продукту, що використовується.

# productIconThemeError
source: Product icon theme is unknown or not installed.
uk: Тема значка продукту невідома або не встановлена.

# semanticTokenColors
source: Overrides editor semantic token color and styles from the currently selected color theme.
uk: Перезаписує кольори та стилі семантичних токенів редактора з поточно вибраної кольорової теми.

# workbenchColors
source: Overrides colors from the currently selected color theme.
uk: Перезаписує кольори з обраної теми кольорів.

source: Color Themes
uk: Колірні теми

source: File Icon Themes
uk: Іконки тем файлів

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікувалося, що `contributes.{0}.path` ({1}) буде включено в папку розширення ({2}). Це може зробити розширення непортативним.

source: Product Icon Themes
uk: Іконки тем продукту

# reqarray
source: Extension point `{0}` must be an array.
uk: Точка розширення `{0}` повинна бути масивом.

# reqid
source: Expected string in `contributes.{0}.id`. Provided value: {1}
uk: Очікується рядок у `contributes.{0}.id`. Надане значення: {1}

# reqpath
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікується рядок у `contributes.{0}.path`. Надане значення: {1}

source: Themes
uk: Теми

# vscode.extension.contributes.iconThemes
source: Contributes file icon themes.
uk: Сприяє темам значків файлів.

# vscode.extension.contributes.iconThemes.id
source: Id of the file icon theme as used in the user settings.
uk: Ідентифікатор теми значків файлів, що використовується в налаштуваннях користувача.

# vscode.extension.contributes.iconThemes.label
source: Label of the file icon theme as shown in the UI.
uk: Мітка теми значка файлу, як показано в інтерфейсі.

# vscode.extension.contributes.iconThemes.path
source: Path of the file icon theme definition file. The path is relative to the extension folder and is typically './fileicons/awesome-icon-theme.json'.
uk: Шлях до файлу визначення теми значків файлів. Шлях є відносним до папки розширення і зазвичай має вигляд './fileicons/awesome-icon-theme.json'.

# vscode.extension.contributes.productIconThemes
source: Contributes product icon themes.
uk: Сприяє темам іконок продукту.

# vscode.extension.contributes.productIconThemes.id
source: Id of the product icon theme as used in the user settings.
uk: Ідентифікатор теми значка продукту, що використовується в налаштуваннях користувача.

# vscode.extension.contributes.productIconThemes.label
source: Label of the product icon theme as shown in the UI.
uk: Мітка теми значка продукту, як показано в інтерфейсі.

# vscode.extension.contributes.productIconThemes.path
source: Path of the product icon theme definition file. The path is relative to the extension folder and is typically './producticons/awesome-product-icon-theme.json'.
uk: Шлях до файлу визначення теми значків продукту. Шлях є відносним до папки розширення і зазвичай має вигляд './producticons/awesome-product-icon-theme.json'.

# vscode.extension.contributes.themes
source: Contributes textmate color themes.
uk: Сприяє темам кольорів textmate.

# vscode.extension.contributes.themes.id
source: Id of the color theme as used in the user settings.
uk: Ідентифікатор кольорової теми, що використовується в налаштуваннях користувача.

# vscode.extension.contributes.themes.label
source: Label of the color theme as shown in the UI.
uk: Мітка кольорової теми, як показано в інтерфейсі.

# vscode.extension.contributes.themes.path
source: Path of the tmTheme file. The path is relative to the extension folder and is typically './colorthemes/awesome-color-theme.json'.
uk: Шлях до файлу tmTheme. Шлях є відносним до папки розширення і зазвичай має вигляд './colorthemes/awesome-color-theme.json'.

# vscode.extension.contributes.themes.uiTheme
source: Base theme defining the colors around the editor: 'vs' is the light color theme, 'vs-dark' is the dark color theme. 'hc-black' is the dark high contrast theme, 'hc-light' is the light high contrast theme.
uk: Базова тема, що визначає кольори навколо редактора: 'vs' — це світла кольорова тема, 'vs-dark' — це темна кольорова тема. 'hc-black' — це темна тема з високим контрастом, 'hc-light' — це світла тема з високим контрастом.

# contributes.color.description
source: The description of the semantic token type
uk: Опис темізованого кольору

source: Contributes semantic token modifiers.
uk: Сприяє семантичним модифікаторам токенів.

# contributes.semanticTokenModifiers.description
source: The description of the semantic token modifier
uk: Опис модифікатора семантичного токена

# contributes.semanticTokenModifiers.id
source: The identifier of the semantic token modifier
uk: Ідентифікатор модифікатора семантичного токена

# contributes.semanticTokenModifiers.id.format
source: Identifiers should be in the form letterOrDigit[_-letterOrDigit]*
uk: Ідентифікатори повинні мати форму letterOrDigit[_-letterOrDigit]*

# contributes.semanticTokenScopes
source: Contributes semantic token scope maps.
uk: Вносить карти обсягу семантичних токенів.

# contributes.semanticTokenScopes.languages
source: Lists the languge for which the defaults are.
uk: Перераховує мови, для яких встановлено значення за замовчуванням.

# contributes.semanticTokenScopes.scopes
source: Maps a semantic token (described by semantic token selector) to one or more textMate scopes used to represent that token.
uk: Відображає семантичний токен (описаний селектором семантичного токена) на один або кілька текстових областей textMate, які використовуються для представлення цього токена.

source: Contributes semantic token types.
uk: Сприяє типам семантичних токенів.

# contributes.semanticTokenTypes.id
source: The identifier of the semantic token type
uk: Ідентифікатор типу семантичного токена

# contributes.semanticTokenTypes.id.format
source: Identifiers should be in the form letterOrDigit[_-letterOrDigit]*
uk: Ідентифікатори повинні мати форму letterOrDigit[_-letterOrDigit]*

# contributes.semanticTokenTypes.superType
source: The super type of the semantic token type
uk: Супертип семантичного типу токена

# contributes.semanticTokenTypes.superType.format
source: Super types should be in the form letterOrDigit[_-letterOrDigit]*
uk: Супертипи повинні бути у формі letterOrDigit[_-letterOrDigit]*

# invalid.description
source: 'configuration.{0}.description' must be defined and can not be empty
uk: 'configuration.colors.description' має бути визначено і не може бути порожнім

# invalid.id
source: 'configuration.{0}.id' must be defined and can not be empty
uk: 'configuration.colors.id' повинен бути визначений і не може бути порожнім

# invalid.id.format
source: 'configuration.{0}.id' must follow the pattern letterOrDigit[-_letterOrDigit]*
uk: 'configuration.colors.id' може містити лише літери, цифри та крапки і не може починатися з крапки.

# invalid.semanticTokenModifierConfiguration
source: 'configuration.semanticTokenModifier' must be an array
uk: 'configuration.semanticTokenModifier' має бути масивом

# invalid.semanticTokenScopes.configuration
source: 'configuration.semanticTokenScopes' must be an array
uk: 'configuration.semanticTokenScopes' має бути масивом

# invalid.semanticTokenScopes.language
source: 'configuration.semanticTokenScopes.language' must be a string
uk: 'configuration.semanticTokenScopes.language' має бути рядком

# invalid.semanticTokenScopes.scopes
source: 'configuration.semanticTokenScopes.scopes' must be defined as an object
uk: 'configuration.semanticTokenScopes.scopes' має бути визначено як об'єкт

# invalid.semanticTokenScopes.scopes.selector
source: configuration.semanticTokenScopes.scopes': Problems parsing selector {0}.
uk: configuration.semanticTokenScopes.scopes': Проблеми з парсингом селектора {0}.

# invalid.semanticTokenScopes.scopes.value
source: 'configuration.semanticTokenScopes.scopes' values must be an array of strings
uk: 'configuration.semanticTokenScopes.scopes' значення повинні бути масивом рядків

# invalid.semanticTokenTypeConfiguration
source: 'configuration.semanticTokenType' must be an array
uk: 'configuration.semanticTokenType' має бути масивом

# invalid.superType.format
source: 'configuration.{0}.superType' must follow the pattern letterOrDigit[-_letterOrDigit]*
uk: 'configuration.{0}.superType' має відповідати шаблону letterOrDigit[-_letterOrDigit]*

# window.systemColorTheme
source: Set the color mode for native UI elements such as native dialogs, menus and title bar. Even if your OS is configured in light color mode, you can select a dark system color theme for the window. You can also configure to automatically adjust based on the {0} setting. Note: This setting is ignored when {1} is enabled.
uk: {0} та {1} стануть посиланнями на інші налаштування. Встановіть режим кольору для елементів нативного інтерфейсу, таких як нативні діалоги, меню та панель заголовка. Навіть якщо ваша ОС налаштована на світлий режим кольору, ви можете вибрати темну кольорову тему системи для вікна. Ви також можете налаштувати автоматичне коригування на основі налаштування {0}. Примітка: Це налаштування ігнорується, коли {1} увімкнено.

# window.systemColorTheme.auto
source: Use light native widget colors for light color themes and dark for dark color themes.
uk: Використовуйте світлі кольори віджетів для світлих кольорових тем і темні для темних кольорових тем.

# window.systemColorTheme.dark
source: Use dark native widget colors.
uk: Використовуйте темні кольори рідних віджетів.

# window.systemColorTheme.default
source: Native widget colors match the system colors.
uk: Кольори рідних віджетів відповідають кольорам системи.

# window.systemColorTheme.light
source: Use light native widget colors.
uk: Використовуйте світлі кольори віджетів за замовчуванням.
