Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_authentication.xlf
Languages: uk

# accessRequest
source: Grant access to {0} for {1}... (1)
uk: Надати доступ до {0} для {1}... (1)

source: &&Allow
uk: &&Дозволити

# confirmAuthenticationAccess
source: The extension '{0}' wants to access the {1} account '{2}'.
uk: Розширення '{0}' хоче отримати доступ до облікового запису {1} '{2}'.

source: &&Deny
uk: &&Відмовити

# getSessionPlateholder
source: Select an account for '{0}' to use or Esc to cancel
uk: Виберіть обліковий запис для '{0}', щоб використовувати, або натисніть Esc, щоб скасувати

# selectAccount
source: The extension '{0}' wants to access a {1} account
uk: Розширення '{0}' хоче отримати доступ до облікового запису {1}

# sign in
source: Sign in requested
uk: Запит на вхід

# signInRequest
source: Sign in with {0} to use {1} (1)
uk: Увійдіть за допомогою {0}, щоб використовувати {1} (1)

# useOtherAccount
source: Sign in to another account
uk: Увійти в інший обліковий запис

# authentication.id
source: The id of the authentication provider.
uk: Ідентифікатор постачальника автентифікації.

# authentication.idConflict
source: This authentication id '{0}' has already been registered
uk: Цей ідентифікатор автентифікації '{0}' вже був зареєстрований

# authentication.label
source: The human readable name of the authentication provider.
uk: Людсько зрозуміле ім'я постачальника аутентифікації.

# authentication.missingId
source: An authentication contribution must specify an id.
uk: Внесок автентифікації повинен вказувати ідентифікатор.

# authentication.missingLabel
source: An authentication contribution must specify a label.
uk: Внесок аутентифікації повинен вказувати мітку.

# authenticationExtensionPoint
source: Contributes authentication
uk: Додає автентифікацію
