Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_userDataSync.xlf
Languages: uk

# accept failed
source: Error while accepting changes. Please check [logs]({0}) for more details.
uk: Помилка під час прийняття змін. Будь ласка, перевірте [логи]({0}) для отримання додаткової інформації.

# auth failed
source: Error while turning on Settings Sync: Authentication failed.
uk: Помилка під час увімкнення синхронізації налаштувань: автентифікація не вдалася.

# cancel turning on sync
source: Cancel
uk: Скасувати

# complete merges title
source: Complete Merge
uk: Завершити злиття

source: Configure...
uk: Налаштувати...

# configure and turn on sync detail
source: Please sign in to backup and sync your data across devices.
uk: Будь ласка, увійдіть, щоб створити резервну копію та синхронізувати свої дані між пристроями.

# configure sync
source: Configure...
uk: Налаштувати...

# configure sync placeholder
source: Choose what to sync
uk: Виберіть, що синхронізувати

# configure sync title
source: {0}: Configure...
uk: {0}: Налаштувати...

# conflicts detected
source: Unable to sync due to conflicts in {0}. Please resolve them to continue.
uk: Не вдається синхронізувати через конфлікти в {0}. Будь ласка, вирішіть їх, щоб продовжити.

source: Default
uk: За замовчуванням

# download sync activity complete
source: Successfully downloaded Settings Sync activity.
uk: Успішно завантажено активність синхронізації налаштувань.

# error reset required
source: Settings sync is disabled because your data in the cloud is older than that of the client. Please clear your data in the cloud before turning on sync.
uk: Синхронізація налаштувань вимкнена, оскільки ваші дані в хмарі старіші, ніж дані клієнта. Будь ласка, очистіть свої дані в хмарі перед увімкненням синхронізації.

# error reset required while starting sync
source: Settings sync cannot be turned on because your data in the cloud is older than that of the client. Please clear your data in the cloud before turning on sync.
uk: Синхронізацію налаштувань не можна ввімкнути, оскільки ваші дані в хмарі старіші, ніж дані клієнта. Будь ласка, очистіть свої дані в хмарі перед увімкненням синхронізації.

# error upgrade required
source: Settings sync is disabled because the current version ({0}, {1}) is not compatible with the sync service. Please update before turning on sync.
uk: Синхронізація налаштувань вимкнена, оскільки поточна версія ({0}, {1}) не сумісна з сервісом синхронізації. Будь ласка, оновіть перед увімкненням синхронізації.

# error upgrade required while starting sync
source: Settings sync cannot be turned on because the current version ({0}, {1}) is not compatible with the sync service. Please update before turning on sync.
uk: Синхронізацію налаштувань не можна увімкнути, оскільки поточна версія ({0}, {1}) не сумісна з сервісом синхронізації. Будь ласка, оновіть версію перед увімкненням синхронізації.

# errorInvalidConfiguration
source: Unable to sync {0} because the content in the file is not valid. Please open the file and correct it.
uk: Неможливо синхронізувати {0}, оскільки вміст файлу недійсний. Будь ласка, відкрийте файл і виправте його.

# global activity turn on sync
source: Backup and Sync Settings...
uk: Налаштування резервного копіювання та синхронізації...

# has conflicts
source: {0}: Conflicts Detected
uk: {0}: Виявлено конфлікти

source: Insiders
uk: Інсайдери

# method not found
source: Settings sync is disabled because the client is making invalid requests. Please report an issue with the logs.
uk: Синхронізація налаштувань вимкнена, оскільки клієнт робить недійсні запити. Будь ласка, повідомте про проблему з журналами.

# no authentication providers
source: No authentication providers are available.
uk: Немає доступних провайдерів аутентифікації.

# open file
source: Open {0} File
uk: Відкрити {0} файл

# operationId
source: Operation Id: {0}
uk: Ідентифікатор операції: {0}

source: Replace Local
uk: Замінити локальний

source: Replace Remote
uk: Замінити пульт

source: Report Issue
uk: Повідомити про проблему

# reset
source: Clear Data in Cloud...
uk: Очистити дані в хмарі...

# resolveConflicts_global
source: Show Conflicts ({0})
uk: Показати конфлікти ({0})

# service changed and turned off
source: Settings sync was turned off because {0} now uses a separate service. Please turn on sync again.
uk: Синхронізацію налаштувань було вимкнено, оскільки {0} тепер використовує окремий сервіс. Будь ласка, увімкніть синхронізацію знову.

# service switched to insiders
source: Settings Sync has been switched to insiders service
uk: Синхронізація налаштувань була переведена на сервіс для інсайдерів.

# service switched to stable
source: Settings Sync has been switched to stable service
uk: Синхронізація налаштувань була перемкнена на стабільний сервіс.

# session expired
source: Settings sync was turned off because current session is expired, please sign in again to turn on sync.
uk: Синхронізацію налаштувань було вимкнено, оскільки поточна сесія закінчилася, будь ласка, увійдіть знову, щоб увімкнути синхронізацію.

source: Show Conflicts
uk: Показати конфлікти

# show sync log title
source: {0}: Show Log
uk: {0}: Показати журнал

# show sync log toolrip
source: Show Log
uk: Показати журнал

# show sync logs
source: Show Log
uk: Показати журнал

source: Show Synced Data
uk: Показати синхронізовані дані

# show synced data action
source: Show Synced Data
uk: Показати синхронізовані дані

# sign in accounts
source: Sign in to Sync Settings (1)
uk: Увійти в налаштування синхронізації (1)

# sign in and turn on
source: Sign in
uk: Увійти

# sign in global
source: Sign in to Sync Settings
uk: Увійти для синхронізації налаштувань

# sign in to sync
source: Sign in to Sync Settings
uk: Увійти в налаштування синхронізації

source: Stable
uk: Стабільний

# stop sync
source: Turn Off
uk: Вимкнути

# switchSyncService.description
source: Ensure you are using the same settings sync service when syncing with multiple environments
uk: Переконайтеся, що ви використовуєте один і той же сервіс синхронізації налаштувань при синхронізації з кількома середовищами.

# switchSyncService.title
source: {0}: Select Service
uk: {0}: Виберіть послугу

# sync is on
source: Settings Sync is On
uk: Синхронізація налаштувань увімкнена

source: Sync Now
uk: Синхронізувати зараз

# sync settings
source: Show Settings
uk: Показати налаштування

# synced with time
source: synced {0}
uk: синхронізовано {0}

source: syncing
uk: синхронізація

# too large
source: Disabled syncing {0} because size of the {1} file to sync is larger than {2}. Please open the file and reduce the size and enable sync
uk: Вимкнено синхронізацію {0}, оскільки розмір файлу {1}, що підлягає синхронізації, перевищує {2}. Будь ласка, відкрийте файл, зменште його розмір і увімкніть синхронізацію.

# too large while starting sync
source: Settings sync cannot be turned on because size of the {0} file to sync is larger than {1}. Please open the file and reduce the size and turn on sync
uk: Синхронізацію налаштувань не можна увімкнути, оскільки розмір файлу {0}, що підлягає синхронізації, перевищує {1}. Будь ласка, відкрийте файл, зменшіть його розмір і увімкніть синхронізацію.

# too many profiles
source: Disabled syncing profiles because there are too many profiles to sync. Settings Sync supports syncing maximum 20 profiles. Please reduce the number of profiles and enable sync
uk: Вимкнено синхронізацію профілів, оскільки занадто багато профілів для синхронізації. Синхронізація налаштувань підтримує синхронізацію максимум 20 профілів. Будь ласка, зменшіть кількість профілів і увімкніть синхронізацію.

source: &&Turn off
uk: &&Вимкнути

# turn off failed
source: Error while turning off Settings Sync. Please check [logs]({0}) for more details.
uk: Помилка під час вимкнення синхронізації налаштувань. Будь ласка, перевірте [журнали]({0}) для отримання додаткової інформації.

# turn off sync confirmation
source: Do you want to turn off sync?
uk: Ви хочете вимкнути синхронізацію?

# turn off sync detail
source: Your settings, keybindings, extensions, snippets and UI State will no longer be synced.
uk: Ваші налаштування, прив'язки клавіш, розширення, фрагменти коду та стан інтерфейсу більше не будуть синхронізовані.

# turn off sync everywhere
source: Turn off sync on all your devices and clear the data from the cloud.
uk: Вимкніть синхронізацію на всіх ваших пристроях і очистіть дані з хмари.

# turn on failed
source: Error while turning on Settings Sync. {0}
uk: Помилка під час увімкнення синхронізації налаштувань. {0}

# turn on failed with user data sync error
source: Error while turning on Settings Sync. Please check [logs]({0}) for more details.
uk: Помилка під час увімкнення синхронізації налаштувань. Будь ласка, перевірте [журнали]({0}) для отримання додаткової інформації.

# turn on sync
source: Turn on Settings Sync...
uk: Увімкнути синхронізацію налаштувань...

# turned off
source: Settings sync was turned off from another device, please turn on sync again.
uk: Синхронізацію налаштувань було вимкнено з іншого пристрою, будь ласка, увімкніть синхронізацію знову.

# turning on sync
source: Turning on Settings Sync...
uk: Увімкнення синхронізації налаштувань...

# turning on syncing
source: Turning on Settings Sync...
uk: Увімкнення синхронізації налаштувань...

# using separate service
source: Settings sync now uses a separate service, more information is available in the [Settings Sync Documentation](https://aka.ms/vscode-settings-sync-help#_syncing-stable-versus-insiders).
uk: Синхронізація налаштувань тепер використовує окремий сервіс, більше інформації доступно в [Документації з синхронізації налаштувань](https://aka.ms/vscode-settings-sync-help#_syncing-stable-versus-insiders).

# workbench.actions.syncData.reset
source: Clear Data in Cloud...
uk: Очистити дані в хмарі...

# local too many requests - reload
source: Settings sync is suspended temporarily because the current device is making too many requests. Please reload {0} to resume.
uk: Синхронізація налаштувань тимчасово призупинена, оскільки поточний пристрій надсилає занадто багато запитів. Будь ласка, перезавантажте {0}, щоб відновити.

# local too many requests - restart
source: Settings sync is suspended temporarily because the current device is making too many requests. Please restart {0} to resume.
uk: Синхронізація налаштувань тимчасово призупинена, оскільки поточний пристрій надсилає занадто багато запитів. Будь ласка, перезапустіть {0}, щоб відновити.

source: Reload
uk: Перезавантажити

source: Restart
uk: Перезапустити

# server too many requests
source: Settings sync is disabled because the current device is making too many requests. Please wait for 10 minutes and turn on sync.
uk: Синхронізація налаштувань вимкнена, оскільки поточний пристрій надсилає занадто багато запитів. Будь ласка, почекайте 10 хвилин і увімкніть синхронізацію.

# settings sync
source: Settings Sync. Operation Id: {0}
uk: Синхронізація налаштувань. Ідентифікатор операції: {0}

source: Theirs
uk: Їхній

source: Yours
uk: Ваші

# explanation
source: Please go through each entry and merge to resolve conflicts.
uk: Будь ласка, перегляньте кожен запис і об'єднайте їх, щоб вирішити конфлікти.

# localResourceName
source: {0} (Local)
uk: {0} (Локальний)

# remoteResourceName
source: {0} (Remote)
uk: {0} (Віддалений)

# workbench.actions.sync.acceptLocal
source: Accept Local
uk: Прийняти локальний

# workbench.actions.sync.acceptRemote
source: Accept Remote
uk: Прийняти віддалене

# workbench.actions.sync.openConflicts
source: Show Conflicts
uk: Показати конфлікти

# confirm replace
source: Would you like to replace your current {0} with selected?
uk: Ви хочете замінити ваші поточні {0} на вибрані?

source: Conflicts
uk: Конфлікти

source: Current
uk: Представляє поточну машину

# downloaded sync activity title
source: Sync Activity (Developer)
uk: Синхронізація активності (Розробник)

# last sync states
source: Last Synced Remotes
uk: Останні синхронізовані віддалені репозиторії

# leftResourceName
source: {0} (Remote)
uk: {0} (Віддалений)

# local sync activity title
source: Sync Activity (Local)
uk: Синхронізація активності (локальна)

source: No Machines
uk: Немає машин

# not found
source: machine not found with id: {0}
uk: машину не знайдено з ідентифікатором: {0}

# placeholder
source: Enter the name of the machine
uk: Введіть назву машини

# remote sync activity title
source: Sync Activity (Remote)
uk: Синхронізація активності (віддалена)

# reset
source: Reset Synced Data
uk: Очистити дані в хмарі...

# rightResourceName
source: {0} (Local)
uk: {0} (Локальний)

# select sync activity file
source: Select Sync Activity File or Folder
uk: Виберіть файл або папку синхронізації

# sync logs
source: Logs
uk: Журнали

source: Synced Machines
uk: Синхронізовані машини

source: Troubleshoot
uk: Виправлення несправностей

# turn off sync on machine
source: Are you sure you want to turn off sync on {0}?
uk: Ви впевнені, що хочете вимкнути синхронізацію на {0}?

# turn off sync on multiple machines
source: Are you sure you want to turn off sync on selected machines?
uk: Ви впевнені, що хочете вимкнути синхронізацію на вибраних машинах?

# valid message
source: Machine name should be unique and not empty
uk: Ім'я машини повинно бути унікальним і не порожнім.

# workbench.actions.sync.compareWithLocal
source: Compare with Local
uk: Порівняти з локальним

# workbench.actions.sync.editMachineName
source: Edit Name
uk: Редагувати ім'я

# workbench.actions.sync.loadActivity
source: Load Sync Activity
uk: Завантажити синхронізацію активності

# workbench.actions.sync.replaceCurrent
source: Restore
uk: Відновити

# workbench.actions.sync.resolveResourceRef
source: Show raw JSON sync data
uk: Показати сирі дані синхронізації JSON

# workbench.actions.sync.turnOffSyncOnMachine
source: Turn off Settings Sync
uk: Вимкнути синхронізацію налаштувань

# Open Backup folder
source: Open Local Backups Folder
uk: Відкрити папку локальних резервних копій

# no backups
source: Local backups folder does not exist
uk: Тека локальних резервних копій не існує

# open
source: Open Folder
uk: Відкрити папку
