Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# notificationCenterHeaderForeground
source: Notifications center header foreground color. Notifications slide in from the bottom right of the window.
uk: Колір переднього плану заголовка центру сповіщень. Сповіщення з'являються з нижнього правого кута вікна.

# notificationToastBorder
source: Notification toast border color. Notifications slide in from the bottom right of the window.
uk: Колір рамки сповіщення. Сповіщення з'являються з нижнього правого кута вікна.

# notificationsBackground
source: Notifications background color. Notifications slide in from the bottom right of the window.
uk: Колір фону сповіщень. Сповіщення з'являються з правого нижнього кута вікна.

# notificationsBorder
source: Notifications border color separating from other notifications in the notifications center. Notifications slide in from the bottom right of the window.
uk: Колір рамки сповіщень, що відокремлює їх від інших сповіщень у центрі сповіщень. Сповіщення з'являються з правого нижнього кута вікна.

# notificationsErrorIconForeground
source: The color used for the icon of error notifications. Notifications slide in from the bottom right of the window.
uk: Колір, що використовується для іконки сповіщень про помилки. Сповіщення з'являються з правого нижнього кута вікна.

# notificationsForeground
source: Notifications foreground color. Notifications slide in from the bottom right of the window.
uk: Колір тексту сповіщень. Сповіщення з'являються знизу праворуч вікна.

# notificationsInfoIconForeground
source: The color used for the icon of info notifications. Notifications slide in from the bottom right of the window.
uk: Колір, що використовується для іконки сповіщень про інформацію. Сповіщення з'являються з нижнього правого кута вікна.

# notificationsLink
source: Notification links foreground color. Notifications slide in from the bottom right of the window.
uk: Колір переднього плану посилань сповіщень. Сповіщення з'являються з нижнього правого кута вікна.

# notificationsWarningIconForeground
source: The color used for the icon of warning notifications. Notifications slide in from the bottom right of the window.
uk: Колір, що використовується для іконки сповіщень про попередження. Сповіщення з'являються з правого нижнього кута вікна.

# outputViewBackground
source: Output view background color.
uk: Колір фону виводу.

# outputViewStickyScrollBackground
source: Output view sticky scroll background color.
uk: Вивід перегляду кольору фону липкого скролу.

# panelActiveTitleBorder
source: Border color for the active panel title. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір рамки для активного заголовка панелі. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал.

# panelActiveTitleForeground
source: Title color for the active panel. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір заголовка для активної панелі. Панелі відображаються під областю редактора і містять такі вьюхи, як вихідні дані та інтегрований термінал.

# panelBackground
source: Panel background color. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір фону панелі. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал.

# panelBorder
source: Panel border color to separate the panel from the editor. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір рамки панелі для відокремлення панелі від редактора. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал.

# panelDragAndDropBorder
source: Drag and drop feedback color for the panel titles. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Перетягніть і відпустіть колір зворотного зв'язку для заголовків панелей. Панелі відображаються нижче області редактора і містять перегляди, такі як вихідні дані та інтегрований термінал.

# panelInactiveTitleForeground
source: Title color for the inactive panel. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір заголовка для неактивної панелі. Панелі відображаються під областю редактора і містять такі елементи, як вихідні дані та інтегрований термінал.

# panelInputBorder
source: Input box border for inputs in the panel.
uk: Кордон поля введення для введень у панелі.

# panelSectionBorder
source: Panel section border color used when multiple views are stacked horizontally in the panel. Panels are shown below the editor area and contain views like output and integrated terminal. Panel sections are views nested within the panels.
uk: Колір межі секції панелі, що використовується, коли кілька подань розташовані горизонтально в панелі. Панелі відображаються нижче області редактора та містять подання, такі як вихідні дані та інтегрований термінал. Секції панелі - це подання, вкладені в панелі.

# panelSectionDragAndDropBackground
source: Drag and drop feedback color for the panel sections. The color should have transparency so that the panel sections can still shine through. Panels are shown below the editor area and contain views like output and integrated terminal. Panel sections are views nested within the panels.
uk: Перетягніть і скиньте колір зворотного зв'язку для секцій панелі. Колір має бути прозорим, щоб секції панелі все ще могли просвічуватися. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал. Секції панелі - це елементи, вкладені в панелі.

# panelSectionHeaderBackground
source: Panel section header background color. Panels are shown below the editor area and contain views like output and integrated terminal. Panel sections are views nested within the panels.
uk: Колір фону заголовка секції панелі. Панелі відображаються нижче області редактора і містять такі види, як вихідні дані та інтегрований термінал. Секції панелей - це види, вкладені в панелі.

# panelSectionHeaderBorder
source: Panel section header border color used when multiple views are stacked vertically in the panel. Panels are shown below the editor area and contain views like output and integrated terminal. Panel sections are views nested within the panels.
uk: Колір межі заголовка секції панелі, що використовується, коли кілька подань розташовані вертикально в панелі. Панелі відображаються нижче області редактора і містять подання, такі як вихідні дані та інтегрований термінал. Секції панелі - це подання, вкладені в панелі.

# panelSectionHeaderForeground
source: Panel section header foreground color. Panels are shown below the editor area and contain views like output and integrated terminal. Panel sections are views nested within the panels.
uk: Колір переднього плану заголовка секції панелі. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал. Секції панелей - це елементи, вкладені в панелі.

# panelStickyScrollBackground
source: Background color of sticky scroll in the panel.
uk: Колір фону липкого прокручування в панелі.

# panelStickyScrollBorder
source: Border color of sticky scroll in the panel.
uk: Колір рамки липкого скролу в панелі.

# panelStickyScrollShadow
source: Shadow color of sticky scroll in the panel.
uk: Колір тіні липкого скролу в панелі.

# panelTitleBadgeBackground
source: Panel title badge background color. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір фону значка заголовка панелі. Панелі відображаються нижче області редактора і містять такі елементи, як вихідні дані та інтегрований термінал.

# panelTitleBadgeForeground
source: Panel title badge foreground color. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір переднього плану значка заголовка панелі. Панелі відображаються під областю редактора і містять такі елементи, як вивід та інтегрований термінал.

# panelTitleBorder
source: Panel title border color on the bottom, separating the title from the views. Panels are shown below the editor area and contain views like output and integrated terminal.
uk: Колір рамки заголовка панелі внизу, що відокремлює заголовок від переглядів. Панелі відображаються нижче області редактора і містять перегляди, такі як вихідні дані та інтегрований термінал.

# profileBadgeBackground
source: Profile badge background color. The profile badge shows on top of the settings gear icon in the activity bar.
uk: Колір фону значка профілю. Значок профілю відображається поверх іконки налаштувань у панелі активності.

# profileBadgeForeground
source: Profile badge foreground color. The profile badge shows on top of the settings gear icon in the activity bar.
uk: Колір переднього плану значка профілю. Значок профілю відображається поверх значка налаштувань у панелі активності.

# sideBarActivityBarTopBorder
source: Border color between the activity bar at the top/bottom and the views.
uk: Колір межі між панеллю активності вгорі/внизу та виглядами.

# sideBarBackground
source: Side bar background color. The side bar is the container for views like explorer and search.
uk: Колір фону бічної панелі. Бічна панель є контейнером для таких переглядів, як провідник та пошук.

# sideBarBorder
source: Side bar border color on the side separating to the editor. The side bar is the container for views like explorer and search.
uk: Колір межі бокової панелі з боку, що відокремлює її від редактора. Бокова панель є контейнером для таких переглядів, як провідник і пошук.

# sideBarDragAndDropBackground
source: Drag and drop feedback color for the side bar sections. The color should have transparency so that the side bar sections can still shine through. The side bar is the container for views like explorer and search. Side bar sections are views nested within the side bar.
uk: Перетягніть і відпустіть колір зворотного зв'язку для секцій бічної панелі. Колір повинен мати прозорість, щоб секції бічної панелі все ще були видимими. Бічна панель є контейнером для таких переглядів, як провідник і пошук. Секції бічної панелі - це перегляди, вкладені в бічну панель.

# sideBarForeground
source: Side bar foreground color. The side bar is the container for views like explorer and search.
uk: Колір переднього плану бічної панелі. Бічна панель є контейнером для таких виглядів, як провідник і пошук.

# sideBarSectionHeaderBackground
source: Side bar section header background color. The side bar is the container for views like explorer and search. Side bar sections are views nested within the side bar.
uk: Колір фону заголовка секції бокової панелі. Бокова панель є контейнером для таких переглядів, як провідник та пошук. Секції бокової панелі - це перегляди, вкладені в бокову панель.

# sideBarSectionHeaderBorder
source: Side bar section header border color. The side bar is the container for views like explorer and search. Side bar sections are views nested within the side bar.
uk: Колір межі заголовка секції бічної панелі. Бічна панель є контейнером для таких виглядів, як провідник і пошук. Секції бічної панелі - це вигляди, вкладені в бічну панель.

# sideBarSectionHeaderForeground
source: Side bar section header foreground color. The side bar is the container for views like explorer and search. Side bar sections are views nested within the side bar.
uk: Колір переднього плану заголовка секції бокової панелі. Бокова панель є контейнером для таких елементів, як провідник і пошук. Секції бокової панелі - це елементи, вкладені в бокову панель.

# sideBarStickyScrollBackground
source: Background color of sticky scroll in the side bar.
uk: Колір фону липкого скролу в бічній панелі.

# sideBarStickyScrollBorder
source: Border color of sticky scroll in the side bar.
uk: Колір рамки закріпленого прокручування в бічній панелі.

# sideBarStickyScrollShadow
source: Shadow color of sticky scroll in the side bar.
uk: Колір тіні закріпленого прокручування в бічній панелі.

# sideBarTitleBackground
source: Side bar title background color. The side bar is the container for views like explorer and search.
uk: Колір фону заголовка бічної панелі. Бічна панель є контейнером для переглядів, таких як провідник і пошук.

# sideBarTitleBorder
source: Side bar title border color on the bottom, separating the title from the views. The side bar is the container for views like explorer and search.
uk: Колір межі заголовка бічної панелі внизу, що відокремлює заголовок від переглядів. Бічна панель є контейнером для переглядів, таких як провідник та пошук.

# sideBarTitleForeground
source: Side bar title foreground color. The side bar is the container for views like explorer and search.
uk: Колір переднього плану заголовка бокової панелі. Бокова панель є контейнером для таких переглядів, як провідник і пошук.

# sideBySideEditor.horizontalBorder
source: Color to separate two editors from each other when shown side by side in an editor group from top to bottom.
uk: Колір для розділення двох редакторів один від одного, коли вони показані поруч у групі редакторів зверху вниз.

# sideBySideEditor.verticalBorder
source: Color to separate two editors from each other when shown side by side in an editor group from left to right.
uk: Колір для розділення двох редакторів один від одного, коли вони показані поруч у групі редакторів зліва направо.

# statusBarBackground
source: Status bar background color when a workspace or folder is opened. The status bar is shown in the bottom of the window.
uk: Колір фону панелі стану, коли відкрито робоче середовище або папку. Панель стану відображається внизу вікна.

# statusBarBorder
source: Status bar border color separating to the sidebar and editor. The status bar is shown in the bottom of the window.
uk: Колір рамки рядка стану, що відділяє бокову панель від редактора. Рядок стану відображається внизу вікна.

# statusBarErrorItemBackground
source: Status bar error items background color. Error items stand out from other status bar entries to indicate error conditions. The status bar is shown in the bottom of the window.
uk: Колір фону елементів помилки в рядку стану. Елементи помилки виділяються серед інших записів рядка стану, щоб вказати на умови помилки. Рядок стану відображається внизу вікна.

# statusBarErrorItemForeground
source: Status bar error items foreground color. Error items stand out from other status bar entries to indicate error conditions. The status bar is shown in the bottom of the window.
uk: Колір переднього плану елементів помилки на панелі стану. Елементи помилки виділяються серед інших записів панелі стану, щоб вказати на умови помилки. Панель стану відображається внизу вікна.

# statusBarErrorItemHoverBackground
source: Status bar error items background color when hovering. Error items stand out from other status bar entries to indicate error conditions. The status bar is shown in the bottom of the window.
uk: Колір фону елементів помилки в рядку стану при наведенні. Елементи помилки виділяються серед інших записів рядка стану, щоб вказати на умови помилки. Рядок стану відображається внизу вікна.

# statusBarErrorItemHoverForeground
source: Status bar error items foreground color when hovering. Error items stand out from other status bar entries to indicate error conditions. The status bar is shown in the bottom of the window.
uk: Колір переднього плану елементів помилки на панелі стану при наведенні. Елементи помилки виділяються серед інших записів панелі стану, щоб вказати на умови помилки. Панель стану відображається внизу вікна.

# statusBarFocusBorder
source: Status bar border color when focused on keyboard navigation. The status bar is shown in the bottom of the window.
uk: Колір межі панелі стану, коли вона активна для навігації з клавіатури. Панель стану відображається внизу вікна.

# statusBarForeground
source: Status bar foreground color when a workspace or folder is opened. The status bar is shown in the bottom of the window.
uk: Колір переднього плану панелі стану, коли відкрито робоче середовище або папку. Панель стану відображається внизу вікна.

# statusBarItemActiveBackground
source: Status bar item background color when clicking. The status bar is shown in the bottom of the window.
uk: Колір фону елемента панелі стану при натисканні. Панель стану відображається внизу вікна.

# statusBarItemCompactHoverBackground
source: Status bar item background color when hovering an item that contains two hovers. The status bar is shown in the bottom of the window.
uk: Колір фону елемента панелі стану при наведенні на елемент, який містить два наведення. Панель стану відображається внизу вікна.

# statusBarItemFocusBorder
source: Status bar item border color when focused on keyboard navigation. The status bar is shown in the bottom of the window.
uk: Колір межі елемента панелі стану, коли фокус на клавіатурній навігації. Панель стану відображається внизу вікна.

# statusBarItemHoverBackground
source: Status bar item background color when hovering. The status bar is shown in the bottom of the window.
uk: Колір фону елемента статусного рядка при наведенні. Статусний рядок відображається внизу вікна.

# statusBarItemHoverForeground
source: Status bar item foreground color when hovering. The status bar is shown in the bottom of the window.
uk: Колір переднього плану елемента панелі стану під час наведення. Панель стану відображається внизу вікна.

# statusBarItemOfflineBackground
source: Status bar item background color when the workbench is offline.
uk: Колір фону елемента панелі стану, коли робоча область офлайн.

# statusBarItemOfflineForeground
source: Status bar item foreground color when the workbench is offline.
uk: Колір переднього плану елемента рядка стану, коли робоча область офлайн.

# statusBarItemRemoteBackground
source: Background color for the remote indicator on the status bar.
uk: Колір фону для індикатора віддаленого доступу на панелі стану.

# statusBarItemRemoteForeground
source: Foreground color for the remote indicator on the status bar.
uk: Колір переднього плану для індикатора віддаленого доступу на панелі стану.

# statusBarNoFolderBackground
source: Status bar background color when no folder is opened. The status bar is shown in the bottom of the window.
uk: Колір фону панелі стану, коли жодна папка не відкрита. Панель стану відображається внизу вікна.

# statusBarNoFolderBorder
source: Status bar border color separating to the sidebar and editor when no folder is opened. The status bar is shown in the bottom of the window.
uk: Колір рамки статусного рядка, що відокремлює бокову панель і редактор, коли жодна папка не відкрита. Статусний рядок відображається внизу вікна.

# statusBarNoFolderForeground
source: Status bar foreground color when no folder is opened. The status bar is shown in the bottom of the window.
uk: Колір переднього плану панелі стану, коли жодна папка не відкрита. Панель стану відображається внизу вікна.

# statusBarOfflineItemHoverBackground
source: Status bar item background hover color when the workbench is offline.
uk: Колір фону елемента панелі стану при наведенні, коли робоча область офлайн.

# statusBarOfflineItemHoverForeground
source: Status bar item foreground hover color when the workbench is offline.
uk: Колір переднього плану елемента панелі стану при наведенні, коли робоча область офлайн.

# statusBarProminentItemBackground
source: Status bar prominent items background color. Prominent items stand out from other status bar entries to indicate importance. The status bar is shown in the bottom of the window.
uk: Колір фону помітних елементів панелі стану. Помітні елементи виділяються серед інших записів панелі стану, щоб вказати на їхню важливість. Панель стану відображається внизу вікна.

# statusBarProminentItemForeground
source: Status bar prominent items foreground color. Prominent items stand out from other status bar entries to indicate importance. The status bar is shown in the bottom of the window.
uk: Колір переднього плану видимих елементів рядка стану. Видимі елементи вирізняються з інших записів рядка стану, щоб вказати на їх важливість. Рядок стану відображається внизу вікна.

# statusBarProminentItemHoverBackground
source: Status bar prominent items background color when hovering. Prominent items stand out from other status bar entries to indicate importance. The status bar is shown in the bottom of the window.
uk: Колір фону видимих елементів панелі стану при наведенні. Видимі елементи вирізняються серед інших записів панелі стану, щоб вказати на їх важливість. Панель стану відображається внизу вікна.

# statusBarProminentItemHoverForeground
source: Status bar prominent items foreground color when hovering. Prominent items stand out from other status bar entries to indicate importance. The status bar is shown in the bottom of the window.
uk: Колір переднього плану помітних елементів рядка стану при наведенні. Помітні елементи виділяються серед інших записів рядка стану, щоб вказати на їх важливість. Рядок стану відображається внизу вікна.

# statusBarRemoteItemHoverBackground
source: Background color for the remote indicator on the status bar when hovering.
uk: Колір фону для індикатора віддаленого доступу на панелі стану при наведенні.

# statusBarRemoteItemHoverForeground
source: Foreground color for the remote indicator on the status bar when hovering.
uk: Колір переднього плану для індикатора віддаленого доступу на панелі стану при наведенні.

# statusBarWarningItemBackground
source: Status bar warning items background color. Warning items stand out from other status bar entries to indicate warning conditions. The status bar is shown in the bottom of the window.
uk: Колір фону елементів попередження на панелі стану. Елементи попередження виділяються серед інших записів панелі стану, щоб вказати на умови попередження. Панель стану відображається внизу вікна.

# statusBarWarningItemForeground
source: Status bar warning items foreground color. Warning items stand out from other status bar entries to indicate warning conditions. The status bar is shown in the bottom of the window.
uk: Колір переднього плану елементів попередження на панелі стану. Елементи попередження виділяються серед інших записів панелі стану, щоб вказати на умови попередження. Панель стану відображається внизу вікна.

# statusBarWarningItemHoverBackground
source: Status bar warning items background color when hovering. Warning items stand out from other status bar entries to indicate warning conditions. The status bar is shown in the bottom of the window.
uk: Колір фону елементів попередження на панелі стану при наведенні. Елементи попередження виділяються серед інших записів панелі стану, щоб вказати на умови попередження. Панель стану відображається внизу вікна.

# statusBarWarningItemHoverForeground
source: Status bar warning items foreground color when hovering. Warning items stand out from other status bar entries to indicate warning conditions. The status bar is shown in the bottom of the window.
uk: Колір переднього плану елементів попередження на панелі стану при наведенні. Елементи попередження виділяються серед інших записів панелі стану, щоб вказати на умови попередження. Панель стану відображається внизу вікна.

# tabActiveBackground
source: Active tab background color in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Фоновий колір активної вкладки в активній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.
