Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_authentication.xlf
Languages: uk

source: Accounts
uk: Облікові записи

source: Current account
uk: Поточний рахунок

# manageAccountPreferenceForExtension
source: Manage Extension Account Preferences
uk: Керувати налаштуваннями облікового запису розширення

# noAccountUsage
source: This extension has not used any accounts yet.
uk: Ця розширення ще не використовувало жодних облікових записів.

# noAccounts
source: No accounts are currently used by this extension.
uk: Жодні облікові записи наразі не використовуються цим розширенням.

# pickAProviderTitle
source: Manage Extension Account Preferences
uk: Керувати налаштуваннями облікового запису розширення

# placeholder v2
source: Manage '{0}' account preferences for {1}...
uk: Керуйте налаштуваннями облікового запису '{0}' для {1}...

# selectExtension
source: Select an extension to manage account preferences for
uk: Виберіть розширення для керування налаштуваннями облікового запису для

# selectProvider
source: Select an authentication provider to manage account preferences for
uk: Виберіть постачальника аутентифікації для управління налаштуваннями облікового запису для

# title
source: '{0}' Account Preferences For This Workspace
uk: '{0}' Налаштування облікового запису для цього робочого простору

# use new account
source: Use a new account...
uk: Використовуйте новий акаунт...

# manageAccountPreferenceForMcpServer
source: Manage MCP Server Account Preferences
uk: Керувати налаштуваннями облікового запису сервера MCP

# noAccountUsage
source: This MCP server has not used any accounts yet.
uk: Ця розширення ще не використовувало жодних облікових записів.

# noAccounts
source: No accounts are currently used by this MCP server.
uk: Жодні облікові записи наразі не використовуються цим розширенням.

# pickAProviderTitle
source: Manage MCP Server Account Preferences
uk: Керувати налаштуваннями облікового запису розширення

# authenticationCategory
source: Authentication
uk: Аутентифікація

# clientId
source: Client ID: {0}
uk: Ідентифікатор клієнта: {0}

# confirmDeleteDetail
source: This will remove all stored authentication data for the selected provider(s). You will need to re-authenticate if you use these providers again.
uk: Це видалить всі збережені дані автентифікації для вибраних постачальників. Вам потрібно буде повторно автентифікуватися, якщо ви знову використовуватимете цих постачальників.

# confirmDeleteMultipleProviders
source: Are you sure you want to remove {0} dynamic authentication providers: {1}?
uk: Ви впевнені, що хочете видалити {0} динамічних постачальників автентифікації: {1}?

# confirmDeleteSingleProvider
source: Are you sure you want to remove the dynamic authentication provider "{0}"?
uk: Ви впевнені, що хочете видалити динамічного постачальника аутентифікації "{0}"?

# noDynamicProviders
source: No dynamic authentication providers
uk: Немає динамічних постачальників аутентифікації

# noDynamicProvidersDetail
source: No dynamic authentication providers have been used yet.
uk: Ще не було використано жодного динамічного постачальника аутентифікації.

source: Remove
uk: Видалити

# removeDynamicAuthProviders
source: Remove Dynamic Authentication Providers
uk: Видалити динамічні постачальники аутентифікації

# selectProviderToRemove
source: Select a dynamic authentication provider to remove
uk: Виберіть динамічного постачальника аутентифікації для видалення

# accountLastUsedDate
source: Last used this account {0}
uk: Останній раз використовував цей акаунт {0}

# accountPreferences
source: Manage account preferences for this extension
uk: Управляйте налаштуваннями облікового запису для цього розширення

# manageExtensions
source: Choose which extensions can access this account
uk: Виберіть, які розширення можуть отримати доступ до цього облікового запису

source: Manage Trusted Extensions
uk: Керувати надійними розширеннями

# manageTrustedExtensions.cancel
source: Cancel
uk: Скасувати

source: Manage Trusted Extensions For Account
uk: Керувати довіреними розширеннями для облікового запису

# noTrustedExtensions
source: This account has not been used by any extensions.
uk: Цей обліковий запис не використовувався жодними розширеннями.

# notUsed
source: Has not used this account
uk: Не використовував цей акаунт

# pickAccount
source: Pick an account to manage trusted extensions for
uk: Виберіть обліковий запис для керування довіреними розширеннями

# trustedExtensionTooltip
source: This extension is trusted by Microsoft and always has access to this account
uk: Ця розширення довірене Microsoft і завжди має доступ до цього облікового запису

# trustedExtensions
source: Trusted by Microsoft
uk: Довіряє Microsoft

source: View extension details
uk: Переглянути деталі розширення

# accountPreferences
source: Manage account preferences for this MCP server
uk: Управляйте налаштуваннями облікового запису для цього розширення

# manageMcpServers
source: Choose which MCP servers can access this account
uk: Виберіть, які сервери MCP можуть отримати доступ до цього облікового запису.

source: Manage Trusted MCP Servers
uk: Керувати надійними серверами MCP

# manageTrustedMcpServers.cancel
source: Cancel
uk: Скасувати

source: Manage Trusted MCP Servers For Account
uk: Керувати надійними MCP-серверами для облікового запису

# noTrustedMcpServers
source: This account has not been used by any MCP servers.
uk: Цей обліковий запис не використовувався жодним сервером MCP.

# pickAccount
source: Pick an account to manage trusted MCP servers for
uk: Виберіть обліковий запис для керування довіреними розширеннями

# trustedMcpServerTooltip
source: This MCP server is trusted by Microsoft and always has access to this account
uk: Цей сервер MCP довірений Microsoft і завжди має доступ до цього облікового запису.

# trustedMcpServers
source: Trusted by Microsoft
uk: Довіряє Microsoft

source: &&Sign Out
uk: &&Вийти

# signOutMessage
source: The account '{0}' has been used by: {1} Sign out from these extensions?
uk: Обліковий запис '{0}' був використаний: {1} Вийти з цих розширень?

# signOutMessageSimple
source: Sign out of '{0}'?
uk: Вийти з '{0}'?

source: Sign out of account
uk: Вийти з облікового запису

source: Authentication
uk: Аутентифікація

# authenticationMcpAuthorizationServers
source: MCP Authorization Servers
uk: Сервери авторизації MCP

# authenticationlabel
source: Label
uk: Мітка
