Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_snippets.xlf
Languages: uk

source: Snippets
uk: Фрагменти

# bad_name1
source: Invalid file name
uk: Недійсне ім'я файлу

# bad_name2
source: '{0}' is not a valid file name
uk: '{0}' не є дійсним ім'ям файлу

# bad_name3
source: '{0}' already exists
uk: '{0}' вже існує

# global.scope
source: (global)
uk: (глобальний)

# group.global
source: Existing Snippets
uk: Існуючі фрагменти

# miOpenSnippets
source: &&Snippets
uk: &&Фрагменти

# name
source: Type snippet file name
uk: Введіть ім'я файлу фрагмента

# new.folder
source: New Snippets file for '{0}'...
uk: Новий файл фрагментів для '{0}'...

# new.global
source: New Global Snippets file...
uk: Новий файл глобальних фрагментів...

# new.global.sep
source: New Snippets
uk: Нові фрагменти

# new.global_scope
source: global
uk: глобальний

# new.workspace_scope
source: {0} workspace
uk: {0} робоча область

# openSnippet.label
source: Configure Snippets
uk: Налаштувати фрагменти

# openSnippet.pickLanguage
source: Select Snippets File or Create Snippets
uk: Виберіть файл фрагментів або створіть фрагменти

# userSnippets
source: Snippets
uk: Фрагменти

# label
source: Fill File with Snippet
uk: Заповнити файл фрагментом

# placeholder
source: Select a snippet
uk: Виберіть фрагмент

# snippet.suggestions.label
source: Insert Snippet
uk: Вставити фрагмент

# label
source: Surround with Snippet...
uk: Заповнити файл фрагментом

source: More...
uk: Більше...

# overflow.start.title
source: Start with Snippet
uk: Почати з фрагмента

# title
source: Start with: {0}
uk: Почніть з: {0}

# disableSnippet
source: Hide from IntelliSense
uk: Сховати від IntelliSense

# enable.snippet
source: Show in IntelliSense
uk: Показати в IntelliSense

# isDisabled
source: (hidden from IntelliSense)
uk: (сховано від IntelliSense)

# pick.noSnippetAvailable
source: No snippet available
uk: Немає доступного фрагмента

# pick.placeholder
source: Select a snippet
uk: Виберіть фрагмент

# sep.userSnippet
source: User Snippets
uk: Фрагменти користувача

# sep.workspaceSnippet
source: Workspace Snippets
uk: Фрагменти робочого простору

# editor.snippets.codeActions.enabled
source: Controls if surround-with-snippets or file template snippets show as Code Actions.
uk: Контролює, чи показують фрагменти оточення або фрагменти шаблонів файлів як дії коду.

# snippetSchema.json
source: User snippet configuration
uk: Конфігурація фрагмента користувача

# snippetSchema.json.body
source: The snippet content. Use `$1`, `${1:defaultText}` to define cursor positions, use `$0` for the final cursor position. Insert variable values with `${varName}` and `${varName:defaultText}`, e.g. `This is file: $TM_FILENAME`.
uk: Вміст фрагмента. Використовуйте `$1`, `${1:defaultText}` для визначення позицій курсора, використовуйте `$0` для фінальної позиції курсора. Вставте значення змінних за допомогою `${varName}` та `${varName:defaultText}`, наприклад, `Це файл: $TM_FILENAME`.

# snippetSchema.json.default
source: Empty snippet
uk: Порожній фрагмент

# snippetSchema.json.description
source: The snippet description.
uk: Опис фрагмента.

# snippetSchema.json.isFileTemplate
source: The snippet is meant to populate or replace a whole file
uk: Цей фрагмент призначений для заповнення або заміни цілого файлу

# snippetSchema.json.prefix
source: The prefix to use when selecting the snippet in intellisense
uk: Префікс, який слід використовувати при виборі фрагмента в інтелісенсі

# snippetSchema.json.scope
source: A list of language names to which this snippet applies, e.g. 'typescript,javascript'.
uk: Список назв мов, до яких застосовується цей фрагмент, наприклад 'typescript,javascript'.

# source.userSnippet
source: User Snippet
uk: Фрагмент користувача

# source.userSnippetGlobal
source: Global User Snippet
uk: Глобальний фрагмент користувача

# source.workspaceSnippetGlobal
source: Workspace Snippet
uk: Фрагмент робочого простору

# badFile
source: The snippet file "{0}" could not be read.
uk: Файл фрагмента "{0}" не вдалося прочитати.

# badVariableUse
source: One or more snippets from the extension '{0}' very likely confuse snippet-variables and snippet-placeholders (see https://code.visualstudio.com/docs/editor/userdefinedsnippets#_snippet-syntax for more details)
uk: Один або кілька фрагментів з розширення '{0}' дуже ймовірно плутають змінні-фрагменти та плейсхолдери-фрагменти (див. https://code.visualstudio.com/docs/editor/userdefinedsnippets#_snippet-syntax для отримання додаткової інформації)

# invalid.language
source: Unknown language in `contributes.{0}.language`. Provided value: {1}
uk: Невідома мова в `contributes.{0}.language`. Надане значення: {1}

# invalid.language.0
source: When omitting the language, the value of `contributes.{0}.path` must be a `.code-snippets`-file. Provided value: {1}
uk: При пропуску мови, значення `contributes.{0}.path` повинно бути файлом з розширенням `.code-snippets`. Надане значення: {1}

# invalid.path.0
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікуваний рядок у `contributes.{0}.path`. Надане значення: {1}

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікувалося, що `contributes.{0}.path` ({1}) буде включено до папки розширення ({2}). Це може зробити розширення непортативним.

# vscode.extension.contributes.snippets
source: Contributes snippets.
uk: Вносить фрагменти.

# vscode.extension.contributes.snippets-language
source: Language identifier for which this snippet is contributed to.
uk: Ідентифікатор мови, для якої цей фрагмент був наданий.

# vscode.extension.contributes.snippets-path
source: Path of the snippets file. The path is relative to the extension folder and typically starts with './snippets/'.
uk: Шлях до файлу фрагментів. Шлях є відносним до папки розширення і зазвичай починається з './snippets/'.
