Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_callHierarchy.xlf
Languages: uk

# callHierarchyDirection
source: Whether call hierarchy shows incoming or outgoing calls
uk: Чи показує ієрархія дзвінків вхідні чи вихідні дзвінки

# callHierarchyVisible
source: Whether call hierarchy peek is currently showing
uk: Чи наразі показується попередній перегляд ієрархії викликів

source: Close
uk: Закрити

# editorHasCallHierarchyProvider
source: Whether a call hierarchy provider is available
uk: Чи доступний провайдер ієрархії викликів

# error
source: Failed to show call hierarchy
uk: Не вдалося відобразити ієрархію викликів

# no.item
source: No results
uk: Немає результатів

# showIncomingCallsIcons
source: Icon for incoming calls in the call hierarchy view.
uk: Іконка для вхідних дзвінків у вигляді ієрархії дзвінків.

# showOutgoingCallsIcon
source: Icon for outgoing calls in the call hierarchy view.
uk: Іконка для вихідних дзвінків у вигляді ієрархії дзвінків.

# title
source: Peek Call Hierarchy
uk: Перегляд ієрархії викликів

# title.incoming
source: Show Incoming Calls
uk: Показати вхідні дзвінки

# title.outgoing
source: Show Outgoing Calls
uk: Показати вихідні дзвінки

# title.refocus
source: Refocus Call Hierarchy
uk: Переналаштувати ієрархію дзвінків

# callFrom
source: Calls from '{0}'
uk: Дзвінки з '{0}'

# callsTo
source: Callers of '{0}'
uk: Абоненти '{0}'

# empt.callsFrom
source: No calls from '{0}'
uk: Немає дзвінків від '{0}'

# empt.callsTo
source: No callers of '{0}'
uk: Немає викликів '{0}'

# title.loading
source: Loading...
uk: Завантаження...

# from
source: calls from {0}
uk: дзвінки з {0}

# to
source: callers of {0}
uk: абоненти {0}

# tree.aria
source: Call Hierarchy
uk: Ієрархія викликів
