Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_mergeEditor.xlf
Languages: uk

# layout.column
source: Column Layout
uk: Стовпчикове розташування

# layout.mixed
source: Mixed Layout
uk: Змішане розташування

# layout.showBase
source: Show Base
uk: Показати базу

# layout.showBaseCenter
source: Show Base Center
uk: Показати базовий центр

# layout.showBaseTop
source: Show Base Top
uk: Показати базовий верх

# merge.acceptAllInput1
source: Accept All Incoming Changes from Left
uk: Прийняти всі вхідні зміни зліва

# merge.acceptAllInput2
source: Accept All Current Changes from Right
uk: Прийняти всі поточні зміни з правого боку

# merge.goToNextUnhandledConflict
source: Go to Next Unhandled Conflict
uk: Перейти до наступного необробленого конфлікту

# merge.goToPreviousUnhandledConflict
source: Go to Previous Unhandled Conflict
uk: Перейти до попереднього необробленого конфлікту

# merge.openBaseEditor
source: Open Base File
uk: Відкрити базовий файл

# merge.toggleCurrentConflictFromLeft
source: Toggle Current Conflict from Left
uk: Перемкнути поточний конфлікт зліва

# merge.toggleCurrentConflictFromRight
source: Toggle Current Conflict from Right
uk: Перемкнути поточний конфлікт з правого боку

source: Merge Editor
uk: Редактор злиття

# mergeEditor.acceptAllCombination
source: Accept All Combination
uk: Прийняти всі комбінації

# mergeEditor.acceptMerge
source: Complete Merge
uk: Завершити злиття

# mergeEditor.acceptMerge.unhandledConflicts.accept
source: &&Complete with Conflicts
uk: &&Завершити з конфліктами

# mergeEditor.acceptMerge.unhandledConflicts.detail
source: The file contains unhandled conflicts.
uk: Файл містить некеровані конфлікти.

# mergeEditor.acceptMerge.unhandledConflicts.message
source: Do you want to complete the merge of {0}?
uk: Ви хочете завершити злиття {0}?

# mergeEditor.compareInput1WithBase
source: Compare Input 1 With Base
uk: Порівняти Вхід 1 з Основою

# mergeEditor.compareInput2WithBase
source: Compare Input 2 With Base
uk: Порівняти Вхід 2 з Базою

# mergeEditor.compareWithBase
source: Compare With Base
uk: Порівняти з базою

# mergeEditor.resetChoice
source: Reset Choice for 'Close with Conflicts'
uk: Скинути вибір для 'Закрити з конфліктами'

# mergeEditor.resetResultToBaseAndAutoMerge
source: Reset Result
uk: Скинути результат

# mergeEditor.resetResultToBaseAndAutoMerge.short
source: Reset
uk: Скинути

# mergeEditor.toggleBetweenInputs
source: Toggle Between Merge Editor Inputs
uk: Перемикатися між введеннями редактора злиття

source: Open File
uk: Відкрити файл

source: Show Non-Conflicting Changes
uk: Показати неперекриваючі зміни

# title
source: Open Merge Editor
uk: Відкрити редактор злиття

# merge.dev.copyState
source: Copy Merge Editor State as JSON
uk: Скопіювати стан редактора злиття як JSON

# merge.dev.loadContentsFromFolder
source: Load Merge Editor State from Folder
uk: Завантажити стан редактора злиття з папки

# merge.dev.saveContentsToFolder
source: Save Merge Editor State to Folder
uk: Зберегти стан редактора злиття в папку

# mergeEditor
source: Merge Editor (Dev)
uk: Редактор злиття

# mergeEditor.name
source: Merge Editor
uk: Редактор злиття

# mergeEditor.noActiveMergeEditor
source: No active merge editor
uk: Немає активного редактора злиття

# mergeEditor.selectFolderToSaveTo
source: Select folder to save to
uk: Виберіть папку для збереження

# mergeEditor.successfullyCopiedMergeEditorContents
source: Successfully copied merge editor state
uk: Успішно скопійовано стан редактора злиття

# mergeEditor.successfullySavedMergeEditorContentsToFolder
source: Successfully saved merge editor state to folder
uk: Успішно збережено стан редактора злиття в папку

# diffAlgorithm.advanced
source: Uses the advanced diffing algorithm.
uk: Використовує розширений алгоритм порівняння.

# diffAlgorithm.legacy
source: Uses the legacy diffing algorithm.
uk: Використовує застарілий алгоритм порівняння.

# name
source: Merge Editor
uk: Редактор злиття

# msg1
source: You are in a merge editor.
uk: Ви в редакторі злиття.

# msg2
source: Navigate between merge conflicts using the commands Go to Next Unhandled Conflict{0} and Go to Previous Unhandled Conflict{1}.
uk: Переміщуйтеся між конфліктами злиття, використовуючи команди Перейти до наступного необробленого конфлікту{0} та Перейти до попереднього необробленого конфлікту{1}.

# msg3
source: Run the command Merge Editor: Accept All Incoming Changes from the Left{0} and Merge Editor: Accept All Current Changes from the Right{1}
uk: Виконайте команду Merge Editor: Прийняти всі вхідні зміни зліва{0} та Merge Editor: Прийняти всі поточні зміни справа{1}

# msg4
source: Complete the Merge{0}.
uk: Завершіть злиття{0}.

# msg5
source: Toggle between merge editor inputs, incoming and current changes {0}.
uk: Перемикайте між вхідними даними редактора злиття, вхідними та поточними змінами {0}.

# mergeEditor.input1
source: Incoming, Left Input
uk: Вхідний, Лівий вхід

# mergeEditor.input2
source: Current, Right Input
uk: Поточний, Правильний Вхід

# mergeEditor.result
source: Merge Result
uk: Результат злиття

# name
source: Merging: {0}
uk: Редактор злиття

source: &&Accept Merge
uk: &&Прийняти злиття

# detail1
source: The merge result will be lost if you don't save it.
uk: Результат злиття буде втрачено, якщо ви його не збережете.

# detail1Conflicts
source: The file contains unhandled conflicts. The merge result will be lost if you don't save it.
uk: Файл містить некеровані конфлікти. Результат злиття буде втрачено, якщо ви його не збережете.

# detailN
source: The merge results will be lost if you don't save them.
uk: Результати злиття будуть втрачені, якщо ви їх не збережете.

# detailNConflicts
source: The files contain unhandled conflicts. The merge results will be lost if you don't save them.
uk: Файли містять неконтрольовані конфлікти. Результати злиття будуть втрачені, якщо ви їх не збережете.

# discard
source: Do&&n't Save
uk: Не&& зберігати

# merge-editor.source
source: Before Resolving Conflicts In Merge Editor
uk: Перед вирішенням конфліктів у редакторі злиття

# message1
source: Do you want keep the merge result of {0}?
uk: Ви хочете зберегти результат злиття {0}?

# messageN
source: Do you want keep the merge result of {0} files?
uk: Ви хочете зберегти результат злиття {0} файлів?

# noMoreWarn
source: Do not ask me again
uk: Не питай мене знову

source: &&Save
uk: &&Зберегти

# saveTempFile.detail
source: This will write the merge result to the original file and close the merge editor.
uk: Це запише результат злиття в оригінальний файл і закриє редактор злиття.

# saveTempFile.message
source: Do you want to accept the merge result?
uk: Ви хочете прийняти результат злиття?

# saveWithConflict
source: &&Save With Conflicts
uk: &&Зберегти з конфліктами

# workspace.close
source: &&Close
uk: &&Закрити

# workspace.closeWithConflicts
source: &&Close with Conflicts
uk: &&Закрити з конфліктами

# workspace.detail1.handled
source: Your changes will be lost if you don't save them.
uk: Ваші зміни будуть втрачені, якщо ви їх не збережете.

# workspace.detail1.unhandled
source: The file contains unhandled conflicts. Your changes will be lost if you don't save them.
uk: Файл містить некеровані конфлікти. Ваші зміни будуть втрачені, якщо ви їх не збережете.

# workspace.detail1.unhandled.nonDirty
source: The file contains unhandled conflicts.
uk: Файл містить некеровані конфлікти.

# workspace.detailN.handled
source: Your changes will be lost if you don't save them.
uk: Ваші зміни будуть втрачені, якщо ви їх не збережете.

# workspace.detailN.unhandled
source: The files contain unhandled conflicts. Your changes will be lost if you don't save them.
uk: Файли містять неконтрольовані конфлікти. Ваші зміни будуть втрачені, якщо ви їх не збережете.

# workspace.detailN.unhandled.nonDirty
source: The files contain unhandled conflicts.
uk: Файли містять некеровані конфлікти.

# workspace.doNotSave
source: Do&&n't Save
uk: Не&& зберігати

# workspace.message1
source: Do you want to save the changes you made to {0}?
uk: Ви хочете зберегти зміни, які ви внесли до {0}?

# workspace.message1.nonDirty
source: Do you want to close the merge editor for {0}?
uk: Ви хочете закрити редактор злиття для {0}?

# workspace.messageN
source: Do you want to save the changes you made to {0} files?
uk: Ви хочете зберегти зміни, які ви внесли до {0} файлів?

# workspace.messageN.nonDirty
source: Do you want to close {0} merge editors?
uk: Ви хочете закрити {0} редакторів злиття?

# workspace.save
source: &&Save
uk: &&Зберегти

# workspace.saveWithConflict
source: &&Save with Conflicts
uk: &&Зберегти з конфліктами

# conflictingLine
source: 1 Conflicting Line
uk: 1 Конфліктуюча лінія

# conflictingLines
source: {0} Conflicting Lines
uk: {0} Конфліктуючі рядки

source: Set Input Handled
uk: Встановлено обробку вводу

source: Undo Mark As Handled
uk: Скасувати позначення як оброблене

# mergeEditor.change.background
source: The background color for changes.
uk: Фоновий колір для змін.

# mergeEditor.change.word.background
source: The background color for word changes.
uk: Колір фону для змін слів.

# mergeEditor.changeBase.background
source: The background color for changes in base.
uk: Колір фону для змін у базі.

# mergeEditor.changeBase.word.background
source: The background color for word changes in base.
uk: Колір фону для змін слів у базі.

# mergeEditor.conflict.handled.minimapOverViewRuler
source: The foreground color for changes in input 1.
uk: Колір переднього плану для змін у введенні 1.

# mergeEditor.conflict.handledFocused.border
source: The border color of handled focused conflicts.
uk: Колір межі оброблених конфліктів фокусу.

# mergeEditor.conflict.handledUnfocused.border
source: The border color of handled unfocused conflicts.
uk: Колір межі оброблених неактивних конфліктів.

# mergeEditor.conflict.input1.background
source: The background color of decorations in input 1.
uk: Колір фону декорацій у введенні 1.

# mergeEditor.conflict.input2.background
source: The background color of decorations in input 2.
uk: Колір фону декорацій у введенні 2.

# mergeEditor.conflict.unhandled.minimapOverViewRuler
source: The foreground color for changes in input 1.
uk: Колір переднього плану для змін у введенні 1.

# mergeEditor.conflict.unhandledFocused.border
source: The border color of unhandled focused conflicts.
uk: Колір межі необроблених конфліктів з фокусом.

# mergeEditor.conflict.unhandledUnfocused.border
source: The border color of unhandled unfocused conflicts.
uk: Колір межі необроблених неактивних конфліктів.

# mergeEditor.conflictingLines.background
source: The background of the "Conflicting Lines" text.
uk: Фон тексту "Конфліктуючі лінії".

# accept
source: Accept {0}
uk: Прийняти {0}

# acceptBoth
source: Accept Combination
uk: Прийняти комбінацію

# acceptBoth0First
source: Accept Combination ({0} First)
uk: Прийняти комбінацію ({0} перший)

# acceptBothTooltip
source: Accept an automatic combination of both sides in the result document.
uk: Прийміть автоматичне поєднання обох сторін у документі результату.

# acceptTooltip
source: Accept {0} in the result document.
uk: Прийміть {0} у документі результату.

# append
source: Append {0}
uk: Додати {0}

# appendTooltip
source: Append {0} to the result document.
uk: Додати {0} до документа результату.

# combine
source: Accept Combination
uk: Прийняти комбінацію

source: Ignore
uk: Ігнорувати

source: Manual Resolution
uk: Ручне вирішення

# manualResolutionTooltip
source: This conflict has been resolved manually.
uk: Цей конфлікт був вирішений вручну.

# markAsHandledTooltip
source: Don't take this side of the conflict.
uk: Не приймайте цю сторону конфлікту.

source: No Changes Accepted
uk: Зміни не приймаються

# noChangesAcceptedTooltip
source: The current resolution of this conflict equals the common ancestor of both the right and left changes.
uk: Поточне вирішення цього конфлікту дорівнює спільному предку як правих, так і лівих змін.

# remove
source: Remove {0}
uk: Видалити {0}

# removeTooltip
source: Remove {0} from the result document.
uk: Видалити {0} з документа результату.

source: Reset to base
uk: Скинути до бази

# resetToBaseTooltip
source: Reset this conflict to the common ancestor of both the right and left changes.
uk: Скинути цей конфлікт до спільного предка як правих, так і лівих змін.

source: Base
uk: База

# compareWith
source: Comparing with {0}
uk: Порівнюючи з {0}

# compareWithTooltip
source: Differences are highlighted with a background color.
uk: Відмінності виділені кольором фону.

# accept.conflicting
source: Accept (result is dirty)
uk: Прийняти (результат брудний)

# accept.excluded
source: Accept
uk: Прийняти

# accept.first
source: Undo accept
uk: Скасувати прийняття

# accept.second
source: Undo accept (currently second)
uk: Скасувати прийняття (в даний момент другий)

source: Input 1
uk: Введення 1

source: Input 2
uk: Введіть 2

# mergeEditor.accept
source: Accept {0}
uk: Прийняти {0}

# mergeEditor.acceptBoth
source: Accept Both
uk: Прийняти обидва

# mergeEditor.markAsHandled
source: Mark as Handled
uk: Позначити як оброблене

# mergeEditor.swap
source: Swap
uk: Обмін

# allConflictHandled
source: All conflicts handled, the merge can be completed now.
uk: Усі конфлікти вирішені, злиття можна завершити зараз.

source: Go to next conflict
uk: Перейти до наступного конфлікту

# mergeEditor.remainingConflict
source: {0} Conflicts Remaining
uk: {0} Конфліктів залишилося

# mergeEditor.remainingConflicts
source: {0} Conflict Remaining
uk: {0} Конфлікт залишився

source: Result
uk: Результат

# mergeEditor
source: Text Merge Editor
uk: Редактор злиття

# noConflictMessage
source: There is currently no conflict focused that can be toggled.
uk: В даний момент немає конфлікту, на якому можна зосередитися, що можна перемикати.

# baseUri
source: The uri of the baser of a merge editor
uk: URI бази редактора злиття

# editorLayout
source: The layout mode of a merge editor
uk: Режим макета редактора злиття

# is
source: The editor is a merge editor
uk: Редактор є редактором злиття

# isr
source: The editor is a the result editor of a merge editor.
uk: Редактор є редактором результату злиття.

# resultUri
source: The uri of the result of a merge editor
uk: uri результату редактора злиття

# showBase
source: If the merge editor shows the base version
uk: Якщо редактор злиття показує базову версію

# showBaseAtTop
source: If base should be shown at the top
uk: Якщо базу слід показати вгорі

# showNonConflictingChanges
source: If the merge editor shows non-conflicting changes
uk: Показати неперекриваючі зміни

# merge.dev.openSelectionInTemporaryMergeEditor
source: Open Selection In Temporary Merge Editor
uk: Відкрити вибір у тимчасовому редакторі злиття

# merge.dev.openState
source: Open Merge Editor State from JSON
uk: Відкрити стан злиття редактора з JSON

# mergeEditor.enterJSON
source: Enter JSON
uk: Введіть JSON
