Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_keybinding.xlf
Languages: uk

# invalid.keybindings
source: Invalid `contributes.{0}`: {1}
uk: Неправильний `contributes.{0}`: {1}

# keybindings.commandsIsArray
source: Incorrect type. Expected "{0}". The field 'command' does not support running multiple commands. Use command 'runCommands' to pass it multiple commands to run.
uk: Неправильний тип. Очікується "{0}". Поле 'command' не підтримує виконання кількох команд. Використовуйте команду 'runCommands', щоб передати їй кілька команд для виконання.

# keybindings.json.args
source: Arguments to pass to the command to execute.
uk: Аргументи, які потрібно передати команді для виконання.

# keybindings.json.command
source: Name of the command to execute
uk: Назва команди для виконання

# keybindings.json.key
source: Key or key sequence (separated by space)
uk: Клавіша або послідовність клавіш (розділені пробілом)

# keybindings.json.removalCommand
source: Name of the command to remove keyboard shortcut for
uk: Назва команди для видалення комбінації клавіш для

# keybindings.json.title
source: Keybindings configuration
uk: Налаштування клавіш

# keybindings.json.when
source: Condition when the key is active.
uk: Умова, коли ключ активний.

# nonempty
source: expected non-empty value.
uk: очікуване ненульове значення.

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string`

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# unboundCommands
source: Here are other available commands:
uk: Ось інші доступні команди:

# vscode.extension.contributes.keybindings
source: Contributes keybindings.
uk: Вносить ключові комбінації.

# vscode.extension.contributes.keybindings.args
source: Arguments to pass to the command to execute.
uk: Аргументи для передачі команді для виконання.

# vscode.extension.contributes.keybindings.command
source: Identifier of the command to run when keybinding is triggered.
uk: Ідентифікатор команди, яка буде виконана, коли спрацьовує прив'язка клавіші.

# vscode.extension.contributes.keybindings.key
source: Key or key sequence (separate keys with plus-sign and sequences with space, e.g. Ctrl+O and Ctrl+L L for a chord).
uk: Клавіша або послідовність клавіш (розділяйте клавіші знаком плюс, а послідовності - пробілом, наприклад, Ctrl+O та Ctrl+L L для акорду).

# vscode.extension.contributes.keybindings.linux
source: Linux specific key or key sequence.
uk: Специфічна клавіша або послідовність клавіш для Linux.

# vscode.extension.contributes.keybindings.mac
source: Mac specific key or key sequence.
uk: Специфічна клавіша або комбінація клавіш для Mac.

# vscode.extension.contributes.keybindings.when
source: Condition when the key is active.
uk: Умова, коли ключ активний.

# vscode.extension.contributes.keybindings.win
source: Windows specific key or key sequence.
uk: Специфічна клавіша або послідовність клавіш для Windows.

# keyboard.layout.config
source: Control the keyboard layout used in web.
uk: Контролюйте розкладку клавіатури, що використовується в вебі.

# keyboardConfigurationTitle
source: Keyboard
uk: Клавіатура

# emptyKeybindingsHeader
source: Place your key bindings in this file to override the defaults
uk: Розмістіть свої прив'язки клавіш у цьому файлі, щоб переопределити значення за замовчуванням

# errorInvalidConfiguration
source: Unable to write to the keybindings configuration file. It has an object which is not of type Array. Please open the file to clean up and try again.
uk: Неможливо записати в конфігураційний файл прив'язок клавіш. Він містить об'єкт, який не є типом Array. Будь ласка, відкрийте файл, щоб очистити його, і спробуйте ще раз.

# errorKeybindingsFileDirty
source: Unable to write because the keybindings configuration file has unsaved changes. Please save it first and then try again.
uk: Неможливо записати, оскільки файл конфігурації прив'язок клавіш має незбережені зміни. Будь ласка, спочатку збережіть його, а потім спробуйте знову.

# parseErrors
source: Unable to write to the keybindings configuration file. Please open it to correct errors/warnings in the file and try again.
uk: Неможливо записати в файл конфігурації клавіш. Будь ласка, відкрийте його, щоб виправити помилки/попередження у файлі та спробуйте ще раз.
