Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_workspaces.xlf
Languages: uk

# errorInvalidTaskConfiguration
source: Unable to write into workspace configuration file. Please open the file to correct errors/warnings in it and try again.
uk: Неможливо записати у файл конфігурації робочого простору. Будь ласка, відкрийте файл, щоб виправити помилки/попередження в ньому, і спробуйте ще раз.

# openWorkspaceConfigurationFile
source: Open Workspace Configuration
uk: Відкрити конфігурацію робочого простору

source: Save
uk: Зберегти

source: Save Workspace
uk: Зберегти робочу область

# workspaceTrustEditorInputName
source: Workspace Trust
uk: Довіра до робочого простору

# workspaceTrustEditorLabelIcon
source: Icon of the workspace trust editor label.
uk: Іконка мітки редактора довіри робочого простору.

# doNotAskAgain
source: Always discard untitled workspaces without asking
uk: Завжди відкидати неназвані робочі області без запитань

# doNotSave
source: Do&&n't Save
uk: Не&&зберігати

# restartExtensionHost.reason
source: Opening a multi-root workspace
uk: Відкриття багатокореневого робочого простору

source: &&Save
uk: Зберегти

# saveWorkspaceDetail
source: Save your workspace if you plan to open it again.
uk: Збережіть своє робоче середовище, якщо плануєте відкрити його знову.

# saveWorkspaceMessage
source: Do you want to save your workspace configuration as a file?
uk: Ви хочете зберегти конфігурацію вашого робочого простору як файл?

# workspaceOpenedDetail
source: The workspace is already opened in another window. Please close that window first and then try again.
uk: Робоче середовище вже відкрите в іншому вікні. Будь ласка, спочатку закрийте це вікно, а потім спробуйте ще раз.

# workspaceOpenedMessage
source: Unable to save workspace '{0}'
uk: Неможливо зберегти робочу область '{0}'
