Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

source: Working
uk: Працює...

# chatOutputRenderer.mimeTypes
source: MIME types that this renderer can handle
uk: Типи MIME, які може обробляти цей рендерер

# chatOutputRenderer.viewType
source: Unique identifier for the renderer.
uk: Унікальний ідентифікатор для рендерера.

# vscode.extension.contributes.chatOutputRenderer
source: Contributes a renderer for specific MIME types in chat outputs
uk: Вносить рендерер для специфічних MIME-типів у виходах чату

# chat.viewContainer.label
source: Chat
uk: Чат

# chatCommand
source: A short name by which this command is referred to in the UI, e.g. `fix` or * `explain` for commands that fix an issue or explain code. The name should be unique among the commands provided by this participant.
uk: Коротка назва, якою ця команда називається в інтерфейсі, наприклад, `fix` або * `explain` для команд, які виправляють проблему або пояснюють код. Назва повинна бути унікальною серед команд, наданих цим учасником.

# chatCommandDescription
source: A description of this command.
uk: Опис цієї команди.

# chatCommandDisambiguation
source: Metadata to help with automatically routing user questions to this chat command.
uk: Метадані для допомоги в автоматичному маршрутизації запитань користувачів до цієї команди чату.

# chatCommandDisambiguationCategory
source: A detailed name for this category, e.g. `workspace_questions` or `web_questions`.
uk: Детальна назва для цієї категорії, наприклад, `workspace_questions` або `web_questions`.

# chatCommandDisambiguationDescription
source: A detailed description of the kinds of questions that are suitable for this chat command.
uk: Докладний опис видів запитань, які підходять для цієї команди чату.

# chatCommandDisambiguationExamples
source: A list of representative example questions that are suitable for this chat command.
uk: Список представницьких прикладів запитань, які підходять для цієї команди чату.

# chatCommandSampleRequest
source: When the user clicks this command in `/help`, this text will be submitted to the participant.
uk: Коли користувач натискає цю команду в `/help`, цей текст буде надіслано учаснику.

# chatCommandSticky
source: Whether invoking the command puts the chat into a persistent mode, where the command is automatically added to the chat input for the next message.
uk: Чи виклик команди переводить чат у постійний режим, де команда автоматично додається до введення чату для наступного повідомлення.

# chatCommandWhen
source: A condition which must be true to enable this command.
uk: Умова, яка повинна бути істинною, щоб активувати цю команду.

# chatCommandsDescription
source: Commands available for this chat participant, which the user can invoke with a `/`.
uk: Команди, доступні для цього учасника чату, які користувач може викликати за допомогою `/`.

# chatFailErrorMessage
source: Chat failed to load because the installed version of the Copilot Chat extension is not compatible with this version of {0}. Please ensure that the Copilot Chat extension is up to date.
uk: Чат не вдалося завантажити, оскільки встановлена версія розширення Copilot Chat не сумісна з цією версією {0}. Будь ласка, переконайтеся, що розширення Copilot Chat оновлене.

# chatParticipantDescription
source: A description of this chat participant, shown in the UI.
uk: Опис цього учасника чату, відображений в інтерфейсі.

# chatParticipantDisambiguation
source: Metadata to help with automatically routing user questions to this chat participant.
uk: Метадані для допомоги в автоматичному маршрутизації запитань користувачів до цього учасника чату.

# chatParticipantDisambiguationCategory
source: A detailed name for this category, e.g. `workspace_questions` or `web_questions`.
uk: Докладна назва для цієї категорії, наприклад, `workspace_questions` або `web_questions`.

# chatParticipantDisambiguationDescription
source: A detailed description of the kinds of questions that are suitable for this chat participant.
uk: Докладний опис видів запитань, які підходять для цього учасника чату.

# chatParticipantDisambiguationExamples
source: A list of representative example questions that are suitable for this chat participant.
uk: Список представницьких прикладів запитань, які підходять для цього учасника чату.

# chatParticipantFullName
source: The full name of this chat participant, which is shown as the label for responses coming from this participant. If not provided, {0} is used.
uk: Повне ім'я цього учасника чату, яке відображається як мітка для відповідей, що надходять від цього учасника. Якщо не вказано, використовується {0}.

# chatParticipantId
source: A unique id for this chat participant.
uk: Унікальний ідентифікатор для цього учасника чату.

# chatParticipantName
source: User-facing name for this chat participant. The user will use '@' with this name to invoke the participant. Name must not contain whitespace.
uk: Ім'я, яке бачить користувач, для цього учасника чату. Користувач буде використовувати '@' з цим ім'ям, щоб викликати учасника. Ім'я не повинно містити пробілів.

# chatParticipantWhen
source: A condition which must be true to enable this participant.
uk: Умова, яка повинна бути істинною, щоб активувати цього учасника.

source: Chat Participants
uk: Учасники чату

# chatSampleRequest
source: When the user clicks this participant in `/help`, this text will be submitted to the participant.
uk: Коли користувач натискає на цього учасника в `/help`, цей текст буде надіслано учаснику.

# miToggleChat
source: &&Chat
uk: &&Чат

# participantCommands
source: Commands
uk: Команди

# participantDescription
source: Description
uk: Опис

# participantFullName
source: Full Name
uk: Повне ім'я

# participantName
source: Name
uk: Ім'я

source: Show Extension
uk: Показати розширення

# vscode.extension.contributes.chatParticipant
source: Contributes a chat participant
uk: Сприяє учаснику чату

# pastedAttachment.multiple
source: {0} and {1} more
uk: {0} та {1} ще

# pastedAttachment.multipleLines
source: {0} lines
uk: {0} рядків

# pastedAttachment.oneLine
source: 1 line
uk: 1 рядок

# pastedChatAttachments
source: Insert Prompt & Attachments
uk: Вставити запит та вкладення

source: Pasted Code Attachment
uk: Вставлений код вкладення

source: Pasted Image Attachment
uk: Вставлене зображення

# pastedImageName
source: Pasted Image
uk: Вставлене зображення

source: Chat Sessions
uk: Чат-сесії

# chat.sessions.chatView
source: Chat
uk: Чат

# chat.sessions.chatView.description
source: Chat View
uk: Перегляд чату

# chat.sessions.showHistory
source: Show history...
uk: Показати історію...

# chat.sessions.title
source: Chat Sessions
uk: Чат-сесії

# chatSessionInputAriaLabel
source: Type session name. Press Enter to confirm or Escape to cancel.
uk: Введіть назву сеансу. Натисніть Enter, щоб підтвердити, або Escape, щоб скасувати.

source: Chat Sessions
uk: Чат-сесії

# chatSessions.dragLabel
source: {0} chat sessions
uk: {0} сеансів чату

# chatSessions.loading
source: Loading chat sessions...
uk: Завантаження чат-сесій...

# chatSessions.noResults
source: No local chat sessions [Start a Chat](command:workbench.action.openChat)
uk: Немає локальних чат-сесій [Почати чат](command:workbench.action.openChat)

# chatSessions.refreshing
source: Refreshing chat sessions...
uk: Оновлення чат-сесій...

# chatSessionNotFound
source: Use `#copilotCodingAgent` to begin a new [coding agent session]({0}).
uk: Використовуйте `#copilotCodingAgent`, щоб розпочати нову [сесію кодування агента]({0}).

# chatSessionsExtPoint
source: Contributes chat session integrations to the chat widget.
uk: Вносить інтеграції сеансів чату до віджету чату.

# chatSessionsExtPoint.chatSessionType
source: Unique identifier for the type of chat session.
uk: Унікальний ідентифікатор для типу чату.

# chatSessionsExtPoint.description
source: Description of the chat session for use in menus and tooltips.
uk: Опис сеансу чату для використання в меню та підказках.

# chatSessionsExtPoint.displayName
source: A longer name for this item which is used for display in menus.
uk: Довша назва для цього елемента, яка використовується для відображення в меню.

# chatSessionsExtPoint.name
source: Name shown in the chat widget. (eg: @agent)
uk: Ім'я, яке відображається у віджеті чату. (наприклад: @агент)

# chatSessionsExtPoint.when
source: Condition which must be true to show this item.
uk: Умова, яка повинна бути істинною, щоб показати цей елемент.

# continueInNewChat
source: Continue **{0}** in a new chat editor
uk: Продовжте **{0}** у новому редакторі чату

# interactiveSession.openNewSessionEditor
source: New {0} Chat Editor
uk: Новий {0} Редактор Чатів

# continueWith
source: Continue with {0}
uk: Продовжити з {0}

# copilotFailedWarning
source: Copilot failed to get ready. Please ensure you are signed in to {0} and that the extension `{1}` is installed and enabled.
uk: Copilot не зміг підготуватися. Будь ласка, переконайтеся, що ви увійшли в {0} і що розширення `{1}` встановлено та активовано.

# copilotSetupError
source: Copilot setup failed.
uk: Налаштування Copilot не вдалося.

# copilotTookLongWarning
source: Copilot took too long to get ready. Please ensure you are signed in to {0} and that the extension `{1}` is installed and enabled.
uk: Copilot зайняв занадто багато часу, щоб підготуватися. Будь ласка, переконайтеся, що ви увійшли до {0} і що розширення `{1}` встановлено та увімкнено.

# copilotUnavailableWarning
source: Copilot failed to get a response. Please try again.
uk: Copilot не зміг отримати відповідь. Будь ласка, спробуйте ще раз.

# copilotWorkspaceTrust
source: Copilot is currently only supported in trusted workspaces.
uk: Copilot наразі підтримується лише в надійних робочих просторах.

# enterpriseInstance
source: What is your {0} instance?
uk: Який ваш {0} екземпляр?

# enterpriseInstancePlaceholder
source: i.e. "octocat" or "https://octocat.ghe.com"...
uk: тобто "octocat" або "https://octocat.ghe.com"...

# forceSignIn
source: Sign in to use Copilot
uk: Увійдіть, щоб використовувати Copilot

# hideChatSetup
source: Hide AI Features
uk: Сховати функції ШІ

# hideChatSetupButton
source: Hide AI Features
uk: Сховати функції ШІ

# hideChatSetupConfirm
source: Are you sure you want to hide AI features?
uk: Ви впевнені, що хочете приховати функції ШІ?

# hideChatSetupDetail
source: You can restore AI features by running the '{0}' command.
uk: Ви можете відновити функції ШІ, виконавши команду '{0}'.

# installingCopilot
source: Getting Copilot ready
uk: Підготовка Copilot

# invalidEnterpriseInstance
source: You must enter a valid {0} instance (i.e. "octocat" or "https://octocat.ghe.com")
uk: Ви повинні ввести дійсний {0} екземпляр (тобто "octocat" або "https://octocat.ghe.com")

# manageOverages
source: Manage Copilot Overages
uk: Керувати перевищеннями Copilot

# managePlan
source: Upgrade to Copilot Pro
uk: Оновити до Copilot Pro

# restartExtensionHost.reason.disable
source: Disabling AI features
uk: Вимкнення функцій ШІ

# restartExtensionHost.reason.enable
source: Enabling AI features
uk: Увімкнення функцій ШІ

source: Retry
uk: Спробувати ще раз

# settingUpCopilotNeeded
source: You need to set up Copilot and be signed in to use Chat.
uk: Вам потрібно налаштувати Copilot і увійти в систему, щоб використовувати Chat.

# settings
source: By continuing, you agree to {0}'s [Terms]({1}) and [Privacy Statement]({2}). {3} Copilot may show [public code]({4}) suggestions and use your data to improve the product. You can change these [settings]({5}) anytime.
uk: Продовжуючи, ви погоджуєтеся з [Умовами]({1}) та [Заявою про конфіденційність]({2}) {0}. {3} Copilot може показувати пропозиції [публічного коду]({4}) та використовувати ваші дані для покращення продукту. Ви можете змінити ці [налаштування]({5}) в будь-який час.

# setupChatProgress
source: Getting Copilot ready...
uk: Підготовка Copilot...

# setupChatSignIn2
source: Signing in to {0}.
uk: Увійти в {0}.

source: Set up Copilot.
uk: Налаштуйте Copilot.

# setupCopilotButton
source: Set up Copilot
uk: Налаштувати Copilot

# setupErrorDialog
source: Copilot setup failed. Would you like to try again?
uk: Налаштування Copilot не вдалося. Хотіли б ви спробувати ще раз?

# setupToolDisplayName
source: New Workspace
uk: Новий робочий простір

# setupToolsDescription
source: Scaffold a new workspace in VS Code
uk: Сконструюйте нове робоче середовище у VS Code

# signIn
source: Sign in to use {0} Copilot
uk: Увійдіть, щоб використовувати {0} Copilot

source: Skip for now
uk: Пропустити зараз

# startUsing
source: Start using {0} Copilot
uk: Почніть використовувати {0} Copilot

# triggerChatSetup
source: Use AI Features with GitHub Copilot for free...
uk: Використовуйте функції ШІ з GitHub Copilot безкоштовно...

# triggerChatSetupFromAccounts
source: Sign in to use Copilot...
uk: Увійдіть, щоб використовувати Copilot...

# trustNeeded
source: You need to trust this workspace to use Chat.
uk: Вам потрібно довіряти цьому робочому простору, щоб використовувати Chat.

# unknownSetupError
source: An error occurred while setting up Copilot. Would you like to try again?
uk: Сталася помилка під час налаштування Copilot. Бажаєте спробувати ще раз?

# unknownSignInError
source: Failed to sign in to {0}. Would you like to try again?
uk: Не вдалося увійти до {0}. Бажаєте спробувати ще раз?

# unknownSignInErrorDetail
source: You must be signed in to use Copilot.
uk: Ви повинні увійти в систему, щоб використовувати Copilot.

# vscodeAgentDescription
source: Ask questions about VS Code
uk: Запитуйте питання про VS Code

# waitingCopilot
source: Getting Copilot ready
uk: Підготовка Copilot

# waitingCopilot2
source: Copilot is almost ready
uk: Copilot майже готовий

# willResolveTo
source: Will resolve to {0}
uk: Вирішить до {0}

# activateCopilotButton
source: Set up Copilot
uk: Налаштувати Copilot

# activateDescription
source: Set up Copilot to use AI features.
uk: Налаштуйте Copilot для використання функцій ШІ.

# additionalUsageDisabled
source: Additional paid premium requests disabled.
uk: Додаткові запити на платні премії вимкнено.

# additionalUsageEnabled
source: Additional paid premium requests enabled.
uk: Увімкнено додаткові запити на платні премії.

source: Cancel Snooze
uk: Скасувати відкладення

# chatAndCompletionsQuotaExceededStatus
source: Quota reached
uk: Квота досягнута

# chatQuotaExceededStatus
source: Chat quota reached
uk: Досягнуто квоти чату

# chatStatus
source: Copilot Status
uk: Статус Copilot

# chatsLabel
source: Chat messages
uk: Чат повідомлення

source: Code Completions
uk: Завершення коду

# completions.plus5min
source: +5 min
uk: +5 хв

# completions.remainingTime
source: remaining
uk: залишок

# completions.snooze5minutes
source: Hide completions and NES for 5 min
uk: Сховати завершення та NES на 5 хвилин

# completions.snooze5minutesTitle
source: Hide completions for 5 min
uk: Сховати завершення на 5 хвилин

# completions.snoozeAdditional5minutes
source: Snooze additional 5 min
uk: Відкласти ще на 5 хвилин

# completions.snoozeTimeDescription
source: Completions are hidden for the remaining duration
uk: Завершення приховані на залишок часу

# completionsDisabledStatus
source: Code completions disabled
uk: Завершення коду вимкнено

# completionsLabel
source: Code completions
uk: Завершення коду

# completionsQuotaExceededStatus
source: Completions quota reached
uk: Квота завершень досягнута

# completionsSnoozedStatus
source: Code completions snoozed
uk: Завершення коду призупинено

# copilotDisabledStatus
source: Copilot Disabled
uk: Копілот вимкнено

# copilotLaterStatus
source: Finish Setup
uk: Завершити налаштування

# enableCopilotButton
source: Enable Copilot
uk: Увімкнути Copilot

# enableDescription
source: Enable Copilot to use AI features.
uk: Увімкніть Copilot для використання функцій ШІ.

# gaugeBackground
source: Gauge background color.
uk: Колір фону вимірювача.

# gaugeBorder
source: Gauge border color.
uk: Колір межі вимірювача.

# gaugeErrorBackground
source: Gauge error background color.
uk: Колір фону помилки вимірювання.

# gaugeErrorForeground
source: Gauge error foreground color.
uk: Колір переднього плану помилки вимірювання.

# gaugeForeground
source: Gauge foreground color.
uk: Виміряти колір переднього плану.

# gaugeWarningBackground
source: Gauge warning background color.
uk: Колір фону попередження датчика.

# gaugeWarningForeground
source: Gauge warning foreground color.
uk: Колір переднього плану попередження датчика.

source: Learn More
uk: Дізнатися більше

# limitQuota
source: Allowance resets {0}.
uk: Виплати скидаються {0}.

# notSignedIntoCopilot
source: Signed out
uk: Вийшли

# premiumChatsLabel
source: Premium requests
uk: Преміум запити

# quotaDisplayWithOverage
source: +{0} requests
uk: +{0} запитів

# quotaLabel
source: Manage Copilot
uk: Керувати Copilot

# quotaTooltip
source: Manage Copilot
uk: Керувати Copilot

# quotaUnlimited
source: Included
uk: Включено

# settings.codeCompletions.allFiles
source: All files
uk: Усі файли

# settings.nextEditSuggestions
source: Next edit suggestions
uk: Наступні пропозиції редагування

# settings.snooze
source: Snooze
uk: Снуз

# settingsLabel
source: Settings
uk: Налаштування

# settingsTooltip
source: Open Settings
uk: Відкрити Налаштування

# signInDescription
source: Sign in to use Copilot AI features.
uk: Увійдіть, щоб використовувати функції Copilot AI.

# signInToUseCopilotButton
source: Sign in to use Copilot
uk: Увійдіть, щоб використовувати Copilot

# usageTitle
source: Copilot Usage
uk: Використання Copilot

# agentMessage
source: Ask Copilot to edit your files in [agent mode]({0}). Copilot will automatically use multiple requests to pick files to edit, run terminal commands, and iterate on errors.
uk: Попросіть Copilot редагувати ваші файли в [режимі агента]({0}). Copilot автоматично використовуватиме кілька запитів для вибору файлів для редагування, виконання команд терміналу та ітерації на помилках.

# agentTitle
source: Build with agent mode.
uk: Будувати в режимі агента.

# chat.input.placeholder.lockedToAgent
source: Chat with {0}
uk: Чат з {0}

# chatDescription
source: Ask about your code.
uk: Запитайте про свій код.

# chatDisclaimer
source: AI responses may be inaccurate.
uk: Відповіді ШІ можуть бути неточними.

# chatMessage
source: Copilot is powered by AI, so mistakes are possible. Review output carefully before use.
uk: Copilot працює на базі ШІ, тому можливі помилки. Уважно перевіряйте результати перед використанням.

# chatWidget.suggestedPrompts.buildWorkspace
source: Build workspace
uk: Створити робочу область

# chatWidget.suggestedPrompts.buildWorkspacePrompt
source: How do I build this workspace?
uk: Як мені побудувати це робоче середовище?

# chatWidget.suggestedPrompts.findConfig
source: Show project config
uk: Показати конфігурацію проекту

# chatWidget.suggestedPrompts.findConfigPrompt
source: Where is the configuration for this project defined?
uk: Де визначена конфігурація для цього проекту?

# chatWidget.suggestedPrompts.gettingStarted
source: Ask @vscode
uk: Запитайте @vscode

# chatWidget.suggestedPrompts.gettingStartedPrompt
source: @vscode How do I change the theme to light mode?
uk: @vscode Як я можу змінити тему на світлий режим?

# chatWidget.suggestedPrompts.newProject
source: Create project
uk: Створити проект

# chatWidget.suggestedPrompts.newProjectPrompt
source: Create a #new Hello World project in TypeScript
uk: Створіть новий проект Hello World у TypeScript

# chatWidget.tips
source: {0} or type {1} to attach context {2} to chat with extensions Type {3} to use commands
uk: {0} або введіть {1}, щоб додати контекст {2}, щоб спілкуватися з розширеннями Введіть {3}, щоб використовувати команди

# chatWidget.tips.withoutParticipants
source: {0} or type {1} to attach context
uk: {0} або введіть {1}, щоб додати контекст

# codingAgentMessage
source: This chat session will be forwarded to the {0} coding agent
uk: Ця чат-сесія буде передана агенту кодування {0}

# codingAgentTitle
source: Chat with {0}
uk: Чат з {0}

# editsHelp
source: Start your editing session by defining a set of files that you want to work with. Then ask Copilot for the changes you want to make.
uk: Почніть свою сесію редагування, визначивши набір файлів, з якими ви хочете працювати. Потім запитайте у Copilot про зміни, які ви хочете внести.

# editsTitle
source: Edit in context.
uk: Редагувати в контексті.

# expChatAdditionalMessage
source: Review AI output carefully before use.
uk: Уважно перевірте вихідні дані ШІ перед використанням.

# expChatTitle
source: Welcome to Copilot
uk: Ласкаво просимо до Copilot

# expchatMessage
source: Let's get started
uk: Почнемо.

# scrollDownButtonLabel
source: Scroll down
uk: Прокрутіть вниз

# chat.codeBlock.toolbar
source: Code block toolbar
uk: Панель інструментів блоку коду

# chat.codeBlockHelp
source: Code block
uk: Блок коду

# chat.codeBlockLabel
source: Code block {0}
uk: Блок коду {0}

# chat.codeBlockToolbarLabel
source: Code block {0}
uk: Блок коду {0}

# chat.compareCodeBlockLabel
source: Code Edits
uk: Редагування коду

# chat.edits.1
source: Applied 1 change in [[``{0}``]]
uk: Застосовано 1 зміну в [[``{0}``]]

# chat.edits.N
source: Applied {0} changes in [[``{1}``]]
uk: Застосовано {0} зміни в [[``{1}``]]

# chat.edits.rejected
source: Edits in [[``{0}``]] have been rejected
uk: Редагування в [[``{0}``]] були відхилені

# interactive.compare.apply.confirm
source: The original file has been modified.
uk: Оригінальний файл був змінений.

# interactive.compare.apply.confirm.detail
source: Do you want to apply the changes anyway?
uk: Ви хочете все ж застосувати зміни?

source: Modified
uk: Модифіковано

source: Original
uk: Оригінал

# vulnerabilitiesPlural
source: {0} vulnerabilities
uk: {0} вразливостей

# vulnerabilitiesSingular
source: {0} vulnerability
uk: {0} вразливість

source: Active file
uk: Активний файл

# installLabel
source: Install Chat Extensions...
uk: Встановити розширення чату...

# mcp.prompt.error
source: Error resolving prompt: {0}
uk: Помилка при обробці запиту: {0}

# mcp.prompt.image
source: Prompt Image
uk: Запит зображення

# mcp.prompt.resource
source: Prompt Resource
uk: Запит Ресурс

# promptFileDescription
source: User Prompt File
uk: Файл запиту користувача

# promptFileDescriptionWorkspace
source: Workspace Prompt File
uk: Файл запиту робочого простору

# chatPlaceholderHint
source: Add context (#), extensions (@), commands (/)
uk: Додати контекст (#), розширення (@), команди (/)

# hoverAccessibilityChatAgent
source: There is a chat agent hover part here.
uk: Тут є частина з наведенням на агента чату.

# relatedFile
source: {0} (Suggested)
uk: {0} (Рекомендовано)

source: Screenshot
uk: Скриншот

source: Built-In
uk: Вбудований

source: Custom
uk: Користувацький

# chat.manageModels
source: Manage Models...
uk: Керувати моделями...

# chat.manageModels.tooltip
source: Manage language models
uk: Керувати мовними моделями

# chat.modelPicker.label
source: Pick Model
uk: Виберіть модель

# chat.moreModels
source: Add Premium Models
uk: Додати преміум моделі

# chat.moreModels.tooltip
source: Add premium models
uk: Додати преміум моделі

# attach-instructions.capitalized.ellipses
source: Attach Instructions...
uk: Прикріпити інструкції...

# chatContext.attach.instructions.label
source: Instructions...
uk: Інструкції...

# commands.instructions.select-dialog.placeholder
source: Select instructions files to attach
uk: Виберіть файли інструкцій для прикріплення

# commands.prompt.manage-dialog.placeholder
source: Select the instructions file to open
uk: Виберіть файл інструкцій для відкриття

source: Configure Instructions...
uk: Налаштувати інструкції...

# configure-instructions.short
source: Instructions
uk: Інструкції

source: Configure Instructions...
uk: Налаштувати інструкції...
