Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_preferences.xlf
Languages: uk

# keybindingsEditorLabelIcon
source: Icon of the keybindings editor label.
uk: Іконка мітки редактора прив'язок клавіш.

# keybindingsInputName
source: Keyboard Shortcuts
uk: Комбінації клавіш

# default
source: System
uk: Система

source: Extension
uk: Розширення

source: meta
uk: мета

source: option
uk: опція

source: User
uk: Користувач

source: Default Keybindings
uk: За замовчуванням клавіші

# emptyKeybindingsHeader
source: Place your key bindings in this file to override the defaults
uk: Помістіть свої прив'язки клавіш у цей файл, щоб перевизначити значення за замовчуванням.

# fail.createSettings
source: Unable to create '{0}' ({1}).
uk: Неможливо створити '{0}' ({1}).

# openFolderFirst
source: Open a folder or workspace first to create workspace or folder settings.
uk: Спочатку відкрийте папку або робочу область, щоб створити налаштування робочої області або папки.

# settingsEditor2InputName
source: Settings
uk: Налаштування

# settingsEditorLabelIcon
source: Icon of the settings editor label.
uk: Іконка мітки редактора налаштувань.

source: Commonly Used
uk: Звичайно, використовується

# defaultKeybindingsHeader
source: Override key bindings by placing them into your key bindings file.
uk: Перезапишіть прив'язки клавіш, помістивши їх у файл прив'язок клавіш.

# invalidTypeError
source: Setting has an invalid type, expected {0}. Fix in JSON.
uk: Налаштування має недійсний тип, очікувався {0}. Виправте в JSON.

# regexParsingError
source: Error parsing the following regex both with and without the u flag:
uk: Помилка розбору наступного регулярного виразу як з прапором u, так і без нього:

# validations.arrayIncorrectType
source: Incorrect type. Expected an array.
uk: Неправильний тип. Очікувався масив.

# validations.booleanIncorrectType
source: Incorrect type. Expected "boolean".
uk: Неправильний тип. Очікувався "логічний".

# validations.colorFormat
source: Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.
uk: Недійсний формат кольору. Використовуйте #RGB, #RGBA, #RRGGBB або #RRGGBBAA.

# validations.exclusiveMax
source: Value must be strictly less than {0}.
uk: Значення повинно бути строго менше ніж {0}.

# validations.exclusiveMin
source: Value must be strictly greater than {0}.
uk: Значення повинно бути строго більшим за {0}.

# validations.expectedInteger
source: Value must be an integer.
uk: Значення повинно бути цілим числом.

# validations.expectedNumeric
source: Value must be a number.
uk: Значення повинно бути числом.

# validations.invalidStringEnumValue
source: Value is not accepted. Valid values: {0}.
uk: Значення не приймається. Дійсні значення: {0}.

# validations.max
source: Value must be less than or equal to {0}.
uk: Значення має бути меншим або рівним {0}.

# validations.maxLength
source: Value must be {0} or fewer characters long.
uk: Значення має бути довжиною {0} символів або менше.

# validations.min
source: Value must be greater than or equal to {0}.
uk: Значення повинно бути більшим або рівним {0}.

# validations.minLength
source: Value must be {0} or more characters long.
uk: Значення повинно бути довжиною {0} або більше символів.

# validations.multipleOf
source: Value must be a multiple of {0}.
uk: Значення повинно бути кратним {0}.

# validations.objectIncorrectType
source: Incorrect type. Expected an object.
uk: Неправильний тип. Очікувався об'єкт.

# validations.objectPattern
source: Property {0} is not allowed.
uk: Властивість {0} не дозволена.

# validations.regex
source: Value must match regex `{0}`.
uk: Значення повинно відповідати регулярному виразу `{0}`.

# validations.stringArrayIncorrectType
source: Incorrect type. Expected a string array.
uk: Неправильний тип. Очікувався масив рядків.

# validations.stringArrayItemEnum
source: Value {0} is not one of {1}
uk: Значення {0} не є одним із {1}

# validations.stringArrayItemPattern
source: Value {0} must match regex {1}.
uk: Значення {0} повинно відповідати регулярному виразу {1}.

# validations.stringArrayMaxItem
source: Array must have at most {0} items
uk: Масив може містити не більше {0} елементів

# validations.stringArrayMinItem
source: Array must have at least {0} items
uk: Масив повинен містити щонайменше {0} елементів

# validations.stringArrayUniqueItems
source: Array has duplicate items
uk: Масив має дублікати елементів

# validations.stringIncorrectEnumOptions
source: The enum options should be strings, but there is a non-string option. Please file an issue with the extension author.
uk: Опції enum повинні бути рядками, але є опція, яка не є рядком. Будь ласка, створіть проблему для автора розширення.

# validations.stringIncorrectType
source: Incorrect type. Expected "string".
uk: Неправильний тип. Очікується "рядок".

# validations.uriEmpty
source: URI expected.
uk: Очікується URI.

# validations.uriMissing
source: URI is expected.
uk: Очікується URI.

# validations.uriSchemeMissing
source: URI with a scheme is expected.
uk: Очікується URI з схемою.
