Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_inlineChat.xlf
Languages: uk

# cancel
source: Cancel Request
uk: Скасувати запит

# cancelShort
source: Cancel
uk: Скасувати

# send.edit
source: Edit Code
uk: Редагувати код

# send.generate
source: Generate
uk: Генерувати

# apply1
source: Accept Changes
uk: Прийняти зміни

# apply2
source: Accept
uk: Прийняти

# arrowDown
source: Cursor Down
uk: Курсор вниз

# arrowUp
source: Cursor Up
uk: Курсор вгору

# cat
source: Inline Chat
uk: Вбудований чат

# chat.rerun.label
source: Rerun Request
uk: Запит на повторне виконання

source: Close
uk: Закрити

# configure
source: Configure Inline Chat
uk: Налаштувати інтерактивний чат

source: Discard
uk: Видалити

# focus
source: Focus Input
uk: Фокус вводу

# moveToNextHunk
source: Move to Next Change
uk: Перейти до наступної зміни

# moveToPreviousHunk
source: Move to Previous Change
uk: Перейти до попередньої зміни

source: Rerun
uk: Повторити

# reveal
source: Toggle Inline Chat
uk: Переключити вбудований чат

# run
source: Editor Inline Chat
uk: Редактор Вбудований Чат

# showChanges
source: Toggle Changes
uk: Перемикання змін

# startInlineChat
source: Icon which spawns the inline chat from the editor toolbar.
uk: Іконка, яка відкриває вбудований чат з панелі інструментів редактора.

# stop
source: Undo & Close
uk: Скасувати та закрити

# unstash
source: Resume Last Dismissed Inline Chat
uk: Відновити останній закритий чат в рядку

source: View in Chat
uk: Переглянути в чаті

# create.fail
source: Failed to start editor chat
uk: Не вдалося запустити чат редактора

# empty
source: No results, please refine your input and try again
uk: Немає результатів, будь ласка, уточніть ваш запит і спробуйте ще раз

# err.apply
source: Failed to apply changes.
uk: Не вдалося застосувати зміни.

# err.discard
source: Failed to discard changes.
uk: Не вдалося скасувати зміни.

# welcome.2
source: Getting ready...
uk: Готуємось...

# defaultTitle
source: Chat
uk: Чат

# disableHint
source: Disable Inline Chat Hint
uk: Вимкнути підказку для інтегрованого чату

# hideHint
source: Hide Inline Chat Hint
uk: Сховати підказку для інтерактивного чату

# inlineChatShowingHint
source: Whether inline chat shows a contextual hint
uk: Чи показує інтерактивний чат контекстну підказку

# showHint
source: Show Inline Chat Hint
uk: Показати підказку для чату в рядку

# startWithCurrentLine
source: Start in Editor with Current Line
uk: Почати в редакторі з поточної рядка

# title1
source: {0} to continue with {1}
uk: {0} для продовження з {1}

# title2
source: {0} to edit with {1}
uk: {0} для редагування з {1}

# aria-label
source: Inline Chat Input
uk: Вбудований чат-ввід

# inlineChat.accessibilityHelp
source: Inline Chat Input, Use {0} for Inline Chat Accessibility Help.
uk: Введення чату в рядку, використовуйте {0} для допомоги з доступністю чату в рядку.

# inlineChat.accessibilityHelpNoKb
source: Inline Chat Input, Run the Inline Chat Accessibility Help command for more information.
uk: Введення чату в рядку, виконайте команду допомоги з доступності чату в рядку для отримання додаткової інформації.

# inlineChatClosed
source: Closed inline chat widget
uk: Закритий вбудований віджет чату

# accessibleDiffView
source: Whether the inline chat also renders an accessible diff viewer for its changes.
uk: Чи відображає інтерактивний чат також доступний переглядач змін для своїх змін.

# accessibleDiffView.auto
source: The accessible diff viewer is based on screen reader mode being enabled.
uk: Доступний переглядач змін базується на увімкненому режимі для читачів екрану.

# accessibleDiffView.off
source: The accessible diff viewer is never enabled.
uk: Доступний переглядач різниць ніколи не активується.

# accessibleDiffView.on
source: The accessible diff viewer is always enabled.
uk: Доступний переглядач відмінностей завжди увімкнено.

# editorMinimap.inlineChatInserted
source: Minimap marker color for inline chat inserted content.
uk: Колір маркера міні-карти для вмісту, вставленого в інтерактивний чат.

# editorOverviewRuler.inlineChatInserted
source: Overview ruler marker color for inline chat inserted content.
uk: Огляд кольору маркера лінійки для вставленого вмісту в чаті.

# editorOverviewRuler.inlineChatRemoved
source: Overview ruler marker color for inline chat removed content.
uk: Огляд кольору маркера лінійки для вмісту чату в рядку видалено.

# emptyLineHint
source: Whether empty lines show a hint to generate code with inline chat.
uk: Чи показують порожні рядки підказку для генерації коду з інтерактивним чатом.

# finishOnType
source: Whether to finish an inline chat session when typing outside of changed regions.
uk: Чи завершити сесію інтерактивного чату, коли вводите текст поза зміненими регіонами.

# holdToSpeech
source: Whether holding the inline chat keybinding will automatically enable speech recognition.
uk: Чи буде утримання клавіші прив'язки до інлайн-чату автоматично активувати розпізнавання мови.

# inlineChat.background
source: Background color of the interactive editor widget
uk: Колір фону інтерактивного віджету редактора

# inlineChat.border
source: Border color of the interactive editor widget
uk: Колір рамки віджета інтерактивного редактора

# inlineChat.foreground
source: Foreground color of the interactive editor widget
uk: Колір переднього плану інтерактивного віджета редактора

# inlineChat.shadow
source: Shadow color of the interactive editor widget
uk: Колір тіні інтерактивного віджета редактора

# inlineChatChangeHasDiff
source: Whether the current change supports showing a diff
uk: Чи підтримує поточна зміна відображення різниці

# inlineChatChangeShowsDiff
source: Whether the current change showing a diff
uk: Чи відображає поточна зміна різницю

# inlineChatDiff.inserted
source: Background color of inserted text in the interactive editor input
uk: Колір фону вставленого тексту в інтерактивному редакторі вводу

# inlineChatDiff.removed
source: Background color of removed text in the interactive editor input
uk: Колір фону видаленого тексту в інтерактивному редакторі вводу

# inlineChatEditing
source: Whether the user is currently editing or generating code in the inline chat
uk: Чи користувач наразі редагує або генерує код у вбудованому чаті

# inlineChatEmpty
source: Whether the interactive editor input is empty
uk: Чи є введення інтерактивного редактора порожнім

# inlineChatFocused
source: Whether the interactive editor input is focused
uk: Чи сфокусовано введення інтерактивного редактора

# inlineChatHasEditsAgent
source: Whether an agent for inliine for interactive editors exists
uk: Чи існує агент для inliine для інтерактивних редакторів

# inlineChatHasPossible
source: Whether a provider for inline chat exists and whether an editor for inline chat is open
uk: Чи існує постачальник для інтерактивного чату та чи відкритий редактор для інтерактивного чату

# inlineChatHasProvider
source: Whether a provider for interactive editors exists
uk: Чи існує постачальник для інтерактивних редакторів

# inlineChatHasStashedSession
source: Whether interactive editor has kept a session for quick restore
uk: Чи зберіг інтерактивний редактор сесію для швидкого відновлення

# inlineChatInnerCursorFirst
source: Whether the cursor of the iteractive editor input is on the first line
uk: Чи знаходиться курсор вводу інтерактивного редактора на першому рядку

# inlineChatInnerCursorLast
source: Whether the cursor of the iteractive editor input is on the last line
uk: Чи курсор інтерактивного редактора введення знаходиться на останньому рядку

# inlineChatInput.background
source: Background color of the interactive editor input
uk: Колір фону вводу інтерактивного редактора

# inlineChatInput.border
source: Border color of the interactive editor input
uk: Колір рамки вводу інтерактивного редактора

# inlineChatInput.focusBorder
source: Border color of the interactive editor input when focused
uk: Колір рамки вводу інтерактивного редактора при фокусуванні

# inlineChatInput.placeholderForeground
source: Foreground color of the interactive editor input placeholder
uk: Колір переднього плану плейсхолдера вводу інтерактивного редактора

# inlineChatOuterCursorPosition
source: Whether the cursor of the outer editor is above or below the interactive editor input
uk: Чи курсор зовнішнього редактора знаходиться вище або нижче вводу інтерактивного редактора

# inlineChatRequestInProgress
source: Whether an inline chat request is currently in progress
uk: Чи наразі триває запит на інтегрований чат

# inlineChatResponseFocused
source: Whether the interactive widget's response is focused
uk: Чи зосереджена відповідь інтерактивного віджета

# inlineChatResponseTypes
source: What type was the responses have been receieved, nothing yet, just messages, or messaged and local edits
uk: Який тип відповідей було отримано: нічого ще, лише повідомлення, або повідомлення та локальні редагування?

# inlineChatVisible
source: Whether the interactive editor input is visible
uk: Чи видимий ввід інтерактивного редактора

# lineSuffixHint
source: Whether lines that are dominated by natural language or pseudo code show a hint to continue with inline chat. For instance, `class Person with name and hobbies` would show a hint to continue with chat.
uk: Чи рядки, що домінують природною мовою або псевдокодом, показують підказку продовжити з інтерактивним чатом. Наприклад, `class Person with name and hobbies` показуватиме підказку продовжити з чатом.

source: Hold for Speech
uk: Утримуйте для мовлення
