Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_tasks.xlf
Languages: uk

# NamedProblemMatcherSchema.label
source: A human readable label of the problem matcher.
uk: Людсько зрозуміле позначення матчера проблем.

# NamedProblemMatcherSchema.name
source: The name of the problem matcher used to refer to it.
uk: Назва засобу для співставлення проблем, що використовується для його позначення.

# NamedProblemPatternSchema.name
source: The name of the problem pattern.
uk: Назва шаблону проблеми.

# PatternTypeSchema.description
source: A problem pattern or the name of a contributed or predefined problem pattern. Can be omitted if base is specified.
uk: Шаблон проблеми або назва внесеного чи попередньо визначеного шаблону проблеми. Може бути пропущено, якщо вказано базу.

# PatternTypeSchema.name
source: The name of a contributed or predefined pattern
uk: Назва внесеного або попередньо визначеного шаблону

# ProblemMatcherExtPoint
source: Contributes problem matchers
uk: Сприяє відповідності проблемам

# ProblemMatcherParser.invalidRegexp
source: Error: The string {0} is not a valid regular expression.
uk: Помилка: Рядок {0} не є дійсним регулярним виразом.

# ProblemMatcherParser.noDefinedPatter
source: Error: the pattern with the identifier {0} doesn't exist.
uk: Помилка: шаблон з ідентифікатором {0} не існує.

# ProblemMatcherParser.noFileLocation
source: Error: the description doesn't define a file location: {0}
uk: Помилка: опис не визначає місце розташування файлу: {0}

# ProblemMatcherParser.noIdentifier
source: Error: the pattern property refers to an empty identifier.
uk: Помилка: властивість шаблону посилається на порожній ідентифікатор.

# ProblemMatcherParser.noOwner
source: Error: the description doesn't define an owner: {0}
uk: Помилка: опис не визначає власника: {0}

# ProblemMatcherParser.noProblemMatcher
source: Error: the description can't be converted into a problem matcher: {0}
uk: Помилка: опис не може бути перетворений у відповідник проблеми: {0}

# ProblemMatcherParser.noProblemPattern
source: Error: the description doesn't define a valid problem pattern: {0}
uk: Помилка: опис не визначає дійсний шаблон проблеми: {0}

# ProblemMatcherParser.noValidIdentifier
source: Error: the pattern property {0} is not a valid pattern variable name.
uk: Помилка: властивість шаблону {0} не є дійсною назвою змінної шаблону.

# ProblemMatcherParser.problemPattern.watchingMatcher
source: A problem matcher must define both a begin pattern and an end pattern for watching.
uk: Відповідач проблеми повинен визначити як початковий шаблон, так і кінцевий шаблон для спостереження.

# ProblemMatcherParser.unknownSeverity
source: Info: unknown severity {0}. Valid values are error, warning and info.
uk: Інформація: невідомий рівень серйозності {0}. Дійсні значення: помилка, попередження та інформація.

# ProblemMatcherSchema.applyTo
source: Controls if a problem reported on a text document is applied only to open, closed or all documents.
uk: Контролює, чи проблема, зазначена в текстовому документі, стосується лише відкритих, закритих або всіх документів.

# ProblemMatcherSchema.background
source: Patterns to track the begin and end of a matcher active on a background task.
uk: Шаблони для відстеження початку та закінчення матчера, активного на фоновому завданні.

# ProblemMatcherSchema.background.activeOnStart
source: If set to true the background monitor starts in active mode. This is the same as outputting a line that matches beginsPattern when the task starts.
uk: Якщо встановлено значення true, монітор фону запускається в активному режимі. Це те саме, що і виведення рядка, який відповідає beginsPattern, коли завдання починається.

# ProblemMatcherSchema.background.beginsPattern
source: If matched in the output the start of a background task is signaled.
uk: Якщо виведення збігається, сигналізується про початок фонової задачі.

# ProblemMatcherSchema.background.endsPattern
source: If matched in the output the end of a background task is signaled.
uk: Якщо вивід збігається, сигналізується про закінчення фонової задачі.

# ProblemMatcherSchema.base
source: The name of a base problem matcher to use.
uk: Назва базового матчера проблем, який потрібно використовувати.

# ProblemMatcherSchema.fileLocation
source: Defines how file names reported in a problem pattern should be interpreted. A relative fileLocation may be an array, where the second element of the array is the path of the relative file location. The search fileLocation mode, performs a deep (and, possibly, heavy) file system search within the directories specified by the include/exclude properties of the second element (or the current workspace directory if not specified).
uk: Визначає, як імена файлів, що повідомляються в шаблоні проблеми, повинні інтерпретуватися. Відносний fileLocation може бути масивом, де другим елементом масиву є шлях до відносного місця розташування файлу. Режим пошуку fileLocation виконує глибокий (і, можливо, важкий) пошук у файловій системі в межах каталогів, зазначених у властивостях include/exclude другого елемента (або в каталозі поточної робочої області, якщо не зазначено).

# ProblemMatcherSchema.owner
source: The owner of the problem inside Code. Can be omitted if base is specified. Defaults to 'external' if omitted and base is not specified.
uk: Власник проблеми всередині коду. Може бути пропущено, якщо вказано базу. За замовчуванням 'external', якщо пропущено і база не вказана.

# ProblemMatcherSchema.severity
source: The default severity for captures problems. Is used if the pattern doesn't define a match group for severity.
uk: За замовчуванням, серйозність для захоплень проблем. Використовується, якщо шаблон не визначає групу відповідності для серйозності.

# ProblemMatcherSchema.source
source: A human-readable string describing the source of this diagnostic, e.g. 'typescript' or 'super lint'.
uk: Людсько зрозумілий рядок, що описує джерело цього діагностичного, наприклад, 'typescript' або 'super lint'.

# ProblemMatcherSchema.watching
source: Patterns to track the begin and end of a watching matcher.
uk: Шаблони для відстеження початку та кінця спостережувального матчера.

# ProblemMatcherSchema.watching.activeOnStart
source: If set to true the watcher starts in active mode. This is the same as outputting a line that matches beginsPattern when the task starts.
uk: Якщо встановлено значення true, спостерігач починає працювати в активному режимі. Це те ж саме, що виводити рядок, який відповідає beginsPattern, коли завдання починається.

# ProblemMatcherSchema.watching.beginsPattern
source: If matched in the output the start of a watching task is signaled.
uk: Якщо виведення співпадає, сигналізується початок завдання спостереження.

# ProblemMatcherSchema.watching.deprecated
source: The watching property is deprecated. Use background instead.
uk: Властивість watching застаріла. Використовуйте замість цього background.

# ProblemMatcherSchema.watching.endsPattern
source: If matched in the output the end of a watching task is signaled.
uk: Якщо вивід збігається, сигналізується про завершення завдання спостереження.

# ProblemPatternExtPoint
source: Contributes problem patterns
uk: Сприяє проблемним патернам

# ProblemPatternParser.invalidRegexp
source: Error: The string {0} is not a valid regular expression.
uk: Помилка: Рядок {0} не є дійсним регулярним виразом.

# ProblemPatternParser.loopProperty.notLast
source: The loop property is only supported on the last line matcher.
uk: Властивість циклу підтримується лише на останньому рядку, що відповідає шаблону.

# ProblemPatternParser.problemPattern.kindProperty.notFirst
source: The problem pattern is invalid. The kind property must be provided only in the first element
uk: Шаблон проблеми недійсний. Властивість kind повинна бути надана лише в першому елементі.

# ProblemPatternParser.problemPattern.missingLocation
source: The problem pattern is invalid. It must either have kind: "file" or have a line or location match group.
uk: Шаблон проблеми недійсний. Він повинен мати або kind: "file", або мати групу збігу рядка або місця.

# ProblemPatternParser.problemPattern.missingProperty
source: The problem pattern is invalid. It must have at least have a file and a message.
uk: Шаблон проблеми недійсний. Він повинен містити принаймні файл і повідомлення.

# ProblemPatternParser.problemPattern.missingRegExp
source: The problem pattern is missing a regular expression.
uk: Шаблон проблеми не містить регулярного виразу.

# ProblemPatternRegistry.error
source: Invalid problem pattern. The pattern will be ignored.
uk: Неправильний шаблон проблеми. Шаблон буде проігноровано.

# ProblemPatternSchema.code
source: The match group index of the problem's code. Defaults to undefined
uk: Індекс групи збігів коду проблеми. За замовчуванням - невизначено.

# ProblemPatternSchema.column
source: The match group index of the problem's line character. Defaults to 3
uk: Індекс групи збігів символу рядка проблеми. За замовчуванням 3

# ProblemPatternSchema.endColumn
source: The match group index of the problem's end line character. Defaults to undefined
uk: Індекс групи збігів символу кінцевого рядка проблеми. За замовчуванням - невизначено.

# ProblemPatternSchema.endLine
source: The match group index of the problem's end line. Defaults to undefined
uk: Індекс групи збігів кінцевого рядка проблеми. За замовчуванням невизначено.

# ProblemPatternSchema.file
source: The match group index of the filename. If omitted 1 is used.
uk: Індекс групи збігу імені файлу. Якщо пропущено, використовується 1.

# ProblemPatternSchema.kind
source: whether the pattern matches a location (file and line) or only a file.
uk: чи відповідає шаблон місцезнаходженню (файл і рядок) або лише файлу.

# ProblemPatternSchema.line
source: The match group index of the problem's line. Defaults to 2
uk: Індекс групи збігів рядка проблеми. За замовчуванням 2

# ProblemPatternSchema.location
source: The match group index of the problem's location. Valid location patterns are: (line), (line,column) and (startLine,startColumn,endLine,endColumn). If omitted (line,column) is assumed.
uk: Індекс групи збігів місця розташування проблеми. Дійсні шаблони місць розташування: (рядок), (рядок,стовпець) та (початковийРядок,початковийСтовпець,кінцевийРядок,кінцевийСтовпець). Якщо пропущено, вважається (рядок,стовпець).

# ProblemPatternSchema.loop
source: In a multi line matcher loop indicated whether this pattern is executed in a loop as long as it matches. Can only specified on a last pattern in a multi line pattern.
uk: У циклі відповідності для багаторядкових шаблонів вказується, чи виконується цей шаблон у циклі, поки він відповідає. Може бути вказано лише для останнього шаблону в багаторядковому шаблоні.

# ProblemPatternSchema.message
source: The match group index of the message. If omitted it defaults to 4 if location is specified. Otherwise it defaults to 5.
uk: Індекс групи збігів повідомлення. Якщо пропущено, за замовчуванням становить 4, якщо вказано місцезнаходження. В іншому випадку за замовчуванням становить 5.

# ProblemPatternSchema.regexp
source: The regular expression to find an error, warning or info in the output.
uk: Регулярний вираз для знаходження помилки, попередження або інформації в виході.

# ProblemPatternSchema.severity
source: The match group index of the problem's severity. Defaults to undefined
uk: Індекс групи відповідності тяжкості проблеми. За замовчуванням не визначено.

# WatchingPatternSchema.file
source: The match group index of the filename. Can be omitted.
uk: Індекс групи збігів імені файлу. Може бути пропущено.

# WatchingPatternSchema.regexp
source: The regular expression to detect the begin or end of a background task.
uk: Регулярний вираз для виявлення початку або закінчення фонової задачі.

# eslint-compact
source: ESLint compact problems
uk: ESLint компактні проблеми

# eslint-stylish
source: ESLint stylish problems
uk: Проблеми стилю ESLint

# go
source: Go problems
uk: Перейти до проблем

# gulp-tsc
source: Gulp TSC Problems
uk: Gulp TSC Проблеми

# jshint
source: JSHint problems
uk: Проблеми JSHint

# jshint-stylish
source: JSHint stylish problems
uk: Проблеми JSHint stylish

# lessCompile
source: Less problems
uk: Менше проблем

# msCompile
source: Microsoft compiler problems
uk: Проблеми компілятора Microsoft

# ConfigurationParser.inValidArg
source: Error: command argument must either be a string or a quoted string. Provided value is: {0}
uk: Помилка: аргумент команди повинен бути або рядком, або рядком у лапках. Надане значення: {0}

# ConfigurationParser.incorrectType
source: Error: the task configuration '{0}' is using an unknown type. The task configuration will be ignored.
uk: Помилка: конфігурація завдання '{0}' використовує невідомий тип. Конфігурація завдання буде проігнорована.

# ConfigurationParser.invalidCWD
source: Warning: options.cwd must be of type string. Ignoring value {0}
uk: Увага: options.cwd має бути типу рядка. Ігноруємо значення {0}

# ConfigurationParser.invalidVariableReference
source: Error: Invalid problemMatcher reference: {0}
uk: Помилка: Неправильне посилання на problemMatcher: {0}

# ConfigurationParser.missingType
source: Error: the task configuration '{0}' is missing the required property 'type'. The task configuration will be ignored.
uk: Помилка: конфігурація завдання '{0}' не містить обов'язкову властивість 'type'. Конфігурацію завдання буде проігноровано.

# ConfigurationParser.noName
source: Error: Problem Matcher in declare scope must have a name: {0}
uk: Помилка: Проблемний матчер у визначеній області повинен мати ім'я: {0}

# ConfigurationParser.noShell
source: Warning: shell configuration is only supported when executing tasks in the terminal.
uk: Увага: конфігурація оболонки підтримується лише під час виконання завдань у терміналі.

# ConfigurationParser.noTaskName
source: Error: a task must provide a label property. The task will be ignored. {0}
uk: Помилка: завдання повинно надавати властивість мітки. Завдання буде проігноровано. {0}

# ConfigurationParser.noTaskType
source: Error: tasks configuration must have a type property. The configuration will be ignored. {0}
uk: Помилка: конфігурація завдань повинна мати властивість типу. Конфігурація буде проігнорована. {0}

# ConfigurationParser.noTypeDefinition
source: Error: there is no registered task type '{0}'. Did you miss installing an extension that provides a corresponding task provider?
uk: Помилка: не зареєстровано тип завдання '{0}'. Ви пропустили встановлення розширення, яке надає відповідного постачальника завдань?

# ConfigurationParser.notCustom
source: Error: tasks is not declared as a custom task. The configuration will be ignored. {0}
uk: Помилка: tasks не оголошено як користувацьке завдання. Конфігурація буде проігнорована. {0}

# ConfigurationParser.unknownMatcherKind
source: Warning: the defined problem matcher is unknown. Supported types are string | ProblemMatcher | Array<string | ProblemMatcher>. {0}
uk: Увага: визначений матчер проблеми невідомий. Підтримувані типи: рядок | ProblemMatcher | Масив<string | ProblemMatcher>. {0}

# TaskParse.noOsSpecificGlobalTasks
source: Task version 2.0.0 doesn't support global OS specific tasks. Convert them to a task with a OS specific command. Affected tasks are: {0}
uk: Версія завдання 2.0.0 не підтримує глобальні завдання, специфічні для ОС. Перетворіть їх на завдання з командою, специфічною для ОС. Підлягають змінам завдання: {0}

# taskConfiguration.noCommand
source: Error: the task '{0}' doesn't define a command. The task will be ignored. Its definition is: {1}
uk: Помилка: завдання '{0}' не визначає команду. Завдання буде проігноровано. Його визначення: {1}

# taskConfiguration.noCommandOrDependsOn
source: Error: the task '{0}' neither specifies a command nor a dependsOn property. The task will be ignored. Its definition is: {1}
uk: Помилка: завдання '{0}' не вказує ні команди, ні властивість dependsOn. Завдання буде проігноровано. Його визначення: {1}

# taskConfiguration.providerUnavailable
source: Warning: {0} tasks are unavailable in the current environment.
uk: Увага: {0} завдань недоступні в поточному середовищі.

# TaskDefinition.description
source: The actual task type. Please note that types starting with a '$' are reserved for internal usage.
uk: Фактичний тип завдання. Зверніть увагу, що типи, що починаються з '$', зарезервовані для внутрішнього використання.

# TaskDefinition.properties
source: Additional properties of the task type
uk: Додаткові властивості типу завдання

# TaskDefinition.when
source: Condition which must be true to enable this type of task. Consider using `shellExecutionSupported`, `processExecutionSupported`, and `customExecutionSupported` as appropriate for this task definition. See the [API documentation](https://code.visualstudio.com/api/extension-guides/task-provider#when-clause) for more information.
uk: Умова, яка повинна бути істинною, щоб активувати цей тип завдання. Розгляньте можливість використання `shellExecutionSupported`, `processExecutionSupported` та `customExecutionSupported` відповідно до цього визначення завдання. Дивіться [документацію API](https://code.visualstudio.com/api/extension-guides/task-provider#when-clause) для отримання додаткової інформації.

# TaskDefinitionExtPoint
source: Contributes task kinds
uk: Сприяє видам завдань

# TaskTypeConfiguration.noType
source: The task type configuration is missing the required 'taskType' property
uk: Конфігурація типу завдання не містить обов'язкову властивість 'taskType'

# tasks.customExecutionSupported
source: Whether CustomExecution tasks are supported. Consider using in the when clause of a 'taskDefinition' contribution.
uk: Чи підтримуються завдання CustomExecution. Розгляньте можливість використання в умові when внесення 'taskDefinition'.

# tasks.processExecutionSupported
source: Whether ProcessExecution tasks are supported. Consider using in the when clause of a 'taskDefinition' contribution.
uk: Чи підтримуються завдання ProcessExecution. Розгляньте можливість використання в умовному виразі 'taskDefinition' внеску.

# tasks.serverlessWebContext
source: True when in the web with no remote authority.
uk: Правда, коли в мережі без віддаленої авторитетності.

# tasks.shellExecutionSupported
source: Whether ShellExecution tasks are supported. Consider using in the when clause of a 'taskDefinition' contribution.
uk: Чи підтримуються завдання ShellExecution. Розгляньте можливість використання в умовному виразі 'taskDefinition' внеску.

# tasks.taskCommandsRegistered
source: Whether the task commands have been registered yet
uk: Чи були вже зареєстровані команди завдання?

# Maven
source: Executes common maven commands
uk: Виконує загальні команди maven

# dotnetCore
source: Executes .NET Core build command
uk: Виконує команду збірки .NET Core

# externalCommand
source: Example to run an arbitrary external command
uk: Приклад виконання довільної зовнішньої команди

# msbuild
source: Executes the build target
uk: Виконує ціль збірки

# TaskDefinition.missingRequiredProperty
source: Error: the task identifier '{0}' is missing the required property '{1}'. The task identifier will be ignored.
uk: Помилка: ідентифікатор завдання '{0}' не містить обов'язкову властивість '{1}'. Ідентифікатор завдання буде проігноровано.

# taskTerminalActive
source: Whether the active terminal is a task terminal.
uk: Чи є активний термінал терміналом завдань.

# tasks.taskRunningContext
source: Whether a task is currently running.
uk: Чи виконується завдання в даний час.

# tasksCategory
source: Tasks
uk: Завдання

# TaskSystem.exitAnyways
source: &&Exit Anyways
uk: &&Вихід у будь-якому випадку

# TaskSystem.noProcess
source: The launched task doesn't exist anymore. If the task spawned background processes exiting VS Code might result in orphaned processes. To avoid this start the last background process with a wait flag.
uk: Запущене завдання більше не існує. Якщо завдання створило фонові процеси, вихід з VS Code може призвести до залишкових процесів. Щоб уникнути цього, запустіть останній фоновий процес з прапором очікування.

# TaskSystem.runningTask
source: There is a task running. Do you want to terminate it?
uk: Виконується завдання. Ви хочете його завершити?

# TaskSystem.terminateTask
source: &&Terminate Task
uk: &&Завершити задачу
