Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_notebook.xlf
Languages: uk

# notebook.focusedEditorBorder
source: The color of the notebook cell editor border.
uk: Колір рамки редактора комірки нотатника.

# notebook.inactiveFocusedCellBorder
source: The color of the cell's top and bottom border when a cell is focused while the primary focus is outside of the editor.
uk: Колір верхньої та нижньої межі комірки, коли комірка має фокус, а основний фокус знаходиться поза редактором.

# notebook.inactiveSelectedCellBorder
source: The color of the cell's borders when multiple cells are selected.
uk: Колір межі комірки, коли вибрано кілька комірок.

# notebook.outputContainerBackgroundColor
source: The color of the notebook output container background.
uk: Колір фону контейнера виводу блокнота.

# notebook.outputContainerBorderColor
source: The border color of the notebook output container.
uk: Колір межі контейнера виходу блокнота.

# notebook.selectedCellBorder
source: The color of the cell's top and bottom border when the cell is selected but not focused.
uk: Колір верхньої та нижньої межі комірки, коли комірка вибрана, але не в фокусі.

# notebook.symbolHighlightBackground
source: Background color of highlighted cell
uk: Колір фону виділеної комірки

# notebookEditorOverviewRuler.runningCellForeground
source: The color of the running cell decoration in the notebook editor overview ruler.
uk: Колір декоративного елемента активної клітинки в лінійці огляду редактора нотаток.

# notebookScrollbarSliderActiveBackground
source: Notebook scrollbar slider background color when clicked on.
uk: Колір фону повзунка прокрутки нотатника при натисканні.

# notebookScrollbarSliderBackground
source: Notebook scrollbar slider background color.
uk: Колір фону повзунка прокрутки нотатника.

# notebookScrollbarSliderHoverBackground
source: Notebook scrollbar slider background color when hovering.
uk: Колір фону повзунка прокрутки ноутбука при наведенні.

# notebookStatusErrorIcon.foreground
source: The error icon color of notebook cells in the cell status bar.
uk: Колір значка помилки комірок нотатника в панелі стану комірок.

# notebookStatusRunningIcon.foreground
source: The running icon color of notebook cells in the cell status bar.
uk: Колір іконки виконання комірок нотаток у панелі стану комірок.

# notebookStatusSuccessIcon.foreground
source: The error icon color of notebook cells in the cell status bar.
uk: Колір значка помилки комірок блокнота у панелі стану комірок.

# selectedCellBackground
source: The background color of a cell when the cell is selected.
uk: Колір фону комірки, коли комірка вибрана.

# Notebook name
source: Name
uk: Ім'я

# Notebook renderer name
source: Name
uk: Ім'я

# contributes.notebook.provider
source: Contributes notebook document provider.
uk: Сприяє постачальнику документів блокнота.

# contributes.notebook.provider.displayName
source: Human readable name of the notebook.
uk: Людсько зрозуміла назва блокнота.

# contributes.notebook.provider.selector
source: Set of globs that the notebook is for.
uk: Набір глобусів, для яких призначено блокнот.

# contributes.notebook.provider.selector.filenamePattern
source: Glob that the notebook is enabled for.
uk: Глоб, для якого увімкнено блокнот.

# contributes.notebook.provider.viewType
source: Type of the notebook.
uk: Тип ноутбука.

# contributes.notebook.renderer
source: Contributes notebook output renderer provider.
uk: Сприяє постачальнику рендерера виходу нотаток.

# contributes.notebook.renderer.displayName
source: Human readable name of the notebook output renderer.
uk: Людсько зрозуміла назва рендерера виходу блокнота.

# contributes.notebook.renderer.entrypoint
source: File to load in the webview to render the extension.
uk: Файл для завантаження у веб-переглядач для відображення розширення.

# contributes.notebook.renderer.entrypoint.extends
source: Existing renderer that this one extends.
uk: Існуючий рендерер, який цей розширює.

# contributes.notebook.renderer.hardDependencies
source: List of kernel dependencies the renderer requires. If any of the dependencies are present in the `NotebookKernel.preloads`, the renderer can be used.
uk: Список залежностей ядра, які потрібні рендереру. Якщо будь-які з залежностей присутні в `NotebookKernel.preloads`, рендерер може бути використаний.

# contributes.notebook.renderer.optionalDependencies
source: List of soft kernel dependencies the renderer can make use of. If any of the dependencies are present in the `NotebookKernel.preloads`, the renderer will be preferred over renderers that don't interact with the kernel.
uk: Список м'яких залежностей ядра, які може використовувати рендерер. Якщо будь-яка з залежностей присутня в `NotebookKernel.preloads`, рендерер буде віддаватися перевага над рендерерами, які не взаємодіють з ядром.

# contributes.notebook.renderer.requiresMessaging
source: Defines how and if the renderer needs to communicate with an extension host, via `createRendererMessaging`. Renderers with stronger messaging requirements may not work in all environments.
uk: Визначає, як і чи потрібно рендереру спілкуватися з хостом розширення, через `createRendererMessaging`. Рендерери з більш суворими вимогами до обміну повідомленнями можуть не працювати в усіх середовищах.

# contributes.notebook.renderer.requiresMessaging.always
source: Messaging is required. The renderer will only be used when it's part of an extension that can be run in an extension host.
uk: Повідомлення є обов'язковим. Рендерер буде використовуватися лише тоді, коли він є частиною розширення, яке можна запустити в хості розширень.

# contributes.notebook.renderer.requiresMessaging.never
source: The renderer does not require messaging.
uk: Рендерер не потребує повідомлень.

# contributes.notebook.renderer.requiresMessaging.optional
source: The renderer is better with messaging available, but it's not requried.
uk: Рендерер працює краще з доступним повідомленням, але це не є обов'язковим.

# contributes.notebook.renderer.viewType
source: Unique identifier of the notebook output renderer.
uk: Унікальний ідентифікатор рендерера виходу блокнота.

# contributes.notebook.selector
source: Set of globs that the notebook is for.
uk: Набір глобусів, для яких призначено нотатник.

# contributes.notebook.selector.provider.excludeFileNamePattern
source: Glob that the notebook is disabled for.
uk: Глоб, для якого ноутбук вимкнено.

# contributes.preload.entrypoint
source: Path to file loaded in the webview.
uk: Шлях до файлу, завантаженого в веб-переглядачі.

# contributes.preload.localResourceRoots
source: Paths to additional resources that should be allowed in the webview.
uk: Шляхи до додаткових ресурсів, які повинні бути дозволені в веб-переглядачі.

# contributes.preload.provider
source: Contributes notebook preloads.
uk: Сприяє попередньому завантаженню блокнотів.

# contributes.preload.provider.viewType
source: Type of the notebook.
uk: Тип ноутбука.

# contributes.priority
source: Controls if the custom editor is enabled automatically when the user opens a file. This may be overridden by users using the `workbench.editorAssociations` setting.
uk: Контролює, чи активується користувацький редактор автоматично, коли користувач відкриває файл. Це може бути переоприділено користувачами за допомогою налаштування `workbench.editorAssociations`.

# contributes.priority.default
source: The editor is automatically used when the user opens a resource, provided that no other default custom editors are registered for that resource.
uk: Редактор автоматично використовується, коли користувач відкриває ресурс, за умови, що для цього ресурсу не зареєстровано жодних інших редакторів за замовчуванням.

# contributes.priority.option
source: The editor is not automatically used when the user opens a resource, but a user can switch to the editor using the `Reopen With` command.
uk: Редактор не використовується автоматично, коли користувач відкриває ресурс, але користувач може переключитися на редактор, використовуючи команду `Reopen With`.

# notebookRenderer
source: Notebook Renderers
uk: Рендерери блокнотів

source: Notebooks
uk: Блокноти

# clearIcon
source: Icon to clear cell outputs in notebook editors.
uk: Іконка для очищення виходу клітинок у редакторах нотаток.

# collapsedIcon
source: Icon to annotate a collapsed section in notebook editors.
uk: Іконка для анотації згорнутого розділу в редакторах нотаток.

# copyIcon
source: Icon to copy content to clipboard
uk: Іконка для копіювання вмісту в буфер обміну

# deleteCellIcon
source: Icon to delete a cell in notebook editors.
uk: Іконка для видалення клітинки в редакторах нотаток.

# editIcon
source: Icon to edit a cell in notebook editors.
uk: Іконка для редагування комірки в редакторах нотаток.

# errorStateIcon
source: Icon to indicate an error state in notebook editors.
uk: Іконка для вказівки на стан помилки в редакторах нотаток.

# executeAboveIcon
source: Icon to execute above cells in notebook editors.
uk: Іконка для виконання вищезазначених клітинок у редакторах нотаток.

# executeAllIcon
source: Icon to execute all cells in notebook editors.
uk: Іконка для виконання всіх клітинок у редакторах блокнотів.

# executeBelowIcon
source: Icon to execute below cells in notebook editors.
uk: Іконка для виконання нижченаведених комірок у редакторах нотаток.

# executeIcon
source: Icon to execute in notebook editors.
uk: Іконка для виконання в редакторах нотаток.

# executingStateIcon
source: Icon to indicate an executing state in notebook editors.
uk: Іконка для позначення стану виконання в редакторах нотаток.

# expandedIcon
source: Icon to annotate an expanded section in notebook editors.
uk: Іконка для анотації розширеного розділу в редакторах нотаток.

# mimetypeIcon
source: Icon for a mime type in notebook editors.
uk: Іконка для типу MIME в редакторах нотаток.

# moveDownIcon
source: Icon to move down a cell in notebook editors.
uk: Іконка для переміщення вниз по клітинці в редакторах нотаток.

# moveUpIcon
source: Icon to move up a cell in notebook editors.
uk: Іконка для переміщення вгору на клітинку в редакторах нотаток.

# nextChangeIcon
source: Icon for the next change action in the diff editor.
uk: Іконка для наступної дії зміни в редакторі відмінностей.

# openAsTextIcon
source: Icon to open the notebook in a text editor.
uk: Іконка для відкриття блокнота в текстовому редакторі.

# pendingStateIcon
source: Icon to indicate a pending state in notebook editors.
uk: Іконка для позначення очікувального стану в редакторах нотаток.

# previousChangeIcon
source: Icon for the previous change action in the diff editor.
uk: Іконка для попередньої дії зміни в редакторі порівняння.

# renderOutputIcon
source: Icon to render output in diff editor.
uk: Іконка для відображення виходу в редакторі порівняння.

# revertIcon
source: Icon to revert in notebook editors.
uk: Іконка для скасування в редакторах нотаток.

# selectKernelIcon
source: Configure icon to select a kernel in notebook editors.
uk: Налаштуйте значок для вибору ядра в редакторах нотаток.

# splitCellIcon
source: Icon to split a cell in notebook editors.
uk: Іконка для розділення клітинки в редакторах нотаток.

# stopEditIcon
source: Icon to stop editing a cell in notebook editors.
uk: Іконка для зупинки редагування клітинки в редакторах нотаток.

# stopIcon
source: Icon to stop an execution in notebook editors.
uk: Іконка для зупинки виконання в редакторах нотаток.

# successStateIcon
source: Icon to indicate a success state in notebook editors.
uk: Іконка для позначення стану успіху в редакторах нотаток.

# toggleWhitespace
source: Icon for the toggle whitespace action in the diff editor.
uk: Іконка для дії перемикання пробілів у редакторі порівняння.

# variablesViewIcon
source: View icon of the variables view.
uk: Переглянути значок перегляду змінних.

source: Notebook Output Editor
uk: Редактор виходу нотаток

# notebookOutputEditorInput
source: Notebook Output Preview
uk: Попередній перегляд виходу нотатника

# notebookRunTrust
source: Executing a notebook cell will run code from this workspace.
uk: Виконання клітинки нотатника запустить код з цього робочого простору.

# workbench.notebook.clearNotebookKernelsMRUCache
source: Clear Notebook Kernels MRU Cache
uk: Очистити кеш MRU ядер блокнота

# disableOtherKeymapsConfirmation
source: Disable other keymaps ({0}) to avoid conflicts between keybindings?
uk: Вимкніть інші клавіатурні розкладки ({0}), щоб уникнути конфліктів між клавішами?

source: No
uk: Ні

source: Yes
uk: Так

# renderChannelName
source: Notebook
uk: Блокнот

# notebook.cell.toggleLineNumbers.title
source: Show Cell Line Numbers
uk: Показати номери клітинних ліній

# notebook.lineNumbers
source: Controls the display of line numbers in the cell editor.
uk: Контролює відображення номерів рядків у редакторі клітинок.

# installJupyterPrompt
source: Install additional renderers from the marketplace
uk: Встановіть додаткові рендерери з маркетплейсу.

# pickMimeType
source: Change Presentation
uk: Змінити презентацію

# promptChooseMimeTypeInSecure.placeHolder
source: Select mimetype to render for current output
uk: Виберіть тип MIME для відображення для поточного виходу. Багаті типи MIME доступні лише тоді, коли блокнот довірений.

# unavailableRenderInfo
source: renderer not available
uk: рендерер недоступний

# cellExpandInputButtonLabel
source: Expand Cell Input ({0})
uk: Розширити введення клітинки ({0})

# cellExpandInputButtonLabelWithDoubleClick
source: Double-click to expand cell input ({0})
uk: Двічі клацніть, щоб розгорнути введення в клітинку ({0})

# notebook.cell.status.failure
source: Failure
uk: Невдача

# notebook.moreRunActionsLabel
source: More...
uk: Більше...

# cellExpandOutputButtonLabel
source: Expand Cell Output (${0})
uk: Розширити вихідні дані комірки (${0})

# cellExpandOutputButtonLabelWithDoubleClick
source: Double-click to expand cell output ({0})
uk: Двічі клацніть, щоб розгорнути вихідні дані комірки ({0})

# cellOutputsCollapsedMsg
source: Outputs are collapsed
uk: Виводи згорнуті

# hiddenCellsLabel
source: 1 cell hidden
uk: 1 комірка прихована

# hiddenCellsLabelPlural
source: {0} cells hidden
uk: {0} клітин приховано

# notebook.emptyMarkdownPlaceholder
source: Empty markdown cell, double-click or press enter to edit.
uk: Порожня markdown-осередок, двічі клацніть або натисніть Enter, щоб редагувати.

# notebook.error.rendererFallbacksExhausted
source: Could not render content for '$0'
uk: Не вдалося відобразити вміст для '$0'

# notebook.error.rendererNotFound
source: No renderer found for '$0'
uk: Не знайдено рендерера для '$0'

# webview title
source: Notebook webview content
uk: Зміст веб-перегляду нотатника

# cellExecutionOrderCountLabel
source: Execution Order
uk: Порядок виконання

# empty
source: empty cell
uk: Клітинка не має виходу

# current1
source: Currently Selected
uk: Наразі вибрано

# current2
source: {0} - Currently Selected
uk: {0} - В даний час обрано

# installSuggestedKernel
source: Install/Enable suggested extensions
uk: Встановити/Увімкнути рекомендовані розширення

# kernels.detecting
source: Detecting Kernels
uk: Виявлення ядер

# kernels.selectedKernelAndKernelDetectionRunning
source: Selected Kernel: {0} (Kernel Detection Tasks Running)
uk: Вибраний ядро: {0} (Виконуються завдання виявлення ядра)

# learnMoreTooltip
source: Learn More
uk: Дізнатися більше

# prompt.placeholder.change
source: Change kernel for '{0}'
uk: Змінити ядро для '{0}'

# prompt.placeholder.select
source: Select kernel for '{0}'
uk: Виберіть ядро для '{0}'

# searchForKernels
source: Browse marketplace for kernel extensions
uk: Перегляньте ринок для розширень ядра

# select
source: Select Kernel
uk: Виберіть ядро

source: Select Another Kernel
uk: Виберіть інший ядро

# selectAnotherKernel.more
source: Select Another Kernel...
uk: Вибрати інший ядро...

# selectKernel.placeholder
source: Type to choose a kernel source
uk: Наберіть, щоб вибрати джерело ядра

# selectKernelFromExtension
source: Select Kernel from {0}
uk: Виберіть Ядро з {0}

# notebookActions.selectKernel
source: Select Notebook Kernel
uk: Виберіть ядро блокнота

# notebookActions.selectKernel.args
source: Notebook Kernel Args
uk: Аргументи ядра нотатника

# workbench.notebook.developer.addViewZones
source: Toggle Notebook View Zones
uk: Перемкнути зони перегляду нотаток

# vetoAutoExtHostRestart
source: An extension provided notebook for '{0}' is still open that would close otherwise.
uk: Розширення, що надає блокнот для '{0}', все ще відкритий, який інакше закрився б.

# vetoExtHostRestart
source: An extension provided notebook for '{0}' could not be saved.
uk: Розширення, що надає блокнот для '{0}', не вдалося зберегти.
