Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_configuration.xlf
Languages: uk

# configurationDefaults.description
source: Contribute defaults for configurations
uk: Внести значення за замовчуванням для конфігурацій

# setting description
source: Configure settings to be applied for all profiles.
uk: Налаштуйте параметри, які будуть застосовані для всіх профілів.

# errorConfigurationFileDirty
source: Unable to write into user settings because the file has unsaved changes. Please save the user settings file first and then try again.
uk: Неможливо записати в налаштування користувача, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть файл налаштувань користувача, а потім спробуйте ще раз.

# errorConfigurationFileDirtyFolder
source: Unable to write into folder settings because the file has unsaved changes. Please save the '{0}' folder settings file first and then try again.
uk: Неможливо записати в налаштування папки, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть файл налаштувань папки '{0}', а потім спробуйте ще раз.

# errorConfigurationFileDirtyWorkspace
source: Unable to write into workspace settings because the file has unsaved changes. Please save the workspace settings file first and then try again.
uk: Неможливо записати в налаштування робочого простору, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть файл налаштувань робочого простору, а потім спробуйте ще раз.

# errorConfigurationFileModifiedSince
source: Unable to write into user settings because the content of the file is newer.
uk: Неможливо записати в налаштування користувача, оскільки вміст файлу новіший.

# errorConfigurationFileModifiedSinceFolder
source: Unable to write into folder settings because the content of the file is newer.
uk: Неможливо записати в папку налаштувань, оскільки вміст файлу новіший.

# errorConfigurationFileModifiedSinceWorkspace
source: Unable to write into workspace settings because the content of the file is newer.
uk: Неможливо записати в налаштування робочого простору, оскільки вміст файлу новіший.

# errorInvalidConfiguration
source: Unable to write into user settings. Please open the user settings to correct errors/warnings in it and try again.
uk: Неможливо записати в налаштування користувача. Будь ласка, відкрийте налаштування користувача, щоб виправити помилки/попередження в них, і спробуйте ще раз.

# errorInvalidConfigurationFolder
source: Unable to write into folder settings. Please open the '{0}' folder settings to correct errors/warnings in it and try again.
uk: Неможливо записати в налаштування папки. Будь ласка, відкрийте налаштування папки '{0}', щоб виправити помилки/попередження в ньому та спробуйте ще раз.

# errorInvalidConfigurationWorkspace
source: Unable to write into workspace settings. Please open the workspace settings to correct errors/warnings in the file and try again.
uk: Неможливо записати в налаштування робочого простору. Будь ласка, відкрийте налаштування робочого простору, щоб виправити помилки/попередження у файлі та спробуйте ще раз.

# errorInvalidFolderConfiguration
source: Unable to write to Folder Settings because {0} does not support the folder resource scope.
uk: Не вдається записати в Налаштування папки, оскільки {0} не підтримує область ресурсу папки.

# errorInvalidFolderTarget
source: Unable to write to Folder Settings because no resource is provided.
uk: Неможливо записати в Налаштування папки, оскільки не надано жодного ресурсу.

# errorInvalidLaunchConfiguration
source: Unable to write into the launch configuration file. Please open it to correct errors/warnings in it and try again.
uk: Неможливо записати в файл конфігурації запуску. Будь ласка, відкрийте його, щоб виправити помилки/попередження в ньому, і спробуйте ще раз.

# errorInvalidRemoteConfiguration
source: Unable to write into remote user settings. Please open the remote user settings to correct errors/warnings in it and try again.
uk: Неможливо записати в налаштування віддаленого користувача. Будь ласка, відкрийте налаштування віддаленого користувача, щоб виправити помилки/попередження в них, і спробуйте ще раз.

# errorInvalidResourceLanguageConfiguration
source: Unable to write to Language Settings because {0} is not a resource language setting.
uk: Неможливо записати в Налаштування мови, оскільки {0} не є налаштуванням мови ресурсу.

# errorInvalidTaskConfiguration
source: Unable to write into the tasks configuration file. Please open it to correct errors/warnings in it and try again.
uk: Неможливо записати в конфігураційний файл завдань. Будь ласка, відкрийте його, щоб виправити помилки/попередження в ньому, і спробуйте ще раз.

# errorInvalidUserTarget
source: Unable to write to User Settings because {0} does not support for global scope.
uk: Неможливо записати в Налаштування користувача, оскільки {0} не підтримує глобальну область.

# errorInvalidWorkspaceConfigurationApplication
source: Unable to write {0} to Workspace Settings. This setting can be written only into User settings.
uk: Неможливо записати {0} у Налаштування робочого простору. Це налаштування можна записати лише в Налаштування користувача.

# errorInvalidWorkspaceConfigurationMachine
source: Unable to write {0} to Workspace Settings. This setting can be written only into User settings.
uk: Неможливо записати {0} у Налаштування робочого простору. Це налаштування можна записати лише в Налаштуваннях користувача.

# errorInvalidWorkspaceTarget
source: Unable to write to Workspace Settings because {0} does not support for workspace scope in a multi folder workspace.
uk: Неможливо записати налаштування робочого простору, оскільки {0} не підтримує область робочого простору в багатопапковому робочому просторі.

# errorLaunchConfigurationFileDirty
source: Unable to write into launch configuration file because the file has unsaved changes. Please save it first and then try again.
uk: Неможливо записати в файл конфігурації запуску, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть його, а потім спробуйте ще раз.

# errorLaunchConfigurationFileModifiedSince
source: Unable to write into launch configuration file because the content of the file is newer.
uk: Неможливо записати в файл конфігурації запуску, оскільки вміст файлу новіший.

# errorNoWorkspaceOpened
source: Unable to write to {0} because no workspace is opened. Please open a workspace first and try again.
uk: Неможливо записати в {0}, оскільки жоден робочий простір не відкрито. Будь ласка, спочатку відкрийте робочий простір і спробуйте ще раз.

# errorPolicyConfiguration
source: Unable to write {0} because it is configured in system policy.
uk: Неможливо записати {0}, оскільки він налаштований у системній політиці.

# errorRemoteConfigurationFileDirty
source: Unable to write into remote user settings because the file has unsaved changes. Please save the remote user settings file first and then try again.
uk: Неможливо записати в налаштування віддаленого користувача, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть файл налаштувань віддаленого користувача, а потім спробуйте ще раз.

# errorRemoteConfigurationFileModifiedSince
source: Unable to write into remote user settings because the content of the file is newer.
uk: Неможливо записати в налаштування віддаленого користувача, оскільки вміст файлу новіший.

# errorTasksConfigurationFileDirty
source: Unable to write into tasks configuration file because the file has unsaved changes. Please save it first and then try again.
uk: Неможливо записати в файл конфігурації завдань, оскільки файл має незбережені зміни. Будь ласка, спочатку збережіть його, а потім спробуйте ще раз.

# errorTasksConfigurationFileModifiedSince
source: Unable to write into tasks configuration file because the content of the file is newer.
uk: Неможливо записати в конфігураційний файл завдань, оскільки вміст файлу новіший.

# errorUnknown
source: Unable to write to {0} because of an internal error.
uk: Неможливо записати в {0} через внутрішню помилку.

# errorUnknownKey
source: Unable to write to {0} because {1} is not a registered configuration.
uk: Неможливо записати в {0}, оскільки {1} не є зареєстрованою конфігурацією.

# folderTarget
source: Folder Settings
uk: Налаштування папки

# fsError
source: Error while writing to {0}. {1}
uk: Помилка під час запису в {0}. {1}

# open
source: Open Settings
uk: Відкрити Налаштування

source: Open Launch Configuration
uk: Відкрити конфігурацію запуску

source: Open Tasks Configuration
uk: Відкрити конфігурацію завдань

# remoteUserTarget
source: Remote User Settings
uk: Налаштування віддаленого користувача

source: Save and Retry
uk: Зберегти та спробувати знову

# userTarget
source: User Settings
uk: Налаштування користувача

# workspaceTarget
source: Workspace Settings
uk: Налаштування робочого простору

# errorInvalidFile
source: Unable to write into the file. Please open the file to correct errors/warnings in the file and try again.
uk: Неможливо записати у файл. Будь ласка, відкрийте файл, щоб виправити помилки/попередження у файлі та спробуйте ще раз.
