Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_format.xlf
Languages: uk

# config
source: Configure Default Formatter...
uk: Налаштувати форматування за замовчуванням...

# config.bad
source: Extension '{0}' is configured as formatter but not available. Select a different default formatter to continue.
uk: Розширення '{0}' налаштоване як форматер, але недоступне. Виберіть інший форматер за замовчуванням, щоб продовжити.

# config.needed
source: There are multiple formatters for '{0}' files. One of them should be configured as default formatter.
uk: Існує кілька форматувачів для файлів '{0}'. Один з них повинен бути налаштований як форматувач за замовчуванням.

# def
source: (default)
uk: (за замовчуванням)

# do.config
source: &&Configure...
uk: &&Налаштувати...

# do.config.command
source: Configure...
uk: Налаштувати...

# do.config.notification
source: Configure...
uk: Налаштувати...

# format.placeHolder
source: Select a formatter
uk: Виберіть форматер

# formatDocument.label.multiple
source: Format Document With...
uk: Форматувати документ за допомогою...

# formatSelection.label.multiple
source: Format Selection With...
uk: Формат вибору з...

# formatter
source: Formatting
uk: Форматування

# formatter.default
source: Defines a default formatter which takes precedence over all other formatter settings. Must be the identifier of an extension contributing a formatter.
uk: Визначає форматер за замовчуванням, який має пріоритет над усіма іншими налаштуваннями форматера. Повинен бути ідентифікатором розширення, що надає форматер.

# miss
source: Configure Default Formatter
uk: Налаштувати форматування за замовчуванням

# miss.1
source: Extension '{0}' is configured as formatter but it cannot format '{1}'-files
uk: Розширення '{0}' налаштоване як форматер, але не може форматувати файли '{1}'.

# miss.2
source: Extension '{0}' is configured as formatter but it can only format '{1}'-files as a whole, not selections or parts of it.
uk: Розширення '{0}' налаштоване як форматер, але воно може форматувати лише файли '{1}' цілком, а не вибірки чи їх частини.

# null
source: None
uk: Ніщо

# nullFormatterDescription
source: None
uk: Ні

# select
source: Select a default formatter for '{0}' files
uk: Виберіть форматувальник за замовчуванням для файлів '{0}'

# summary
source: Formatter Conflicts
uk: Конфлікти форматування

# formatDocument.label.multiple
source: Format Document
uk: Форматувати документ за допомогою...

source: &&Install Formatter...
uk: &&Встановити форматер...

# no.provider
source: There is no formatter for '{0}' files installed.
uk: Форматувача для файлів '{0}' не встановлено.

# too.large
source: This file cannot be formatted because it is too large
uk: Цей файл не може бути відформатований, оскільки він занадто великий

# formatChanges
source: Format Modified Lines
uk: Форматувати змінені рядки
