Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_performance.xlf
Languages: uk

# cycles
source: Print Service Cycles
uk: Друк сервісних циклів

# emitter
source: Print Emitter Profiles
uk: Друк профілів викидача

# insta.trace
source: Print Service Traces
uk: Друк служби трасування

# show.label
source: Startup Performance
uk: Продуктивність стартапу

# name
source: Startup Performance
uk: Продуктивність стартапу

# experimental.rendererProfiling
source: When enabled, slow renderers are automatically profiled.
uk: Коли увімкнено, повільні рендерери автоматично профілюються.

# prof.detail
source: Please create an issue and manually attach the following files: {0}
uk: Будь ласка, створіть проблему та вручну прикріпіть наступні файли: {0}

# prof.detail.restart
source: A final restart is required to continue to use '{0}'. Again, thank you for your contribution.
uk: Для продовження використання '{0}' потрібен фінальний перезапуск. Ще раз дякуємо за ваш внесок.

# prof.message
source: Successfully created profiles.
uk: Успішно створено профілі.

# prof.restart
source: Restart
uk: Перезапустити

# prof.restart.button
source: &&Restart
uk: &&Перезапустити

# prof.restartAndFileIssue
source: &&Create Issue and Restart
uk: &&Створити задачу та перезапустити

# prof.thanks
source: Thanks for helping us.
uk: Дякуємо за вашу допомогу.
