Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_interactive.xlf
Languages: uk

# interactive.activeCodeBorder
source: The border color for the current interactive code cell when the editor has focus.
uk: Колір рамки для поточної інтерактивної кодової клітини, коли редактор має фокус.

# interactive.execute
source: Execute Code
uk: Виконати код

# interactive.history.focus
source: Focus History
uk: Історія фокусу

# interactive.history.next
source: Next value in history
uk: Наступне значення в історії

# interactive.history.previous
source: Previous value in history
uk: Попереднє значення в історії

# interactive.inactiveCodeBorder
source: The border color for the current interactive code cell when the editor does not have focus.
uk: Колір межі для поточної інтерактивної кодової клітинки, коли редактор не має фокусу.

# interactive.input.clear
source: Clear the interactive window input editor contents
uk: Очистити вміст редактора вводу інтерактивного вікна

# interactive.input.focus
source: Focus Input Editor
uk: Редактор введення фокусу

# interactive.open
source: Open Interactive Window
uk: Відкрити інтерактивне вікно

# interactiveScrollToBottom
source: Scroll to Bottom
uk: Прокрутити донизу

# interactiveScrollToTop
source: Scroll to Top
uk: Прокрутити вгору

source: Interactive Window
uk: Інтерактивне вікно

# interactiveWindow.alwaysScrollOnNewCell
source: Automatically scroll the interactive window to show the output of the last statement executed. If this value is false, the window will only scroll if the last cell was already the one scrolled to.
uk: Автоматично прокручувати інтерактивне вікно, щоб показати вихід останнього виконаного оператору. Якщо це значення є хибним, вікно буде прокручуватися лише в тому випадку, якщо остання клітинка вже була прокручена.

# interactiveWindow.executeWithShiftEnter
source: Execute the Interactive Window (REPL) input box with shift+enter, so that enter can be used to create a newline.
uk: Виконайте поле введення Інтерактивного вікна (REPL) за допомогою shift+enter, щоб enter можна було використовувати для створення нового рядка.

# interactiveWindow.promptToSaveOnClose
source: Prompt to save the interactive window when it is closed. Only new interactive windows will be affected by this setting change.
uk: Запит на збереження інтерактивного вікна при його закритті. Ця зміна налаштувань вплине лише на нові інтерактивні вікна.

# interactiveWindow.showExecutionHint
source: Display a hint in the Interactive Window (REPL) input box to indicate how to execute code.
uk: Відобразіть підказку в полі введення Інтерактивного вікна (REPL), щоб вказати, як виконати код.

# ReplInputAriaLabelHelp
source: Use {0} for accessibility help.
uk: Використовуйте {0} для допомоги з доступністю.

# ReplInputAriaLabelHelpNoKb
source: Run the Open Accessibility Help command for more information.
uk: Виконайте команду Open Accessibility Help для отримання додаткової інформації.

# disableHint
source: Toggle {0} in settings to disable this hint.
uk: Увімкніть {0} у налаштуваннях, щоб вимкнути це підказку.

# emptyHintText
source: Press {0} to execute.
uk: Натисніть {0}, щоб виконати.
