Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_markdown.xlf
Languages: uk

# alreadysetBoolFalse
source: "{0}: {1}" is already disabled
uk: "{0}: {1}" вже вимкнено

# alreadysetBoolTrue
source: "{0}: {1}" is already enabled
uk: "{0}: {1}" вже увімкнено

# alreadysetNum
source: "{0}: {1}" is already set to {2}
uk: {0}: {1}" вже встановлено на {2}

# alreadysetString
source: "{0}: {1}" is already set to "{2}"
uk: {0}: {1}" вже встановлено на "{2}

# changeSettingTitle
source: View or change setting
uk: Переглянути або змінити налаштування

source: Copy Setting ID
uk: Копіювати ID налаштування

# falseMessage
source: Disable "{0}: {1}"
uk: Вимкнути "{0}: {1}"

# numberValue
source: Set "{0}: {1}" to {2}
uk: Встановіть "{0}: {1}" на {2}

# restorePreviousValue
source: Restore value of "{0}: {1}"
uk: Відновити значення "{0}: {1}"

# stringValue
source: Set "{0}: {1}" to "{2}"
uk: Встановіть "{0}: {1}" на "{2}"

# trueMessage
source: Enable "{0}: {1}"
uk: Увімкнути "{0}: {1}"

source: View in Settings
uk: Переглянути в Налаштуваннях

# viewInSettingsDetailed
source: View "{0}: {1}" in Settings
uk: Переглянути "{0}: {1}" у Налаштуваннях
