Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# move side bar right
source: Move Primary Side Bar Right
uk: Перемістити основну бокову панель вправо

# move sidebar left
source: Move Primary Side Bar Left
uk: Перемістити основну бічну панель вліво

source: Move Editor Actions to Tab Bar
uk: Перемістити дії редактора на панель вкладок

# moveEditorActionsToTabBarDescription
source: Move Editor Actions from the title bar to the tab bar
uk: Перемістіть дії редактора з рядка заголовка на панель вкладок

source: Move Editor Actions to Title Bar
uk: Перемістити дії редактора на панель заголовка

# moveEditorActionsToTitleBarDescription
source: Move Editor Actions from the tab bar to the title bar
uk: Перемістіть дії редактора з панелі вкладок на панель заголовка

source: Move Focused View
uk: Перемістити фокусований вигляд

# moveFocusedView.error.noFocusedView
source: There is no view currently focused.
uk: Зараз немає зосередженого вигляду.

# moveFocusedView.error.nonMovableView
source: The currently focused view is not movable.
uk: Поточний фокусований вигляд не є рухомим.

# moveFocusedView.newContainerInPanel
source: New Panel Entry
uk: Новий запис панелі

# moveFocusedView.newContainerInSidePanel
source: New Secondary Side Bar Entry
uk: Новий запис бокової панелі вторинного рівня

# moveFocusedView.newContainerInSidebar
source: New Side Bar Entry
uk: Новий запис бокової панелі

# moveFocusedView.selectDestination
source: Select a Destination for the View
uk: Виберіть місце призначення для перегляду

# moveFocusedView.selectView
source: Select a View to Move
uk: Виберіть вигляд для переміщення

# moveFocusedView.title
source: View: Move {0}
uk: Перегляд: Перемістити {0}

# moveSidebarLeft
source: Move Primary Side Bar Left
uk: Перемістити основну бічну панель вліво

# moveSidebarRight
source: Move Primary Side Bar Right
uk: Перемістити основну бічну панель вправо

source: Move View
uk: Перемістити перегляд

# openAndCloseSidebar
source: Open/Show and Close/Hide Sidebar
uk: Відкрити/Показати та Закрити/Сховати Бокову панель

source: Panel
uk: Панель

source: Panel Alignment
uk: Вирівнювання панелі

# panelBottom
source: Represents the bottom panel
uk: Представляє нижню панель

# panelBottomCenter
source: Represents the bottom panel alignment set to the center
uk: Представляє вирівнювання нижньої панелі, встановлене по центру

# panelBottomJustify
source: Represents the bottom panel alignment set to justified
uk: Представляє вирівнювання нижньої панелі, встановлене на виправлене

# panelBottomLeft
source: Represents the bottom panel alignment set to the left
uk: Представляє вирівнювання нижньої панелі, встановлене зліва

# panelBottomRight
source: Represents the bottom panel alignment set to the right
uk: Представляє вирівнювання нижньої панелі, встановлене праворуч

# panelContainer
source: Panel / {0}
uk: Панель / {0}

# panelLeft
source: Represents a side bar in the left position
uk: Представляє бічну панель у лівому положенні

# panelLeftOff
source: Represents a side bar in the left position toggled off
uk: Представляє бокову панель у лівому положенні, вимкнену

# panelRight
source: Represents side bar in the right position
uk: Представляє бокову панель у правильному положенні

# panelRightOff
source: Represents side bar in the right position toggled off
uk: Представляє бокову панель у правому положенні, вимкнено

source: Primary Side Bar
uk: Основна бічна панель

# primary sidebar mnemonic
source: &&Primary Side Bar
uk: &&Головна бічна панель

# quickInputAlignmentCenter
source: Represents quick input alignment set to the center
uk: Представляє швидке вирівнювання введення, встановлене по центру

# quickInputAlignmentTop
source: Represents quick input alignment set to the top
uk: Представляє швидке вирівнювання введення, встановлене вгорі

# quickOpen
source: Quick Input Position
uk: Швидке введення позиції

# resetFocusedView.error.noFocusedView
source: There is no view currently focused.
uk: Зараз немає зосередженого виду.

source: Reset Focused View Location
uk: Скинути місцезнаходження сфокусованого виду

source: Reset View Locations
uk: Скинути місця перегляду

source: Restore Defaults
uk: Відновити за замовчуванням

# rightPanel
source: Right
uk: Правильно

# rightSideBar
source: Right
uk: Правильно

source: Secondary Side Bar
uk: Бокова панель вторинного рівня

# secondarySideBarContainer
source: Secondary Side Bar / {0}
uk: Бокова панель вторинного боку / {0}

source: Select to Hide
uk: Вибрати, щоб приховати

source: Select to Show
uk: Вибрати для показу

# showEditorActons
source: Show Editor Actions
uk: Показати дії редактора

# showEditorActonsDescription
source: Make Editor Actions visible.
uk: Зробити дії редактора видимими.

source: Show Multiple Editor Tabs
uk: Показати кілька вкладок редактора

# showMultipleEditorTabsDescription
source: Show Tab Bar with multiple tabs
uk: Показати панель вкладок з кількома вкладками

# showMultipleEditorTabsZenMode
source: Show Multiple Editor Tabs in Zen Mode
uk: Показати кілька вкладок редактора в режимі Zen

# showMultipleEditorTabsZenModeDescription
source: Show Tab Bar in Zen Mode
uk: Показати панель вкладок у режимі Zen

source: Show Single Editor Tab
uk: Показати одну вкладку редактора

# showSingleEditorTabDescription
source: Show Tab Bar with one Tab
uk: Показати панель вкладок з однією вкладкою

# showSingleEditorTabZenMode
source: Show Single Editor Tab in Zen Mode
uk: Показати одну вкладку редактора в режимі Zen

# showSingleEditorTabZenModeDescription
source: Show Tab Bar in Zen Mode with one Tab
uk: Показати панель вкладок у режимі Zen з однією вкладкою

# sideBar
source: Primary Side Bar
uk: Основна бокова панель

# sideBarPosition
source: Primary Side Bar Position
uk: Позиція бічної панелі первинного рівня

source: Side Bar
uk: Бічна панель

# sidebarContainer
source: Side Bar / {0}
uk: Бокова панель / {0}

# sidebarHidden
source: Primary Side Bar hidden
uk: Основна бічна панель прихована

# sidebarVisible
source: Primary Side Bar shown
uk: Показано основну бокову панель

source: Status Bar
uk: Рядок стану

# statusBarIcon
source: Represents the status bar
uk: Представляє панель стану

source: Tab Bar
uk: Панель вкладок

source: Toggle Centered Layout
uk: Перемкнути центровану розкладку

# toggleEditor
source: Toggle Editor Area Visibility
uk: Перемикання видимості області редактора

source: Toggle Menu Bar
uk: Перемикання панелі меню

# toggleSeparatePinnedEditorTabs
source: Separate Pinned Editor Tabs
uk: Окремі закріплені вкладки редактора

# toggleSeparatePinnedEditorTabsDescription
source: Toggle whether pinned editor tabs are shown on a separate row above unpinned tabs.
uk: Перемикайте, чи показувати закріплені вкладки редактора на окремому рядку над незакріпленими вкладками.

# toggleSideBar
source: Toggle Primary Side Bar
uk: Перемикання основної бічної панелі

# toggleSidebar
source: Toggle Primary Side Bar Visibility
uk: Перемикання видимості основної бокової панелі

# toggleSidebarPosition
source: Toggle Primary Side Bar Position
uk: Перемикання позиції основної бокової панелі

# toggleStatusbar
source: Toggle Status Bar Visibility
uk: Перемикання видимості панелі стану

# toggleVisibility
source: Visibility
uk: Видимість

source: Toggle Zen Mode
uk: Перемкнути режим Зен

source: Top
uk: Верх

source: Zen Mode
uk: Режим Зен

# zenModeIcon
source: Represents zen mode
uk: Представляє режим дзен

# mitoggleTreeStickyScroll
source: &&Toggle Tree Sticky Scroll
uk: &&Перемкнути закріплене прокручування дерева

source: Toggle Tree Sticky Scroll
uk: Перемикати закріплену прокрутку дерева

# toggleTreeStickyScrollDescription
source: Toggles Sticky Scroll widget at the top of tree structures such as the File Explorer and Debug variables View.
uk: Перемикає віджет фіксованого прокручування вгорі деревоподібних структур, таких як Провідник файлів та Перегляд змінних налагодження.

source: Focus Next Part
uk: Зосередитися на наступній частині

source: Focus Previous Part
uk: Зосередити попередню частину

# navigateDown
source: Navigate to the View Below
uk: Перейдіть до перегляду нижче

# navigateLeft
source: Navigate to the View on the Left
uk: Перейдіть до Перегляду зліва

# navigateRight
source: Navigate to the View on the Right
uk: Перейдіть до перегляду праворуч

# navigateUp
source: Navigate to the View Above
uk: Перейдіть до перегляду зверху

# quickNavigateNext
source: Navigate Next in Quick Open
uk: Перейти до Наступного в Швидкому Відкритті

# quickNavigatePrevious
source: Navigate Previous in Quick Open
uk: Перейти до попереднього в Швидкому відкритті

# quickOpen
source: Go to File...
uk: Швидке введення позиції

# quickOpenWithModes
source: Quick Open
uk: Швидке відкриття

# quickSelectNext
source: Select Next in Quick Open
uk: Виберіть Далі у Швидкому Відкритті

# quickSelectPrevious
source: Select Previous in Quick Open
uk: Виберіть Попередній у Швидкому Відкритті

source: Copy
uk: Копіювати

source: Cut
uk: Вирізати

source: Paste
uk: Вставити

source: Redo
uk: Перезробити

source: Select All
uk: Вибрати все

source: Undo
uk: Скасувати

source: About
uk: Про

# blur
source: Remove keyboard focus from focused element
uk: Зняти фокус з елемента, на якому є фокус клавіатури

# dirtyFolder
source: Folder with Unsaved Files
uk: Папка з незбереженими файлами

# dirtyFolderConfirm
source: Do you want to open the folder to review the unsaved files?
uk: Ви хочете відкрити папку, щоб переглянути незбережені файли?

# dirtyFolderConfirmDetail
source: Folders with unsaved files cannot be removed until all unsaved files have been saved or reverted.
uk: Папки з незбереженими файлами не можуть бути видалені, поки всі незбережені файли не будуть збережені або скасовані.

# dirtyRecentlyOpenedFolder
source: Folder With Unsaved Files
uk: Папка з незбереженими файлами

# dirtyRecentlyOpenedWorkspace
source: Workspace With Unsaved Files
uk: Робоча область з незбереженими файлами

# dirtyWorkspace
source: Workspace with Unsaved Files
uk: Робоча область з незбереженими файлами

# dirtyWorkspaceConfirm
source: Do you want to open the workspace to review the unsaved files?
uk: Ви хочете відкрити робочу область, щоб переглянути незбережені файли?

# dirtyWorkspaceConfirmDetail
source: Workspaces with unsaved files cannot be removed until all unsaved files have been saved or reverted.
uk: Робочі простори з незбереженими файлами не можуть бути видалені, поки всі незбережені файли не будуть збережені або скасовані.

source: files
uk: файли

source: folders
uk: папки

# miAbout
source: &&About
uk: &&Про нас

# miConfirmClose
source: Confirm Before Close
uk: Підтвердити перед закриттям

# miMore
source: &&More...
uk: &&Більше...

# miNewWindow
source: New &&Window
uk: Нове &&вікно

# miOpenRecent
source: Open &&Recent
uk: Відкрити &&останні

# miToggleFullScreen
source: &&Full Screen
uk: &&Повний екран

source: New Window
uk: Нове вікно

source: Open Recent...
uk: Відкрити нещодавні...

# openRecentPlaceholder
source: Select to open (hold Ctrl-key to force new window or Alt-key for same window)
uk: Виберіть, щоб відкрити (утримуйте клавішу Ctrl, щоб примусити відкрити в новому вікні, або клавішу Alt для того ж вікна)

# openRecentPlaceholderMac
source: Select to open (hold Cmd-key to force new window or Option-key for same window)
uk: Виберіть, щоб відкрити (утримуйте клавішу Cmd, щоб примусово відкрити нове вікно, або клавішу Option для того ж вікна)

source: Quick Open Recent...
uk: Швидке відкриття нещодавніх...

# recentDirtyFolderAriaLabel
source: {0}, folder with unsaved changes
uk: {0}, папка з незбереженими змінами

# recentDirtyWorkspaceAriaLabel
source: {0}, workspace with unsaved changes
uk: {0}, робочий простір з незбереженими змінами

source: Reload Window
uk: Перезавантажити вікно

# remove
source: Remove from Recently Opened
uk: Видалити з нещодавно відкритих

source: Toggle Full Screen
uk: Перемкнути повний екран

# workspacesAndFolders
source: folders & workspaces
uk: папки та робочі простори

source: Close Workspace
uk: Закрити робочий простір

source: Duplicate Workspace
uk: Дублювати робочий простір

# duplicateWorkspaceInNewWindow
source: Duplicate As Workspace in New Window
uk: Дублювати як робочий простір у новому вікні

# globalRemoveFolderFromWorkspace
source: Remove Folder from Workspace...
uk: Видалити папку з робочого простору...

# miAddFolderToWorkspace
source: A&&dd Folder to Workspace...
uk: Д&&одати папку до робочої області...

# miCloseFolder
source: Close &&Folder
uk: Закрити &&папку

# miCloseWorkspace
source: Close &&Workspace
uk: Закрити &&робочий простір

# miOpen
source: &&Open...
uk: &&Відкрити...

# miOpenFile
source: &&Open File...
uk: &&Відкрити файл...

# miOpenFolder
source: Open &&Folder...
uk: Відкрити &&папку...

# miOpenWorkspace
source: Open Wor&&kspace from File...
uk: Відкрити ро&&бочий простір з файлу...

# miSaveWorkspaceAs
source: Save Workspace As...
uk: Зберегти робоче середовище як...

source: Open File...
uk: Відкрити файл...

# openFileFolder
source: Open...
uk: Відкрити...

source: Open Folder...
uk: Відкрити папку...

# openWorkspaceAction
source: Open Workspace from File...
uk: Відкрити робочий простір з файлу...

# openWorkspaceConfigFile
source: Open Workspace Configuration File
uk: Відкрити файл конфігурації робочого простору

# saveWorkspaceAsAction
source: Save Workspace As...
uk: Зберегти робоче середовище як...

source: Workspaces
uk: Робочі простори

source: &&Add
uk: &&Додати

source: Add Folder to Workspace...
uk: Додати папку до робочого простору...

# addFolderToWorkspaceTitle
source: Add Folder to Workspace
uk: Додати папку до робочої області

# workspaceFolderPickerPlaceholder
source: Select workspace folder
uk: Виберіть папку робочого простору

# pinned
source: {0}, pinned
uk: {0}, закріплено

# preview
source: {0}, preview
uk: Показати &&попередній перегляд

# notebookCellLabel
source: {0} • Cell {1}
uk: {0} • Ячейка {1}

# notebookCellOutputLabel
source: {0} • Cell {1} • Output {2}
uk: {0} • Осередок {1} • Вихід {2}

# notebookCellOutputLabelSimple
source: {0} • Cell {1} • Output
uk: {0} • Ячейка {1} • Вихід

source: Activity Bar Position
uk: Позиція панелі активності

source: Bottom
uk: Низ

source: Focus Activity Bar
uk: Панель активності фокусу

# hide
source: Hidden
uk: Схований

source: Hide Activity Bar
uk: Сховати панель активності

source: Hide Menu
uk: Сховати меню

source: Menu
uk: Меню

# miBottomActivityBar
source: &&Bottom
uk: &&Низ

# miDefaultActivityBar
source: &&Default
uk: &&За замовчуванням

# miHideActivityBar
source: &&Hidden
uk: &&Прихований

# miTopActivityBar
source: &&Top
uk: &&Верхній

# nextSideBarView
source: Next Primary Side Bar View
uk: Наступний основний бічний бар перегляду

# positionActivituBar
source: Activity Bar Position
uk: Позиція панелі активності

# positionActivityBarBottom
source: Move Activity Bar to Bottom
uk: Перемістити панель активності вниз

# positionActivityBarDefault
source: Move Activity Bar to Side
uk: Перемістити панель активності на бік

# positionActivityBarTop
source: Move Activity Bar to Top
uk: Перемістити панель активності вгору

# previousSideBarView
source: Previous Primary Side Bar View
uk: Попередній вигляд бічної панелі первинного боку

# auxiliaryBarHidden
source: Secondary Side Bar hidden
uk: Секундарна бічна панель прихована

# auxiliaryBarVisible
source: Secondary Side Bar shown
uk: Показано бічну панель вторинного боку

# closeIcon
source: Icon to close the secondary side bar.
uk: Іконка для закриття вторинної бокової панелі.

# closeSecondarySideBar
source: Hide Secondary Side Bar
uk: Сховати вторинну бокову панель

# focusAuxiliaryBar
source: Focus into Secondary Side Bar
uk: Фокус на вторинній боковій панелі

# hideAuxiliaryBar
source: Hide Secondary Side Bar
uk: Сховати вторинну бокову панель

# maximizeAuxiliaryBar
source: Maximize Secondary Side Bar
uk: Максимізувати бокову панель вторинного рівня

# maximizeAuxiliaryBarTooltip
source: Maximize Secondary Side Bar Size
uk: Максимізувати розмір бокової панелі вторинного боку

# maximizeIcon
source: Icon to maximize the secondary side bar.
uk: Іконка для розгортання вторинної бокової панелі.

# miCloseSecondarySideBar
source: &&Secondary Side Bar
uk: &&Другорядна бічна панель

# nextAuxiliaryBarView
source: Next Secondary Side Bar View
uk: Наступний бічний вигляд вторинної сторони

# openAndCloseAuxiliaryBar
source: Open/Show and Close/Hide Secondary Side Bar
uk: Відкрити/Показати та Закрити/Сховати вторинну бічну панель

# previousAuxiliaryBarView
source: Previous Secondary Side Bar View
uk: Попередній вигляд бічної панелі вторинного боку

# restoreAuxiliaryBar
source: Restore Secondary Side Bar
uk: Відновити бічну панель вторинного рівня

# restoreAuxiliaryBarTooltip
source: Restore Secondary Side Bar Size
uk: Відновити розмір бокової панелі вторинного рівня

# toggleAuxiliaryBar
source: Toggle Secondary Side Bar Visibility
uk: Перемикати видимість вторинної бокової панелі

# toggleAuxiliaryIconLeft
source: Icon to toggle the secondary side bar in its left position.
uk: Іконка для перемикання вторинної бічної панелі у її лівому положенні.

# toggleAuxiliaryIconLeftOn
source: Icon to toggle the secondary side bar on in its left position.
uk: Іконка для перемикання вторинної бічної панелі в її лівому положенні.

# toggleAuxiliaryIconRight
source: Icon to toggle the secondary side bar off in its right position.
uk: Іконка для вимкнення вторинної бокової панелі у її правому положенні.

# toggleAuxiliaryIconRightOn
source: Icon to toggle the secondary side bar on in its right position.
uk: Іконка для перемикання вторинної бокової панелі у її правому положенні.

# toggleMaximizedAuxiliaryBar
source: Toggle Maximized Secondary Side Bar
uk: Перемкнути максимізовану бічну панель вторинного боку

source: Toggle Secondary Side Bar
uk: Перемкнути вторинну бокову панель

# hide second side bar
source: Hide Secondary Side Bar
uk: Сховати вторинну бічну панель

# move second side bar left
source: Move Secondary Side Bar Left
uk: Перемістити бокову панель праворуч

# move second side bar right
source: Move Secondary Side Bar Right
uk: Перемістити бічну панель праворуч

source: Show Icons
uk: Показати значки

source: Show Labels
uk: Показати мітки

source: Close Banner
uk: Закрити банер

source: Focus Banner
uk: Банер фокусу

# activityBarAriaLabel
source: Active View Switcher
uk: Перемикач активного вигляду

source: Additional Views
uk: Додаткові перегляди

# hide
source: Hide '{0}'
uk: Схований

source: Hide Badge
uk: Сховати значок

# keep
source: Keep '{0}'
uk: Зберегти {0}

source: Show Badge
uk: Показати значок

# toggle
source: Toggle View Pinned
uk: Перемикання перегляду закріплених

# toggleBadge
source: Toggle View Badge
uk: Перемкнути значок перегляду

# ariaCompositeToolbarLabel
source: {0} actions
uk: {0} дій

source: Views and More Actions...
uk: Перегляди та інші дії...

source: &&Copy
uk: Копіювати

source: OK
uk: &&Гаразд

# disableCompactAuxiliaryWindow
source: Turn Off Compact Mode
uk: Вимкнути компактний режим

# enableCompactAuxiliaryWindow
source: Turn On Compact Mode
uk: Увімкнути компактний режим

# toggleCompactAuxiliaryWindow
source: Toggle Window Compact Mode
uk: Переключити компактний режим вікна

# binaryEditor
source: Binary Viewer
uk: Бінарний переглядач

# binaryError
source: The file is not displayed in the text editor because it is either binary or uses an unsupported text encoding.
uk: Файл не відображається в текстовому редакторі, оскільки він є бінарним або використовує неподтримуване текстове кодування.

source: Open Anyway
uk: Відкрити все одно

# enabled
source: Enable/disable navigation breadcrumbs.
uk: Увімкнути/вимкнути навігаційні крихти.

# filepath
source: Controls whether and how file paths are shown in the breadcrumbs view.
uk: Контролює, чи та як шляхи до файлів відображаються у вигляді хлібних крихт.

# filepath.last
source: Only show the last element of the file path in the breadcrumbs view.
uk: Показувати лише останній елемент шляху файлу в режимі хлібних крихт.

# filepath.off
source: Do not show the file path in the breadcrumbs view.
uk: Не показувати шлях до файлу в режимі хлібних крихт.

# filepath.on
source: Show the file path in the breadcrumbs view.
uk: Показати шлях до файлу у вигляді хлібних крихт.

# filteredTypes.array
source: When enabled breadcrumbs show `array`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `array`.

# filteredTypes.boolean
source: When enabled breadcrumbs show `boolean`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `boolean`.

# filteredTypes.class
source: When enabled breadcrumbs show `class`-symbols.
uk: Коли ввімкнено, хлібні крихти показують символи `class`.

# filteredTypes.constant
source: When enabled breadcrumbs show `constant`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `constant`.

# filteredTypes.constructor
source: When enabled breadcrumbs show `constructor`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `constructor`.

# filteredTypes.enum
source: When enabled breadcrumbs show `enum`-symbols.
uk: Коли увімкнено, хлібні крихти показують `enum`-символи.

# filteredTypes.enumMember
source: When enabled breadcrumbs show `enumMember`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `enumMember`.

# filteredTypes.event
source: When enabled breadcrumbs show `event`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `event`.

# filteredTypes.field
source: When enabled breadcrumbs show `field`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `field`.

# filteredTypes.file
source: When enabled breadcrumbs show `file`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `file`.

# filteredTypes.function
source: When enabled breadcrumbs show `function`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `function`.

# filteredTypes.interface
source: When enabled breadcrumbs show `interface`-symbols.
uk: Коли ввімкнено, хлібні крихти показують символи `interface`.

# filteredTypes.key
source: When enabled breadcrumbs show `key`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `key`.

# filteredTypes.method
source: When enabled breadcrumbs show `method`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `method`.

# filteredTypes.module
source: When enabled breadcrumbs show `module`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `module`.

# filteredTypes.namespace
source: When enabled breadcrumbs show `namespace`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `namespace`.

# filteredTypes.null
source: When enabled breadcrumbs show `null`-symbols.
uk: Коли ввімкнено, хлібні крихти показують символи `null`.

# filteredTypes.number
source: When enabled breadcrumbs show `number`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `number`.

# filteredTypes.object
source: When enabled breadcrumbs show `object`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `object`.

# filteredTypes.operator
source: When enabled breadcrumbs show `operator`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `operator`.

# filteredTypes.package
source: When enabled breadcrumbs show `package`-symbols.
uk: Коли ввімкнено, хлібні крихти показують символи `package`.

# filteredTypes.property
source: When enabled breadcrumbs show `property`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `property`.

# filteredTypes.string
source: When enabled breadcrumbs show `string`-symbols.
uk: Коли увімкнено, хлібні крихти показують `string`-символи.

# filteredTypes.struct
source: When enabled breadcrumbs show `struct`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `struct`.

# filteredTypes.typeParameter
source: When enabled breadcrumbs show `typeParameter`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `typeParameter`.
