Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_mcp.xlf
Languages: uk

# app.mcp.json.type
source: The type of the server.
uk: Тип сервера.

# app.mcp.json.url
source: The URL of the Streamable HTTP or SSE endpoint.
uk: URL потоку HTTP або SSE.

# app.mcp.json.url.pattern
source: The URL must start with 'http://' or 'https://'.
uk: URL повинен починатися з 'http://' або 'https://'.

source: ID
uk: Ідентифікатор

# mcp.discovery.source.claude-desktop.config
source: Claude Desktop configuration (`claude_desktop_config.json`)
uk: Конфігурація настільного додатку Claude (`claude_desktop_config.json`)

# mcp.discovery.source.cursor-global
source: Cursor (Global)
uk: Курсор (Глобальний)

# mcp.discovery.source.cursor-global.config
source: Cursor global configuration (`~/.cursor/mcp.json`)
uk: Глобальна конфігурація курсора (`~/.cursor/mcp.json`)

# mcp.discovery.source.cursor-workspace
source: Cursor (Workspace)
uk: Курсор (Робоча область)

# mcp.discovery.source.cursor-workspace.config
source: Cursor workspace configuration (`.cursor/mcp.json`)
uk: Конфігурація робочого простору курсора (`.cursor/mcp.json`)

# mcp.discovery.source.windsurf
source: Windsurf
uk: Вітрильний серфінг

# mcp.discovery.source.windsurf.config
source: Windsurf configurations (`~/.codeium/windsurf/mcp_config.json`)
uk: Конфігурації віндсерфінгу (`~/.codeium/windsurf/mcp_config.json`)

# mcpServerDefinitionProviders
source: MCP Servers
uk: Сервери MCP

source: Name
uk: Назва розширення

# vscode.extension.contributes.mcp
source: Contributes Model Context Protocol servers. Users of this should also use `vscode.lm.registerMcpServerDefinitionProvider`.
uk: Сприяє серверам протоколу контексту моделі. Користувачі цього також повинні використовувати `vscode.lm.registerMcpServerDefinitionProvider`.

# vscode.extension.contributes.mcp.id
source: Unique ID for the collection.
uk: Унікальний ідентифікатор для колекції.

# vscode.extension.contributes.mcp.label
source: Display name for the collection.
uk: Відображуване ім'я для колекції.

# vscode.extension.contributes.mcp.when
source: Condition which must be true to enable this collection.
uk: Умова, яка повинна бути істинною, щоб активувати цю колекцію.

# mcp.hasServersWithErrors.description
source: Indicates whether there are any MCP servers with errors.
uk: Вказує, чи є які-небудь сервери MCP з помилками.

# mcp.hasUnknownTools.description
source: Indicates whether there are MCP servers with unknown tools.
uk: Вказує, чи є сервери MCP з невідомими інструментами.

# mcp.serverCount.description
source: Context key that has the number of registered MCP servers
uk: Контекстний ключ, що містить кількість зареєстрованих серверів MCP

# mcp.toolsCount.description
source: Context key that has the number of registered MCP tools
uk: Контекстний ключ, що містить кількість зареєстрованих інструментів MCP

# mcp.debug.nodeBinReq
source: MCP server must be launched with the "node" executable to enable debugging, but was launched with "{0}"
uk: Сервер MCP повинен бути запущений з виконуваним файлом "node" для активації налагодження, але був запущений з "{0}"

# mcp.debug.pythonBinReq
source: MCP server must be launched with the "python" executable to enable debugging, but was launched with "{0}"
uk: Сервер MCP повинен бути запущений з виконуваним файлом "python" для активації налагодження, але був запущений з "{0}"

# mcp.tool.warning
source: Note that MCP servers or malicious conversation content may attempt to misuse '{0}' through tools.
uk: Зверніть увагу, що сервери MCP або шкідливий вміст розмов можуть намагатися зловживати '{0}' за допомогою інструментів.

# mcp.toolset
source: {0}: All Tools
uk: {0}: Усі інструменти

# msg.ran
source: Ran {0}
uk: Запущено {0}

# msg.run
source: Running {0}
uk: Запуск {0}

# msg.title
source: Run {0}
uk: Запустити {0}

# mcp.launchError
source: Error starting {0}: {1}
uk: Помилка при запуску {0}: {1}

# mcp.launchError.openConfig
source: Open Configuration
uk: Відкрити конфігурацію

# mcp.trust.details
source: The MCP server {0} was updated. MCP servers may add context to your chat session and lead to unexpected behavior. Do you want to trust and run this server?
uk: Сервер MCP {0} був оновлений. Сервери MCP можуть додати контекст до вашої чат-сесії та призвести до несподіваної поведінки. Ви хочете довіряти та запустити цей сервер?

# mcp.trust.detailsMulti
source: Several updated MCP servers were discovered: {0} MCP servers may add context to your chat session and lead to unexpected behavior. Do you want to trust and run these server?
uk: Було виявлено кілька оновлених серверів MCP: {0} Сервери MCP можуть додати контекст до вашої чат-сесії та призвести до несподіваної поведінки. Чи хочете ви довіряти цим серверам і запустити їх?

# mcp.trust.no
source: Do not trust
uk: Не довіряйте

# mcp.trust.pick
source: Pick Trusted
uk: Виберіть надійний

# mcp.trust.yes
source: Trust
uk: Довіра

# trustFromExt
source: from {0}
uk: з {0}

# trustTitleWithOrigin
source: Trust and run MCP server {0}?
uk: Довіртеся і запустіть сервер MCP {0}?

# trustTitleWithOriginMulti
source: Trust and run {0} MCP servers?
uk: Довіряти та запускати {0} MCP сервери?

# mcp.sampling.rpd
source: {0} total requests in the last 7 days.
uk: {0} загальних запитів за останні 7 днів.

source: Configure
uk: Налаштувати

# mcp.sampling.allow.always
source: Always
uk: Завжди

# mcp.sampling.allow.inSession
source: Allow in this Session
uk: Дозволити в цій сесії

# mcp.sampling.allow.never
source: Never
uk: Ніколи

# mcp.sampling.allow.notNow
source: Not Now
uk: Не зараз

# mcp.sampling.allowDuringChat.desc
source: The MCP server "{0}" has issued a request to make a language model call. Do you want to allow it to make requests during chat?
uk: Сервер MCP "{0}" надіслав запит на виклик мовної моделі. Чи хочете ви дозволити йому робити запити під час чату?

# mcp.sampling.allowDuringChat.title
source: Allow MCP tools from "{0}" to make LLM requests?
uk: Дозволити інструментам MCP з "{0}" робити запити LLM?

# mcp.sampling.allowOutsideChat.desc
source: The MCP server "{0}" has issued a request to make a language model call. Do you want to allow it to make requests, outside of tool calls during chat?
uk: Сервер MCP "{0}" надіслав запит на виклик мовної моделі. Чи хочете ви дозволити йому робити запити, поза викликами інструментів під час чату?

# mcp.sampling.allowOutsideChat.title
source: Allow MCP server "{0}" to make LLM requests?
uk: Дозволити серверу MCP "{0}" робити запити LLM?

# mcp.sampling.needsModels
source: MCP server "{0}" triggered a language model request, but it has no allowlisted models.
uk: Сервер MCP "{0}" ініціював запит до мовної моделі, але не має моделей у списку дозволених.

# mcpBadSchema
source: MCP server `{0}` has tools with invalid parameters which will be omitted.
uk: Сервер MCP `{0}` має інструменти з недійсними параметрами, які будуть пропущені.

# mcpBadSchema.show
source: Show
uk: Показати

# mcpBadSchema.tool
source: Tool `{0}` has invalid JSON parameters:
uk: Інструмент `{0}` має недійсні параметри JSON:

# mcpDebugPyHelp
source: The command "{0}" was not found. You can specify the path to debugpy in the `dev.debug.debugpyPath` option.
uk: Команду "{0}" не знайдено. Ви можете вказати шлях до debugpy в опції `dev.debug.debugpyPath`.

# mcpServerError
source: The MCP server {0} could not be started: {1}
uk: Сервер MCP {0} не вдалося запустити: {1}

# mcpServerInstall
source: Install {0}
uk: Встановити {0}

# mcpServerNotFound
source: The command "{0}" needed to run {1} was not found.
uk: Команда "{0}", необхідна для виконання {1}, не була знайдена.

# mcpViewDocs
source: View Docs
uk: Переглянути документи

# mcpServer.starting
source: Starting server {0}
uk: Запуск сервера {0}

# mcpServer.state
source: Connection state: {0}
uk: Стан з'єднання: {0}

# mcpServer.stopping
source: Stopping server {0}
uk: Зупинка сервера {0}

# mcpstate.error
source: Error {0}
uk: Помилка {0}

# mcpstate.running
source: Running
uk: Запуск

# mcpstate.starting
source: Starting
uk: Початок

# mcpstate.stopped
source: Stopped
uk: Зупинено
