Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# filteredTypes.variable
source: When enabled breadcrumbs show `variable`-symbols.
uk: Коли увімкнено, хлібні крихти показують символи `variable`.

# icons
source: Render breadcrumb items with icons.
uk: Відобразити елементи хлібних крихт з іконками.

# symbolSortOrder
source: Controls how symbols are sorted in the breadcrumbs outline view.
uk: Контролює, як символи сортуються в огляді хлібних крихт.

# symbolSortOrder.name
source: Show symbol outline in alphabetical order.
uk: Показати контур символів в алфавітному порядку.

# symbolSortOrder.position
source: Show symbol outline in file position order.
uk: Показати контур символу в порядку позицій файлу.

# symbolSortOrder.type
source: Show symbol outline in symbol type order.
uk: Показати контур символу в порядку типу символу.

# symbolpath
source: Controls whether and how symbols are shown in the breadcrumbs view.
uk: Контролює, чи і як символи відображаються в режимі хлібних крихт.

# symbolpath.last
source: Only show the current symbol in the breadcrumbs view.
uk: Показувати лише поточний символ у вигляді хлібних крихт.

# symbolpath.off
source: Do not show symbols in the breadcrumbs view.
uk: Не показувати символи в перегляді хлібних крихт.

# symbolpath.on
source: Show all symbols in the breadcrumbs view.
uk: Показати всі символи в режимі хлібних крихт.

# title
source: Breadcrumb Navigation
uk: Навігація за хлібними крихтами

# breadcrumbsActive
source: Whether breadcrumbs have focus
uk: Чи мають хлібні крихти фокус

# breadcrumbsPossible
source: Whether the editor can show breadcrumbs
uk: Чи може редактор показувати хлібні крихти

# breadcrumbsVisible
source: Whether breadcrumbs are currently visible
uk: Чи хлібні крихти наразі видимі

# cmd.focus
source: Focus Breadcrumbs
uk: Хлібні крихти фокусу

# cmd.focusAndSelect
source: Focus and Select Breadcrumbs
uk: Зосередитися та вибрати хлібні крихти

# cmd.toggle
source: Toggle Breadcrumbs
uk: Перемикати хлібні крихти

# cmd.toggle2
source: Toggle Breadcrumbs
uk: Перемикати хлібні крихти

# empty
source: no elements
uk: немає елементів

# miBreadcrumbs2
source: &&Breadcrumbs
uk: &&Хлібні крихти

# separatorIcon
source: Icon for the separator in the breadcrumbs.
uk: Іконка для роздільника в хлібних крихтах.

source: Breadcrumbs
uk: Хлібні крихти

source: Compare
uk: Порівняти

# compare.nextChange
source: Go to Next Change
uk: Перейти до наступної зміни

# compare.openSide
source: Open Active Diff Side
uk: Відкрити активну диференційну сторону

# compare.previousChange
source: Go to Previous Change
uk: Перейти до попередньої зміни

# swapDiffSides
source: Swap Left and Right Editor Side
uk: Поміняти місцями ліву та праву сторони редактора

source: Toggle Inline View
uk: Перемкнути вбудований вигляд

# activeGroupEditorsByMostRecentlyUsedQuickAccess
source: Show Editors in Active Group by Most Recently Used
uk: Показати редакторів у активній групі за останнім використанням

# allEditorsByAppearanceQuickAccess
source: Show All Opened Editors By Appearance
uk: Показати всі відкриті редактори за зовнішнім виглядом

# allEditorsByMostRecentlyUsedQuickAccess
source: Show All Opened Editors By Most Recently Used
uk: Показати всі відкриті редактори за останнім використанням

source: Binary Diff Editor
uk: Бінарний диф-редактор

source: Close All
uk: Закрити все

# closeAllSaved
source: Close Saved
uk: Закрити збережене

source: Close Editor
uk: Закрити редактор

source: Close Editor Group
uk: Закрити групу редактора

# closeEditorsInGroup
source: Close All Editors in Group
uk: Закрити всі редактори в групі

# closeGroupAction
source: Close Group
uk: Закрити групу

# closeOtherEditors
source: Close Other Editors in Group
uk: Закрити інші редактори в групі

source: Close Others
uk: Закрити інших

source: Close Pinned Editor
uk: Закрити закріплений редактор

# closeRight
source: Close to the Right
uk: Близько до Правого

# closeRightEditors
source: Close Editors to the Right in Group
uk: Закрити редактори праворуч у групі

# closeSavedEditors
source: Close Saved Editors in Group
uk: Закрити збережені редактори в групі

# copyEditorGroupToNewWindow
source: Copy into New Window
uk: Копіювати в нове вікно

# copyEditorToNewWindow
source: Copy Editor into New Window
uk: Копіювати редактора у нове вікно

# copyToNewWindow
source: Copy into New Window
uk: Скопіювати в нове вікно

# editorQuickAccessPlaceholder
source: Type the name of an editor to open it.
uk: Введіть ім'я редактора, щоб відкрити його.

source: Hidden
uk: Схований

# hideTabs
source: Hidden
uk: Схований

# ignoreTrimWhitespace.label
source: Show Leading/Trailing Whitespace Differences
uk: Показати різницю в провідних/задніх пробілах

source: Inline View
uk: Вбудований перегляд

source: Join in Group
uk: Приєднатися до групи

source: Keep Editor
uk: Зберегти редактор

source: Keep Open
uk: Тримати відкритим

# lockEditorGroup
source: Lock Group
uk: Група блокування

source: Lock Group
uk: Група блокування

# lockGroupAction
source: Lock Group
uk: Група блокування

source: Maximize Group
uk: Максимізувати групу

# miClearRecentOpen
source: &&Clear Recently Opened...
uk: &&Очистити нещодавно відкриті...

# miCopyEditorToNewWindow
source: &&Copy Editor into New Window
uk: &&Копіювати редактор в нове вікно

# miEditorLayout
source: Editor &&Layout
uk: &&Макет редактора

# miFirstSideEditor
source: &&First Side in Editor
uk: &&Перша сторона в редакторі

# miFocusAboveGroup
source: Group &&Above
uk: Група &&вище

# miFocusBelowGroup
source: Group &&Below
uk: Група &&нижче

# miFocusFifthGroup
source: Group &&5
uk: Група &&5

# miFocusFirstGroup
source: Group &&1
uk: Група &&1

# miFocusFourthGroup
source: Group &&4
uk: Група &&4

# miFocusLeftGroup
source: Group &&Left
uk: Група &&ліворуч

# miFocusRightGroup
source: Group &&Right
uk: Група &&праворуч

# miFocusSecondGroup
source: Group &&2
uk: Група &&2

# miFocusThirdGroup
source: Group &&3
uk: Група &&3

# miJoinEditorInGroup
source: Join in &&Group
uk: Приєднатися до &&групи

# miJoinEditorInGroupWithoutMnemonic
source: Join in Group
uk: Приєднатися до групи

# miLastEditLocation
source: &&Last Edit Location
uk: &&Останнє місце редагування

# miMoveEditorToNewWindow
source: &&Move Editor into New Window
uk: &&Перемістити редактор у нове вікно

# miNextEditor
source: &&Next Editor
uk: &&Наступний редактор

# miNextEditorInGroup
source: &&Next Editor in Group
uk: &&Наступний редактор у групі

# miNextGroup
source: &&Next Group
uk: &&Наступна група

# miNextRecentlyUsedEditor
source: &&Next Used Editor
uk: &&Наступний використаний редактор

# miNextUsedEditorInGroup
source: &&Next Used Editor in Group
uk: &&Наступний використаний редактор у групі

# miPreviousEditor
source: &&Previous Editor
uk: &&Попередній редактор

# miPreviousEditorInGroup
source: &&Previous Editor in Group
uk: &&Попередній редактор у групі

# miPreviousGroup
source: &&Previous Group
uk: &&Попередня група

# miPreviousRecentlyUsedEditor
source: &&Previous Used Editor
uk: &&Попередній використаний редактор

# miPreviousUsedEditorInGroup
source: &&Previous Used Editor in Group
uk: &&Попередній використаний редактор у групі

# miReopenClosedEditor
source: &&Reopen Closed Editor
uk: &&Відкрити закритий редактор

# miSecondSideEditor
source: &&Second Side in Editor
uk: &&Другий бік в редакторі

# miShare
source: Share
uk: Поділитися

# miSingleColumnEditorLayout
source: &&Single
uk: &&Одиничний

# miSingleColumnEditorLayoutWithoutMnemonic
source: Single
uk: Одиночний

# miSplitEditorDown
source: Split &&Down
uk: Розділити &&вниз

# miSplitEditorDownWithoutMnemonic
source: Split Down
uk: Розділити вниз

# miSplitEditorInGroup
source: Split in &&Group
uk: Розділити в &&групі

# miSplitEditorInGroupWithoutMnemonic
source: Split in Group
uk: Розділити на групу

# miSplitEditorLeft
source: Split &&Left
uk: Розділити &&зліва

# miSplitEditorLeftWithoutMnemonic
source: Split Left
uk: Розділити ліворуч

# miSplitEditorRight
source: Split &&Right
uk: Розділити &&справа

# miSplitEditorRightWithoutMnemonic
source: Split Right
uk: Розділити праворуч

# miSplitEditorUp
source: Split &&Up
uk: Розділити &&вгору

# miSplitEditorUpWithoutMnemonic
source: Split Up
uk: Розділити

# miSwitchEditor
source: Switch &&Editor
uk: Перемкнути &&редактор

# miSwitchGroup
source: Switch &&Group
uk: Перемкнути &&групу

# miThreeColumnsEditorLayout
source: T&&hree Columns
uk: T&&ри стовпці

# miThreeColumnsEditorLayoutWithoutMnemonic
source: Three Columns
uk: Три колонки

# miThreeRowsEditorLayout
source: Three &&Rows
uk: Три &&рядки

# miThreeRowsEditorLayoutWithoutMnemonic
source: Three Rows
uk: Три рядки

# miTwoByTwoGridEditorLayout
source: &&Grid (2x2)
uk: &&Сітка (2x2)

# miTwoByTwoGridEditorLayoutWithoutMnemonic
source: Grid (2x2)
uk: Сітка (2x2)

# miTwoColumnsBottomEditorLayout
source: Two &&Columns Bottom
uk: Два &&стовпці знизу

# miTwoColumnsBottomEditorLayoutWithoutMnemonic
source: Two Columns Bottom
uk: Дві колонки внизу

# miTwoColumnsEditorLayout
source: &&Two Columns
uk: &&Дві колонки

# miTwoColumnsEditorLayoutWithoutMnemonic
source: Two Columns
uk: Дві колонки

# miTwoRowsEditorLayout
source: T&&wo Rows
uk: Д&&ва ряди

# miTwoRowsEditorLayoutWithoutMnemonic
source: Two Rows
uk: Два рядки

# miTwoRowsRightEditorLayout
source: Two R&&ows Right
uk: Два р&&яди праворуч

# miTwoRowsRightEditorLayoutWithoutMnemonic
source: Two Rows Right
uk: Два рядки вправо

source: Move Above
uk: Перемістити вгору

source: Move Below
uk: Перемістити вниз

# moveEditorGroupToNewWindow
source: Move into New Window
uk: Перейти в нове вікно

# moveEditorToNewWindow
source: Move Editor into New Window
uk: Перемістити редактор у нове вікно

source: Move Left
uk: Перемістити вліво

source: Move Right
uk: Перемістити вправо

# moveToNewWindow
source: Move into New Window
uk: Перейти в нове вікно

source: Multiple Tabs
uk: Кілька вкладок

# navigate.next.label
source: Next Change
uk: Наступна зміна

# navigate.prev.label
source: Previous Change
uk: Попередня зміна

# nextChangeIcon
source: Icon for the next change action in the diff editor.
uk: Іконка для наступної дії зміни в редакторі відмінностей.

source: Pin Editor
uk: Редактор закріплень

# previousChangeIcon
source: Icon for the previous change action in the diff editor.
uk: Іконка для попередньої зміни дії в редакторі відмінностей.

# reopenWith
source: Reopen Editor With...
uk: Відкрити редактор з...

source: Share
uk: Поділитися

source: Show Opened Editors
uk: Показати відкриті редактори

source: Side by Side Editor
uk: Редактор поруч

source: Single Tab
uk: Одна вкладка

# splitAndMoveEditor
source: Split & Move
uk: Розділити та перемістити

source: Split Down
uk: Розділити вниз

source: Split Editor Down
uk: Розділити редактор вниз

source: Split Editor Right
uk: Розділити редактор праворуч

source: Split in Group
uk: Розділити на групу

source: Split Left
uk: Розділити ліворуч

source: Split Right
uk: Розділити праворуч

source: Split Up
uk: Розділити

# swapDiffSides
source: Swap Left and Right Side
uk: Поміняти місцями ліву та праву сторони редактора

source: Text Diff Editor
uk: Редактор порівняння тексту

source: Text Editor
uk: Текстовий редактор

source: Title Bar
uk: Рядок заголовка

# toggleLockGroup
source: Lock Group
uk: Група блокування

# togglePreviewMode
source: Enable Preview Editors
uk: Увімкнути редактори попереднього перегляду

# toggleSplitEditorInGroupLayout
source: Toggle Layout
uk: Перемкнути макет

# toggleWhitespace
source: Icon for the toggle whitespace action in the diff editor.
uk: Іконка для дії перемикання пробілів у редакторі порівняння.

# unlockEditorGroup
source: Unlock Group
uk: Розблокувати групу

# unlockGroupAction
source: Unlock Group
uk: Розблокувати групу

source: Unmaximize Group
uk: Зменшити групу

source: Unpin
uk: Відкріпити

source: Unpin Editor
uk: Відкріпити редактор

# clearButtonLabel
source: &&Clear
uk: &&Очистити

source: Clear Editor History
uk: Очистити історію редактора

# clearRecentFiles
source: Clear Recently Opened...
uk: Очистити нещодавно відкриті...

source: Close All Editors
uk: Закрити всі редактори

# closeAllGroups
source: Close All Editor Groups
uk: Закрити всі групи редакторів

source: Close Editor in All Groups
uk: Закрити редактор у всіх групах

source: Close Editors in Other Groups
uk: Закрити редактори в інших групах

# closeEditorsToTheLeft
source: Close Editors to the Left in Group
uk: Закрити редактори зліва в групі

# closeOneEditor
source: Close
uk: Закрити

# confirmClearDetail
source: This action is irreversible!
uk: Цю дію не можна скасувати!

# confirmClearEditorHistoryMessage
source: Do you want to clear the history of recently opened editors?
uk: Ви хочете очистити історію нещодавно відкритих редакторів?

# confirmClearRecentsMessage
source: Do you want to clear all recently opened files and workspaces?
uk: Ви хочете очистити всі нещодавно відкриті файли та робочі простори?

# copyEditorGroupToNewWindow
source: Copy Editor Group into New Window
uk: Копіювати в нове вікно

# duplicateActiveGroupDown
source: Duplicate Editor Group Down
uk: Дублювати групу редактора вниз

# duplicateActiveGroupLeft
source: Duplicate Editor Group Left
uk: Дублювати групу редактора зліва

# duplicateActiveGroupRight
source: Duplicate Editor Group Right
uk: Дублювати права групи редактора

# duplicateActiveGroupUp
source: Duplicate Editor Group Up
uk: Дублювати групу редактора вгору

# editorLayoutSingle
source: Single Column Editor Layout
uk: Макет редактора з однією колонкою

# editorLayoutThreeColumns
source: Three Columns Editor Layout
uk: Макет редактора з трьома стовпцями

# editorLayoutThreeRows
source: Three Rows Editor Layout
uk: Макет редактора з трьома рядами

# editorLayoutTwoByTwoGrid
source: Grid Editor Layout (2x2)
uk: Макет редактора сітки (2x2)

# editorLayoutTwoColumns
source: Two Columns Editor Layout
uk: Макет редактора з двома стовпцями

# editorLayoutTwoColumnsBottom
source: Two Columns Bottom Editor Layout
uk: Макет редактора з двома стовпцями внизу

# editorLayoutTwoRows
source: Two Rows Editor Layout
uk: Макет редактора з двома рядками

# editorLayoutTwoRowsRight
source: Two Rows Right Editor Layout
uk: Макет редактора з двома рядами праворуч

# evenEditorGroups
source: Reset Editor Group Sizes
uk: Скинути розміри групи редактора

# firstEditorInGroup
source: Open First Editor in Group
uk: Відкрити перший редактор у групі

# focusAboveGroup
source: Focus Editor Group Above
uk: Група редакторів фокусу зверху

source: Focus Active Editor Group
uk: Група активного редактора фокусу

# focusBelowGroup
source: Focus Editor Group Below
uk: Група редакторів фокусу нижче

source: Focus First Editor Group
uk: Група редакторів Focus First

source: Focus Last Editor Group
uk: Група останнього редактора фокусу

# focusLeftGroup
source: Focus Left Editor Group
uk: Група редакторів лівої фокусування

# focusNextGroup
source: Focus Next Editor Group
uk: Група наступного редактора Focus

# focusPreviousGroup
source: Focus Previous Editor Group
uk: Група попередніх редакторів фокусу

# focusRightGroup
source: Focus Right Editor Group
uk: Група редакторів Focus Right

# joinAllGroups
source: Join All Editor Groups
uk: Приєднатися до всіх груп редакторів

# joinTwoGroups
source: Join Editor Group with Next Group
uk: Приєднатися до групи редакторів з наступною групою

# lastEditorInGroup
source: Open Last Editor in Group
uk: Відкрити останній редактор у групі

# maximizeEditorHideSidebar
source: Maximize Editor Group and Hide Side Bars
uk: Максимізувати групу редактора та приховати бічні панелі

# miBack
source: &&Back
uk: &&Назад

# miCopyEditorGroupToNewWindow
source: &&Copy Editor Group into New Window
uk: &&Копіювати групу редактора у нове вікно

# miForward
source: &&Forward
uk: &&Далі

# miMoveEditorGroupToNewWindow
source: &&Move Editor Group into New Window
uk: &&Перемістити групу редактора в нове вікно

# miNewEmptyEditorWindow
source: &&New Empty Editor Window
uk: &&Нове порожнє вікно редактора

# miRestoreEditorsToMainWindow
source: &&Restore Editors into Main Window
uk: &&Відновити редактори у головному вікні

# minimizeOtherEditorGroups
source: Expand Editor Group
uk: Розширити групу редакторів

# minimizeOtherEditorGroupsHideSidebar
source: Expand Editor Group and Hide Side Bars
uk: Розгорнути групу редактора та приховати бічні панелі

# moveActiveGroupDown
source: Move Editor Group Down
uk: Перемістити групу редакторів вниз

# moveActiveGroupLeft
source: Move Editor Group Left
uk: Перемістити групу редакторів вліво

# moveActiveGroupRight
source: Move Editor Group Right
uk: Перемістити групу редакторів вправо

# moveActiveGroupUp
source: Move Editor Group Up
uk: Перемістити групу редакторів вгору

# moveEditorGroupToNewWindow
source: Move Editor Group into New Window
uk: Перейти в нове вікно

source: Move Editor Left
uk: Перемістити редактор вліво

source: Move Editor Right
uk: Перемістити редактор вправо

# moveEditorToAboveGroup
source: Move Editor into Group Above
uk: Перемістити редактор у групу вище

# moveEditorToBelowGroup
source: Move Editor into Group Below
uk: Перемістити редактор у групу нижче

# moveEditorToFirstGroup
source: Move Editor into First Group
uk: Перемістити редактор у першу групу

# moveEditorToLastGroup
source: Move Editor into Last Group
uk: Перемістити редактор у останню групу

# moveEditorToLeftGroup
source: Move Editor into Left Group
uk: Перемістити редактор у ліву групу

# moveEditorToNextGroup
source: Move Editor into Next Group
uk: Перемістити редактор у наступну групу

# moveEditorToPreviousGroup
source: Move Editor into Previous Group
uk: Перемістити редактор у попередню групу

# moveEditorToRightGroup
source: Move Editor into Right Group
uk: Перемістити редактор у праву групу

# navigateBack
source: Go Back
uk: Повернутися назад

# navigateBackInEdits
source: Go Back in Edit Locations
uk: Повернутися до редагування місць

# navigateBackInNavigations
source: Go Back in Navigation Locations
uk: Повернутися назад у навігаційні локації

# navigateEditorGroups
source: Navigate Between Editor Groups
uk: Переміщення між групами редакторів

# navigateEditorHistoryByInput
source: Quick Open Previous Editor from History
uk: Швидке відкриття попереднього редактора з історії

# navigateForward
source: Go Forward
uk: Іти вперед

# navigateForwardInEdits
source: Go Forward in Edit Locations
uk: Перейти вперед у редагуванні місць

# navigateForwardInNavigations
source: Go Forward in Navigation Locations
uk: Перейти вперед у навігаційних місцях

# navigatePrevious
source: Go Previous
uk: Перейти до попереднього

# navigatePreviousInEdits
source: Go Previous in Edit Locations
uk: Перейти до попереднього в редагуванні місць

# navigatePreviousInNavigationLocations
source: Go Previous in Navigation Locations
uk: Перейти до попереднього в навігаційних локаціях

# navigateToLastEditLocation
source: Go to Last Edit Location
uk: Перейти до останнього місця редагування

# navigateToLastNavigationLocation
source: Go to Last Navigation Location
uk: Перейти до останнього місця навігації

source: New Empty Editor Window
uk: Нове порожнє вікно редактора

# newGroupAbove
source: New Editor Group Above
uk: Нова група редакторів зверху

# newGroupBelow
source: New Editor Group Below
uk: Нова група редакторів нижче

# newGroupLeft
source: New Editor Group to the Left
uk: Нова група редакторів зліва

# newGroupRight
source: New Editor Group to the Right
uk: Нова група редакторів праворуч

# nextEditorInGroup
source: Open Next Editor in Group
uk: Відкрити наступний редактор у групі

source: Open Next Editor
uk: Відкрити наступний редактор

source: Open Next Recently Used Editor
uk: Відкрити наступний нещодавно використаний редактор

source: Open Next Recently Used Editor In Group
uk: Відкрити наступний нещодавно використаний редактор у групі

source: Open Previous Editor
uk: Відкрити попередній редактор

source: Open Previous Editor in Group
uk: Відкрити попередній редактор у групі

source: Open Previous Recently Used Editor
uk: Відкрити попередній нещодавно використаний редактор

source: Open Previous Recently Used Editor In Group
uk: Відкрити попередній нещодавно використаний редактор у групі

source: Quick Open Least Recently Used Editor
uk: Швидке відкриття редактора з найменш нещодавнім використанням

source: Quick Open Least Recently Used Editor in Group
uk: Швидке відкриття редактора з найменш нещодавнім використанням у групі

source: Quick Open Previous Recently Used Editor
uk: Швидке відкриття попереднього нещодавно використаного редактора

source: Quick Open Previous Recently Used Editor in Group
uk: Швидке відкриття попереднього нещодавно використаного редактора в групі

source: Reopen Closed Editor
uk: Відкрити закритий редактор

# reopenTextEditor
source: Reopen Editor with Text Editor
uk: Відкрити редактор з текстовим редактором

# restoreEditorsToMainWindow
source: Restore Editors into Main Window
uk: Відновити редактори у головному вікні

# revertAndCloseActiveEditor
source: Revert and Close Editor
uk: Скасувати та закрити редактор

# reverting
source: Reverting Editors...
uk: Повернення редакторів...

# showAllEditors
source: Show All Editors By Appearance
uk: Показати всіх редакторів за зовнішнім виглядом

source: Show All Editors By Most Recently Used
uk: Показати всіх редакторів за останнім використанням

# showEditorsInActiveGroup
source: Show Editors in Active Group By Most Recently Used
uk: Показати редакторів у активній групі за останнім використанням

source: Split Editor
uk: Розділений редактор

# splitEditorGroupDown
source: Split Editor Down
uk: Розділити редактор вниз

# splitEditorGroupLeft
source: Split Editor Left
uk: Розділити редактор ліворуч

# splitEditorGroupRight
source: Split Editor Right
uk: Розділити редактор праворуч

# splitEditorGroupUp
source: Split Editor Up
uk: Розділити редактор

source: Split Editor Orthogonal
uk: Ортогональний розділений редактор

# splitEditorToAboveGroup
source: Split Editor into Group Above
uk: Розділити редактор на групу зверху

# splitEditorToBelowGroup
source: Split Editor into Group Below
uk: Розділити редактор на групу нижче

# splitEditorToFirstGroup
source: Split Editor into First Group
uk: Розділити редактор на першу групу

# splitEditorToLastGroup
source: Split Editor into Last Group
uk: Розділити редактор на останню групу

# splitEditorToLeftGroup
source: Split Editor into Left Group
uk: Розділити редактор на ліву групу

# splitEditorToNextGroup
source: Split Editor into Next Group
uk: Розділити редактор на наступну групу

# splitEditorToPreviousGroup
source: Split Editor into Previous Group
uk: Розділити редактор на попередню групу

# splitEditorToRightGroup
source: Split Editor into Right Group
uk: Розділити редактор на праву групу

source: Toggle Editor Type
uk: Перемикання типу редактора

# toggleEditorWidths
source: Toggle Editor Group Sizes
uk: Перемикання розмірів групи редакторів

source: Toggle Maximize Editor Group
uk: Перемкнути максимізацію групи редактора

# editorCommand.activeEditorCopy.arg.description
source: Argument Properties: * 'to': String value providing where to copy. * 'value': Number value providing how many positions or an absolute position to copy.
uk: Властивості аргументів: * 'to': Рядкове значення, що вказує, куди копіювати. * 'value': Числове значення, що вказує, скільки позицій або абсолютну позицію для копіювання.

# editorCommand.activeEditorCopy.arg.name
source: Active editor copy argument
uk: Аргумент копії активного редактора

# editorCommand.activeEditorCopy.description
source: Copy the active editor by groups
uk: Скопіювати активний редактор за групами
