Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminalContrib.xlf
Languages: uk

# terminalSymbolIcon.flagForeground
source: The foreground color for an flag icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки прапора. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.folderForeground
source: The foreground color for a folder icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка папки. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.inlineSuggestionForeground
source: The foreground color for an inline suggestion icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки вбудованої підказки. Ці іконки з'являться у віджеті підказок терміналу.

# terminalSymbolIcon.methodForeground
source: The foreground color for a method icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки методу. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.optionForeground
source: The foreground color for an option icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка опції. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.pullRequestDoneForeground
source: The foreground color for a completed pull request icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка завершеного запиту на злиття. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.pullRequestForeground
source: The foreground color for a pull request icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки запиту на злиття. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.remoteForeground
source: The foreground color for a remote icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для віддаленого значка. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.stashForeground
source: The foreground color for a stash icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки сховища. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.symbolicLinkFileForeground
source: The foreground color for a symbolic link file icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка файлу символічного посилання. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.symbolicLinkFolderForeground
source: The foreground color for a symbolic link folder icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка папки символічного посилання. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.tagForeground
source: The foreground color for a tag icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка тегу. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolInlineSuggestionIcon
source: Icon for inline suggestions in the terminal suggest widget.
uk: Іконка для вбудованих пропозицій у віджеті терміналу.

# terminalSymbolMethodIcon
source: Icon for methods in the terminal suggest widget.
uk: Іконка для методів у віджеті пропозицій терміналу.

# terminalSymbolOptionIcon
source: Icon for options in the terminal suggest widget.
uk: Іконка для параметрів у віджеті пропозицій терміналу.

# terminalSymbolOptionValue
source: Icon for enum members in the terminal suggest widget.
uk: Іконка для членів enum у віджеті пропозицій терміналу.

# terminalSymbolPullRequestDoneIcon
source: Icon for completed pull requests in the terminal suggest widget.
uk: Іконка для завершених запитів на злиття у віджеті терміналу.

# terminalSymbolPullRequestIcon
source: Icon for pull requests in the terminal suggest widget.
uk: Іконка для запитів на злиття в віджеті пропозицій терміналу.

# terminalSymbolRemoteIcon
source: Icon for remotes in the terminal suggest widget.
uk: Іконка для пультів у віджеті пропозицій терміналу.

# terminalSymbolStashIcon
source: Icon for stashes in the terminal suggest widget.
uk: Іконка для сховищ у віджеті терміналу.

# terminalSymbolSymbolicLinkFileIcon
source: Icon for symbolic link files in the terminal suggest widget.
uk: Іконка для символічних посилань у файлах у віджеті терміналу.

# terminalSymbolSymbolicLinkFolderIcon
source: Icon for symbolic link folders in the terminal suggest widget.
uk: Іконка для символічних посилань на папки в віджеті терміналу.

# terminalSymbolTagIcon
source: Icon for tags in the terminal suggest widget.
uk: Іконка для тегів у віджеті пропозицій терміналу.

# runOnEnter.always
source: Always run on `Enter`.
uk: Завжди запускайте на `Enter`.

# runOnEnter.exactMatch
source: Run on `Enter` when the suggestion is typed in its entirety.
uk: Запустіть на `Enter`, коли пропозиція буде введена повністю.

# runOnEnter.exactMatchIgnoreExtension
source: Run on `Enter` when the suggestion is typed in its entirety or when a file is typed without its extension included.
uk: Запустіть на `Enter`, коли пропозиція введена повністю або коли файл введено без включення його розширення.

# runOnEnter.never
source: Never run on `Enter`.
uk: Ніколи не натискайте `Enter`.

# suggest.cdPath
source: Controls whether to enable $CDPATH support which exposes children of the folders in the $CDPATH variable regardless of the current working directory. $CDPATH is expected to be semi colon-separated on Windows and colon-separated on other platforms.
uk: Контролює, чи увімкнути підтримку $CDPATH, яка відкриває дочірні елементи папок у змінній $CDPATH незалежно від поточного робочого каталогу. Очікується, що $CDPATH буде розділений крапкою з комою на Windows і двокрапкою на інших платформах.

# suggest.cdPath.absolute
source: Enable the feature and use absolute paths. This is useful when the shell doesn't natively support `$CDPATH`.
uk: Увімкніть цю функцію та використовуйте абсолютні шляхи. Це корисно, коли оболонка не підтримує `$CDPATH` за замовчуванням.

# suggest.cdPath.off
source: Disable the feature.
uk: Вимкніть функцію.

# suggest.cdPath.relative
source: Enable the feature and use relative paths.
uk: Увімкніть функцію та використовуйте відносні шляхи.

# suggest.enabled
source: Enables terminal intellisense suggestions (preview) for supported shells ({0}) when {1} is set to {2}.
uk: Увімкнення пропозицій інтелектуального завершення командного рядка (попередній перегляд) для підтримуваних оболонок ({0}), коли {1} встановлено на {2}.

# suggest.inlineSuggestion
source: Controls whether the shell's inline suggestion should be detected and how it is scored.
uk: Контролює, чи має бути виявлено вбудовану пропозицію оболонки та як вона оцінюється.

# suggest.inlineSuggestion.alwaysOnTop
source: Enable the feature and always put the inline suggestion on top.
uk: Увімкніть цю функцію та завжди розміщуйте вбудовану пропозицію зверху.

# suggest.inlineSuggestion.alwaysOnTopExceptExactMatch
source: Enable the feature and sort the inline suggestion without forcing it to be on top. This means that exact matches will be will be above the inline suggestion.
uk: Увімкніть функцію та відсортуйте вбудовану пропозицію без примусу її бути на верху. Це означає, що точні збіги будуть вище вбудованої пропозиції.

# suggest.inlineSuggestion.off
source: Disable the feature.
uk: Вимкніть функцію.

# suggest.provider.description
source: Whether to enable this provider.
uk: Чи ввімкнути цього постачальника.

# suggest.provider.lsp.description
source: Provides completions for language server protocol-specific arguments.
uk: Надає завершення для специфічних аргументів протоколу мовного сервера.

# suggest.providers
source: Providers are enabled by default. Omit them by setting the id of the provider to `false`.
uk: Постачальники увімкнені за замовчуванням. Виключіть їх, встановивши ідентифікатор постачальника на `false`.

# suggest.quickSuggestions
source: Controls whether suggestions should automatically show up while typing. Also be aware of the {0}-setting which controls if suggestions are triggered by special characters.
uk: Контролює, чи повинні пропозиції автоматично з'являтися під час введення. Також зверніть увагу на налаштування {0}, яке контролює, чи викликаються пропозиції спеціальними символами.

# suggest.quickSuggestions.arguments
source: Enable quick suggestions for arguments, anything after the first word in a command line input.
uk: Увімкніть швидкі підказки для аргументів, усе після першого слова у введенні командного рядка.

# suggest.quickSuggestions.commands
source: Enable quick suggestions for commands, the first word in a command line input.
uk: Увімкніть швидкі пропозиції для команд, першого слова у введенні командного рядка.

# suggest.quickSuggestions.unknown
source: Enable quick suggestions when it's unclear what the best suggestion is, if this is on files and folders will be suggested as a fallback.
uk: Увімкніть швидкі пропозиції, коли неясно, яка з пропозицій є найкращою; якщо це стосується файлів і папок, вони будуть запропоновані як резервний варіант.

# suggest.runOnEnter
source: Controls whether suggestions should run immediately when `Enter` (not `Tab`) is used to accept the result.
uk: Контролює, чи повинні пропозиції виконуватися негайно, коли використовується `Enter` (а не `Tab`) для прийняття результату.

# suggest.showStatusBar
source: Controls whether the terminal suggestions status bar should be shown.
uk: Контролює, чи має бути показана панель стану термінальних підказок.

# suggest.suggestOnTriggerCharacters
source: Controls whether suggestions should automatically show up when typing trigger characters.
uk: Контролює, чи повинні пропозиції автоматично з'являтися під час введення тригерних символів.

# suggest.upArrowNavigatesHistory
source: Determines whether the up arrow key navigates the command history when focus is on the first suggestion and navigation has not yet occurred. When set to false, the up arrow will move focus to the last suggestion instead.
uk: Визначає, чи клавіша стрілки вгору переміщує історію команд, коли фокус знаходиться на першій пропозиції і навігація ще не відбулася. Якщо встановлено значення false, клавіша стрілки вгору перемістить фокус на останню пропозицію.

# terminal.integrated.selectionMode
source: Controls how suggestion selection works in the integrated terminal.
uk: Контролює, як працює вибір пропозицій в інтегрованому терміналі.

# terminal.integrated.selectionMode.always
source: Always select a suggestion when automatically triggering IntelliSense. `Enter` or `Tab` can be used to accept the first suggestion.
uk: Завжди обирайте пропозицію при автоматичному виклику IntelliSense. Для прийняття першої пропозиції можна використовувати `Enter` або `Tab`.

# terminal.integrated.selectionMode.never
source: Never select a suggestion when automatically triggering IntelliSense. The list must be navigated via `Down` before `Enter` or `Tab` can be used to accept the active suggestion.
uk: Ніколи не вибирайте пропозицію при автоматичному виклику IntelliSense. Список потрібно переглядати за допомогою `Down`, перш ніж можна буде використовувати `Enter` або `Tab` для прийняття активної пропозиції.

# terminal.integrated.selectionMode.partial
source: Partially select a suggestion when automatically triggering IntelliSense. `Tab` can be used to accept the first suggestion, only after navigating the suggestions via `Down` will `Enter` also accept the active suggestion.
uk: Частково виберіть пропозицію при автоматичному виклику IntelliSense. `Tab` можна використовувати для прийняття першої пропозиції, лише після навігації по пропозиціях за допомогою `Down` також `Enter` прийме активну пропозицію.

# terminalSuggestProvidersConfigurationTitle
source: Terminal Suggest Providers
uk: Термінал пропонує постачальників

# terminalWindowsExecutableSuggestionSetting
source: A set of windows command executable extensions that will be included as suggestions in the terminal. Many executables are included by default, listed below: {0}. To exclude an extension, set it to `false` . To include one not in the list, add it and set it to `true`.
uk: Набір розширень виконуваних команд Windows, які будуть включені як пропозиції в терміналі. Багато виконуваних файлів включено за замовчуванням, наведено нижче: {0}. Щоб виключити розширення, встановіть його в `false`. Щоб включити те, що не в списку, додайте його та встановіть в `true`.

# terminal.integrated.localEchoEnabled
source: When local echo should be enabled. This will override {0}
uk: Коли локальне ехо має бути ввімкнене. Це переоприділить {0}

# terminal.integrated.localEchoEnabled.auto
source: Enabled only for remote workspaces
uk: Увімкнено лише для віддалених робочих просторів

# terminal.integrated.localEchoEnabled.off
source: Always disabled
uk: Завжди вимкнено

# terminal.integrated.localEchoEnabled.on
source: Always enabled
uk: Завжди увімкнено

# terminal.integrated.localEchoExcludePrograms
source: Local echo will be disabled when any of these program names are found in the terminal title.
uk: Локальне відображення буде вимкнено, коли в заголовку терміналу буде знайдено будь-яке з цих імен програм.

# terminal.integrated.localEchoLatencyThreshold
source: Length of network delay, in milliseconds, where local edits will be echoed on the terminal without waiting for server acknowledgement. If '0', local echo will always be on, and if '-1' it will be disabled.
uk: Довжина мережевої затримки, в мілісекундах, при якій локальні редагування будуть відображатися на терміналі без очікування підтвердження від сервера. Якщо '0', локальне відображення завжди буде ввімкнено, а якщо '-1', воно буде вимкнене.

# terminal.integrated.localEchoStyle
source: Terminal style of locally echoed text; either a font style or an RGB color.
uk: Стиль терміналу локально відображеного тексту; або стиль шрифту, або RGB колір.

# terminalVoiceTextInserted
source: {0} inserted
uk: {0} вставлено

source: Enable Extension
uk: Увімкнути розширення

source: Install Extension
uk: Встановити розширення

# terminal.voice.detail
source: Microphone support requires this extension.
uk: Підтримка мікрофона вимагає цього розширення.

# terminal.voice.enableSpeechExtension
source: Would you like to enable the speech extension?
uk: Чи хочете ви увімкнути розширення для мовлення?

# terminal.voice.installSpeechExtension
source: Would you like to install 'VS Code Speech' extension from 'Microsoft'?
uk: Ви хочете встановити розширення 'VS Code Speech' від 'Microsoft'?

# workbench.action.terminal.startDictation
source: Start Dictation in Terminal
uk: Почати диктування в терміналі

# workbench.action.terminal.stopDictation
source: Stop Dictation in Terminal
uk: Зупинити диктування в терміналі

source: Install
uk: Встановити

# useWslExtension.title
source: The '{0}' extension is recommended for opening a terminal in WSL.
uk: Розширення '{0}' рекомендується для відкриття терміналу в WSL.

# fontZoomIn
source: Increase Font Size
uk: Збільшити розмір шрифту

# fontZoomOut
source: Decrease Font Size
uk: Зменшити розмір шрифту

# fontZoomReset
source: Reset Font Size
uk: Скинути розмір шрифту

# terminal.integrated.mouseWheelZoom
source: Zoom the font of the terminal when using mouse wheel and holding `Ctrl`.
uk: Збільшуйте шрифт терміналу, використовуючи колесо миші та утримуючи `Ctrl`.

# terminal.integrated.mouseWheelZoom.mac
source: Zoom the font of the terminal when using mouse wheel and holding `Cmd`.
uk: Збільште шрифт терміналу, використовуючи колесо миші та утримуючи `Cmd`.
