Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_remote.xlf
Languages: uk

# switchRemote.label
source: Switch Remote
uk: Перемикач дистанційного керування

source: Connection Lost
uk: Зв'язок втрачено

# pickRemoteExtension
source: Select url to open
uk: Виберіть URL для відкриття

source: Reconnect Now
uk: Перепідключитися зараз

# reconnectionPermanentFailure
source: Cannot reconnect. Please reload the window.
uk: Не вдалося повторно підключитися. Будь ласка, перезавантажте вікно.

# reconnectionRunning
source: Disconnected. Attempting to reconnect...
uk: Відключено. Спроба перепідключення...

# reconnectionWaitMany
source: Attempting to reconnect in {0} seconds...
uk: Спроба повторного підключення через {0} секунд...

# reconnectionWaitOne
source: Attempting to reconnect in {0} second...
uk: Спроба повторного підключення через {0} секунд...

source: Reload Window
uk: Перезавантажити вікно

# reloadWindow.dialog
source: &&Reload Window
uk: &&Перезавантажити вікно

source: Remote Explorer
uk: Віддалений оглядач

# remote.help
source: Help and feedback
uk: Допомога та відгуки

# remote.help.documentation
source: Read Documentation
uk: Читати документацію

# remote.help.getStarted
source: Get Started
uk: Почати

# remote.help.issues
source: Review Issues
uk: Переглянути проблеми

# remote.help.report
source: Report Issue
uk: Повідомити про проблему

source: Remote Help
uk: Віддалена допомога

source: &&Allow
uk: &&Дозволити

source: &&Learn More
uk: &&Дізнатися більше

# remember
source: Do not show again
uk: Не показувати знову

# unsupportedGlibcBannerLearnMore
source: Learn More
uk: Дізнатися більше

# unsupportedGlibcWarning
source: You are about to connect to an OS version that is unsupported by {0}.
uk: Ви збираєтеся підключитися до версії ОС, яка не підтримується {0}.

# unsupportedGlibcWarning.banner
source: You are connected to an OS version that is unsupported by {0}.
uk: Ви підключені до версії ОС, яка не підтримується {0}.

source: 1 forwarded port
uk: 1 переадресований порт

# nForwardedPorts
source: {0} forwarded ports
uk: {0} переслані порти

# noRemoteNoPorts
source: No forwarded ports. Forward a port to access your locally running services over the internet. [Forward a Port]({0})
uk: Немає переадресованих портів. Переадресуйте порт, щоб отримати доступ до своїх локально запущених сервісів через інтернет. [Переадресувати порт]({0})

source: Ports
uk: Порти

# remote.autoForwardPortsSource.fallback
source: Over 20 ports have been automatically forwarded. The `process` based automatic port forwarding has been switched to `hybrid` in settings. Some ports may no longer be detected.
uk: Більше 20 портів було автоматично перенаправлено. Автоматичне перенаправлення портів на основі `process` було переключено на `hybrid` у налаштуваннях. Деякі порти можуть більше не бути виявлені.

# remote.autoForwardPortsSource.fallback.showPortSourceSetting
source: Show Setting
uk: Показати налаштування

# remote.autoForwardPortsSource.fallback.switchBack
source: Undo
uk: Скасувати

# remote.forwardedPorts.statusbarTextNone
source: No Ports Forwarded
uk: Немає переадресованих портів

# remote.forwardedPorts.statusbarTooltip
source: Forwarded Ports: {0}
uk: Перенаправлені порти: {0}

# remote.tunnelsView.automaticForward
source: Your application{0} running on port {1} is available.
uk: Ваш додаток{0}, що працює на порту {1}, доступний.

# remote.tunnelsView.elevationButton
source: Use Port {0} as Sudo...
uk: Використовуйте порт {0} як Sudo...

# remote.tunnelsView.elevationMessage
source: You'll need to run as superuser to use port {0} locally.
uk: Вам потрібно запустити як суперкористувач, щоб використовувати порт {0} локально.

# remote.tunnelsView.makePublic
source: Make Public
uk: Зробити публічним

# remote.tunnelsView.notificationLink2
source: [See all forwarded ports]({0})
uk: [Переглянути всі переадресовані порти]({0})

# remoteNoPorts
source: No forwarded ports. Forward a port to access your running services locally. [Forward a Port]({0})
uk: Немає пересланих портів. Переслайте порт, щоб отримати доступ до своїх запущених сервісів локально. [Переслати порт]({0})

# status.forwardedPorts
source: Forwarded Ports
uk: Перенаправлені порти

# copyAddressIcon
source: Icon for the copy local address action.
uk: Іконка для дії копіювання локальної адреси.

# documentationIcon
source: Documentation icon in the remote explorer view.
uk: Іконка документації у вигляді віддаленого оглядача.

# feedbackIcon
source: Feedback icon in the remote explorer view.
uk: Іконка зворотного зв'язку у вигляді віддаленого огляду.

# forwardPortIcon
source: Icon for the forward action.
uk: Іконка для дії вперед.

# forwardedPortWithProcessIcon
source: Icon for forwarded ports that do have a running process.
uk: Іконка для переадресованих портів, на яких є запущений процес.

# forwardedPortWithoutProcessIcon
source: Icon for forwarded ports that don't have a running process.
uk: Іконка для пересланих портів, які не мають запущеного процесу.

# getStartedIcon
source: Getting started icon in the remote explorer view.
uk: Іконка початку роботи в перегляді віддаленого провідника.

# labelPortIcon
source: Icon for the label port action.
uk: Іконка для мітки дії порту.

# openBrowserIcon
source: Icon for the open browser action.
uk: Іконка для дії відкритого браузера.

# openPreviewIcon
source: Icon for the open preview action.
uk: Іконка для дії відкриття попереднього перегляду.

# portIcon
source: Icon representing a remote port.
uk: Іконка, що представляє віддалений порт.

# portsViewIcon
source: View icon of the remote ports view.
uk: Переглянути іконку перегляду віддалених портів.

# privatePortIcon
source: Icon representing a private remote port.
uk: Іконка, що представляє приватний віддалений порт.

# remoteExplorerViewIcon
source: View icon of the remote explorer view.
uk: Переглянути значок віддаленого перегляду провідника.

# reportIssuesIcon
source: Report issue icon in the remote explorer view.
uk: Іконка звіту про проблему у вигляді віддаленого дослідника.

# reviewIssuesIcon
source: Review issue icon in the remote explorer view.
uk: Перегляньте значок проблеми у вигляді віддаленого дослідника.

# stopForwardIcon
source: Icon for the stop forwarding action.
uk: Іконка для дії зупинки пересилання.

# closeRemoteConnection.title
source: Close Remote Connection
uk: Закрити віддалене з'єднання

# closeVirtualWorkspace.title
source: Close Remote Workspace
uk: Закрити віддалене робоче місце

# disconnectedFrom
source: Disconnected from {0}
uk: Відключено від {0}

# host.open
source: Opening Remote...
uk: Відкриття віддаленого...

# host.reconnecting
source: Reconnecting to {0}...
uk: Відновлення з'єднання з {0}...

# host.tooltip
source: Editing on {0}
uk: Редагування на {0}

# miCloseRemote
source: Close Re&&mote Connection
uk: Закрити &&віддалене з'єднання

# networkStatusHighLatencyTooltip
source: Network appears to have high latency ({0}ms last, {1}ms average), certain features may be slow to respond.
uk: Мережа, здається, має високу затримку ({0}мс остання, {1}мс середня), деякі функції можуть повільно реагувати.

# networkStatusOfflineTooltip
source: Network appears to be offline, certain features might be unavailable.
uk: Мережа, здається, офлайн, деякі функції можуть бути недоступні.

# noHost.tooltip
source: Open a Remote Window
uk: Відкрити віддалене вікно

# remote.category
source: Remote
uk: Віддалений

# remote.close
source: Close Remote Connection
uk: Закрити віддалене з'єднання

# remote.install
source: Install Remote Development Extensions
uk: Встановіть розширення для віддаленої розробки

# remote.showExtensionRecommendations
source: When enabled, remote extensions recommendations will be shown in the Remote Indicator menu.
uk: Коли увімкнено, рекомендації щодо віддалених розширень будуть показані в меню Індикатора віддаленості.

# remote.showMenu
source: Show Remote Menu
uk: Показати віддалене меню

# remote.startActions.help
source: Learn More
uk: Дізнатися більше

# remote.startActions.install
source: Install
uk: Встановити

# remote.startActions.installingExtension
source: Installing extension...
uk: Встановлення розширення...

# remoteActions
source: Select an option to open a Remote Window
uk: Виберіть опцію для відкриття віддаленого вікна

source: Remote Host
uk: Віддалений хост

# workspace.tooltip
source: Editing on {0}
uk: Редагування на {0}

# workspace.tooltip2
source: Some [features are not available]({0}) for resources located on a virtual file system.
uk: Деякі [функції недоступні]({0}) для ресурсів, розташованих на віртуальній файловій системі.

# remote.showWebStartEntryActions
source: Show Remote Start Entry for web
uk: Показати вхід для віддаленого запуску для веб

# tunnelPrivacy.private
source: Private
uk: Приватний

# tunnelPrivacy.public
source: Public
uk: Громадський

# portWithRunningProcess.foreground
source: The color of the icon for a port that has an associated running process.
uk: Колір значка для порту, який має асоційований запущений процес.

# portsLink.followLinkAlt
source: alt + click
uk: alt + клік

# portsLink.followLinkCmd
source: cmd + click
uk: cmd + клік

# portsLink.followLinkCtrl
source: ctrl + click
uk: ctrl + клік

# remote.tunnel
source: Ports
uk: Порти

# remote.tunnel.changeLocalPort
source: Change Local Address Port
uk: Змінити порт локальної адреси

# remote.tunnel.changeLocalPortNumber
source: The local port {0} is not available. Port number {1} has been used instead
uk: Місцевий порт {0} недоступний. Натомість використано номер порту {1}.

# remote.tunnel.close
source: Stop Forwarding Port
uk: Зупинити пересилання порту

# remote.tunnel.closeNoPorts
source: No ports currently forwarded. Try running the {0} command
uk: Наразі немає переадресованих портів. Спробуйте виконати команду {0}

# remote.tunnel.closePlaceholder
source: Choose a port to stop forwarding
uk: Виберіть порт для зупинки пересилання

# remote.tunnel.copyAddressCommandPalette
source: Copy Forwarded Port Address
uk: Скопіювати адресу пересланого порту

# remote.tunnel.copyAddressInline
source: Copy Local Address
uk: Скопіювати локальну адресу

# remote.tunnel.copyAddressPlaceholdter
source: Choose a forwarded port
uk: Виберіть перенаправлений порт

# remote.tunnel.forward
source: Forward a Port
uk: Переслати порт

# remote.tunnel.forwardError
source: Unable to forward {0}:{1}. The host may not be available or that remote port may already be forwarded
uk: Не вдалося переслати {0}:{1}. Хост може бути недоступний або цей віддалений порт може вже бути пересланий.

# remote.tunnel.forwardErrorProvided
source: Unable to forward {0}:{1}. {2}
uk: Неможливо перенаправити {0}:{1}. {2}

# remote.tunnel.forwardItem
source: Forward Port
uk: Передній порт

# remote.tunnel.forwardPrompt
source: Port number or address (eg. 3000 or 10.10.10.10:2000).
uk: Номер порту або адреса (наприклад, 3000 або 10.10.10.10:2000).

# remote.tunnel.label
source: Set Port Label
uk: Встановити мітку порту

# remote.tunnel.open
source: Open in Browser
uk: Відкрити в браузері

# remote.tunnel.openCommandPalette
source: Open Port in Browser
uk: Відкрити порт у браузері

# remote.tunnel.openCommandPaletteNone
source: No ports currently forwarded. Open the Ports view to get started.
uk: Наразі немає переадресованих портів. Відкрийте перегляд Портів, щоб почати.

# remote.tunnel.openCommandPalettePick
source: Choose the port to open
uk: Виберіть порт для відкриття

# remote.tunnel.openCommandPaletteView
source: Open the Ports view...
uk: Відкрийте перегляд Портів...

# remote.tunnel.openPreview
source: Preview in Editor
uk: Попередній перегляд в редакторі

# remote.tunnel.tooltipCandidate
source: Remote port {0}:{1} not forwarded.
uk: Віддалений порт {0}:{1} не перенаправлений.

# remote.tunnel.tooltipForwarded
source: Remote port {0}:{1} forwarded to local address {2}.
uk: Віддалений порт {0}:{1} перенаправлений на локальну адресу {2}.

# remote.tunnel.tooltipName
source: Port labeled {0}.
uk: Порт з міткою {0}.

# remote.tunnelView.alreadyForwarded
source: Port is already forwarded
uk: Порт вже перенаправлений

# remote.tunnelView.inlineElevationMessage
source: May Require Sudo
uk: Може вимагати Sudo

# remote.tunnelsView.addPort
source: Add Port
uk: Додати порт

# remote.tunnelsView.changePort
source: New local port
uk: Новий локальний порт

# remote.tunnelsView.input
source: Press Enter to confirm or Escape to cancel.
uk: Натисніть Enter, щоб підтвердити, або Escape, щоб скасувати.

# remote.tunnelsView.labelPlaceholder
source: Port label
uk: Мітка порту

# remote.tunnelsView.portNumberToHigh
source: Port number must be ≥ 0 and < {0}.
uk: Номер порту повинен бути ≥ 0 та < {0}.

# remote.tunnelsView.portNumberValid
source: Forwarded port should be a number or a host:port.
uk: Перенаправлений порт має бути числом або хост:порт.

# remote.tunnelsView.portShouldBeNumber
source: Local port should be a number.
uk: Локальний порт має бути числом.

# tunnel.addressColumn.label
source: Forwarded Address
uk: Переслане повідомлення

# tunnel.addressColumn.tooltip
source: The address that the forwarded port is available at.
uk: Адреса, за якою доступний переадресований порт.

# tunnel.focusContext
source: Whether the Ports view has focus.
uk: Чи має фокус вигляд Портів.

# tunnel.iconColumn.notRunning
source: No running process.
uk: Немає запущених процесів.

# tunnel.iconColumn.running
source: Port has running process.
uk: Порт має запущений процес.

# tunnel.originColumn.label
source: Origin
uk: Походження

# tunnel.originColumn.tooltip
source: The source that a forwarded port originates from. Can be an extension, user forwarded, statically forwarded, or automatically forwarded.
uk: Джерело, з якого походить переадресований порт. Може бути розширенням, переадресованим користувачем, статично переадресованим або автоматично переадресованим.

# tunnel.portColumn.label
source: Port
uk: Порт

# tunnel.portColumn.tooltip
source: The label and remote port number of the forwarded port.
uk: Мітка та номер віддаленого порту переадресованого порту.

# tunnel.privacyColumn.label
source: Visibility
uk: Видимість

# tunnel.privacyColumn.tooltip
source: The availability of the forwarded port.
uk: Доступність пересланого порту.

# tunnel.processColumn.label
source: Running Process
uk: Запущений процес

# tunnel.processColumn.tooltip
source: The command line of the process that is using the port.
uk: Командний рядок процесу, який використовує порт.

# tunnelContext.privacyMenu
source: Port Visibility
uk: Портова видимість

# tunnelContext.protocolMenu
source: Change Port Protocol
uk: Змінити протокол порту

# tunnelPrivacy.unknown
source: Unknown
uk: Невідомо

source: Tunnel View
uk: Тунельний вид

# tunnelView.runningProcess.inacessable
source: Process information unavailable
uk: Інформація про процес недоступна

# invalidWorkspaceDetail
source: Please select another workspace to open.
uk: Будь ласка, виберіть інше робоче середовище для відкриття.

# invalidWorkspaceMessage
source: Workspace does not exist
uk: Робоча область не існує

# invalidWorkspacePrimary
source: &&Open Workspace...
uk: &&Відкрити робочий простір...

# pauseSocketWriting
source: Connection: Pause socket writing
uk: З'єднання: Призупинити запис сокета

source: Remote
uk: Віддалений

# remote.autoForwardPortFallback
source: The number of auto forwarded ports that will trigger the switch from `process` to `hybrid` when automatically forwarding ports and `remote.autoForwardPortsSource` is set to `process` by default. Set to `0` to disable the fallback. When `remote.autoForwardPortsFallback` hasn't been configured, but `remote.autoForwardPortsSource` has, `remote.autoForwardPortsFallback` will be treated as though it's set to `0`.
uk: Кількість автоматично пересланих портів, які викликатимуть перехід з `process` на `hybrid`, коли порти автоматично пересилаються, а `remote.autoForwardPortsSource` за замовчуванням встановлено на `process`. Встановіть на `0`, щоб вимкнути резервування. Коли `remote.autoForwardPortsFallback` не було налаштовано, але `remote.autoForwardPortsSource` було, `remote.autoForwardPortsFallback` буде розглядатися так, ніби він встановлений на `0`.

# remote.autoForwardPorts
source: When enabled, new running processes are detected and ports that they listen on are automatically forwarded. Disabling this setting will not prevent all ports from being forwarded. Even when disabled, extensions will still be able to cause ports to be forwarded, and opening some URLs will still cause ports to forwarded. Also see {0}.
uk: Коли ця функція увімкнена, нові запущені процеси виявляються, і порти, на яких вони слухають, автоматично пересилаються. Вимкнення цієї налаштування не запобіжить пересилання всіх портів. Навіть коли вона вимкнена, розширення все ще зможуть викликати пересилання портів, а відкриття деяких URL-адрес все ще призведе до пересилання портів. Дивіться також {0}.

# remote.autoForwardPortsSource
source: Sets the source from which ports are automatically forwarded when {0} is true. When {0} is false, {1} will be used to find information about ports that have already been forwarded. On Windows and macOS remotes, the `process` and `hybrid` options have no effect and `output` will be used.
uk: Встановлює джерело, з якого порти автоматично пересилаються, коли {0} є істинним. Коли {0} є хибним, {1} буде використано для отримання інформації про порти, які вже були переслані. На віддалених системах Windows та macOS параметри `process` та `hybrid` не мають жодного ефекту, і буде використано `output`.

# remote.autoForwardPortsSource.hybrid
source: Ports will be automatically forwarded when discovered by reading terminal and debug output. Not all processes that use ports will print to the integrated terminal or debug console, so some ports will be missed. Ports will be "un-forwarded" by watching for processes that listen on that port to be terminated.
uk: Порти будуть автоматично перенаправлені при їх виявленні шляхом читання виходу терміналу та налагодження. Не всі процеси, які використовують порти, будуть виводити інформацію в інтегрований термінал або консоль налагодження, тому деякі порти можуть бути пропущені. Порти будуть "розпередані" шляхом спостереження за процесами, які слухають на цьому порті, до їх завершення.

# remote.autoForwardPortsSource.output
source: Ports will be automatically forwarded when discovered by reading terminal and debug output. Not all processes that use ports will print to the integrated terminal or debug console, so some ports will be missed. Ports forwarded based on output will not be "un-forwarded" until reload or until the port is closed by the user in the Ports view.
uk: Порти будуть автоматично перенаправлені, коли їх виявлять шляхом читання виходу термінала та налагодження. Не всі процеси, які використовують порти, виводитимуть інформацію в інтегрований термінал або консоль налагодження, тому деякі порти можуть бути пропущені. Порти, перенаправлені на основі виходу, не будуть "скасовані" до перезавантаження або поки порт не буде закритий користувачем у вигляді Портів.

# remote.autoForwardPortsSource.process
source: Ports will be automatically forwarded when discovered by watching for processes that are started and include a port.
uk: Порти будуть автоматично перенаправлені, коли їх виявлять, спостерігаючи за процесами, які запускаються і включають порт.

# remote.extensionKind
source: Override the kind of an extension. `ui` extensions are installed and run on the local machine while `workspace` extensions are run on the remote. By overriding an extension's default kind using this setting, you specify if that extension should be installed and enabled locally or remotely.
uk: Перезапишіть тип розширення. Розширення `ui` встановлюються та виконуються на локальному комп'ютері, тоді як розширення `workspace` виконуються віддалено. Перезаписуючи тип розширення за замовчуванням за допомогою цього налаштування, ви вказуєте, чи це розширення має бути встановлене та активоване локально чи віддалено.

# remote.forwardOnClick
source: Controls whether local URLs with a port will be forwarded when opened from the terminal and the debug console.
uk: Контролює, чи будуть локальні URL-адреси з портом переслані при відкритті з терміналу та консолі налагодження.

# remote.localPortHost
source: Specifies the local host name that will be used for port forwarding.
uk: Вказує локальне ім'я хоста, яке буде використовуватися для переадресації портів.

# remote.portsAttributes
source: Set properties that are applied when a specific port number is forwarded. For example: ``` "3000": { "label": "Application" }, "40000-55000": { "onAutoForward": "ignore" }, ".+\\/server.js": { "onAutoForward": "openPreview" } ```
uk: Встановіть властивості, які застосовуються, коли пересилається конкретний номер порту. Наприклад: ``` "3000": { "label": "Застосунок" }, "40000-55000": { "onAutoForward": "ігнорувати" }, ".+\\/server.js": { "onAutoForward": "відкритиПопереднійПерегляд" } ```

# remote.portsAttributes.defaults
source: Set default properties that are applied to all ports that don't get properties from the setting {0}. For example: ``` { "onAutoForward": "ignore" } ```
uk: Встановіть властивості за замовчуванням, які застосовуються до всіх портів, що не отримують властивості з налаштування {0}. Наприклад: ``` { "onAutoForward": "ігнорувати" } ```

# remote.portsAttributes.elevateIfNeeded
source: Automatically prompt for elevation (if needed) when this port is forwarded. Elevate is required if the local port is a privileged port.
uk: Автоматично запитувати підвищення прав (якщо потрібно), коли цей порт перенаправлений. Підвищення прав необхідне, якщо локальний порт є привілейованим портом.

# remote.portsAttributes.ignore
source: This port will not be automatically forwarded.
uk: Цей порт не буде автоматично перенаправлений.

# remote.portsAttributes.label
source: Label that will be shown in the UI for this port.
uk: Мітка, яка буде показана в інтерфейсі користувача для цього порту.

# remote.portsAttributes.labelDefault
source: Application
uk: Заявка

# remote.portsAttributes.notify
source: Shows a notification when a port is automatically forwarded.
uk: Показує сповіщення, коли порт автоматично перенаправляється.

# remote.portsAttributes.onForward
source: Defines the action that occurs when the port is discovered for automatic forwarding
uk: Визначає дію, яка відбувається, коли порт виявляється для автоматичного пересилання.

# remote.portsAttributes.openBrowser
source: Opens the browser when the port is automatically forwarded. Depending on your settings, this could open an embedded browser.
uk: Відкриває браузер, коли порт автоматично перенаправляється. Залежно від ваших налаштувань, це може відкрити вбудований браузер.

# remote.portsAttributes.openBrowserOnce
source: Opens the browser when the port is automatically forwarded, but only the first time the port is forward during a session. Depending on your settings, this could open an embedded browser.
uk: Відкриває браузер, коли порт автоматично перенаправлений, але лише перший раз, коли порт перенаправляється під час сеансу. Залежно від ваших налаштувань, це може відкрити вбудований браузер.

# remote.portsAttributes.openPreview
source: Opens a preview in the same window when the port is automatically forwarded.
uk: Відкриває попередній перегляд у тому ж вікні, коли порт автоматично перенаправляється.

# remote.portsAttributes.patternError
source: Must be a port number, range of port numbers, or regular expression.
uk: Повинен бути номер порту, діапазон номерів портів або регулярний вираз.
