Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# tabActiveBorder
source: Border on the bottom of an active tab. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон внизу активної вкладки. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabActiveBorderTop
source: Border to the top of an active tab. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Межа до верху активної вкладки. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabActiveForeground
source: Active tab foreground color in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір переднього плану активної вкладки в активній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabActiveModifiedBorder
source: Border on the top of modified active tabs in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон зверху модифікованих активних вкладок в активній групі. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabActiveUnfocusedBorder
source: Border on the bottom of an active tab in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон внизу активної вкладки в неактивній групі. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabActiveUnfocusedBorderTop
source: Border to the top of an active tab in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон зверху активної вкладки в неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabBorder
source: Border to separate tabs from each other. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон для розділення вкладок один від одного. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabDragAndDropBorder
source: Border between tabs to indicate that a tab can be inserted between two tabs. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Межа між вкладками, щоб вказати, що вкладка може бути вставлена між двома вкладками. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabHoverBackground
source: Tab background color when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір фону вкладок при наведенні. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabHoverBorder
source: Border to highlight tabs when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон для підсвічування вкладок при наведенні. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabHoverForeground
source: Tab foreground color when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір фону вкладок при наведенні. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabInactiveBackground
source: Inactive tab background color in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Фоновий колір неактивної вкладки в активній групі. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabInactiveForeground
source: Inactive tab foreground color in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір переднього плану неактивної вкладки в активній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabInactiveModifiedBorder
source: Border on the top of modified inactive tabs in an active group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон на верхній частині змінених неактивних вкладок у активній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabSelectedBackground
source: Background of a selected tab. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Фон вибраної вкладки. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabSelectedBorderTop
source: Border to the top of a selected tab. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Межа до верхньої частини вибраної вкладки. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabSelectedForeground
source: Foreground of a selected tab. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Передній план вибраної вкладки. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedActiveBackground
source: Active tab background color in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір фону активної вкладки в неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedActiveForeground
source: Active tab foreground color in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір переднього плану активної вкладки в неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedHoverBackground
source: Tab background color in an unfocused group when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір фону вкладки в неактивній групі під час наведення. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedHoverBorder
source: Border to highlight tabs in an unfocused group when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон для підсвічування вкладок у неактивній групі під час наведення. Вкладки є контейнерами для редакторів в області редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedHoverForeground
source: Tab foreground color in an unfocused group when hovering. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір переднього плану вкладок у неактивній групі під час наведення. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedInactiveBackground
source: Inactive tab background color in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір фону неактивної вкладки в неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# tabUnfocusedInactiveForeground
source: Inactive tab foreground color in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Колір переднього плану неактивної вкладки в неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# tabsContainerBackground
source: Background color of the editor group title header when tabs are enabled. Editor groups are the containers of editors.
uk: Колір фону заголовка групи редакторів, коли вкладки увімкнені. Групи редакторів є контейнерами редакторів.

# tabsContainerBorder
source: Border color of the editor group title header when tabs are enabled. Editor groups are the containers of editors.
uk: Колір рамки заголовка групи редакторів, коли вкладки увімкнені. Групи редакторів - це контейнери для редакторів.

# titleBarActiveBackground
source: Title bar background when the window is active.
uk: Фонове зображення заголовка вікна, коли воно активне.

# titleBarActiveForeground
source: Title bar foreground when the window is active.
uk: Передній план рядка заголовка, коли вікно активне.

# titleBarBorder
source: Title bar border color.
uk: Колір межі заголовка.

# titleBarInactiveBackground
source: Title bar background when the window is inactive.
uk: Фонове зображення рядка заголовка, коли вікно неактивне.

# titleBarInactiveForeground
source: Title bar foreground when the window is inactive.
uk: Передній план рядка заголовка, коли вікно неактивне.

# unfocusedActiveModifiedBorder
source: Border on the top of modified active tabs in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Границя у верхній частині змінених активних вкладок у неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# unfocusedINactiveModifiedBorder
source: Border on the top of modified inactive tabs in an unfocused group. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон у верхній частині змінених неактивних вкладок у неактивній групі. Вкладки є контейнерами для редакторів у зоні редактора. У одній групі редакторів може бути відкрито кілька вкладок. Може бути кілька груп редакторів.

# windowActiveBorder
source: The color used for the border of the window when it is active on macOS or Linux. Requires custom title bar style and custom or hidden window controls on Linux.
uk: Колір, що використовується для рамки вікна, коли воно активне на macOS або Linux. Потрібен користувацький стиль заголовка вікна та користувацькі або приховані елементи управління вікном на Linux.

# windowInactiveBorder
source: The color used for the border of the window when it is inactive on macOS or Linux. Requires custom title bar style and custom or hidden window controls on Linux.
uk: Колір, що використовується для межі вікна, коли воно неактивне на macOS або Linux. Потребує кастомного стилю заголовка вікна та кастомних або прихованих елементів управління вікном на Linux.

source: Default view icon.
uk: Іконка за замовчуванням.

# duplicateId
source: A view with id '{0}' is already registered
uk: Перегляд з ідентифікатором '{0}' вже зареєстровано

# treeView.notRegistered
source: No tree view with id '{0}' registered.
uk: Не зареєстровано жодного дерева з ідентифікатором '{0}'.

# views log
source: Views
uk: Перегляди

source: Configure Runtime Arguments
uk: Налаштувати аргументи виконання

# reloadWindowWithExtensionsDisabled
source: Reload with Extensions Disabled
uk: Перезавантажити з вимкненими розширеннями

source: Reveal User Data Folder
uk: Відкрити папку даних користувача

source: Show GPU Info
uk: Показати інформацію про GPU

source: Stop Tracing
uk: Зупинити відстеження

# stopTracing.button
source: &&Relaunch and Enable Tracing
uk: &&Перезапустити та увімкнути трасування

# stopTracing.detail
source: This can take up to one minute to complete.
uk: Це може зайняти до однієї хвилини для завершення.

# stopTracing.message
source: Tracing requires to launch with a '--trace' argument
uk: Відстеження вимагає запуску з аргументом '--trace'

# stopTracing.title
source: Creating trace file...
uk: Створення файлу трасування...

# toggleDevTools
source: Toggle Developer Tools
uk: Перемкнути інструменти розробника

# install
source: Install '{0}' command in PATH
uk: Встановіть команду '{0}' у PATH

source: Shell Command
uk: Команда оболонки

# successFrom
source: Shell command '{0}' successfully uninstalled from PATH.
uk: Команду оболонки '{0}' успішно видалено з PATH.

# successIn
source: Shell command '{0}' successfully installed in PATH.
uk: Команду оболонки '{0}' успішно встановлено в PATH.

# uninstall
source: Uninstall '{0}' command from PATH
uk: Видалити команду '{0}' з PATH

# close
source: Close Window
uk: Закрити

source: Close Window
uk: Закрити вікно

# current
source: Current Window
uk: Поточне вікно

# disableWindowAlwaysOnTop
source: Turn Off Always on Top
uk: Вимкнути завжди зверху

# enableWindowAlwaysOnTop
source: Turn On Always on Top
uk: Увімкнути Завжди на верху

# miCloseWindow
source: Clos&&e Window
uk: Закрити вікно

# miZoomIn
source: &&Zoom In
uk: &&Збільшити

# miZoomOut
source: &&Zoom Out
uk: &&Зменшити масштаб

# miZoomReset
source: &&Reset Zoom
uk: &&Скинути масштаб

source: Quick Switch Window...
uk: Швидкий перемикач вікон...

source: Switch Window...
uk: Переключити вікно...

# switchWindowPlaceHolder
source: Select a window to switch to
uk: Виберіть вікно, щоб перемкнутися на нього

source: Toggle Window Always on Top
uk: Перемикати вікно завжди зверху

# windowDirtyAriaLabel
source: {0}, window with unsaved changes
uk: {0}, вікно з незбереженими змінами

source: window group
uk: віконна група

source: Zoom In
uk: Збільшити

source: Zoom Out
uk: Зменшити масштаб

# zoomReset
source: Reset Zoom
uk: Скинути масштаб

# application.shellEnvironmentResolutionTimeout
source: Controls the timeout in seconds before giving up resolving the shell environment when the application is not already launched from a terminal. See our [documentation](https://go.microsoft.com/fwlink/?linkid=2149667) for more information.
uk: Контролює тайм-аут у секундах перед відмовою від вирішення середовища оболонки, коли додаток ще не запущено з терміналу. Дивіться нашу [документацію](https://go.microsoft.com/fwlink/?linkid=2149667) для отримання додаткової інформації.

# argv.crashReporterId
source: Unique id used for correlating crash reports sent from this app instance.
uk: Унікальний ідентифікатор, що використовується для кореляції звітів про аварії, надісланих з цього екземпляра програми.

# argv.disableChromiumSandbox
source: Disables the Chromium sandbox. This is useful when running VS Code as elevated on Linux and running under Applocker on Windows.
uk: Вимикає пісочницю Chromium. Це корисно при запуску VS Code з підвищеними правами на Linux та при запуску під Applocker на Windows.

# argv.disableHardwareAcceleration
source: Disables hardware acceleration. ONLY change this option if you encounter graphic issues.
uk: Вимикає апаратне прискорення. Змінюйте цю опцію ТІЛЬКИ у разі виникнення графічних проблем.

# argv.disableLcdText
source: Disables LCD font antialiasing.
uk: Вимикає згладжування шрифтів LCD.

# argv.enableCrashReporter
source: Allows to disable crash reporting, should restart the app if the value is changed.
uk: Дозволяє вимкнути звітність про збої, потрібно перезапустити додаток, якщо значення змінено.

# argv.enableRDPDisplayTracking
source: Ensures that maximized windows gets restored to correct display during RDP reconnection.
uk: Забезпечує, щоб максимізовані вікна відновлювались до правильного відображення під час повторного підключення RDP.

# argv.enebleProposedApi
source: Enable proposed APIs for a list of extension ids (such as `vscode.git`). Proposed APIs are unstable and subject to breaking without warning at any time. This should only be set for extension development and testing purposes.
uk: Увімкніть запропоновані API для списку ідентифікаторів розширень (таких як `vscode.git`). Запропоновані API є нестабільними і можуть зазнати змін без попередження в будь-який момент. Це слід встановлювати лише для цілей розробки та тестування розширень.

# argv.force-renderer-accessibility
source: Forces the renderer to be accessible. ONLY change this if you are using a screen reader on Linux. On other platforms the renderer will automatically be accessible. This flag is automatically set if you have editor.accessibilitySupport: on.
uk: Примушує рендерер бути доступним. Змінюйте це ТІЛЬКИ, якщо ви використовуєте екранний читач на Linux. На інших платформах рендерер буде автоматично доступним. Цей прапорець автоматично встановлюється, якщо у вас editor.accessibilitySupport: on.

# argv.forceColorProfile
source: Allows to override the color profile to use. If you experience colors appear badly, try to set this to `srgb` and restart.
uk: Дозволяє перевизначити профіль кольору для використання. Якщо ви помічаєте, що кольори виглядають неправильно, спробуйте встановити це значення на `srgb` і перезапустити.

# argv.locale
source: The display Language to use. Picking a different language requires the associated language pack to be installed.
uk: Мова відображення для використання. Вибір іншої мови вимагає встановлення відповідного мовного пакету.

# argv.logLevel
source: Log level to use. Default is 'info'. Allowed values are 'error', 'warn', 'info', 'debug', 'trace', 'off'.
uk: Рівень журналювання для використання. Значення за замовчуванням - 'info'. Дозволені значення: 'error', 'warn', 'info', 'debug', 'trace', 'off'.

# argv.passwordStore
source: Configures the backend used to store secrets on Linux. This argument is ignored on Windows & macOS.
uk: Налаштовує бекенд, що використовується для зберігання секретів на Linux. Цей аргумент ігнорується на Windows і macOS.

# argv.proxyBypassList
source: Bypass any specified proxy for the given semi-colon-separated list of hosts. Example value "<local>;*.microsoft.com;*foo.com;1.2.3.4:5678", will use the proxy server for all hosts except for local addresses (localhost, 127.0.0.1 etc.), microsoft.com subdomains, hosts that contain the suffix foo.com and anything at 1.2.3.4:5678
uk: Обійти будь-який вказаний проксі для заданого списку хостів, розділеного крапкою з комою. Приклад значення "<local>;*.microsoft.com;*foo.com;1.2.3.4:5678" буде використовувати проксі-сервер для всіх хостів, за винятком локальних адрес (localhost, 127.0.0.1 тощо), піддоменів microsoft.com, хостів, що містять суфікс foo.com, та всього на 1.2.3.4:5678.

# argv.remoteDebuggingPort
source: Specifies the port to use for remote debugging.
uk: Вказує порт, який потрібно використовувати для віддаленого налагодження.

# argv.useInMemorySecretStorage
source: Ensures that an in-memory store will be used for secret storage instead of using the OS's credential store. This is often used when running VS Code extension tests or when you're experiencing difficulties with the credential store.
uk: Забезпечує використання сховища в пам'яті для зберігання секретів замість використання сховища облікових даних ОС. Це часто використовується під час виконання тестів розширень VS Code або коли ви стикаєтеся з труднощами зі сховищем облікових даних.

# closeWhenEmpty
source: Controls whether closing the last editor should also close the window. This setting only applies for windows that do not show folders.
uk: Контролює, чи закриття останнього редактора повинно також закрити вікно. Ця настройка застосовується лише для вікон, які не показують папки.

# confirmSaveUntitledWorkspace
source: Controls whether a confirmation dialog shows asking to save or discard an opened untitled workspace in the window when switching to another workspace. Disabling the confirmation dialog will always discard the untitled workspace.
uk: Контролює, чи показується діалог підтвердження, що запитує зберегти чи скасувати відкритий незбережений робочий простір у вікні при переході до іншого робочого простору. Вимкнення діалогу підтвердження завжди скасує незбережений робочий простір.

# controlsStyle
source: Adjust the appearance of the window controls to be native by the OS, custom drawn or hidden. Changes require a full restart to apply.
uk: Налаштуйте вигляд елементів керування вікном, щоб вони були рідними для ОС, кастомно намальованими або прихованими. Зміни вимагають повного перезапуску для застосування.

# dialogStyle
source: Adjust the appearance of dialogs to be native by the OS or custom.
uk: Налаштуйте вигляд діалогів, щоб вони були рідними для ОС або користувацькими.

# enableCrashReporterDeprecated
source: If this setting is false, no telemetry will be sent regardless of the new setting's value. Deprecated due to being combined into the {0} setting.
uk: Якщо ця настройка є хибною, жодна телеметрія не буде надіслана, незалежно від значення нової настройки. Відмінену через об'єднання в настройку {0}.

# keyboardConfigurationTitle
source: Keyboard
uk: Клавіатура

# mergeAllWindowTabs
source: Merge All Windows
uk: Об'єднати всі вікна

# miExit
source: E&&xit
uk: E&&вихід

source: Move Window Tab to New Window
uk: Перемістити вкладку в нове вікно

# newTab
source: New Window Tab
uk: Нова вкладка вікна
