Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_extensionManagement.xlf
Languages: uk

# I cannot reproduce
source: I can't reproduce
uk: Я не можу відтворити

# This is Bad
source: I can reproduce
uk: Я можу відтворити

# bisect
source: Extension Bisect is active and has disabled {0} extensions. Check if you can still reproduce the problem and proceed by selecting from these options.
uk: Розширення Bisect активне і вимкнуло {0} розширень. Перевірте, чи можете ви все ще відтворити проблему, і продовжте, вибравши з цих варіантів.

# bisect.plural
source: Extension Bisect is active and has disabled {0} extensions. Check if you can still reproduce the problem and proceed by selecting from these options.
uk: Розширення Bisect активне і вимкнуло {0} розширень. Перевірте, чи можете ви все ще відтворити проблему, і продовжте, вибравши з цих варіантів.

# bisect.singular
source: Extension Bisect is active and has disabled 1 extension. Check if you can still reproduce the problem and proceed by selecting from these options.
uk: Розширення Bisect активне і вимкнуло 1 розширення. Перевірте, чи можете ви все ще відтворити проблему, і продовжте, вибравши з цих варіантів.

source: Continue
uk: Продовжити

# detail.start
source: Extension Bisect will use binary search to find an extension that causes a problem. During the process the window reloads repeatedly (~{0} times). Each time you must confirm if you are still seeing problems.
uk: Розширення Bisect використовуватиме бінарний пошук, щоб знайти розширення, яке викликає проблему. Під час процесу вікно перезавантажується кілька разів (~{0} разів). Щоразу ви повинні підтвердити, чи все ще бачите проблеми.

# done.detail
source: Extension Bisect is done and has identified {0} as the extension causing the problem.
uk: Розширення Bisect завершено і виявило {0} як розширення, що викликає проблему.

# done.detail2
source: Extension Bisect is done but no extension has been identified. This might be a problem with {0}.
uk: Розширення Bisect виконано, але жодне розширення не було ідентифіковано. Це може бути проблемою з {0}.

# done.disbale
source: Keep this extension disabled
uk: Тримайте це розширення вимкненим

# done.msg
source: Extension Bisect
uk: Розширення Bisect

# msg.next
source: Extension Bisect
uk: Розширення Bisect

# msg.start
source: Extension Bisect
uk: Розширення Bisect

# msg2
source: &&Start Extension Bisect
uk: &&Почати розширення Бісект

# next.bad
source: I can &&reproduce
uk: Я можу &&відтворити

# next.cancel
source: &&Cancel Bisect
uk: &&Скасувати Бісект

# next.good
source: I ca&&n't reproduce
uk: Я не можу відтворити

# next.stop
source: &&Stop Bisect
uk: &&Зупинити Бісект

# report
source: &&Report Issue & Continue
uk: &&Повідомити про проблему & Продовжити

# title.isBad
source: Continue Extension Bisect
uk: Продовжити розширення бісект

# title.start
source: Start Extension Bisect
uk: Почати розширення бісект

# title.stop
source: Stop Extension Bisect
uk: Зупинити бісекту розширення

# Reload
source: Reload and Enable Extensions
uk: Перезавантажити та увімкнути розширення

# cannot change disablement environment
source: Cannot change enablement of {0} extension because it is disabled in environment
uk: Не можна змінити активацію розширення {0}, оскільки воно вимкнене в середовищі

# cannot change disallowed extension enablement
source: Cannot change enablement of {0} extension because it is disallowed
uk: Не можна змінити можливість {0} розширення, оскільки це заборонено

# cannot change enablement dependency
source: Cannot enable '{0}' extension because it depends on '{1}' extension that cannot be enabled
uk: Не вдалося активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке не може бути активоване.

# cannot change enablement environment
source: Cannot change enablement of {0} extension because it is enabled in environment
uk: Не можна змінити активацію розширення {0}, оскільки воно активоване в середовищі

# cannot change enablement extension kind
source: Cannot change enablement of {0} extension because of its extension kind
uk: Не вдається змінити активацію розширення {0} через його тип розширення

# cannot change enablement malicious
source: Cannot change enablement of {0} extension because it is malicious
uk: Не можна змінити активацію розширення {0}, оскільки воно є шкідливим

# cannot change enablement virtual workspace
source: Cannot change enablement of {0} extension because it does not support virtual workspaces
uk: Не можна змінити можливість {0} розширення, оскільки воно не підтримує віртуальні робочі області.

# cannot change invalid extension enablement
source: Cannot change enablement of {0} extension because of it is invalid
uk: Не можна змінити активацію розширення {0}, оскільки воно є недійсним

# cannot disable auth extension
source: Cannot change enablement {0} extension because Settings Sync depends on it.
uk: Не можна змінити активування {0} розширення, оскільки синхронізація налаштувань залежить від нього.

# cannot disable auth extension in workspace
source: Cannot change enablement of {0} extension in workspace because it contributes authentication providers
uk: Не можна змінити активацію розширення {0} у робочому просторі, оскільки воно надає постачальників аутентифікації.

# cannot disable language pack extension
source: Cannot change enablement of {0} extension because it contributes language packs.
uk: Не можна змінити активацію розширення {0}, оскільки воно постачає мовні пакети.

# extensionsDisabled
source: All installed extensions are temporarily disabled.
uk: Усі встановлені розширення тимчасово вимкнені.

source: No workspace.
uk: Немає робочого простору.

# not a web extension
source: Cannot add '{0}' because this extension is not a web extension.
uk: Не можна додати '{0}', оскільки цей розширення не є веб-розширенням.

source: Open Installed Web Extensions Resource
uk: Відкрити встановлені веб-розширення ресурсів

# accessExtensionFeature
source: Access '{0}' Feature
uk: Доступ до функції '{0}'

# accessExtensionFeatureMessage
source: '{0}' extension would like to access the '{1}' feature.
uk: '{0}' розширення хоче отримати доступ до функції '{1}'.

source: Allow
uk: Дозволити

# disallow
source: Don't Allow
uk: Не дозволяти

source: Browser
uk: Браузер

source: Remote
uk: Віддалений

# Manifest is not found
source: Installing Extension {0} failed: Manifest is not found.
uk: Встановлення розширення {0} не вдалося: Маніфест не знайдено.

# VS Code for Web
source: {0} for the Web
uk: {0} для вебу

# allUnverifed
source: All publishers are [**not** verified]({0}).
uk: Усі видавці [**не** перевірені]({0}).

# cannot be installed
source: Cannot install the '{0}' extension because it is not available in this setup.
uk: Не вдається встановити розширення '{0}', оскільки воно недоступне в цій конфігурації.

# cannot be installed in server
source: Cannot install the '{0}' extension because it is not available in the '{1}' setup.
uk: Не вдається встановити розширення '{0}', оскільки воно недоступне в налаштуванні '{1}'.

# checkAllTrustedPublishersTitle
source: Do you trust the publisher "{0}" and {1} others?
uk: Чи довіряєте ви видавцеві "{0}" та {1} іншим?

# checkTrustedPublisherTitle
source: Do you trust the publisher "{0}"?
uk: Чи довіряєте ви видавцеві "{0}"?

# checkTwoTrustedPublishersTitle
source: Do you trust publishers "{0}" and "{1}"?
uk: Чи довіряєте ви видавцям "{0}" та "{1}"?

# extension published by message
source: The extension {0} is published by {1}.
uk: Розширення {0} опубліковано {1}.

# extensionInstallWorkspaceTrustButton
source: Trust Workspace & Install
uk: Довіртеся робочому простору та встановіть

# extensionInstallWorkspaceTrustContinueButton
source: Install
uk: Встановити

# extensionInstallWorkspaceTrustManageButton
source: Learn More
uk: Дізнатися більше

# extensionInstallWorkspaceTrustMessage
source: Enabling this extension requires a trusted workspace.
uk: Увімкнення цього розширення вимагає надійного робочого простору.

# firstTimeInstallingMessage
source: This is the first time you're installing extensions from these publishers.
uk: Це перший раз, коли ви встановлюєте розширення від цих видавців.

source: &&Install
uk: &&Встановити

# install and do no sync
source: Install (Do &&not sync)
uk: Встановити (Не && синхронізувати)

# install anyways
source: &&Install Anyway
uk: &&Встановити все одно

source: Install Extension
uk: Встановити розширення

source: Install Extensions
uk: Встановити розширення

# install multiple extensions
source: Would you like to install and synchronize extensions across your devices?
uk: Ви хочете встановити та синхронізувати розширення на своїх пристроях?

# install single extension
source: Would you like to install and synchronize '{0}' extension across your devices?
uk: Ви хочете встановити та синхронізувати розширення '{0}' на своїх пристроях?

source: &&Learn More
uk: &&Дізнатися більше

# limited support
source: '{0}' has limited functionality in {1}.
uk: '{0}' має обмежену функціональність у {1}.

# main.notFound
source: Cannot activate because {0} not found
uk: Не вдалося активувати, оскільки {0} не знайдено

source: Manifest is not found
uk: Маніфест не знайдено

# message1
source: The extension {0} is published by {1}. This is the first extension you're installing from this publisher.
uk: Розширення {0} опубліковано {1}. Це перше розширення, яке ви встановлюєте від цього видавця.

# message2
source: {0} has no control over the behavior of third-party extensions, including how they manage your personal data. Proceed only if you trust the publisher.
uk: {0} не має контролю над поведінкою сторонніх розширень, включаючи те, як вони управляють вашими особистими даними. Продовжуйте лише якщо довіряєте видавцеві.

# message3
source: Installing this extension will also install [extensions]({0}) published by {1} and {2}.
uk: Встановлення цього розширення також встановить [розширення]({0}), опубліковані {1} та {2}.

# message4
source: {0} has no control over the behavior of third-party extensions, including how they manage your personal data. Proceed only if you trust the publishers.
uk: {0} не має контролю над поведінкою сторонніх розширень, включаючи те, як вони управляють вашими особистими даними. Продовжуйте лише якщо довіряєте видавцям.

# multiInstallMessage
source: This is the first time you're installing extensions from publishers {0} and {1}.
uk: Це перший раз, коли ви встановлюєте розширення від видавців {0} та {1}.

# multipleDependentsError
source: Cannot uninstall extension '{0}'. Extensions '{1}', '{2}' and others depend on this.
uk: Не вдається видалити розширення '{0}'. Розширення '{1}', '{2}' та інші залежать від цього.

# non web extensions
source: '{0}' contains extensions which are not supported in {1}.
uk: '{0}' містить розширення, які не підтримуються в {1}.

# non web extensions detail
source: Contains extensions which are not supported.
uk: Містить розширення, які не підтримуються.

source: &&Show Extensions
uk: &&Показати розширення

# singleDependentError
source: Cannot uninstall extension '{0}'. Extension '{1}' depends on this.
uk: Не вдається видалити розширення '{0}'. Розширення '{1}' залежить від цього.

# singleUntrustedPublisher
source: Installing this extension will also install [extensions]({0}) published by {1}.
uk: Встановлення цього розширення також встановить [розширення]({0}), опубліковані {1}.

# trust and install
source: Trust Publisher & &&Install
uk: Довірити видавцю & &&Встановити

# trust publishers and install
source: Trust Publishers & &&Install
uk: Довіртеся видавцям & &&Встановити

# twoDependentsError
source: Cannot uninstall extension '{0}'. Extensions '{1}' and '{2}' depend on this.
uk: Не вдається видалити розширення '{0}'. Розширення '{1}' та '{2}' залежать від цього.

# unverifiedPublisherWithName
source: {0} is [**not** verified]({1}).
uk: {0} [**не** перевірено]({1}).

# unverifiedPublishers
source: {0} and {1} are [**not** verified]({2}).
uk: {0} та {1} [**не** перевірені]({2}).

# verifiedPublisherWithName
source: {0} has verified ownership of {1}.
uk: {0} підтвердив право власності на {1}.

# extensionIconVerifiedForeground
source: The icon color for extension verified publisher.
uk: Колір іконки для розширення перевіреного видавця.

# verifiedPublisher
source: Icon used for the verified extension publisher in the extensions view and editor.
uk: Іконка, що використовується для перевіреного видавця розширення у вигляді розширень та редакторі.

source: Local
uk: Місцевий

# incompatibleAPI
source: Can't install '{0}' extension. {1}
uk: Не вдається встановити розширення '{0}'. {1}

# notFoundCompatibleDependency
source: Can't install '{0}' extension because it is not compatible with the current version of {1} (version {2}).
uk: Не вдається встановити розширення '{0}', оскільки воно не сумісне з поточною версією {1} (версія {2}).

# notFoundReleaseExtension
source: Can't install release version of '{0}' extension because it has no release version.
uk: Не вдається встановити версію випуску розширення '{0}', оскільки у нього немає версії випуску.
