Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# localHistoryMaxFileEntries
source: Controls the maximum number of local file history entries per file. When the number of local file history entries exceeds this number for a file, the oldest entries will be discarded.
uk: Контролює максимальну кількість записів історії локальних файлів на файл. Коли кількість записів історії локальних файлів перевищує цю кількість для файлу, найстаріші записи будуть видалені.

# localHistoryMaxFileSize
source: Controls the maximum size of a file (in KB) to be considered for local file history. Files that are larger will not be added to the local file history. Changing this setting has no effect on existing local file history entries.
uk: Контролює максимальний розмір файлу (в КБ), який буде враховуватися для локальної історії файлів. Файли, які більші, не будуть додані до локальної історії файлів. Зміна цього налаштування не вплине на існуючі записи локальної історії файлів.

# menuBarVisibility
source: Control the visibility of the menu bar. A setting of 'toggle' means that the menu bar is hidden and a single press of the Alt key will show it. A setting of 'compact' will move the menu into the side bar.
uk: Контролюйте видимість панелі меню. Налаштування 'перемикання' означає, що панель меню прихована, і одне натискання клавіші Alt покаже її. Налаштування 'компактний' перемістить меню в бокову панель.

# menuBarVisibility.mac
source: Control the visibility of the menu bar. A setting of 'toggle' means that the menu bar is hidden and executing `Focus Application Menu` will show it. A setting of 'compact' will move the menu into the side bar.
uk: Контролюйте видимість панелі меню. Налаштування 'перемикання' означає, що панель меню прихована, і виконання `Фокус на меню програми` покаже її. Налаштування 'компактний' перемістить меню в бічну панель.

# mergeWindow
source: Configure an interval in seconds during which the last entry in local file history is replaced with the entry that is being added. This helps reduce the overall number of entries that are added, for example when auto save is enabled. This setting is only applied to entries that have the same source of origin. Changing this setting has no effect on existing local file history entries.
uk: Налаштуйте інтервал у секундах, протягом якого останній запис у локальній історії файлів замінюється на запис, що додається. Це допомагає зменшити загальну кількість записів, які додаються, наприклад, коли увімкнено автоматичне збереження. Цей параметр застосовується лише до записів, які мають одне й те саме джерело походження. Зміна цього параметра не вплине на існуючі записи локальної історії файлів.

# mouseBackForwardToNavigate
source: Enables the use of mouse buttons four and five for commands 'Go Back' and 'Go Forward'.
uk: Дозволяє використовувати кнопки миші чотири і п’ять для команд 'Назад' і 'Вперед'.

# navigationControlEnabled
source: Controls whether the navigation control is shown in the custom title bar. This setting only has an effect when {0} is not set to {1}.
uk: Контролює, чи відображається елемент навігації в користувацькій заголовній панелі. Цей параметр має ефект лише тоді, коли {0} не встановлено на {1}.

# navigationControlEnabledWeb
source: Controls whether the navigation control in the title bar is shown.
uk: Контролює, чи відображається елемент навігації в заголовку.

# navigationScope
source: Controls the scope of history navigation in editors for commands such as 'Go Back' and 'Go Forward'.
uk: Контролює обсяг навігації історії в редакторах для команд, таких як 'Назад' та 'Вперед'.

# openDefaultKeybindings
source: Controls whether opening keybinding settings also opens an editor showing all default keybindings.
uk: Контролює, чи відкриття налаштувань клавіш також відкриває редактор, що показує всі стандартні клавіші.

# openDefaultSettings
source: Controls whether opening settings also opens an editor showing all default settings.
uk: Контролює, чи відкриття налаштувань також відкриває редактор, що показує всі налаштування за замовчуванням.

# openFilesInNewWindow
source: Controls whether files should open in a new window when using a command line or file dialog. Note that there can still be cases where this setting is ignored (e.g. when using the `--new-window` or `--reuse-window` command line option).
uk: Контролює, чи повинні файли відкриватися в новому вікні при використанні командного рядка або діалогу файлів. Зверніть увагу, що можуть бути випадки, коли ця налаштування ігнорується (наприклад, при використанні параметра командного рядка `--new-window` або `--reuse-window`).

# openFilesInNewWindowMac
source: Controls whether files should open in a new window when using a command line or file dialog. Note that there can still be cases where this setting is ignored (e.g. when using the `--new-window` or `--reuse-window` command line option).
uk: Контролює, чи повинні файли відкриватися в новому вікні при використанні командного рядка або діалогу файлів. Зверніть увагу, що можуть бути випадки, коли ця настройка ігнорується (наприклад, при використанні параметра командного рядка `--new-window` або `--reuse-window`).

# openFoldersInNewWindow
source: Controls whether folders should open in a new window or replace the last active window. Note that there can still be cases where this setting is ignored (e.g. when using the `--new-window` or `--reuse-window` command line option).
uk: Контролює, чи повинні папки відкриватися в новому вікні або замінювати останнє активне вікно. Зверніть увагу, що можуть бути випадки, коли ця настройка ігнорується (наприклад, при використанні параметра командного рядка `--new-window` або `--reuse-window`).

# panelDefaultLocation
source: Controls the default location of the panel (Terminal, Debug Console, Output, Problems) in a new workspace. It can either show at the bottom, top, right, or left of the editor area.
uk: Контролює за замовчуванням місце розташування панелі (Термінал, Консоль налагодження, Вихід, Проблеми) у новому робочому просторі. Вона може відображатися внизу, вгорі, праворуч або ліворуч від області редактора.

# panelOpensMaximized
source: Controls whether the panel opens maximized. It can either always open maximized, never open maximized, or open to the last state it was in before being closed.
uk: Контролює, чи панель відкривається в максимізованому вигляді. Вона може або завжди відкриватися в максимізованому вигляді, або ніколи не відкриватися в максимізованому вигляді, або відкриватися в останньому стані, в якому вона була перед закриттям.

# panelShowLabels
source: Controls whether activity items in the panel title are shown as label or icon.
uk: Контролює, чи елементи активності в заголовку панелі відображаються як мітка чи значок.

# perEditorGroup
source: Controls if the limit of maximum opened editors should apply per editor group or across all editor groups.
uk: Контролює, чи обмеження максимального числа відкритих редакторів повинно застосовуватися для кожної групи редакторів або для всіх груп редакторів.

# pinnedTabSizing
source: Controls the size of pinned editor tabs. Pinned tabs are sorted to the beginning of all opened tabs and typically do not close until unpinned. This value is ignored when {0} is not set to {1}.
uk: Контролює розмір закріплених вкладок редактора. Закріплені вкладки сортуються на початку всіх відкритих вкладок і зазвичай не закриваються, поки не будуть відкриті. Це значення ігнорується, коли {0} не встановлено на {1}.

# preserveInput
source: Controls whether the last typed input to the command palette should be restored when opening it the next time.
uk: Контролює, чи має бути відновлено останній введений текст у палітрі команд при її відкритті наступного разу.

# problems.visibility
source: Controls whether the problems are visible throughout the editor and workbench.
uk: Контролює, чи проблеми видимі в редакторі та робочій області.

# profileName
source: `${profileName}`: name of the profile in which the workspace is opened (e.g. Data Science (Profile)). Ignored if default profile is used.
uk: `${profileName}`: назва профілю, в якому відкрито робоче середовище (наприклад, Data Science (Профіль)). Ігнорується, якщо використовується профіль за замовчуванням.

# remoteName
source: `${remoteName}`: e.g. SSH
uk: `${remoteName}`: наприклад, SSH

# restoreViewState
source: Restores the last editor view state (such as scroll position) when re-opening editors after they have been closed. Editor view state is stored per editor group and discarded when a group closes. Use the {0} setting to use the last known view state across all editor groups in case no previous view state was found for a editor group.
uk: Відновлює останній стан перегляду редактора (такий як позиція прокрутки) при повторному відкритті редакторів після їх закриття. Стан перегляду редактора зберігається для кожної групи редакторів і скидається, коли група закривається. Використовуйте налаштування {0}, щоб використовувати останній відомий стан перегляду для всіх груп редакторів у разі, якщо для групи редакторів не було знайдено попередній стан перегляду.

# revealIfOpen
source: Controls whether an editor is revealed in any of the visible groups if opened. If disabled, an editor will prefer to open in the currently active editor group. If enabled, an already opened editor will be revealed instead of opened again in the currently active editor group. Note that there are some cases where this setting is ignored, such as when forcing an editor to open in a specific group or to the side of the currently active group.
uk: Контролює, чи буде редактор показаний в будь-якій з видимих груп, якщо він відкритий. Якщо вимкнено, редактор надасть перевагу відкриттю в активній групі редакторів. Якщо увімкнено, вже відкритий редактор буде показаний замість повторного відкриття в активній групі редакторів. Зверніть увагу, що є деякі випадки, коли ця настройка ігнорується, наприклад, коли примусово відкривається редактор у конкретній групі або збоку від активної групи.

# rootName
source: `${rootName}`: name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace)).
uk: `${rootName}`: назва робочого простору з необов'язковою віддаленою назвою та індикатором робочого простору, якщо це застосовно (наприклад, myFolder, myRemoteFolder [SSH] або myWorkspace (Workspace)).

# rootNameShort
source: `${rootNameShort}`: shortened name of the workspace without suffixes (e.g. myFolder, myRemoteFolder or myWorkspace).
uk: `${rootNameShort}`: скорочене ім'я робочого простору без суфіксів (наприклад, myFolder, myRemoteFolder або myWorkspace).

# rootPath
source: `${rootPath}`: file path of the opened workspace or folder (e.g. /Users/Development/myWorkspace).
uk: `${rootPath}`: шлях до файлу відкритого робочого простору або папки (наприклад, /Users/Development/myWorkspace).

# scrollToSwitchTabs
source: Controls whether scrolling over tabs will open them or not. By default tabs will only reveal upon scrolling, but not open. You can press and hold the Shift-key while scrolling to change this behavior for that duration. This value is ignored when {0} is not set to {1}.
uk: Контролює, чи відкриватимуться вкладки при прокручуванні, чи ні. За замовчуванням вкладки лише з'являтимуться при прокручуванні, але не відкриватимуться. Ви можете натиснути і утримувати клавішу Shift під час прокручування, щоб змінити цю поведінку на цей час. Це значення ігнорується, коли {0} не встановлено на {1}.

# secondarySideBarDefaultVisibility
source: Controls the default visibility of the secondary side bar in workspaces or empty windows opened for the first time.
uk: Контролює стандартну видимість вторинної бічної панелі в робочих просторах або порожніх вікнах, відкритих вперше.

# secondarySideBarShowLabels
source: Controls whether activity items in the secondary side bar title are shown as label or icon. This setting only has an effect when {0} is not set to {1}.
uk: Контролює, чи елементи активності в заголовку вторинної бічної панелі відображаються як мітка чи значок. Ця настройка має ефект лише тоді, коли {0} не встановлено на {1}.

# separator
source: `${separator}`: a conditional separator (" - ") that only shows when surrounded by variables with values or static text.
uk: `${separator}`: умовний роздільник (" - "), який відображається лише тоді, коли оточений змінними з значеннями або статичним текстом.

# settings.editor.desc
source: Determines which Settings editor to use by default.
uk: Визначає, який редактор налаштувань використовувати за замовчуванням.

# settings.editor.json
source: Use the JSON file editor.
uk: Використовуйте редактор JSON файлів.

# settings.editor.ui
source: Use the settings UI editor.
uk: Використовуйте редактор налаштувань UI.

# settings.showAISearchToggle
source: Controls whether the AI search results toggle is shown in the search bar in the Settings editor after doing a search and once AI search results are available.
uk: Контролює, чи перемикач результатів пошуку AI відображається в рядку пошуку в редакторі налаштувань після виконання пошуку та коли результати пошуку AI доступні.

# sharedViewState
source: Preserves the most recent editor view state (such as scroll position) across all editor groups and restores that if no specific editor view state is found for the editor group.
uk: Зберігає останній стан перегляду редактора (такий як позиція прокрутки) для всіх груп редакторів і відновлює його, якщо не знайдено конкретного стану перегляду редактора для групи редакторів.

# showEditorTabs
source: Controls whether opened editors should show as individual tabs, one single large tab or if the title area should not be shown.
uk: Контролює, чи відкриті редактори повинні відображатися як окремі вкладки, одна велика вкладка або якщо область заголовка не повинна відображатися.

# showIcons
source: Controls whether opened editors should show with an icon or not. This requires a file icon theme to be enabled as well.
uk: Показати значки

# showTabIndex
source: When enabled, will show the tab index. This value is ignored when {0} is not set to {1}.
uk: Коли увімкнено, буде показано індекс вкладки. Це значення ігнорується, коли {0} не встановлено на {1}.

# sideBarLocation
source: Controls the location of the primary side bar and activity bar. They can either show on the left or right of the workbench. The secondary side bar will show on the opposite side of the workbench.
uk: Контролює розташування основної бічної панелі та панелі активності. Вони можуть відображатися зліва або справа від робочої області. Вторинна бічна панель відображатиметься на протилежному боці робочої області.

# sideBySideDirection
source: Controls the default direction of editors that are opened side by side (for example, from the Explorer). By default, editors will open on the right hand side of the currently active one. If changed to `down`, the editors will open below the currently active one. This also impacts the split editor action in the editor toolbar.
uk: Контролює напрямок за замовчуванням для редакторів, які відкриваються поряд (наприклад, з Провідника). За замовчуванням редактори відкриватимуться з правого боку від активного. Якщо змінити на `down`, редактори відкриватимуться під активним. Це також вплине на дію розділення редактора в панелі інструментів редактора.

# splitInGroupLayout
source: Controls the layout for when an editor is split in an editor group to be either vertical or horizontal.
uk: Контролює макет, коли редактор розділений у групі редакторів, щоб бути вертикальним або горизонтальним.

# splitOnDragAndDrop
source: Controls if editor groups can be split from drag and drop operations by dropping an editor or file on the edges of the editor area.
uk: Контролює, чи можуть групи редакторів бути розділені з операцій перетягування та скидання, скидаючи редактор або файл на краї редакторської області.

# splitSizing
source: Controls the size of editor groups when splitting them.
uk: Контролює розмір груп редакторів під час їх розділення.

# statusBarVisibility
source: Controls the visibility of the status bar at the bottom of the workbench.
uk: Контролює видимість панелі стану внизу робочої області.

# suggestCommands
source: Controls whether the command palette should have a list of commonly used commands.
uk: Контролює, чи має палітра команд список часто використовуваних команд.

# tabActionLocation
source: Controls the position of the editor's tabs action buttons (close, unpin). This value is ignored when {0} is not set to {1}.
uk: Контролює позицію кнопок дій вкладок редактора (закрити, відкріпити). Це значення ігнорується, коли {0} не встановлено на {1}.

# tabDescription
source: Controls the format of the label for an editor.
uk: Контролює формат етикетки для редактора.

# tabScrollbarHeight
source: Controls the height of the scrollbars used for tabs and breadcrumbs in the editor title area.
uk: Контролює висоту смуг прокрутки, що використовуються для вкладок і хлібних крихт у заголовку редактора.

# tabSizing
source: Controls the size of editor tabs. This value is ignored when {0} is not set to {1}.
uk: Контролює розмір вкладок редактора. Це значення ігнорується, коли {0} не встановлено на {1}.

# tips.enabled
source: When enabled, will show the watermark tips when no editor is open.
uk: Коли увімкнено, буде показувати підказки водяного знака, коли жоден редактор не відкрито.

# titleScrollbarVisibility
source: Controls the visibility of the scrollbars used for tabs and breadcrumbs in the editor title area.
uk: Контролює видимість смуг прокрутки, які використовуються для вкладок і хлібних крихт у заголовку редактора.

# untitledLabelFormat
source: Controls the format of the label for an untitled editor.
uk: Контролює формат етикетки для неназваного редактора.

# useSplitJSON
source: Controls whether to use the split JSON editor when editing settings as JSON.
uk: Контролює, чи використовувати розділений JSON-редактор під час редагування налаштувань у форматі JSON.

# viewVisibility
source: Controls the visibility of view header actions. View header actions may either be always visible, or only visible when that view is focused or hovered over.
uk: Контролює видимість дій заголовка перегляду. Дії заголовка перегляду можуть бути завжди видимими або видимими лише тоді, коли цей перегляд активний або наведений курсор.

# window.commandCenter
source: Show command launcher together with the window title. This setting only has an effect when {0} is not set to {1}.
uk: Показати запуск команд разом із заголовком вікна. Цей параметр має ефект лише тоді, коли {0} не встановлено на {1}.

# window.commandCenterWeb
source: Show command launcher together with the window title.
uk: Показати запуск команд разом з заголовком вікна.

# window.confirmBeforeClose.always
source: Always ask for confirmation.
uk: Завжди запитуйте підтвердження.

# window.confirmBeforeClose.always.web
source: Always try to ask for confirmation. Note that browsers may still decide to close a tab or window without confirmation.
uk: Завжди намагайтеся запитувати підтвердження. Зверніть увагу, що браузери все ще можуть вирішити закрити вкладку або вікно без підтвердження.

# window.confirmBeforeClose.keyboardOnly
source: Only ask for confirmation if a keybinding was used.
uk: Запитуйте підтвердження лише у разі використання прив'язки клавіші.

# window.confirmBeforeClose.keyboardOnly.web
source: Only ask for confirmation if a keybinding was used to close the window. Note that detection may not be possible in some cases.
uk: Запитуйте підтвердження лише у випадку, якщо для закриття вікна було використано комбінацію клавіш. Зверніть увагу, що в деяких випадках виявлення може бути неможливим.

# window.confirmBeforeClose.never
source: Never explicitly ask for confirmation.
uk: Ніколи не запитуйте підтвердження прямо.

# window.confirmBeforeClose.never.web
source: Never explicitly ask for confirmation unless data loss is imminent.
uk: Ніколи не запитуйте підтвердження явно, якщо втрата даних неминуча.

# window.menuBarVisibility.classic
source: Menu is displayed at the top of the window and only hidden in full screen mode.
uk: Меню відображається вгорі вікна і приховане лише в режимі повного екрану.

# window.menuBarVisibility.compact
source: Menu is displayed as a compact button in the side bar. This value is ignored when {0} is {1} and {2} is either {3} or {4}.
uk: Меню відображається як компактна кнопка в бічній панелі. Це значення ігнорується, коли {0} є {1}, а {2} є або {3}, або {4}.

# window.menuBarVisibility.compact.web
source: Menu is displayed as a compact button in the side bar.
uk: Меню відображається як компактна кнопка в бічній панелі.

# window.menuBarVisibility.hidden
source: Menu is always hidden.
uk: Меню завжди приховане.

# window.menuBarVisibility.toggle
source: Menu is hidden but can be displayed at the top of the window via the Alt key.
uk: Меню приховане, але його можна відобразити вгорі вікна за допомогою клавіші Alt.

# window.menuBarVisibility.toggle.mac
source: Menu is hidden but can be displayed at the top of the window by executing the `Focus Application Menu` command.
uk: Меню приховане, але його можна відобразити вгорі вікна, виконавши команду `Focus Application Menu`.

# window.menuBarVisibility.visible
source: Menu is always visible at the top of the window even in full screen mode.
uk: Меню завжди видно в верхній частині вікна, навіть у режимі повного екрану.

# window.openFilesInNewWindow.default
source: Files will open in a new window unless picked from within the application (e.g. via the File menu).
uk: Файли відкриються в новому вікні, якщо їх не вибрано з програми (наприклад, через меню Файл).

# window.openFilesInNewWindow.defaultMac
source: Files will open in the window with the files' folder open or the last active window unless opened via the Dock or from Finder.
uk: Файли відкриються у вікні з відкритою папкою файлів або в останньому активному вікні, якщо їх не відкрито через Dock або з Finder.

# window.openFilesInNewWindow.off
source: Files will open in the window with the files' folder open or the last active window.
uk: Файли відкриються у вікні з відкритою папкою файлів або в останньому активному вікні.

# window.openFilesInNewWindow.on
source: Files will open in a new window.
uk: Файли відкриються в новому вікні.

# window.openFoldersInNewWindow.default
source: Folders will open in a new window unless a folder is picked from within the application (e.g. via the File menu).
uk: Папки відкриватимуться в новому вікні, якщо папка не буде обрана зсередини програми (наприклад, через меню Файл).

# window.openFoldersInNewWindow.off
source: Folders will replace the last active window.
uk: Папки замінять останнє активне вікно.

# window.openFoldersInNewWindow.on
source: Folders will open in a new window.
uk: Папки відкриються в новому вікні.

# window.titleSeparator
source: Separator used by {0}.
uk: Роздільник, що використовується {0}.

# windowTitle
source: Controls the window title based on the current context such as the opened workspace or active editor. Variables are substituted based on the context:
uk: Контролює заголовок вікна на основі поточного контексту, такого як відкритий робочий простір або активний редактор. Змінні підставляються на основі контексту:

# workbench.activityBar.iconClickBehavior.focus
source: Focus the Primary Side Bar if the clicked item is already visible.
uk: Зосередьтеся на основній бічній панелі, якщо натиснутий елемент вже видимий.

# workbench.activityBar.iconClickBehavior.toggle
source: Hide the Primary Side Bar if the clicked item is already visible.
uk: Сховати основну бокову панель, якщо натиснутий елемент вже видимий.
