Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_outline.xlf
Languages: uk

# filteredTypes.array
source: When enabled, Outline shows `array`-symbols.
uk: Коли увімкнено, Outline показує символи `array`.

# filteredTypes.boolean
source: When enabled, Outline shows `boolean`-symbols.
uk: Коли увімкнено, Outline показує `boolean`-символи.

# filteredTypes.class
source: When enabled, Outline shows `class`-symbols.
uk: Коли увімкнено, Outline показує `class`-символи.

# filteredTypes.constant
source: When enabled, Outline shows `constant`-symbols.
uk: Коли увімкнено, Outline показує `constant`-символи.

# filteredTypes.constructor
source: When enabled, Outline shows `constructor`-symbols.
uk: Коли увімкнено, Outline показує символи `constructor`.

# filteredTypes.enum
source: When enabled, Outline shows `enum`-symbols.
uk: Коли увімкнено, Outline показує `enum`-символи.

# filteredTypes.enumMember
source: When enabled, Outline shows `enumMember`-symbols.
uk: Коли увімкнено, Outline показує символи `enumMember`.

# filteredTypes.event
source: When enabled, Outline shows `event`-symbols.
uk: Коли увімкнено, Outline показує символи `event`.

# filteredTypes.field
source: When enabled, Outline shows `field`-symbols.
uk: Коли увімкнено, Outline показує символи `field`.

# filteredTypes.file
source: When enabled, Outline shows `file`-symbols.
uk: Коли увімкнено, Outline показує символи `file`.

# filteredTypes.function
source: When enabled, Outline shows `function`-symbols.
uk: Коли увімкнено, Outline показує символи `function`.

# filteredTypes.interface
source: When enabled, Outline shows `interface`-symbols.
uk: Коли увімкнено, Outline показує `interface`-символи.

# filteredTypes.key
source: When enabled, Outline shows `key`-symbols.
uk: Коли увімкнено, Outline показує символи `key`.

# filteredTypes.method
source: When enabled, Outline shows `method`-symbols.
uk: Коли увімкнено, Outline показує `method`-символи.

# filteredTypes.module
source: When enabled, Outline shows `module`-symbols.
uk: Коли увімкнено, Outline показує `module`-символи.

# filteredTypes.namespace
source: When enabled, Outline shows `namespace`-symbols.
uk: Коли увімкнено, Outline показує символи `namespace`.

# filteredTypes.null
source: When enabled, Outline shows `null`-symbols.
uk: Коли увімкнено, Outline показує `null`-символи.

# filteredTypes.number
source: When enabled, Outline shows `number`-symbols.
uk: Коли увімкнено, Outline показує символи `number`.

# filteredTypes.object
source: When enabled, Outline shows `object`-symbols.
uk: Коли увімкнено, Outline показує символи `object`.

# filteredTypes.operator
source: When enabled, Outline shows `operator`-symbols.
uk: Коли увімкнено, Outline показує символи `operator`.

# filteredTypes.package
source: When enabled, Outline shows `package`-symbols.
uk: Коли увімкнено, Outline показує символи `package`.

# filteredTypes.property
source: When enabled, Outline shows `property`-symbols.
uk: Коли увімкнено, Outline показує символи `property`.

# filteredTypes.string
source: When enabled, Outline shows `string`-symbols.
uk: Коли увімкнено, Outline показує `string`-символи.

# filteredTypes.struct
source: When enabled, Outline shows `struct`-symbols.
uk: Коли увімкнено, Outline показує символи `struct`.

# filteredTypes.typeParameter
source: When enabled, Outline shows `typeParameter`-symbols.
uk: Коли увімкнено, Outline показує символи `typeParameter`.

# filteredTypes.variable
source: When enabled, Outline shows `variable`-symbols.
uk: Коли увімкнено, Outline показує символи `variable`.

# name
source: Outline
uk: Контур

# outline.initialState
source: Controls whether Outline items are collapsed or expanded.
uk: Контролює, чи елементи Outline згорнуті чи розгорнуті.

# outline.initialState.collapsed
source: Collapse all items.
uk: Згорнути всі елементи.

# outline.initialState.expanded
source: Expand all items.
uk: Розгорнути всі елементи.

# outline.problem.colors
source: Use colors for errors and warnings on Outline elements. Overwritten by {0} when it is off.
uk: Використовуйте кольори для помилок і попереджень на елементах Outline. Перезаписано {0}, коли це вимкнено.

# outline.problems.badges
source: Use badges for errors and warnings on Outline elements. Overwritten by {0} when it is off.
uk: Використовуйте значки для помилок і попереджень на елементах Outline. Перезаписується {0}, коли він вимкнений.

# outline.showIcons
source: Render Outline elements with icons.
uk: Відобразити елементи контурів з іконками.

# outline.showProblem
source: Show errors and warnings on Outline elements. Overwritten by {0} when it is off.
uk: Показувати помилки та попередження на елементах Outline. Перезаписується {0}, коли це вимкнено.

# outlineConfigurationTitle
source: Outline
uk: Контур

# outlineViewIcon
source: View icon of the outline view.
uk: Переглянути значок контурного вигляду.

# collapse
source: Collapse All
uk: Сховати все

# expand
source: Expand All
uk: Розгорнути все

source: Filter on Type
uk: Фільтр за типом

# followCur
source: Follow Cursor
uk: Слідувати за курсором

# sortByKind
source: Sort By: Category
uk: Сортувати за: Категорія

source: Sort By: Name
uk: Сортувати за: Ім'я

source: Sort By: Position
uk: Сортувати за: Позиція

# loading
source: Loading document symbols for '{0}'...
uk: Завантаження символів документа для '{0}'...

# no-editor
source: The active editor cannot provide outline information.
uk: Активний редактор не може надати інформацію про структуру.

# no-symbols
source: No symbols found in document '{0}'
uk: Не знайдено символів у документі '{0}'
