Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_testing.xlf
Languages: uk

# coverage.branchCovered
source: Branch {0} in {1} was executed {2} time(s).
uk: Гілка {0} у {1} була виконана {2} раз(и).

# coverage.branchCoveredYes
source: Branch {0} in {1} was executed.
uk: Гілка {0} у {1} була виконана.

# coverage.branchNotCovered
source: Branch {0} in {1} was not covered.
uk: Гілка {0} у {1} не була охоплена.

# coverage.branches
source: {0} of {1} of branches in {2} were covered.
uk: {0} з {1} гілок у {2} були покриті.

# coverage.declExecutedCount
source: `{0}` was executed {1} time(s).
uk: `{0}` було виконано {1} раз(и).

# coverage.declExecutedNo
source: `{0}` was not executed.
uk: `{0}` не був виконаний.

# coverage.declExecutedYes
source: `{0}` was executed.
uk: `{0}` було виконано.

# coverage.hideInline
source: Hide Inline Coverage
uk: Сховати вбудоване покриття

# coverage.toggleInline
source: Toggle Inline Coverage
uk: Перемикати вбудоване покриття

# testing.coverageForTestAvailable
source: {0} test(s) ran code in this file
uk: {0} тест(ів) виконано коду в цьому файлі

# testing.filterActionLabel
source: Filter Coverage to Test
uk: Фільтрувати покриття для тестування

# testing.goToNextMissedLine
source: Go to Next Uncovered Line
uk: Перейти до наступного непокритого рядка

# testing.goToNextMissedLineDesc
source: Navigate to the next line that is not covered by tests.
uk: Перейдіть до наступного рядка, який не покритий тестами.

# testing.goToPreviousMissedLine
source: Go to Previous Uncovered Line
uk: Перейти до попереднього неохопленого рядка

# testing.goToPreviousMissedLineDesc
source: Navigate to the previous line that is not covered by tests.
uk: Перейдіть до попереднього рядка, який не покритий тестами.

# testing.hideCoverageInExplorer
source: Hide Coverage in Explorer
uk: Сховати покриття в Провіднику

# testing.hideInlineCoverage
source: Hide Inline Coverage
uk: Сховати вбудоване покриття

# testing.rerun
source: Rerun
uk: Перезапустити

# testing.showInlineCoverage
source: Show Inline Coverage
uk: Показати вбудоване покриття

# testing.toggleCoverageInExplorerDesc
source: Toggle the display of test coverage in the File Explorer view.
uk: Перемикайте відображення покриття тестами у вигляді Провідника файлів.

# testing.toggleCoverageInExplorerTitle
source: Toggle Coverage in Explorer
uk: Переключити покриття в Explorer

# testing.toggleInlineCoverage
source: Toggle Inline
uk: Перемкнути вбудоване

# testing.toggleToolbarDesc
source: Toggle the sticky coverage bar in the editor.
uk: Перемикайте закріплену панель покриття в редакторі.

# testing.toggleToolbarTitle
source: Test Coverage Toolbar
uk: Панель покриття тестів

# changePerTestFilter
source: Click to view coverage for a single test
uk: Натисніть, щоб переглянути покриття для одного тесту

# testing.allTests
source: All tests
uk: Усі тести

# testing.coverageForTest
source: Showing "{0}"
uk: Показуючи "{0}"

# testing.percentCoverage
source: {0} Coverage
uk: {0} Покриття

# testing.pickTest
source: Pick a test to show coverage for
uk: Виберіть тест, щоб показати покриття для

# filterIcon
source: Icon for the 'Filter' action in the testing view.
uk: Іконка для дії 'Фільтр' у режимі тестування.

# hiddenIcon
source: Icon shown beside hidden tests, when they've been shown.
uk: Іконка, що відображається поруч із прихованими тестами, коли вони були показані.

# testViewIcon
source: View icon of the test view.
uk: Переглянути іконку тестового перегляду.

# testingCancelIcon
source: Icon to cancel ongoing test runs.
uk: Іконка для скасування поточних тестових запусків.

# testingCancelRefreshTests
source: Icon on the button to cancel refreshing tests.
uk: Іконка на кнопці для скасування оновлення тестів.

# testingCoverage
source: Icon representing test coverage
uk: Іконка, що представляє тестове покриття

# testingCoverageIcon
source: Icon of the "run test with coverage" action.
uk: Іконка дії "запустити тест з покриттям".

# testingDebugAllIcon
source: Icon of the "debug all tests" action.
uk: Іконка дії "відлагодити всі тести".

# testingDebugIcon
source: Icon of the "debug test" action.
uk: Іконка дії "тестування налагодження".

# testingErrorIcon
source: Icon shown for tests that have an error.
uk: Іконка, що відображається для тестів, які мають помилку.

# testingFailedIcon
source: Icon shown for tests that failed.
uk: Іконка, що показує тести, які не пройшли.

# testingMissingBranch
source: Icon representing a uncovered block without a range
uk: Іконка, що представляє відкритий блок без діапазону

# testingPassedIcon
source: Icon shown for tests that passed.
uk: Іконка, що відображається для тестів, які пройшли.

# testingQueuedIcon
source: Icon shown for tests that are queued.
uk: Іконка, що відображається для тестів, які знаходяться в черзі.

# testingRefreshTests
source: Icon on the button to refresh tests.
uk: Іконка на кнопці для оновлення тестів.

# testingRerunIcon
source: Icon of the "rerun tests" action.
uk: Іконка дії "перезапустити тести".

# testingResultsIcon
source: Icons for test results.
uk: Іконки для результатів тестування.

# testingRunAllIcon
source: Icon of the "run all tests" action.
uk: Іконка дії "запустити всі тести".

# testingRunAllWithCoverageIcon
source: Icon of the "run all tests with coverage" action.
uk: Іконка дії "запустити всі тести з покриттям".

# testingRunIcon
source: Icon of the "run test" action.
uk: Іконка дії "запустити тест".

# testingShowAsList
source: Icon shown when the test explorer is disabled as a tree.
uk: Іконка, що відображається, коли дослідник тестів вимкнено у вигляді дерева.

# testingShowAsTree
source: Icon shown when the test explorer is disabled as a list.
uk: Іконка, що відображається, коли дослідник тестів вимкнено у вигляді списку.

# testingSkippedIcon
source: Icon shown for tests that are skipped.
uk: Іконка, що відображається для тестів, які пропущені.

# testingTurnContinuousRunIsOn
source: Icon when continuous run is on for a test ite,.
uk: Іконка, коли безперервний запуск увімкнено для тестового елемента.

# testingTurnContinuousRunOff
source: Icon to turn continuous test runs off.
uk: Іконка для вимкнення безперервного виконання тестів.

# testingTurnContinuousRunOn
source: Icon to turn continuous test runs on.
uk: Іконка для увімкнення безперервного виконання тестів.

# testingUnsetIcon
source: Icon shown for tests that are in an unset state.
uk: Іконка, що відображається для тестів, які знаходяться в не встановленому стані.

# testingUpdateProfiles
source: Icon shown to update test profiles.
uk: Іконка, що відображається для оновлення тестових профілів.

# testingWasCovered
source: Icon representing that an element was covered
uk: Іконка, що вказує на те, що елемент був закритий

# branchCoverage
source: {0}/{1} branches covered ({2})
uk: {0}/{1} філій охоплено ({2})

# functionCoverage
source: {0}/{1} functions covered ({2})
uk: {0}/{1} функцій покрито ({2})

# statementCoverage
source: {0}/{1} statements covered ({2})
uk: {0}/{1} заяв покрито ({2})

# filteredToTest
source: Showing coverage for "{0}"
uk: Показуючи покриття для "{0}"

# functionsWithoutCoverage
source: {0} declarations without coverage...
uk: {0} декларацій без покриття...

source: Loading Coverage Details...
uk: Завантаження деталей покриття...

# testCoverageItemLabel
source: {0} coverage: {0}%
uk: {0} покриття: {0}%

# testCoverageTreeLabel
source: Test Coverage Explorer
uk: Дослідник покриття тестами

# testing.changeCoverageFilter
source: Filter Coverage by Test
uk: Фільтрувати покриття за тестом

# testing.changeCoverageSort
source: Change Sort Order
uk: Змінити порядок сортування

# testing.coverageCollapseAll
source: Collapse All Coverage
uk: Згорнути всі покриття

# testing.coverageSortByCoverage
source: Sort by Coverage
uk: Сортувати за покриттям

# testing.coverageSortByCoverageDescription
source: Files and declarations are sorted by total coverage
uk: Файли та декларації відсортовані за загальним покриттям

# testing.coverageSortByLocation
source: Sort by Location
uk: Сортувати за місцем розташування

# testing.coverageSortByLocationDescription
source: Files are sorted alphabetically, declarations are sorted by position
uk: Файли відсортовані за алфавітом, декларації відсортовані за позицією.

# testing.coverageSortByName
source: Sort by Name
uk: Сортувати за Іменем

# testing.coverageSortByNameDescription
source: Files and declarations are sorted alphabetically
uk: Файли та декларації відсортовані в алфавітному порядку.

# testing.coverageSortPlaceholder
source: Sort the Test Coverage view...
uk: Сортувати вигляд покриття тестами...

# configureProfile
source: Select a profile to update
uk: Виберіть профіль для оновлення

# coverageSelectedTests
source: Run Tests with Coverage
uk: Запустити тести з покриттям

source: Debug Test
uk: Налагодження тесту

source: Debug All Tests
uk: Виправити всі тести

# debugSelectedTests
source: Debug Tests
uk: Налагодження тестів

source: Discovering Tests
uk: Відкриття тестів

source: Get Explorer Selection
uk: Отримати вибір провідника

source: Get Selected Profiles
uk: Отримати вибрані профілі

source: Hide Test
uk: Сховати тест

# noCoverageTestProvider
source: No tests with coverage runners found in this workspace. You may need to install a test provider extension
uk: У цьому робочому просторі не знайдено тестів з покриттям. Вам, можливо, потрібно встановити розширення постачальника тестів.

# noDebugTestProvider
source: No debuggable tests found in this workspace. You may need to install a test provider extension
uk: У цьому робочому просторі не знайдено тестів, які можна налагоджувати. Можливо, вам потрібно встановити розширення постачальника тестів.

# noRelatedCode
source: No related code found.
uk: Не знайдено пов'язаного коду.

# noTestFound
source: No related tests found.
uk: Не знайдено пов'язаних тестів.

# noTestProvider
source: No tests found in this workspace. You may need to install a test provider extension
uk: У цьому робочому просторі не знайдено тестів. Можливо, вам потрібно встановити розширення постачальника тестів.

# noTests
source: No tests found in the selected file or folder
uk: Не знайдено тестів у вибраному файлі або папці.

# noTestsAtCursor
source: No tests found here
uk: Тестів тут не знайдено

# noTestsInFile
source: No tests found in this file
uk: Не знайдено жодних тестів у цьому файлі

source: Related Code
uk: Супутній код

source: Related Tests
uk: Пов'язані тести

source: Run Test
uk: Запустити тест

# run with cover test
source: Run Test with Coverage
uk: Запустити тест з покриттям

source: Run All Tests
uk: Запустити всі тести

# runAllWithCoverage
source: Run All Tests with Coverage
uk: Запустити всі тести з покриттям

# runSelectedTests
source: Run Tests
uk: Запустити тести

# testing.cancelRun
source: Cancel Test Run
uk: Скасувати тестовий запуск

# testing.cancelTestRefresh
source: Cancel Test Refresh
uk: Скасувати тест Оновити

# testing.clearCoverage
source: Clear Coverage
uk: Чітке покриття

# testing.clearResults
source: Clear All Results
uk: Очистити всі результати

# testing.collapseAll
source: Collapse All Tests
uk: Сховати всі тести

# testing.configureProfile
source: Configure Test Profiles
uk: Налаштувати профілі тестування

# testing.coverageAtCursor
source: Run Test at Cursor with Coverage
uk: Запустити тест на курсорі з покриттям

# testing.coverageCurrentFile
source: Run Tests with Coverage in Current File
uk: Запустити тести з покриттям у поточному файлі

# testing.coverageLastRun
source: Rerun Last Run with Coverage
uk: Повторити останній запуск з покриттям

# testing.debugAtCursor
source: Debug Test at Cursor
uk: Налагодження тесту на курсорі

# testing.debugCurrentFile
source: Debug Tests in Current File
uk: Налагодження тестів у поточному файлі

# testing.debugFailTests
source: Debug Failed Tests
uk: Виправити невдалі тести

# testing.debugFailedFromLastRun
source: Debug Failed Tests from Last Run
uk: Виправити невдалі тести з останнього запуску

# testing.debugLastRun
source: Debug Last Run
uk: Відлагодити останній запуск

# testing.editFocusedTest
source: Go to Test
uk: Перейти до тесту

# testing.goToRelatedCode
source: Go to Related Code
uk: Перейти до пов'язаного коду

# testing.goToRelatedTest
source: Go to Related Test
uk: Перейти до пов'язаного тесту

# testing.noCoverage
source: No coverage information available on the last test run.
uk: Немає інформації про покриття для останнього тестового запуску.

# testing.noProfiles
source: No test continuous run-enabled profiles were found
uk: Не знайдено жодних профілів, увімкнених для безперервного виконання тестів.

# testing.openCoverage
source: Open Coverage
uk: Відкрите покриття

# testing.openOutputPeek
source: Peek Output
uk: Переглянути вихідні дані

# testing.peekToRelatedCode
source: Peek Related Code
uk: Переглянути пов'язаний код

# testing.peekToRelatedTest
source: Peek Related Test
uk: Переглянути пов'язаний тест

# testing.reRunFailTests
source: Rerun Failed Tests
uk: Перезапустити невдалі тести

# testing.reRunFailedFromLastRun
source: Rerun Failed Tests from Last Run
uk: Повторити невдалі тести з останнього запуску

# testing.reRunLastRun
source: Rerun Last Run
uk: Повторити останній запуск

# testing.refreshTests
source: Refresh Tests
uk: Оновити тести

# testing.runAtCursor
source: Run Test at Cursor
uk: Запустити тест на курсорі

# testing.runCurrentFile
source: Run Tests in Current File
uk: Запустити тести в поточному файлі

# testing.runUsing
source: Execute Using Profile...
uk: Виконати за допомогою профілю...

# testing.searchForTestExtension
source: Search for Test Extension
uk: Пошук тестового розширення

# testing.selectContinuousProfiles
source: Select profiles to run when files change:
uk: Виберіть профілі для запуску, коли файли змінюються:

# testing.selectDefaultTestProfiles
source: Select Default Profile
uk: Вибрати профіль за замовчуванням

# testing.showMostRecentOutput
source: Show Output
uk: Показати вихідні дані

# testing.sortByDuration
source: Sort by Duration
uk: Сортувати за тривалістю

# testing.sortByLocation
source: Sort by Location
uk: Сортувати за місцем розташування

# testing.sortByStatus
source: Sort by Status
uk: Сортувати за статусом

# testing.startContinuous
source: Start Continuous Run
uk: Почати безперервний запуск

# testing.startContinuousRunUsing
source: Start Continous Run Using...
uk: Почати безперервний запуск за допомогою...

# testing.stopContinuous
source: Stop Continuous Run
uk: Зупинити безперервний запуск

# testing.toggleContinuousRunOff
source: Turn off Continuous Run
uk: Вимкнути безперервний запуск

# testing.toggleContinuousRunOn
source: Turn on Continuous Run
uk: Увімкнути безперервний режим

# testing.toggleInlineTestOutput
source: Toggle Inline Test Output
uk: Перемкнути вивід тесту в рядку

# testing.toggleResultsViewLayout
source: Toggle Tree Position
uk: Перемикання позиції дерева

# testing.viewAsList
source: View as List
uk: Переглянути як список

# testing.viewAsTree
source: View as Tree
uk: Переглянути як Дерево

source: Unhide All Tests
uk: Показати всі тести

source: Unhide Test
uk: Показати тест

# caseNoOutput
source: The test case did not report any output.
uk: Тестовий випадок не повідомив жодного виходу.

# runNoOutput
source: The test run did not record any output.
uk: Тестовий запуск не зафіксував жодного виходу.

# runNoOutputForPast
source: Test output is only available for new test runs.
uk: Вихідні дані тесту доступні лише для нових запусків тестів.

# testingOutputActual
source: Actual result
uk: Фактичний результат

# testingOutputExpected
source: Expected result
uk: Очікуваний результат

source: Close Test Coverage
uk: Закрити тестове покриття

# messageMoreLines1
source: + 1 more line
uk: + 1 додаткова лінія

# messageMoreLinesN
source: + {0} more lines
uk: + {0} додаткових рядків

# nOlderResults
source: {0} older results
uk: {0} старіші результати

# oneOlderResult
source: 1 older result
uk: 1 старіший результат

# openTestCoverage
source: View Test Coverage
uk: Переглянути покриття тестів

# testing.debugFailedFromLastRun
source: Debug Failed Tests
uk: Виправити невдалі тести з останнього запуску

# testing.debugTest
source: Debug Test
uk: Налагодження тесту

# testing.goToError
source: Go to Error
uk: Перейти до помилки

# testing.goToTest
source: Go to Test
uk: Перейти до тесту

# testing.reRunFailedFromLastRun
source: Rerun Failed Tests
uk: Повторити невдалі тести з останнього запуску

# testing.reRunTest
source: Rerun Test
uk: Повторити тест

# testing.revealInExplorer
source: Reveal in Test Explorer
uk: Відкрити в Test Explorer

# testing.showResultOutput
source: Show Result Output
uk: Показати результат виходу

# testingPeekLabel
source: Test Result Messages
uk: Повідомлення про результати тестування

# testFollowup.more
source: +{0} More...
uk: +{0} Більше...

# testing.callStack.debug
source: Debug Test
uk: Налагодження тесту

# testing.callStack.run
source: Rerun Test
uk: Повторити тест

# miViewTesting
source: T&&esting
uk: T&&естування

# noTestProvidersRegistered
source: No tests have been found in this workspace yet.
uk: У цьому робочому просторі ще не знайдено жодних тестів.

# searchForAdditionalTestExtensions
source: Install Additional Test Extensions...
uk: Встановити додаткові розширення для тестування...

# test
source: Testing
uk: Тестування

source: Test Coverage
uk: Покриття тестами

source: Test Explorer
uk: Тестовий експлорер

# testResultsPanelName
source: Test Results
uk: Результати тестування

# testConfigurationUi.pick
source: Pick a test profile to use
uk: Виберіть профіль тесту для використання

source: Update Test Configuration
uk: Оновити конфігурацію тесту

# actual.title
source: Actual
uk: Актуальний

# coverage test
source: Run with Coverage
uk: Запустити з покриттям

# debug all test
source: Debug All Tests
uk: Виправити всі тести

# expected.title
source: Expected
uk: Очікується

# peekTestOutout
source: Peek Test Output
uk: Вихідні дані тесту Peek

# reveal test
source: Reveal in Test Explorer
uk: Відкрити в Test Explorer

# run all test
source: Run All Tests
uk: Запустити всі тести

# run all test with coverage
source: Run All Tests with Coverage
uk: Запустити всі тести з покриттям

# selectTestToRun
source: Select a test to run
uk: Виберіть тест для виконання

# testOverflowItems
source: {0} more tests...
uk: {0} ще тестів...

# testing.gutterMsg.contextMenu
source: Click for test options
uk: Натисніть для варіантів тесту

# testing.gutterMsg.coverage
source: Click to run tests with coverage, right click for more options
uk: Натисніть, щоб запустити тести з покриттям, клацніть правою кнопкою миші для додаткових опцій

# testing.gutterMsg.debug
source: Click to debug tests, right click for more options
uk: Натисніть, щоб налагодити тести, клацніть правою кнопкою для додаткових опцій

# testing.gutterMsg.run
source: Click to run tests, right click for more options
uk: Натисніть, щоб запустити тести, клацніть правою кнопкою для додаткових опцій

# testExplorerFilter
source: Filter (e.g. text, !exclude, @tag)
uk: Фільтр (наприклад, текст, !виключити, @тег)

# testExplorerFilterLabel
source: Filter text for tests in the explorer
uk: Фільтрувати текст для тестів у провіднику

# testing.filters.currentFile
source: Show in Active File Only
uk: Показати тільки в активному файлі

# testing.filters.fuzzyMatch
source: Fuzzy Match
uk: Нечітке співпадіння

# testing.filters.menu
source: More Filters...
uk: Більше фільтрів...

# testing.filters.openedFiles
source: Show in Opened Files Only
uk: Показати тільки в відкритих файлах

# testing.filters.removeTestExclusions
source: Unhide All Tests
uk: Показати всі тести

# testing.filters.showExcludedTests
source: Show Hidden Tests
uk: Показати приховані тести

# testing.filters.showOnlyExecuted
source: Show Only Executed Tests
uk: Показати лише виконані тести

# testing.filters.showOnlyFailed
source: Show Only Failed Tests
uk: Показати лише невдалі тести

source: Configure Test Profiles
uk: Налаштувати профілі тестування

# defaultTestProfile
source: {0} (Default)
uk: {0} (За замовчуванням)

# noResults
source: No test results yet.
uk: Ще немає результатів тестування.

# selectDefaultConfigs
source: Select Default Profile
uk: Вибрати профіль за замовчуванням

# testing.treeElementLabelDuration
source: {0}, in {1}
uk: {0}, за {1}

# testing.treeElementLabelOutdated
source: {0}, outdated result
uk: {0} є оригінальною міткою в testing.treeElementLabel

# testingContinuousBadge
source: Tests are being watched for changes
uk: Тести спостерігаються на предмет змін.

# testingCountBadgeFailed
source: {0} failed tests
uk: {0} невдалих тестів

# testingCountBadgePassed
source: {0} passed tests
uk: {0} пройшов тести

# testingCountBadgeSkipped
source: {0} skipped tests
uk: {0} пропущених тестів

# testingFindExtension
source: Show Workspace Tests
uk: Показати тести робочого простору

# testingNoTest
source: No tests were found in this file.
uk: У цьому файлі не знайдено жодних тестів.

# testingSelectConfig
source: Select Configuration...
uk: Виберіть конфігурацію...

source: Close
uk: Закрити

# testOutputTitle
source: Test Output
uk: Тестовий вихід

# testing.collapsePeekStack
source: Collapse Stack Frames
uk: Сховати стекові фрейми

# testing.goToNextMessage
source: Go to Next Test Failure
uk: Перейти до наступного збою тесту

# testing.goToNextMessage.description
source: Shows the next failure message in your file
uk: Показує наступне повідомлення про помилку у вашому файлі

# testing.goToPreviousMessage
source: Go to Previous Test Failure
uk: Перейти до попередньої помилки тесту

# testing.goToPreviousMessage.description
source: Shows the previous failure message in your file
uk: Показує попереднє повідомлення про помилку у вашому файлі

# testing.markdownPeekError
source: Could not open markdown preview: {0}. Please make sure the markdown extension is enabled.
uk: Не вдалося відкрити попередній перегляд markdown: {0}. Будь ласка, переконайтеся, що розширення markdown увімкнено.

# testing.openMessageInEditor
source: Open in Editor
uk: Відкрити в редакторі

# testing.toggleTestingPeekHistory
source: Toggle Test History in Peek
uk: Перемикання історії тестів у Peek

# testing.toggleTestingPeekHistory.description
source: Shows or hides the history of test runs in the peek view
uk: Показує або приховує історію виконання тестів у попередньому перегляді

source: Testing
uk: Тестування

# testing.coverCountBadgeBackground
source: Background for the badge indicating execution count
uk: Фон для значка, що вказує на кількість виконань

# testing.coverCountBadgeForeground
source: Foreground for the badge indicating execution count
uk: Передній план для значка, що вказує на кількість виконань

# testing.coveredBackground
source: Background color of text that was covered.
uk: Колір фону тексту, який був закритий.

# testing.coveredBorder
source: Border color of text that was covered.
uk: Колір обводки тексту, який був закритий.

# testing.coveredGutterBackground
source: Gutter color of regions where code was covered.
uk: Колір жолоба регіонів, де код був покритий.

# testing.iconErrored
source: Color for the 'Errored' icon in the test explorer.
uk: Колір для іконки 'Errored' у тестовому провіднику.

# testing.iconErrored.retired
source: Retired color for the 'Errored' icon in the test explorer.
uk: Відкликаний колір для іконки 'Errored' у тестовому провіднику.

# testing.iconFailed
source: Color for the 'failed' icon in the test explorer.
uk: Колір для іконки 'не вдалося' у тестовому провіднику.

# testing.iconFailed.retired
source: Retired color for the 'failed' icon in the test explorer.
uk: Відкликаний колір для іконки 'не вдалося' в тестовому провіднику.

# testing.iconPassed
source: Color for the 'passed' icon in the test explorer.
uk: Колір для іконки 'пройдено' у тестовому провіднику.
