Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_mcp.xlf
Languages: uk

# mcp.quickaccess.add
source: MCP Server Resources
uk: Ресурси сервера MCP

# mcp.quickaccess.placeholder
source: Filter to an MCP resource
uk: Фільтрувати до ресурсу MCP

source: MCP Server
uk: MCP Сервер

# mcp.addContext
source: MCP Resources...
uk: MCP Ресурси...

# mcp.addContext.placeholder
source: Select MCP Resource...
uk: Виберіть ресурс MCP...

# mcp.actions.resources
source: Resources
uk: Ресурси

# mcp.actions.sampling
source: Sampling
uk: Вибірка

# mcp.actions.status
source: Status
uk: Статус

# mcp.addConfiguration
source: Add Server...
uk: Додати сервер...

# mcp.addConfiguration.description
source: Installs a new Model Context protocol to the mcp.json settings
uk: Встановлює новий протокол Model Context у налаштуваннях mcp.json

# mcp.addServer
source: Add Server
uk: Додати сервер

# mcp.addServer.description
source: Add a new server configuration
uk: Додати нову конфігурацію сервера

# mcp.autoStart
source: Automatically start MCP servers when sending a chat message
uk: Автоматично запускати сервери MCP при відправці повідомлення в чаті

# mcp.browseResources
source: Browse Resources...
uk: Переглянути ресурси...

# mcp.command.browse
source: MCP Servers
uk: MCP Сервери

# mcp.command.browse.mcp
source: Browse MCP Servers
uk: Перегляд серверів MCP

# mcp.command.browse.tooltip
source: Browse MCP Servers
uk: Перегляд серверів MCP

# mcp.command.openRemoteUserMcp
source: Open Remote User Configuration
uk: Відкрити конфігурацію віддаленого користувача

# mcp.command.openUserMcp
source: Open User Configuration
uk: Відкрити конфігурацію користувача

# mcp.command.openWorkspaceFolderMcp
source: Open Workspace Folder MCP Configuration
uk: Відкрити папку робочого простору конфігурації MCP

# mcp.command.openWorkspaceMcp
source: Open Workspace MCP Configuration
uk: Відкрити конфігурацію робочого простору MCP

# mcp.command.restartServer
source: Restart Server
uk: Перезапустити сервер

# mcp.command.show.installed
source: Show Installed Servers
uk: Показати встановлені сервери

# mcp.command.showConfiguration
source: Show Configuration
uk: Показати конфігурацію

# mcp.command.showOutput
source: Show Output
uk: Показати вихідні дані

# mcp.command.startServer
source: Start Server
uk: Запустити сервер

# mcp.command.stopServer
source: Stop Server
uk: Зупинити сервер

# mcp.config
source: Show Configuration
uk: Показати конфігурацію

# mcp.configAccess
source: Configure Model Access
uk: Налаштувати доступ до моделі

# mcp.configureSamplingModels
source: Configure SamplingModel
uk: Налаштувати SamplingModel

# mcp.configureSamplingModels.ph
source: Pick the models {0} can access via MCP sampling
uk: Виберіть моделі, до яких {0} може отримати доступ через вибірку MCP.

# mcp.disconnect
source: Disconnect Account
uk: Відключити обліковий запис

# mcp.editStoredInput
source: Edit Stored Input
uk: Редагувати збережений ввід

# mcp.err.md.multi
source: Multiple MCP servers were unable to start successfully: {0}
uk: Кілька серверів MCP не змогли успішно запуститися: {0}

# mcp.err.md.single
source: MCP server {0} was unable to start successfully.
uk: Сервер MCP {0} не зміг успішно запуститися.

# mcp.list
source: List Servers
uk: Список серверів

# mcp.newTools
source: New tools available ({0})
uk: Нові інструменти доступні ({0})

# mcp.newTools.md.multi
source: MCP servers have been updated and may have new tools available: {0}
uk: Сервери MCP були оновлені і можуть мати нові доступні інструменти: {0}

# mcp.newTools.md.single
source: MCP server {0} has been updated and may have new tools available.
uk: Сервер MCP {0} був оновлений і може мати нові доступні інструменти.

# mcp.options
source: Server Options
uk: Опції сервера

# mcp.resetCachedTools
source: Reset Cached Tools
uk: Скинути кешовані інструменти

# mcp.resetTrust
source: Reset Trust
uk: Скинути довіру

# mcp.resources
source: Browse Resources
uk: Переглянути ресурси

# mcp.restart
source: Restart Server
uk: Перезапустити сервер

# mcp.samplingLog
source: Show Sampling Requests
uk: Показати запити на вибірку

# mcp.samplingLog.description
source: Show the sampling requests for this server
uk: Показати запити на вибірку для цього сервера

# mcp.samplingLog.title
source: MCP Sampling: {0}
uk: MCP вибірка: {0}

# mcp.selectAction
source: Select action for '{0}'
uk: Виберіть дію для '{0}'

# mcp.selectServer
source: Select an MCP Server
uk: Виберіть сервер MCP

source: MCP Servers
uk: MCP Сервери

# mcp.showOutput
source: Show Output
uk: Показати вихідні дані

# mcp.showOutput.description
source: Set the models the server can use via MCP sampling
uk: Встановіть моделі, які сервер може використовувати через вибірку MCP.

# mcp.signOut
source: Sign Out
uk: Вийти

# mcp.skipCurrentAutostart
source: Skip Current Autostart
uk: Пропустити поточний автозапуск

# mcp.start
source: Start Server
uk: Запустити сервер

# mcp.startPromptingServer
source: Start Prompting Server
uk: Запустити сервер запитів

# mcp.stop
source: Stop Server
uk: Зупинити сервер

# mcp.toolError
source: Error loading {0} tool(s)
uk: Помилка завантаження {0} інструмент(ів)

# mcp.toolRefresh
source: Discovering tools...
uk: Відкриття інструментів...

source: Allow
uk: Дозволити

source: Cancel
uk: Скасувати

# install.error
source: Error installing MCP server {0}: {1}
uk: Помилка встановлення сервера MCP {0}: {1}

# install.newName
source: Enter new name
uk: Введіть нове ім'я

# install.rename
source: Rename "{0}"
uk: Перейменувати "{0}"

# install.show
source: Show Configuration
uk: Показати конфігурацію

# install.start
source: Install Server
uk: Встановити сервер

# install.title
source: Install MCP server {0}
uk: Встановіть сервер MCP {0}

# mcp.command.placeholder
source: Command to run (with optional arguments)
uk: Команда для виконання (з необов'язковими аргументами)

# mcp.command.title
source: Enter Command
uk: Введіть команду

# mcp.confirmPublish
source: Install {0}{1} from {2}?
uk: Встановити {0}{1} з {2}?

# mcp.docker.placeholder
source: Image name (e.g., mcp/imagename)
uk: Ім'я зображення (наприклад, mcp/imagename)

# mcp.docker.title
source: Enter Docker Image Name
uk: Введіть ім'я Docker-образу

# mcp.error.openHelpUri
source: Open help URL
uk: Відкрити URL допомоги

# mcp.error.retry
source: Try a different package
uk: Спробуйте інший пакет

# mcp.loading.title
source: Loading package details...
uk: Завантаження деталей пакету...

# mcp.npm.placeholder
source: Package name (e.g., @org/package)
uk: Назва пакета (наприклад, @org/package)

# mcp.npm.title
source: Enter NPM Package Name
uk: Введіть назву пакету NPM

# mcp.nuget.placeholder
source: Package name (e.g., Package.Name)
uk: Назва пакету (наприклад, Package.Name)

# mcp.nuget.title
source: Enter NuGet Package Name
uk: Введіть назву пакету NuGet

# mcp.pip.placeholder
source: Package name (e.g., package-name)
uk: Назва пакета (наприклад, package-name)

# mcp.pip.title
source: Enter Pip Package Name
uk: Введіть назву пакету Pip

# mcp.serverId.placeholder
source: Unique identifier for this server
uk: Унікальний ідентифікатор для цього сервера

# mcp.serverId.title
source: Enter Server ID
uk: Введіть ID сервера

# mcp.serverType.command
source: Command (stdio)
uk: Команда (stdio)

# mcp.serverType.command.description
source: Run a local command that implements the MCP protocol
uk: Виконайте локальну команду, яка реалізує протокол MCP.

# mcp.serverType.copilot
source: Model-Assisted
uk: Модельно-підтримуваний

# mcp.serverType.docker
source: Docker Image
uk: Docker образ

# mcp.serverType.docker.description
source: Install from a Docker image
uk: Встановити з Docker-образу

# mcp.serverType.http
source: HTTP (HTTP or Server-Sent Events)
uk: HTTP (HTTP або події, надіслані сервером)

# mcp.serverType.http.description
source: Connect to a remote HTTP server that implements the MCP protocol
uk: Підключіться до віддаленого HTTP-сервера, який реалізує протокол MCP.

# mcp.serverType.manual
source: Manual Install
uk: Ручна інсталяція

# mcp.serverType.npm
source: NPM Package
uk: Пакет NPM

# mcp.serverType.npm.description
source: Install from an NPM package name
uk: Встановити з назви пакету NPM

# mcp.serverType.nuget
source: NuGet Package
uk: NuGet пакет

# mcp.serverType.nuget.description
source: Install from a NuGet package name
uk: Встановити з назви пакету NuGet

# mcp.serverType.pip
source: Pip Package
uk: Пакет Pip

# mcp.serverType.pip.description
source: Install from a Pip package name
uk: Встановити з назви пакету Pip

# mcp.serverType.placeholder
source: Choose the type of MCP server to add
uk: Виберіть тип сервера MCP для додавання

# mcp.servers.browse
source: Browse MCP Servers...
uk: Перегляд серверів MCP...

# mcp.servers.discovery
source: Add from another application...
uk: Додати з іншого додатку...

# mcp.target..remote.description
source: Available on this remote machine, runs on {0}
uk: Доступно на цьому віддаленому комп'ютері, працює на {0}

# mcp.target.remote
source: Remote
uk: Віддалений

# mcp.target.title
source: Choose where to install the MCP server
uk: Виберіть, куди встановити сервер MCP

# mcp.target.user
source: Global
uk: Глобальний

# mcp.target.user.description
source: Available in all workspaces, runs locally
uk: Доступно у всіх робочих просторах, працює локально

# mcp.target.workspace
source: Workspace
uk: Робоча область

# mcp.target.workspace.description
source: Available in this workspace, runs locally
uk: Доступно в цьому робочому просторі, працює локально

# mcp.target.workspace.description.remote
source: Available in this workspace, runs on {0}
uk: Доступно в цьому робочому просторі, працює на {0}

# mcp.url.placeholder
source: URL of the MCP server (e.g., http://localhost:3000)
uk: URL сервера MCP (наприклад, http://localhost:3000)

# mcp.url.title
source: Enter Server URL
uk: Введіть URL сервера

# mcp.elicit.accept
source: Respond
uk: Відповісти

# mcp.elicit.cancel
source: Cancel
uk: Скасувати

# mcp.elicit.enum.none
source: None
uk: Ні

# mcp.elicit.enum.none.description
source: No selection
uk: Немає вибору

# mcp.elicit.give
source: Respond
uk: Відповісти

# mcp.elicit.reject
source: Cancel
uk: Скасувати

# mcp.elicit.source
source: MCP Server ({0})
uk: MCP сервер ({0})

# mcp.elicit.title
source: Request for Input
uk: Запит на введення

# mcp.elicit.useDefault
source: Default value
uk: Значення за замовчуванням

# mcp.elicit.validation.date
source: Please enter a valid date (YYYY-MM-DD)
uk: Будь ласка, введіть дійсну дату (YYYY-MM-DD)

# mcp.elicit.validation.dateTime
source: Please enter a valid date-time
uk: Будь ласка, введіть дійсну дату-час.

# mcp.elicit.validation.email
source: Please enter a valid email address
uk: Будь ласка, введіть дійсну адресу електронної пошти.

# mcp.elicit.validation.integer
source: Please enter a valid integer
uk: Будь ласка, введіть дійсне ціле число

# mcp.elicit.validation.maxLength
source: Maximum length is {0}
uk: Максимальна довжина становить {0}

# mcp.elicit.validation.maximum
source: Maximum value is {0}
uk: Максимальне значення - {0}

# mcp.elicit.validation.minLength
source: Minimum length is {0}
uk: Мінімальна довжина становить {0}

# mcp.elicit.validation.minimum
source: Minimum value is {0}
uk: Мінімальне значення – {0}

# mcp.elicit.validation.number
source: Please enter a valid number
uk: Будь ласка, введіть дійсний номер

# mcp.elicit.validation.uri
source: Please enter a valid URI
uk: Будь ласка, введіть дійсний URI

# msg.subtitle
source: {0} (MCP Server)
uk: {0} (MCP Сервер)

source: Optional
uk: Необов'язковий

source: Clear
uk: Чистий

source: Clear All
uk: Очистити все

source: Edit
uk: Редагувати

# mcp.debug
source: Debug
uk: Виправлення помилок

# mcp.restart
source: Restart
uk: Перезапустити сервер

# mcp.server.more
source: More...
uk: Більше...

# mcp.start
source: Start
uk: Запустити сервер

# mcp.stop
source: Stop
uk: Зупинити сервер

# mcp.variableNotFound
source: Variable `{0}` not found, did you mean ${{1}}?
uk: Змінна `{0}` не знайдена, чи ви мали на увазі ${{1}}?

# server.error
source: Error
uk: Помилка

# server.promptcount
source: {0} prompts
uk: {0} підказок

# server.running
source: Running
uk: Запуск

# server.starting
source: Starting
uk: Початок

# server.toolCount
source: {0} tools
uk: {0} інструменти

# mcp.migration.openRemoteConfig
source: Open Remote User MCP Configuration
uk: Відкрити конфігурацію віддаленого користувача MCP

# mcp.migration.openUserConfig
source: Open User MCP Configuration
uk: Відкрити конфігурацію користувача MCP

# mcp.migration.remoteConfigFound
source: MCP servers should no longer be configured in remote user settings. Use the dedicated MCP configuration instead.
uk: Сервери MCP більше не повинні налаштовуватися в налаштуваннях віддаленого користувача. Замість цього використовуйте спеціалізовану конфігурацію MCP.

# mcp.migration.update
source: Update Now
uk: Оновити зараз

# mcp.migration.userConfigFound
source: MCP servers should no longer be configured in user settings. Use the dedicated MCP configuration instead.
uk: Сервери MCP більше не повинні налаштовуватися в налаштуваннях користувача. Замість цього використовуйте спеціальну конфігурацію MCP.

source: Loading...
uk: Завантаження...

# mcp.arg.activeFile
source: Active File
uk: Активний файл

# mcp.arg.activeFiles
source: Active File
uk: Активний файл

# mcp.arg.asCommand
source: Run as Command
uk: Запустити як команду

# mcp.arg.asCommand.description
source: Inserts the command output as the prompt argument
uk: Вставляє вихід команди як аргумент підказки

# mcp.arg.asText
source: Insert as text
uk: Вставити як текст

# mcp.arg.files
source: Files
uk: Файли

# mcp.arg.required
source: This argument is required
uk: Цей аргумент є обов'язковим

# mcp.arg.selectedText
source: Selected Text
uk: Вибраний текст

# mcp.arg.selectedText.multiLine
source: {0} lines
uk: {0} рядків

# mcp.arg.selectedText.singleLine
source: line {0}
uk: рядок {0}

# mcp.arg.suggestions
source: Suggestions
uk: Пропозиції

# mcp.prompt.pick.title
source: Value for: {0}
uk: Значення для: {0}

# mcp.terminal.name
source: MCP Terminal
uk: MCP Термінал

# mcp.quickaccess.attach
source: Attach to chat
uk: Прикріпити до чату

# mcp.quickaccess.placeholder
source: Search for resources
uk: Фільтрувати до ресурсу MCP

# mcp.resource.template
source: Resource template: {0}
uk: Шаблон ресурсу: {0}

# mcp.resource.template.notFound
source: The resource {0} was not found.
uk: Ресурс {0} не знайдено.

# mcp.resource.template.optional
source: Optional
uk: Необов'язково

# mcp.resource.template.placeholder
source: Value for ${0} in {1}
uk: Значення для ${0} в {1}

# config
source: Show Configuration
uk: Показати конфігурацію

# configJson
source: Show Configuration (JSON)
uk: Показати конфігурацію (JSON)

# disabled - all not allowed
source: This MCP Server is disabled because MCP servers are configured to be disabled in the Editor. Please check your [settings]({0}).
uk: Цей сервер MCP вимкнено, оскільки сервери MCP налаштовані на вимкнення в Редакторі. Будь ласка, перевірте свої [налаштування]({0}).

# disabled - some not allowed
source: This MCP Server is disabled because it is configured to be disabled in the Editor. Please check your [settings]({0}).
uk: Цей MCP сервер вимкнено, оскільки він налаштований на вимкнення в Редакторі. Будь ласка, перевірте свої [налаштування]({0}).

source: Install
uk: Встановити

source: Installing
uk: Встановлення

source: Manage
uk: Керувати

# mcpServerInstallation
source: Installing MCP Server {0} started. An editor is now open with more details on this MCP Server
uk: Встановлення MCP Server {0} розпочато. Тепер відкрито редактор з додатковими деталями про цей MCP Server.

# output
source: Show Output
uk: Показати вихідні дані

# restart
source: Restart Server
uk: Перезапустити сервер

# start
source: Start Server
uk: Запустити сервер

# stop
source: Stop Server
uk: Зупинити сервер

source: Uninstall
uk: Видалити

# Install Info
source: Installation
uk: Встановлення

# Marketplace Info
source: Marketplace
uk: Маркетплейс

source: Version
uk: Версія

source: Arguments:
uk: Аргументи:

source: Command:
uk: Команда:

source: Configuration
uk: Конфігурація

# configurationtooltip
source: Server configuration details
uk: Деталі конфігурації сервера

source: Details
uk: Деталі

# detailstooltip
source: Extension details, rendered from the extension's 'README.md' file
uk: Деталі розширення, відображені з файлу 'README.md' розширення

source: Environment Variables:
uk: Змінні середовища:

source: Headers:
uk: Заголовки:

# id
source: Identifier
uk: Ідентифікатор

# last updated
source: Last Released
uk: Останнє випущене

source: Manifest
uk: Манифест

# manifesttooltip
source: Server manifest details
uk: Деталі маніфесту сервера

# name
source: Extension name
uk: Назва розширення

# noConfig
source: No configuration available for this MCP server.
uk: Немає конфігурації для цього сервера MCP.

# noManifest
source: No manifest available for this MCP server.
uk: Немає маніфесту для цього MCP сервера.

# noReadme
source: No README available.
uk: README недоступний.

# packageName
source: Package:
uk: Пакет:

source: Package Arguments:
uk: Аргументи пакету:

source: Packages
uk: Пакети

source: Published
uk: Опубліковано

# remotes
source: Remote
uk: Віддалений

source: Repository
uk: Репозиторій

source: Resources
uk: Ресурси

# runtimeargs
source: Runtime Arguments:
uk: Аргументи виконання:

# serverName
source: Name:
uk: Ім'я:

# serverType
source: Type:
uk: Тип:

# support
source: Contact Support
uk: Зв'язатися з підтримкою

source: Tags
uk: Теги

source: Transport:
uk: Транспорт:

# extensionsInputName
source: MCP Server: {0}
uk: MCP сервер: {0}

# mcpServerEditorLabelIcon
source: Icon of the MCP Server editor.
uk: Іконка редактора сервера MCP.

# licenseIcon
source: Icon shown along with the license status.
uk: Іконка, що відображається разом зі статусом ліцензії.

# mcpServer
source: Icon used for the MCP server.
uk: MCP Сервер

# mcpServerRemoteIcon
source: Icon to indicate that an MCP server is for the remote user scope.
uk: Іконка, що вказує на те, що сервер MCP призначений для області віддаленого користувача.

# mcpServerWorkspaceIcon
source: Icon to indicate that an MCP server is for the workspace scope.
uk: Іконка, що вказує на те, що сервер MCP призначений для області робочого простору.

# starredIcon
source: Icon shown along with the starred status.
uk: Іконка, що відображається разом з позначкою "зірка".

# mcpIconStarForeground
source: The icon color for mcp starred.
uk: Колір іконки для mcp зірковий.

# publisher
source: Publisher ({0})
uk: Видавець ({0})

# remote user extension
source: Remote MCP Server
uk: Віддалений MCP сервер

# verified publisher
source: This publisher has verified ownership of {0}
uk: Цей видавець підтвердив право власності на {0}

# workspace extension
source: Workspace MCP Server
uk: Сервер MCP робочого простору

# mcp
source: MCP Servers
uk: MCP Сервери

source: MCP Servers
uk: MCP Сервери

# mcp-installed
source: MCP Servers - Installed
uk: MCP Сервери - Встановлено

# mcp.gallery.enableDialog.cancel
source: Cancel
uk: Скасувати

# mcp.gallery.enableDialog.enable
source: Enable
uk: Увімкнути

# mcp.gallery.enableDialog.setting
source: This feature is currently in preview. You can disable it anytime using the setting {0}.
uk: Ця функція наразі в режимі попереднього перегляду. Ви можете вимкнути її в будь-який час, використовуючи налаштування {0}.

# mcp.gallery.enableDialog.title
source: Enable MCP Servers Marketplace?
uk: Увімкнути ринок серверів MCP?

# mcp.welcome.descriptionWithLink
source: Browse and install [Model Context Protocol (MCP) servers](https://code.visualstudio.com/docs/copilot/customization/mcp-servers) directly from VS Code to extend agent mode with extra tools for connecting to databases, invoking APIs and performing specialized tasks.
uk: Переглядайте та встановлюйте [сервера протоколу контексту моделі (MCP)](https://code.visualstudio.com/docs/copilot/customization/mcp-servers) безпосередньо з VS Code, щоб розширити режим агента додатковими інструментами для підключення до баз даних, виклику API та виконання спеціалізованих завдань.

# mcp.welcome.enableGalleryButton
source: Enable MCP Servers Marketplace
uk: Увімкнути ринок серверів MCP

# mcp.welcome.settings.tooltip
source: Open Settings
uk: Відкрити Налаштування

# mcp.welcome.title
source: MCP Servers
uk: Сервери MCP

# no extensions found
source: No MCP Servers found.
uk: Не знайдено серверів MCP.

# cannot be installed
source: Cannot install the '{0}' MCP Server because it is not available in this setup.
uk: Не вдається встановити '{0}' MCP Server, оскільки він недоступний у цій конфігурації.

# mcp.configuration.userLocalValue
source: Global in {0}
uk: Глобальний у {0}

# not an extension
source: The provided object is not an mcp server.
uk: Наданий об'єкт не є сервером mcp.

# overwriting
source: Overwriting mcp server '{0}' from {1} with {2}.
uk: Перезаписування сервера mcp '{0}' з {1} на {2}.

# invalidData
source: Expected an array of MCP collections
uk: Очікував масив колекцій MCP

# invalidId
source: Expected 'id' to be a non-empty string.
uk: Очікувалося, що 'id' буде непорожнім рядком.

# invalidLabel
source: Expected 'label' to be a non-empty string.
uk: Очікувалося, що 'label' буде непорожнім рядком.

# invalidWhen
source: Expected 'when' to be a non-empty string.
uk: Очікувалося, що 'when' буде непорожнім рядком.

# onRemoteLabel
source: on {0}
uk: на {0}

# app.mcp.args.command
source: Arguments passed to the server.
uk: Аргументи, передані на сервер.

# app.mcp.dev
source: Enabled development mode for the server. When present, the server will be started eagerly and output will be included in its output. Properties inside the `dev` object can configure additional behavior.
uk: Увімкнено режим розробки для сервера. Коли він присутній, сервер буде запущено з нетерпінням, а вихідні дані будуть включені в його вихід. Властивості всередині об'єкта `dev` можуть налаштовувати додаткову поведінку.

# app.mcp.dev.debug
source: If set, debugs the MCP server using the given runtime as it's started.
uk: Якщо встановлено, налагоджує сервер MCP, використовуючи вказаний час виконання під час його запуску.

# app.mcp.dev.debug.debugpyPath
source: Path to the debugpy executable.
uk: Шлях до виконуваного файлу debugpy.

# app.mcp.dev.debug.type.node
source: Debug the MCP server using Node.js.
uk: Виправте помилки на сервері MCP, використовуючи Node.js.

# app.mcp.dev.debug.type.python
source: Debug the MCP server using Python and debugpy.
uk: Відлагоджуйте сервер MCP за допомогою Python та debugpy.

# app.mcp.dev.watch
source: A glob pattern or list of glob patterns relative to the workspace folder to watch. The MCP server will be restarted when these files change.
uk: Глобальний шаблон або список глобальних шаблонів відносно папки робочого простору, за якою слід спостерігати. Сервер MCP буде перезапущено, коли ці файли зміняться.

# app.mcp.env.command
source: Environment variables passed to the server.
uk: Змінні середовища, передані серверу.

# app.mcp.envFile.command
source: Path to a file containing environment variables for the server.
uk: Шлях до файлу, що містить змінні середовища для сервера.

# app.mcp.json.command
source: The command to run the server.
uk: Команда для запуску сервера.

# app.mcp.json.cwd
source: The working directory for the server command. Defaults to the workspace folder when run in a workspace.
uk: Робочий каталог для команди сервера. За замовчуванням використовується папка робочого простору, коли виконується в робочому просторі.

# app.mcp.json.headers
source: Additional headers sent to the server.
uk: Додаткові заголовки надіслані на сервер.

# app.mcp.json.title
source: Model Context Protocol Servers
uk: Модель Контекст Протокол Сервери
