Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_userDataProfile.xlf
Languages: uk

# all profiles and disabled
source: All Profiles
uk: Усі профілі

# exclude
source: Select {0} Extension
uk: Виберіть {0} Розширення

source: Extensions
uk: Розширення

# installingExtension
source: Installing extension {0}...
uk: Встановлення розширення {0}...

# globalState
source: UI State
uk: Стан інтерфейсу користувача

# keybindings
source: Keyboard Shortcuts
uk: Комбінації клавіш

source: Settings
uk: Налаштування

# exclude
source: Select Snippet {0}
uk: Виберіть {0} Розширення

source: Snippets
uk: Фрагменти

source: Tasks
uk: Завдання

# applying global state
source: Applying UI State...
uk: Застосування стану інтерфейсу...

source: Close
uk: Закрити

# copy
source: &&Copy Link
uk: &&Копіювати посилання

# create from profile
source: Create Profile: {0}
uk: Створити профіль: {0}

# create keybindings
source: Creating Keyboard Shortcuts...
uk: Створення комбінацій клавіш...

# create snippets
source: Creating Snippets...
uk: Створення фрагментів...

# create tasks
source: Creating Tasks...
uk: Створення завдань...

source: Creating Settings...
uk: Створення налаштувань...

# export profile dialog
source: Save Profile
uk: Зберегти профіль

# export profile name
source: Name the profile
uk: Назвіть профіль

# export profile title
source: Export Profile
uk: Експорт профілю

# export success
source: Profile '{0}' was exported successfully.
uk: Профіль '{0}' був успішно експортований.

source: file
uk: файл

# from default
source: From Default Profile
uk: З профілю за замовчуванням

source: Installing Extensions...
uk: Встановлення розширень...

# invalid profile content
source: This profile is not valid.
uk: Цей профіль недійсний.

source: Local
uk: Локальний

# open
source: &&Open Link
uk: &&Відкрити посилання

# open in
source: &&Open in {0}
uk: &&Відкрити в {0}

# overwrite
source: &&Replace
uk: &&Замінити

# profile already exists
source: Profile with name '{0}' already exists. Do you want to replace its contents?
uk: Профіль з ім'ям '{0}' вже існує. Ви хочете замінити його вміст?

# profile name required
source: Profile name must be provided.
uk: Ім'я профілю має бути вказано.

# profiles.exporting
source: {0}: Exporting...
uk: {0}: Експорт...

# progress extensions
source: Applying Extensions...
uk: Застосування розширень...

# progress global state
source: Applying State...
uk: Застосування стану...

# progress keybindings
source: Applying Keyboard Shortcuts...
uk: Застосування комбінацій клавіш...

# progress settings
source: Applying Settings...
uk: Застосування налаштувань...

# progress snippets
source: Applying Snippets...
uk: Застосування фрагментів...

# progress tasks
source: Applying Tasks...
uk: Застосування завдань...

# select
source: Select {0}
uk: Виберіть {0}

source: Select Profile
uk: Вибрати профіль

# select profile content handler
source: Export '{0}' profile as...
uk: Експортувати профіль '{0}' як...

source: Switching Profile...
uk: Перемикання профілю...

source: Troubleshoot Issue
uk: Виправлення проблеми

# troubleshoot profile progress
source: Setting up Troubleshoot Profile: {0}
uk: Налаштування профілю усунення неполадок: {0}

# cannotDeleteDefaultProfile
source: Cannot delete the default profile
uk: Не вдається видалити профіль за замовчуванням

# cannotRenameDefaultProfile
source: Cannot rename the default profile
uk: Не вдається перейменувати профіль за замовчуванням

# reload button
source: &&Reload
uk: &&Перезавантажити

# reload message
source: Switching a profile requires reloading VS Code.
uk: Перемикання профілю вимагає перезавантаження VS Code.

# reload message when removed
source: The current profile has been removed. Please reload to switch back to default profile
uk: Поточний профіль було видалено. Будь ласка, перезавантажте, щоб повернутися до профілю за замовчуванням.

# reload message when switched
source: The current workspace has been removed from the current profile. Please reload to switch back to the updated profile
uk: Поточне робоче середовище було видалено з поточного профілю. Будь ласка, перезавантажте, щоб повернутися до оновленого профілю.

# reload message when updated
source: The current profile has been updated. Please reload to switch back to the updated profile
uk: Поточний профіль було оновлено. Будь ласка, перезавантажте, щоб повернутися до оновленого профілю.

# switch profile
source: Switching to a profile
uk: Перемикання на профіль

# defaultProfileIcon
source: Icon for Default Profile.
uk: Іконка для стандартного профілю.

source: Profile
uk: Профіль

source: Profiles
uk: Профілі

# settingsViewBarIcon
source: Settings icon in the view bar.
uk: Іконка налаштувань у панелі перегляду.
