Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_update.xlf
Languages: uk

# releaseNotesInputName
source: Release Notes: {0}
uk: Примітки до випуску: {0}

# showOnUpdate
source: Show release notes after an update
uk: Показати примітки до випуску після оновлення

source: unassigned
uk: непризначений

source: Downloading Update...
uk: Завантаження оновлення...

source: Check for Updates...
uk: Перевірити наявність оновлень...

# checkingForUpdates
source: Checking for {0} updates...
uk: Перевірка наявності {0} оновлень...

# checkingForUpdates2
source: Checking for Updates...
uk: Перевірка оновлень...

source: Download Update
uk: Завантажити оновлення

source: Download Update (1)
uk: Завантажити оновлення (1)

# downloading
source: Downloading {0} update...
uk: Завантаження оновлення {0}...

source: Install Update
uk: Встановити оновлення

# installUpdate...
source: Install Update... (1)
uk: Встановити оновлення... (1)

source: Installing Update...
uk: Встановлення оновлення...

source: Later
uk: Пізніше

source: Learn More
uk: Дізнатися більше

# noUpdatesAvailable
source: There are currently no updates available.
uk: Зараз немає доступних оновлень.

# read the release notes
source: Welcome to {0} v{1}! Would you like to read the Release Notes?
uk: Ласкаво просимо до {0} v{1}! Ви хочете прочитати Примітки до випуску?

# relaunchDetailInsiders
source: Press the reload button to switch to the Insiders version of VS Code.
uk: Натисніть кнопку перезавантаження, щоб перейти на версію Insiders VS Code.

# relaunchDetailStable
source: Press the reload button to switch to the Stable version of VS Code.
uk: Натисніть кнопку перезавантаження, щоб перейти на стабільну версію VS Code.

# relaunchMessage
source: Changing the version requires a reload to take effect
uk: Зміна версії вимагає перезавантаження для набуття чинності.

source: Release Notes
uk: Примітки до випуску

source: &&Reload
uk: &&Перезавантажити

# restartToUpdate
source: Restart to Update (1)
uk: Перезапустіть для оновлення (1)

# selectSyncService.detail
source: The Insiders version of VS Code will synchronize your settings, keybindings, extensions, snippets and UI State using separate insiders settings sync service by default.
uk: Версія Insiders VS Code за замовчуванням буде синхронізувати ваші налаштування, клавішні комбінації, розширення, фрагменти коду та стан інтерфейсу користувача, використовуючи окрему службу синхронізації налаштувань Insiders.

# selectSyncService.message
source: Choose the settings sync service to use after changing the version
uk: Виберіть службу синхронізації налаштувань, яку слід використовувати після зміни версії

source: Show Update Release Notes
uk: Показати примітки до оновлення

# switchToInsiders
source: Switch to Insiders Version...
uk: Перейти на версію Insiders...

# switchToStable
source: Switch to Stable Version...
uk: Перейти на стабільну версію...

# thereIsUpdateAvailable
source: There is an available update.
uk: Є доступне оновлення.

source: Update Service
uk: Оновлення служби

# update service disabled
source: Updates are disabled because you are running the user-scope installation of {0} as Administrator.
uk: Оновлення вимкнені, оскільки ви запускаєте установку {0} для користувача як Адміністратор.

# update.noReleaseNotesOnline
source: This version of {0} does not have release notes online
uk: Ця версія {0} не має онлайн-нотаток про випуск.

# updateAvailable
source: There's an update available: {0} {1}
uk: Є доступне оновлення: {0} {1}

# updateAvailableAfterRestart
source: Restart {0} to apply the latest update.
uk: Перезавантажте {0}, щоб застосувати останнє оновлення.

# updateIsReady
source: New {0} update available.
uk: Новий {0} оновлення доступний.

source: Update Now
uk: Оновити зараз

# updating
source: Updating {0}...
uk: Оновлення {0}...

# use insiders
source: &&Insiders
uk: &&Інсайдери

# use stable
source: &&Stable (current)
uk: &&Стабільний (поточний)

source: Apply Update...
uk: Застосувати оновлення...

# developerCategory
source: Developer
uk: Розробник

source: Download Update
uk: Завантажити оновлення

# mshowReleaseNotes
source: Show &&Release Notes
uk: Показати &&примітки до випуску

# openDownloadPage
source: Download {0}
uk: Завантажити {0}

# pickUpdate
source: Apply Update
uk: Застосувати оновлення

# releaseNotesFromFileNone
source: Cannot open the current file as Release Notes
uk: Не вдається відкрити поточний файл як Примітки до випуску

source: Restart to Update
uk: Перезапустіть для оновлення (1)

source: Show Release Notes
uk: Показати примітки до випуску

# showReleaseNotesCurrentFile
source: Open Current File as Release Notes
uk: Відкрити поточний файл як примітки до випуску

# updateButton
source: &&Update
uk: &&Оновити
