Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminalContrib.xlf
Languages: uk

# workbench.action.terminal.accessibleBufferGoToNextCommand
source: Accessible Buffer Go to Next Command
uk: Доступний буфер Перейти до наступної команди

# workbench.action.terminal.accessibleBufferGoToPreviousCommand
source: Accessible Buffer Go to Previous Command
uk: Доступний буфер Перейти до попередньої команди

# workbench.action.terminal.focusAccessibleBuffer
source: Focus Accessible Terminal View
uk: Фокус на доступному термінальному вигляді

# workbench.action.terminal.scrollToBottomAccessibleView
source: Scroll to Accessible View Bottom
uk: Прокрутити до нижньої частини доступного вигляду

# workbench.action.terminal.scrollToTopAccessibleView
source: Scroll to Accessible View Top
uk: Прокрутити до доступного вигляду зверху

# commandPromptMigration
source: Consider using powershell instead of command prompt for an improved experience
uk: Розгляньте можливість використання PowerShell замість командного рядка для покращеного досвіду.

# focusAccessibleTerminalView
source: The Focus Accessible Terminal View command<keybinding:{0}> enables screen readers to read terminal contents.
uk: Команда Focus Accessible Terminal View<keybinding:{0}> дозволяє програмам читання з екрану читати вміст терміналу.

# focusAfterRun
source: Configure what gets focused after running selected text in the terminal with `{0}`.
uk: Налаштуйте, на що буде зосереджено увагу після виконання вибраного тексту в терміналі з `{0}`.

# focusViewOnExecution
source: Enable `terminal.integrated.accessibleViewFocusOnCommandExecution` to automatically focus the terminal accessible view when a command is executed in the terminal.
uk: Увімкніть `terminal.integrated.accessibleViewFocusOnCommandExecution`, щоб автоматично фокусувати доступний перегляд терміналу, коли команда виконується в терміналі.

# goToNextCommand
source: Go to Next Command<keybinding:{0}> in the accessible view
uk: Перейдіть до Наступної команди<keybinding:{0}> в доступному вигляді

# goToPreviousCommand
source: Go to Previous Command<keybinding:{0}> in the accessible view
uk: Перейдіть до попередньої команди<keybinding:{0}> в доступному вигляді

# goToRecentDirectory
source: Go to Recent Directory<keybinding:{0}>
uk: Перейдіть до останньої директорії<keybinding:{0}>

# goToSymbol
source: Go to Symbol<keybinding:{0}>
uk: Перейдіть до Символу<keybinding:{0}>

# newWithProfile
source: The Create New Terminal (With Profile) command<keybinding:{0}> allows for easy terminal creation using a specific profile.
uk: Команда Створити новий термінал (з профілем)<keybinding:{0}> дозволяє легко створювати термінал, використовуючи конкретний профіль.

# noShellIntegration
source: Shell integration is not enabled. Some accessibility features may not be available.
uk: Інтеграція оболонки не ввімкнена. Деякі функції доступності можуть бути недоступні.

# openDetectedLink
source: The Open Detected Link command<keybinding:{0}> enables screen readers to easily open links found in the terminal.
uk: Команда Відкрити виявлене посилання<keybinding:{0}> дозволяє екранним читалкам легко відкривати посилання, знайдені в терміналі.

# preserveCursor
source: Customize the behavior of the cursor when toggling between the terminal and accessible view with `terminal.integrated.accessibleViewPreserveCursorPosition.`
uk: Налаштуйте поведінку курсора при перемиканні між терміналом і доступним виглядом за допомогою `terminal.integrated.accessibleViewPreserveCursorPosition.`

# runRecentCommand
source: Run Recent Command<keybinding:{0}>
uk: Запустити останню команду<keybinding:{0}>

# shellIntegration
source: The terminal has a feature called shell integration that offers an enhanced experience and provides useful commands for screen readers such as:
uk: Термінал має функцію під назвою інтеграція оболонки, яка пропонує покращений досвід і надає корисні команди для програм читання з екрану, такі як:

# suggest
source: When the terminal suggest widget is focused:
uk: Коли віджет пропозицій терміналу має фокус:

# suggestCommands
source: - Accept the suggestion<keybinding:{0}> and configure suggest settings<keybinding:{1}>.
uk: - Прийміть пропозицію<keybinding:{0}> та налаштуйте параметри пропозицій<keybinding:{1}>.

# suggestCommandsMore
source: - Toggle between the widget and terminal<keybinding:{0}> and toggle details focus<keybinding:{1}> to learn more about the suggestion.
uk: - Перемикайтеся між віджетом і терміналом<keybinding:{0}> та перемикайте фокус деталей<keybinding:{1}>, щоб дізнатися більше про пропозицію.

# suggestConfigure
source: -Configure suggest settings<keybinding:{0}>
uk: -Налаштувати рекомендовані налаштування<keybinding:{0}>

# suggestLearnMore
source: - Learn more about the suggestion<keybinding:{0}>.
uk: - Дізнайтеся більше про пропозицію<keybinding:{0}>.

# suggestTrigger
source: The terminal request completions command can be invoked manually<keybinding:{0}>, but also appears while typing.
uk: Команду завершення запитів терміналу можна викликати вручну<keybinding:{0}>, але вона також з'являється під час введення.

# terminal.integrated.accessibleViewFocusOnCommandExecution
source: Focus the terminal accessible view when a command is executed.
uk: Зосередьте доступний вигляд терміналу, коли виконується команда.

# terminal.integrated.accessibleViewPreserveCursorPosition
source: Preserve the cursor position on reopen of the terminal's accessible view rather than setting it to the bottom of the buffer.
uk: Зберігайте позицію курсора при повторному відкритті доступного вигляду термінала, а не встановлюйте її внизу буфера.

# terminal.integrated.autoReplies
source: A set of messages that, when encountered in the terminal, will be automatically responded to. Provided the message is specific enough, this can help automate away common responses. Remarks: - Use {0} to automatically respond to the terminate batch job prompt on Windows. - The message includes escape sequences so the reply might not happen with styled text. - Each reply can only happen once every second. - Use {1} in the reply to mean the enter key. - To unset a default key, set the value to null. - Restart VS Code if new don't apply.
uk: Набір повідомлень, на які, коли вони з'являються в терміналі, буде автоматично реагувати. Якщо повідомлення достатньо специфічне, це може допомогти автоматизувати звичайні відповіді. Зауваження: - Використовуйте {0}, щоб автоматично відповісти на запит завершення пакетної роботи в Windows. - Повідомлення містить послідовності escape, тому відповідь може не відбутися з форматованим текстом. - Кожна відповідь може відбутися лише один раз на секунду. - Використовуйте {1} у відповіді, щоб означати клавішу Enter. - Щоб скинути значення за замовчуванням, встановіть значення в null. - Перезапустіть VS Code, якщо нові зміни не застосовуються.

# terminal.integrated.autoReplies.reply
source: The reply to send to the process.
uk: Відповідь, яку потрібно надіслати процесу.

# disableHint
source: Toggle {0} in settings to disable this hint.
uk: Перемкніть {0} у налаштуваннях, щоб вимкнути це підказку.

source: Disable Initial Hint
uk: Вимкнути початкову підказку

# emptyHintText
source: Open chat {0}.
uk: Відкрити чат {0}.

# hintTextDismiss
source: Start typing to dismiss.
uk: Почніть вводити, щоб закрити.

# inlineChatHint
source: [[Open chat]] or start typing to dismiss.
uk: [[Відкрити чат]] або почніть вводити, щоб закрити.

# chatAgentRegisteredContextKey
source: Whether a chat agent is registered for the terminal location.
uk: Чи зареєстрований агент чату для термінального місця.

# chatFocusedContextKey
source: Whether the chat view is focused.
uk: Чи сфокусовано вікно чату.

# chatInputHasTextContextKey
source: Whether the chat input has text.
uk: Чи має введення чату текст.

# chatRequestActiveContextKey
source: Whether there is an active chat request.
uk: Чи є активний запит на чат.

# chatResponseContainsCodeBlockContextKey
source: Whether the chat response contains a code block.
uk: Чи містить відповідь чату блок коду.

# chatResponseContainsMultipleCodeBlocksContextKey
source: Whether the chat response contains multiple code blocks.
uk: Чи містить відповідь чату кілька блоків коду.

# chatVisibleContextKey
source: Whether the chat view is visible.
uk: Чи видима область чату.

# chat.signals
source: Accessibility Signals can be changed via settings with a prefix of signals.chat. By default, if a request takes more than 4 seconds, you will hear a sound indicating that progress is still occurring.
uk: Сигнали доступності можна змінити через налаштування з префіксом signals.chat. За замовчуванням, якщо запит триває більше 4 секунд, ви почуєте звук, що вказує на те, що прогрес все ще триває.

# inlineChat.access
source: It can be activated using the command: Terminal: Start Chat ({0}), which will focus the input box.
uk: Його можна активувати за допомогою команди: Terminal: Start Chat ({0}), що зосередить увагу на полі введення.

# inlineChat.focusInput
source: Reach the input box from the response ({0}).
uk: Доступ до поля введення з відповіді ({0}).

# inlineChat.focusInputNoKb
source: Reach the response from the input box by shift+tabbing or assigning a keybinding for the command: Focus Terminal Input.
uk: Отримайте відповідь з поля вводу, використовуючи shift+tab або призначивши комбінацію клавіш для команди: Фокусувати ввід терміналу.

# inlineChat.focusResponse
source: Reach the response from the input box ({0}).
uk: Отримайте відповідь з поля введення ({0}).

# inlineChat.focusResponseNoKb
source: Reach the response from the input box by tabbing or assigning a keybinding for the command: Focus Terminal Response.
uk: Отримайте відповідь з поля введення, натискаючи клавішу Tab або призначивши комбінацію клавіш для команди: Зосередити відповідь терміналу.

# inlineChat.input
source: The input box is where the user can type a request and can make the request ({0}). The widget will be closed and all content will be discarded when the Escape key is pressed and the terminal will regain focus.
uk: Поле введення - це місце, де користувач може ввести запит і зробити запит ({0}). Віджет буде закрито, і весь вміст буде скинуто, коли буде натиснуто клавішу Escape, і термінал знову отримає фокус.

# inlineChat.inputNoKb
source: The input box is where the user can type a request and can make the request by tabbing to the Make Request button, which is not currently triggerable via keybindings. The widget will be closed and all content will be discarded when the Escape key is pressed and the terminal will regain focus.
uk: Поле введення - це місце, де користувач може ввести запит і зробити запит, перемикаючись на кнопку "Зробити запит", яка наразі не може бути активована за допомогою комбінацій клавіш. Віджет буде закрито, і весь вміст буде скасовано, коли буде натиснута клавіша Escape, і термінал знову отримає фокус.

# inlineChat.insertCommand
source: With focus in the input box command editor, the Terminal: Insert Chat Command ({0}) action.
uk: Зосереджуючи увагу в полі введення редактора команд, дія Терміна: Вставити команду чату ({0}).

# inlineChat.insertCommandNoKb
source: Insert a command by tabbing to the button as the action is currently not triggerable by a keybinding.
uk: Вставте команду, перемістившись до кнопки, оскільки дія наразі не може бути активована за допомогою комбінації клавіш.

# inlineChat.inspectResponseMessage
source: The response can be inspected in the accessible view ({0}).
uk: Відповідь можна переглянути в доступному вигляді ({0}).

# inlineChat.inspectResponseNoKb
source: With the input box focused, inspect the response in the accessible view via the Open Accessible View command, which is currently not triggerable by a keybinding.
uk: Зосередившись на полі введення, перевірте відповідь у доступному вигляді за допомогою команди Відкрити доступний вигляд, яка наразі не може бути активована за допомогою комбінації клавіш.

# inlineChat.overview
source: Inline chat occurs within a terminal. It is useful for suggesting terminal commands. Keep in mind that AI generated code may be incorrect.
uk: Вбудований чат відбувається в терміналі. Це корисно для пропозиції команд терміналу. Майте на увазі, що код, згенерований ШІ, може бути неправильним.

# inlineChat.runCommand
source: With focus in the input box or command editor, the Terminal: Run Chat Command ({0}) action.
uk: Зосереджуючи увагу на полі введення або редакторі команд, виконайте дію Terminal: Run Chat Command ({0}).

# inlineChat.runCommandNoKb
source: Run a command by tabbing to the button as the action is currently not triggerable by a keybinding.
uk: Виконайте команду, перейшовши до кнопки, оскільки дія наразі не може бути активована за допомогою комбінації клавіш.

# inlineChat.toolbar
source: Use tab to reach conditional parts like commands, status, message responses and more.
uk: Використовуйте клавішу Tab, щоб дістатися до умовних частин, таких як команди, статус, відповіді на повідомлення та інше.

# chat.rerun.label
source: Rerun Request
uk: Повторний запит

# closeChat
source: Close
uk: Закрити

source: Insert
uk: Вставити

# insertCommand
source: Insert Chat Command
uk: Вставити команду чату

source: Insert First
uk: Вставити перший

# insertFirstCommand
source: Insert First Chat Command
uk: Вставити першу команду чату

source: Run
uk: Запустити

# runCommand
source: Run Chat Command
uk: Запустити команду чату

source: Run First
uk: Запустити перший

# runFirstCommand
source: Run First Chat Command
uk: Запустити першу команду чату

# startChat
source: Open Inline Chat
uk: Відкрити інтерактивний чат

# terminalCategory
source: Terminal
uk: Термінал

source: View in Chat
uk: Переглянути в чаті

source: Ask about commands
uk: Запитайте про команди

# terminal.integrated.initialHint
source: Controls if the first terminal without input will show a hint about available actions when it is focused.
uk: Контролює, чи перший термінал без введення покаже підказку про доступні дії, коли він буде в фокусі.

# autoApprove.baseCommand
source: Always Allow Commands: {0}
uk: Завжди дозволяти команди: {0}

# autoApprove.baseCommandSingle
source: Always Allow Command: {0}
uk: Завжди дозволяти команду: {0}

# autoApprove.configure
source: Configure Auto Approve...
uk: Налаштувати Автоматичне Схвалення...

# autoApprove.exactCommand
source: Always Allow Exact Command Line
uk: Завжди дозволяти точний рядок команд

# addTerminalSelection
source: Add Terminal Selection to Chat
uk: Додати вибір терміналу до чату

source: Terminal Selection
uk: Вибір терміналу

# toolset.runCommands
source: Runs commands in the terminal
uk: Виконує команди в терміналі

# toolset.runTasks
source: Runs tasks and gets their output for your workspace
uk: Виконує завдання та отримує їхні результати для вашого робочого простору.

# getTerminalLastCommand.past
source: Got last terminal command
uk: Отримано останню команду терміналу

# getTerminalLastCommand.progressive
source: Getting last terminal command
uk: Отримання останньої команди терміналу

# terminalLastCommandTool.displayName
source: Get Terminal Last Command
uk: Отримати останню команду терміналу

# bg.past
source: Checked background terminal output
uk: Перевірено вихідні дані терміналу фону

# bg.progressive
source: Checking background terminal output
uk: Перевірка виходу терміналу в фоновому режимі

# getTerminalOutputTool.displayName
source: Get Terminal Output
uk: Отримати вивід терміналу

# getTerminalSelection.past
source: Read terminal selection
uk: Читати вибір терміналу

# getTerminalSelection.progressive
source: Reading terminal selection
uk: Вибір терміналу читання

# terminalSelectionTool.displayName
source: Get Terminal Selection
uk: Отримати вибір терміналу

# poll.terminal.accept
source: Yes
uk: Так

# poll.terminal.acceptRun
source: Allow
uk: Дозволити

# poll.terminal.confirmRequired
source: The terminal is awaiting input.
uk: Термінал очікує вводу.

# poll.terminal.confirmRunDetail
source: {0} Do you want to send `{1}`{2} followed by `Enter` to the terminal?
uk: {0} Ви хочете надіслати `{1}`{2}, натиснувши `Enter` у терміналі?

# poll.terminal.enterInput
source: Focus terminal
uk: Фокус термінал

# poll.terminal.inputRequest
source: The terminal is awaiting input.
uk: Термінал очікує вводу.

# poll.terminal.polling
source: This will continue to poll for output to determine when the terminal becomes idle for up to 2 minutes.
uk: Це буде продовжувати опитувати наявність виходу, щоб визначити, коли термінал стане неактивним протягом до 2 хвилин.

# poll.terminal.reject
source: No
uk: Ні

# poll.terminal.rejectRun
source: Focus Terminal
uk: Фокус Терминал

# poll.terminal.requireInput
source: {0} Please provide the required input to the terminal.
uk: {0} Будь ласка, введіть необхідні дані в термінал.

# poll.terminal.waiting
source: Continue waiting for `{0}`?
uk: Продовжити чекати на `{0}`?

# autoApprove.global
source: Auto approved by setting {0}
uk: Автоматично затверджено за налаштуванням {0}

# autoApprove.rule
source: Auto approved by rule {0}
uk: Автоматично затверджено за правилом {0}

# autoApprove.rules
source: Auto approved by rules {0}
uk: Автоматично затверджено за правилами {0}

# autoApproveDenied.rule
source: Auto approval denied by rule {0}
uk: Автоматичне схвалення відхилено за правилом {0}

# autoApproveDenied.rules
source: Auto approval denied by rules {0}
uk: Автоматичне схвалення відхилено правилами {0}

# ruleTooltip
source: View rule in settings
uk: Переглянути правило в налаштуваннях

# ruleTooltip.global
source: View settings
uk: Перегляд налаштувань

# runInTerminal
source: Run `{0}` command?
uk: Запустити команду `{0}`?

# runInTerminal.background
source: Run `{0}` command? (background terminal)
uk: Запустити команду `{0}`? (фоновий термінал)

# runInTerminal.promptInjectionDisclaimer
source: Web content may contain malicious code or attempt prompt injection attacks.
uk: Веб-контент може містити шкідливий код або намагатися здійснити атаки з використанням ін'єкцій запитів.

# runInTerminalTool.displayName
source: Run in Terminal
uk: Запустити в Терминалі

# runInTerminalTool.userDescription
source: Tool for running commands in the terminal
uk: Інструмент для виконання команд у терміналі

# allowTaskCreationExecution
source: Allow task creation and execution?
uk: Дозволити створення та виконання завдань?

# alreadyRunning
source: Task `{0}` is already running.
uk: Завдання `{0}` вже виконується.

# copilotChat.fetchingTask
source: Resolving the task
uk: Вирішення завдання

# copilotChat.noTerminal
source: Task started but no terminal was found for: `{0}`
uk: Завдання розпочато, але термінал не знайдено для: `{0}`

# copilotChat.runningTask
source: Running task `{0}`
uk: Виконання завдання `{0}`

# copilotChat.taskNotFound
source: Task not found: `{0}`
uk: Завдання не знайдено: `{0}`

# copilotCreateTask
source: Copilot will create the task `{0}` with command `{1}`{2}.
uk: Copilot створить завдання `{0}` з командою `{1}`{2}.

# createAndRunTask.displayName
source: Create and run Task
uk: Створити та запустити завдання

# createAndRunTask.modelDescription
source: Creates and runs a build, run, or custom task for the workspace by generating or adding to a tasks.json file based on the project structure (such as package.json or README.md). If the user asks to build, run, launch and they have no tasks.json file, use this tool. If they ask to create or add a task, use this tool.
uk: Створює та виконує збірку, запуск або користувацьке завдання для робочого простору, генеруючи або додаючи до файлу tasks.json на основі структури проєкту (такої як package.json або README.md). Якщо користувач просить виконати збірку, запуск або запуск програми, і в них немає файлу tasks.json, використовуйте цей інструмент. Якщо вони просять створити або додати завдання, використовуйте цей інструмент.

# createAndRunTask.userDescription
source: Create and run a task in the workspace
uk: Створіть і запустіть задачу в робочому просторі

# createdTask
source: Created task `{0}`
uk: Створено завдання `{0}`

# createdTaskPast
source: Created task `{0}`
uk: Створено задачу `{0}`

# taskExists
source: Task `{0}` already exists.
uk: Завдання `{0}` вже існує.

# taskExistsPast
source: Task `{0}` already exists.
uk: Завдання `{0}` вже існує.

# copilotChat.checkedTerminalOutput
source: Checked output for task `{0}`
uk: Перевірено вихідні дані для завдання `{0}`

# copilotChat.checkingTerminalOutput
source: Checking output for task `{0}`
uk: Перевірка виходу для завдання `{0}`

# copilotChat.taskAlreadyRunning
source: The task `{0}` is already running.
uk: Завдання `{0}` вже виконується.

# copilotChat.terminalNotFound
source: Terminal not found for task `{0}`
uk: Термінал не знайдено для завдання `{0}`

# getTaskOutputTool.displayName
source: Get Task Output
uk: Отримати вихідні дані завдання

# copilotChat.allowTaskRunMsg
source: Allow Copilot to run the task `{0}`?
uk: Дозволити Copilot виконати завдання `{0}`?

# copilotChat.allowTaskRunTitle
source: Allow task run?
uk: Дозволити виконання задачі?

# copilotChat.ranTask
source: Ran `{0}`
uk: Запущено `{0}`

# copilotChat.runningTask
source: Running `{0}`
uk: Виконання завдання `{0}`

# copilotChat.startedTask
source: Started `{0}`
uk: Почато `{0}`

# copilotChat.taskAlreadyActive
source: The task is already running.
uk: Завдання вже виконується.

# copilotChat.taskIsAlreadyRunning
source: `{0}` is already running.
uk: `{0}` вже запущено.

# copilotChat.taskWasAlreadyRunning
source: `{0}` was already running.
uk: `{0}` вже працював.

# runInTerminalTool.displayName
source: Run Task
uk: Запустити в Терминалі

# runInTerminalTool.userDescription
source: Tool for running tasks in the workspace
uk: Інструмент для виконання команд у терміналі

# copilotChat.taskFailedWithExitCode
source: Task `{0}` failed with exit code {1}.
uk: Завдання `{0}` завершилося з кодом виходу {1}.

# autoApprove.deprecated
source: Use {0} instead
uk: Використовуйте {0} замість цього.

# autoApprove.description.commandLine
source: An object can be used to match against the full command line instead of matching sub-commands and inline commands, for example {0}. In order to be auto approved _both_ the sub-command and command line must not be explicitly denied, then _either_ all sub-commands or command line needs to be approved.
uk: Об'єкт може бути використаний для порівняння з повною командною рядком замість порівняння підкоманд і вбудованих команд, наприклад {0}. Для автоматичного затвердження _обидві_ підкоманди та командний рядок не повинні бути явно відхилені, тоді _або_ всі підкоманди, або командний рядок повинні бути затверджені.

# autoApprove.description.examples.binTest
source: Allow all commands that match the path {0} ({1}, {2}, etc.)
uk: Дозволити всі команди, які відповідають шляху {0} ({1}, {2} тощо)

# autoApprove.description.examples.description
source: Description
uk: Опис

# autoApprove.description.examples.mkdir
source: Allow all commands starting with {0}
uk: Дозволити всі команди, що починаються з {0}

# autoApprove.description.examples.npmRunBuild
source: Allow all commands starting with {0}
uk: Дозволити всі команди, що починаються з {0}

# autoApprove.description.examples.ps1
source: Require explicit approval for any _command line_ that contains {0} regardless of casing
uk: Вимагайте явного затвердження для будь-якого _командного рядка_, що містить {0}, незалежно від регістру.

# autoApprove.description.examples.regexAll
source: Allow all commands (denied commands still require approval)
uk: Дозволити всі команди (команди, яким відмовлено, все ще потребують схвалення)

# autoApprove.description.examples.regexCase
source: will allow {0} commands regardless of casing
uk: дозволить {0} команди незалежно від регістру
