Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_output.xlf
Languages: uk

source: Add Compound Log...
uk: Додати складний журнал...

source: Clear filters text
uk: Очистити фільтри

# clearOutput.label
source: Clear Output
uk: Очистити вивід

source: Export Logs...
uk: Експортувати журнали...

source: Extension Logs
uk: Журнали розширення

source: Import Log...
uk: Імпорт журналу...

source: Import Log File
uk: Імпорт файлу журналу

# logFile
source: The id of the log file to open, for example `"window"`. Currently the best way to get this is to get the ID by checking the `workbench.action.output.show.<id>` commands
uk: Ідентифікатор файлу журналу для відкриття, наприклад, `"window"`. Наразі найкращий спосіб отримати це - отримати ідентифікатор, перевіряючи команди `workbench.action.output.show.<id>`

source: Log Files
uk: Журнали файлів

# logLevel.label
source: Set Log Level...
uk: Встановити рівень журналювання...

# logLevelDefault.label
source: Set As Default
uk: Встановити за замовчуванням

# miToggleOutput
source: &&Output
uk: &&Вивід

# nocustumoutput
source: No custom outputs to remove.
uk: Немає користувацьких виходів для видалення.

# openActiveOutputFile
source: Open Output in Editor
uk: Відкрити вихід у редакторі

# openActiveOutputFileInNewWindow
source: Open Output in New Window
uk: Відкрити вихідні дані в новому вікні

# openLogFile
source: Open Log...
uk: Відкрити журнал...

source: Output
uk: Вихід

# output.smartScroll.enabled
source: Enable/disable the ability of smart scrolling in the output view. Smart scrolling allows you to lock scrolling automatically when you click in the output view and unlocks when you click in the last line.
uk: Увімкніть/вимкніть можливість смарт-прокрутки у вікні виводу. Смарт-прокрутка дозволяє автоматично заблокувати прокрутку, коли ви натискаєте у вікні виводу, і розблоковує її, коли ви натискаєте на останньому рядку.

# outputScrollOff
source: Turn Auto Scrolling Off
uk: Вимкнути автоматичний прокрутку

# outputScrollOn
source: Turn Auto Scrolling On
uk: Увімкнути автоматичне прокручування

# outputViewIcon
source: View icon of the output view.
uk: Переглянути іконку виходу.

# removeLog
source: Remove Output...
uk: Видалити вихід...

# saveActiveOutputAs
source: Save Output As...
uk: Зберегти вихід як...

# selectOutput
source: Select Output Channel
uk: Виберіть канал виводу

source: Select Log
uk: Вибрати журнал

source: Select Log File
uk: Вибрати файл журналу

source: Show Logs...
uk: Показати журнали...

source: Show Output Channels...
uk: Показати канали виводу...

# switchBetweenOutputs.label
source: Switch Output
uk: Перемикання виходу

# switchToOutput.label
source: Switch Output
uk: Перемикання виходу

# toggleAutoScroll
source: Toggle Auto Scrolling
uk: Перемкнути автоматичне прокручування

# toggleTraceDescription
source: Show or hide {0} messages in the output
uk: Показати або приховати {0} повідомлень у виході

source: User Logs
uk: Журнали користувача

# saveLog.dialogTitle
source: Save Output As
uk: Зберегти вихід як

# channel
source: Output channel for '{0}'
uk: Канал виводу для '{0}'

# output model title
source: {0} - Output
uk: {0} - Вихід

# outputView.filter.placeholder
source: Filter
uk: Фільтр

# outputViewAriaLabel
source: Output panel
uk: Панель виводу
