Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_label.xlf
Languages: uk

# temporaryWorkspace
source: Workspace
uk: Робоча область

source: Untitled (Workspace)
uk: Без назви (Робоча область)

# vscode.extension.contributes.resourceLabelFormatters
source: Contributes resource label formatting rules.
uk: Сприяє правилам форматування міток ресурсів.

# vscode.extension.contributes.resourceLabelFormatters.authority
source: URI authority on which to match the formatter on. Simple glob patterns are supported.
uk: URI-авторитет, на якому потрібно співвіднести форматер. Підтримуються прості шаблони glob.

# vscode.extension.contributes.resourceLabelFormatters.formatting
source: Rules for formatting uri resource labels.
uk: Правила форматування міток ресурсів uri.

# vscode.extension.contributes.resourceLabelFormatters.formatting.workspaceSuffix
source: Suffix appended to the workspace label.
uk: Суфікс, доданий до мітки робочого простору.

# vscode.extension.contributes.resourceLabelFormatters.label
source: Label rules to display. For example: myLabel:/${path}. ${path}, ${scheme}, ${authority} and ${authoritySuffix} are supported as variables.
uk: Правила міток для відображення. Наприклад: myLabel:/${path}. ${path}, ${scheme}, ${authority} та ${authoritySuffix} підтримуються як змінні.

# vscode.extension.contributes.resourceLabelFormatters.scheme
source: URI scheme on which to match the formatter on. For example "file". Simple glob patterns are supported.
uk: Схема URI, за якою потрібно зіставити форматер. Наприклад, "file". Підтримуються прості шаблони glob.

# vscode.extension.contributes.resourceLabelFormatters.separator
source: Separator to be used in the uri label display. '/' or '' as an example.
uk: Роздільник, який буде використовуватися для відображення мітки uri. '/' або '' як приклад.

# vscode.extension.contributes.resourceLabelFormatters.stripPathStartingSeparator
source: Controls whether `${path}` substitutions should have starting separator characters stripped.
uk: Контролює, чи потрібно видаляти початкові розділові символи з підстановок `${path}`.

# vscode.extension.contributes.resourceLabelFormatters.tildify
source: Controls if the start of the uri label should be tildified when possible.
uk: Контролює, чи слід тильдувати початок етикетки uri, коли це можливо.

# workspaceName
source: {0} (Workspace)
uk: {0} (Робоча область)

# workspaceNameVerbose
source: {0} (Workspace)
uk: {0} (Робоча область)
