Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_extensions.xlf
Languages: uk

# copy id
source: Copy id ({0})
uk: Скопіювати ідентифікатор ({0})

source: Disable
uk: Вимкнути

source: Disable (Workspace)
uk: Вимкнути (Робоча область)

# errors
source: {0} uncaught errors
uk: {0} не перехоплених помилок

# extensionActivating
source: Extension is activating...
uk: Розширення активується...

# languageActivation
source: Activated by {1} because you opened a {0} file
uk: Активовано {1}, оскільки ви відкрили файл {0}

# requests count
source: {0} Usage: {1} Requests
uk: {0} Використання: {1} Запити

# requests count title
source: Last request was {0}.
uk: Останній запит був {0}.

source: Runtime Extensions
uk: Розширення часу виконання

# session requests count
source: , {0} Requests (Session)
uk: , {0} Запитів (Сесія)

# showRuntimeExtensions
source: Show Running Extensions
uk: Показати активні розширення

# starActivation
source: Activated by {0} on start-up
uk: Активовано {0} під час запуску

# startupFinishedActivation
source: Activated by {0} after start-up finished
uk: Активовано {0} після завершення запуску

# unresponsive.title
source: Extension has caused the extension host to freeze.
uk: Розширення спричинило зависання хоста розширення.

# workspaceContainsFileActivation
source: Activated by {1} because file {0} exists in your workspace
uk: Активовано {1}, оскільки файл {0} існує у вашому робочому просторі.

# workspaceContainsGlobActivation
source: Activated by {1} because a file matching {0} exists in your workspace
uk: Активовано {1}, оскільки файл, що відповідає {0}, існує у вашому робочому просторі.

# workspaceContainsTimeout
source: Activated by {1} because searching for {0} took too long
uk: Активовано {1}, оскільки пошук {0} зайняв занадто багато часу.

# workspaceGenericActivation
source: Activated by {1} on {0}
uk: Активовано {1} на {0}

# exeBasedRecommendation
source: This extension is recommended because of the current workspace configuration
uk: Цю розширення рекомендовано через поточну конфігурацію робочого простору

# exeBasedRecommendation
source: This extension is recommended because you have {0} installed.
uk: Цю розширення рекомендовано через поточну конфігурацію робочого простору

# Changelog title
source: Changelog
uk: Журнал змін

# Install Info
source: Installation
uk: Встановлення

source: Marketplace
uk: Ринок

# Marketplace Info
source: Marketplace
uk: Ринок

source: Version
uk: Версія

source: Built-in
uk: Вбудований

# cache size
source: Cache
uk: Кеш

source: Categories
uk: Категорії

source: Changelog
uk: Журнал змін

# changelogtooltip
source: Extension update history, rendered from the extension's 'CHANGELOG.md' file
uk: Історія оновлень розширення, відображена з файлу 'CHANGELOG.md' розширення

source: Dependencies
uk: Залежності

# dependenciestooltip
source: Lists extensions this extension depends on
uk: Списки розширень, від яких залежить це розширення

source: Details
uk: Деталі

# detailstooltip
source: Extension details, rendered from the extension's 'README.md' file
uk: Деталі розширення, відображені з файлу 'README.md' розширення

# disk space used
source: Cache size
uk: Розмір кешу

# extension pack
source: Extension Pack ({0})
uk: Пакет розширення ({0})

source: Extension Version
uk: Версія розширення

source: Extension Pack
uk: Пакет розширень

# extensionpacktooltip
source: Lists extensions those will be installed together with this extension
uk: Список розширень, які будуть встановлені разом з цим розширенням

source: Features
uk: Особливості

# featurestooltip
source: Lists features contributed by this extension
uk: Перераховує функції, внесені цим розширенням

source: Find
uk: Знайти

source: Find Next
uk: Знайти далі

source: Find Previous
uk: Знайти попереднє

# id
source: Identifier
uk: Ідентифікатор

source: Install count
uk: Кількість установок

source: Issues
uk: Проблеми

source: Last Released
uk: Останнє випущене

source: Last Updated
uk: Останнє оновлення

source: License
uk: Ліцензія

source: Local Extension
uk: Локальне розширення

# name
source: Extension name
uk: Назва розширення

# noChangelog
source: No Changelog available.
uk: Жодного журналу змін не доступно.

source: No Dependencies
uk: Немає залежностей

# noReadme
source: No README available.
uk: README недоступний.

# other
source: Local
uk: Локальний

source: Preview
uk: Попередній перегляд

source: Published
uk: Опубліковано

# publisher
source: Publisher ({0})
uk: Видавець ({0})

source: Rating
uk: Рейтинг

source: Repository
uk: Репозиторій

source: Resources
uk: Ресурси

source: Size
uk: Розмір

source: Size when installed
uk: Розмір при установці

source: Source
uk: Джерело

source: Workspace Extension
uk: Розширення робочого простору

# restartExtensionHost.reason
source: Changing workspace trust
uk: Зміна довіри до робочого простору

# accessExtensionFeature
source: Enable '{0}' Feature
uk: Увімкнути функцію '{0}'

source: Activation
uk: Активація

source: Cancel
uk: Скасувати

# chartDescription
source: There were {0} {1} requests from this extension in the last 30 days.
uk: За останні 30 днів було {0} {1} запитів з цього розширення.

# disableAccessExtensionFeatureMessage
source: Would you like to revoke '{0}' extension to access '{1}' feature?
uk: Ви хочете відкликати розширення '{0}' для доступу до функції '{1}'?

# enable
source: Allow Access
uk: Дозволити доступ

# enableAccessExtensionFeatureMessage
source: Would you like to allow '{0}' extension to access '{1}' feature?
uk: Чи хочете ви дозволити розширенню '{0}' отримати доступ до функції '{1}'?

# extension features list
source: Extension Features
uk: Функції розширення

# grant
source: Allow Access
uk: Дозволити доступ

# label
source: {0} Usage
uk: {0} Використання

# messaages
source: Messages ({0})
uk: Повідомлення ({0})

# noFeatures
source: No features contributed.
uk: Жодні функції не були внесені.

# revoke
source: Revoke Access
uk: Скасувати доступ

# revoked
source: No Access
uk: Немає доступу

# runtime
source: Runtime Status
uk: Статус виконання

# uncaught errors
source: Uncaught Errors ({0})
uk: Неперехоплені помилки ({0})

# donotShowAgain
source: Don't Show Again for this Repository
uk: Не показувати знову для цього репозиторію

# donotShowAgainExtension
source: Don't Show Again for these Extensions
uk: Не показувати знову для цих розширень

# donotShowAgainExtensionSingle
source: Don't Show Again for this Extension
uk: Не показувати знову для цього розширення

# exeRecommended
source: You have {0} installed on your system. Do you want to install the recommended {1} for it?
uk: У вас на системі встановлено {0}. Чи хочете ви встановити рекомендоване {1} для нього?

# extensionFromPublisher
source: '{0}' extension from {1}
uk: Розширення '{0}' з {1}

# extensionsFromMultiplePublishers
source: extensions from {0}, {1} and others
uk: розширення з {0}, {1} та інших

# extensionsFromPublisher
source: extensions from {0}
uk: розширення з {0}

# extensionsFromPublishers
source: extensions from {0} and {1}
uk: розширення з {0} та {1}

# ignoreAll
source: Yes, Ignore All
uk: Так, ігнорувати все

# ignoreExtensionRecommendations
source: Do you want to ignore all extension recommendations?
uk: Ви хочете ігнорувати всі рекомендації щодо розширень?

source: Install
uk: Встановити

# install and do no sync
source: Install (Do not sync)
uk: Встановити (Не синхронізувати)

source: No
uk: Ні

# recommended
source: Do you want to install the recommended {0} for {1}?
uk: Ви хочете встановити рекомендований {0} для {1}?

source: Show Recommendations
uk: Показати рекомендації

source: this repository
uk: цей репозиторій

source: Install from VSIX...
uk: Встановити з VSIX...

# InstallVSIXAction.reloadNow
source: Reload Now
uk: Перезавантажити зараз

# InstallVSIXAction.restartExtensions
source: Restart Extensions
uk: Перезапустити розширення

# InstallVSIXAction.successNoReload
source: Completed installing extension.
uk: Встановлення розширення завершено.

# InstallVSIXAction.successReload
source: Completed installing extension. Please reload Visual Studio Code to enable it.
uk: Встановлення розширення завершено. Будь ласка, перезавантажте Visual Studio Code, щоб активувати його.

# InstallVSIXAction.successRestart
source: Completed installing extension. Please restart extensions to enable it.
uk: Встановлення розширення завершено. Будь ласка, перезапустіть розширення, щоб увімкнути його.

# InstallVSIXs.successNoReload
source: Completed installing extensions.
uk: Встановлення розширень завершено.

# InstallVSIXs.successReload
source: Completed installing extensions. Please reload Visual Studio Code to enable them.
uk: Встановлення розширень завершено. Будь ласка, перезавантажте Visual Studio Code, щоб активувати їх.

# InstallVSIXs.successRestart
source: Completed installing extensions. Please restart extensions to enable them.
uk: Встановлення розширень завершено. Будь ласка, перезапустіть розширення, щоб активувати їх.

# all
source: All Extensions
uk: Усі розширення

# autoRestart
source: If activated, extensions will automatically restart following an update if the window is not in focus. There can be a data loss if you have open Notebooks or Custom Editors.
uk: Якщо активовано, розширення автоматично перезапустяться після оновлення, якщо вікно не в фокусі. Може статися втрата даних, якщо у вас відкриті Нотатники або Користувацькі Редактори.

# builtin
source: Extension '{0}' is a Built-in extension and cannot be installed
uk: Вбудований

# builtin filter
source: Built-in
uk: Вбудований

# checkForUpdates
source: Check for Extension Updates
uk: Перевірити оновлення розширення

source: Clear Extensions Search Results
uk: Очистити результати пошуку розширень

# disableAll
source: Disable All Installed Extensions
uk: Вимкнути всі встановлені розширення

# disableAllWorkspace
source: Disable All Installed Extensions for this Workspace
uk: Вимкнути всі встановлені розширення для цього робочого простору

# disableAutoUpdate
source: Disable Auto Update for All Extensions
uk: Вимкнути автоматичне оновлення для всіх розширень

# disablePreRleaseLabel
source: Switch to Release Version
uk: Переключитися на версію Release

# disabled filter
source: Disabled
uk: Вимкнено

source: Download VSIX
uk: Завантажити VSIX

# download pre-release
source: Download Pre-Release VSIX
uk: Завантажити попередню версію VSIX

# enableAll
source: Enable All Extensions
uk: Увімкнути всі розширення

# enableAllWorkspace
source: Enable All Extensions for this Workspace
uk: Увімкнути всі розширення для цього робочого простору

# enableAutoUpdate
source: Enable Auto Update for All Extensions
uk: Увімкнути автоматичне оновлення для всіх розширень

# enablePreRleaseLabel
source: Switch to Pre-Release Version
uk: Перейти на версію попереднього випуску

# enabled
source: Only Enabled Extensions
uk: Тільки увімкнені розширення

# enabled filter
source: Enabled
uk: Увімкнено

source: Extension
uk: Розширення

# extension updates filter
source: Updates
uk: Оновлення

# extension.publisher.allow.description
source: Allow or disallow all extensions from the publisher.
uk: Дозволити або заборонити всі розширення від видавця.

# extensionInfoDescription
source: Description: {0}
uk: Опис: {0}

# extensionInfoId
source: Id: {0}
uk: Ідентифікатор: {0}

# extensionInfoName
source: Name: {0}
uk: Ім'я: {0}

# extensionInfoPublisher
source: Publisher: {0}
uk: Видавець: {0}

# extensionInfoVSMarketplaceLink
source: VS Marketplace Link: {0}
uk: Посилання на VS Marketplace: {0}

# extensionInfoVersion
source: Version: {0}
uk: Версія: {0}

# extensionUpdates
source: Show Extension Updates
uk: Показати оновлення розширення

source: Extensions
uk: Розширення

# extensions.affinity
source: Configure an extension to execute in a different extension host process.
uk: Налаштуйте розширення для виконання в іншому процесі хоста розширень.

# extensions.allow.all.description
source: Allow or disallow all extensions.
uk: Дозволити або заборонити всі розширення.

# extensions.allow.all.disable
source: Disallow all extensions.
uk: Заборонити всі розширення.

# extensions.allow.all.enable
source: Allow all extensions.
uk: Дозволити всі розширення.

# extensions.allow.description
source: Allow or disallow the extension.
uk: Дозволити або заборонити розширення.

# extensions.allow.version.description
source: Allow or disallow specific versions of the extension. To specifcy a platform specific version, use the format `platform@1.2.3`, e.g. `win32-x64@1.2.3`. Supported platforms are `win32-x64`, `win32-arm64`, `linux-x64`, `linux-arm64`, `linux-armhf`, `alpine-x64`, `alpine-arm64`, `darwin-x64`, `darwin-arm64`
uk: Дозволити або заборонити конкретні версії розширення. Щоб вказати платформо-специфічну версію, використовуйте формат `platform@1.2.3`, наприклад, `win32-x64@1.2.3`. Підтримувані платформи: `win32-x64`, `win32-arm64`, `linux-x64`, `linux-arm64`, `linux-armhf`, `alpine-x64`, `alpine-arm64`, `darwin-x64`, `darwin-arm64`.

# extensions.allowed
source: Specify a list of extensions that are allowed to use. This helps maintain a secure and consistent development environment by restricting the use of unauthorized extensions. For more information on how to configure this setting, please visit the [Configure Allowed Extensions](https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions) section.
uk: Вкажіть список розширень, які дозволено використовувати. Це допомагає підтримувати безпечне та послідовне середовище розробки, обмежуючи використання несанкціонованих розширень. Для отримання додаткової інформації про налаштування цього параметра, будь ласка, відвідайте розділ [Налаштування дозволених розширень](https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions).

# extensions.allowed.all
source: All extensions are allowed.
uk: Усі розширення дозволені.

# extensions.allowed.disable.desc
source: Extension is not allowed.
uk: Розширення не дозволено.

# extensions.allowed.disable.stable.desc
source: Allow only stable versions of the extension.
uk: Дозволити лише стабільні версії розширення.

# extensions.allowed.enable.desc
source: Extension is allowed.
uk: Подовження дозволено.

# extensions.allowed.none
source: No extensions are allowed.
uk: Не дозволяються розширення.

# extensions.autoUpdate
source: Controls the automatic update behavior of extensions. The updates are fetched from a Microsoft online service.
uk: Контролює автоматичну поведінку оновлень розширень. Оновлення отримуються з онлайн-сервісу Microsoft.

# extensions.autoUpdate.enabled
source: Download and install updates automatically only for enabled extensions.
uk: Завантажувати та встановлювати оновлення автоматично лише для увімкнених розширень.

# extensions.autoUpdate.false
source: Extensions are not automatically updated.
uk: Розширення не оновлюються автоматично.

# extensions.autoUpdate.true
source: Download and install updates automatically for all extensions.
uk: Завантажувати та встановлювати оновлення автоматично для всіх розширень.

# extensions.gallery.useUnpkgResourceApi
source: When enabled, extensions to update are fetched from Unpkg service.
uk: Коли увімкнено, розширення для оновлення завантажуються з сервісу Unpkg.

# extensions.publisher.allowed.disable.desc
source: All extensions from the publisher are not allowed.
uk: Усі розширення від видавця не дозволені.

# extensions.publisher.allowed.disable.stable.desc
source: Allow only stable versions of the extensions from the publisher.
uk: Дозволити лише стабільні версії розширень від видавця.

# extensions.publisher.allowed.enable.desc
source: All extensions from the publisher are allowed.
uk: Усі розширення від видавця дозволені.

# extensions.supportUntrustedWorkspaces
source: Override the untrusted workspace support of an extension. Extensions using `true` will always be enabled. Extensions using `limited` will always be enabled, and the extension will hide functionality that requires trust. Extensions using `false` will only be enabled only when the workspace is trusted.
uk: Перезаписати підтримку ненадійного робочого простору розширення. Розширення, що використовують `true`, завжди будуть увімкнені. Розширення, що використовують `limited`, завжди будуть увімкнені, і розширення приховає функціональність, яка потребує довіри. Розширення, що використовують `false`, будуть увімкнені лише тоді, коли робочий простір є надійним.

# extensions.supportUntrustedWorkspaces.false
source: Extension will only be enabled only when the workspace is trusted.
uk: Розширення буде активовано лише тоді, коли робочий простір буде довіреним.

# extensions.supportUntrustedWorkspaces.limited
source: Extension will always be enabled, and the extension will hide functionality requiring trust.
uk: Розширення завжди буде увімкнено, і розширення приховає функціональність, що вимагає довіри.

# extensions.supportUntrustedWorkspaces.supported
source: Defines the untrusted workspace support setting for the extension.
uk: Визначає налаштування підтримки ненадійного робочого простору для розширення.

# extensions.supportUntrustedWorkspaces.true
source: Extension will always be enabled.
uk: Розширення завжди буде увімкнено.

# extensions.supportUntrustedWorkspaces.version
source: Defines the version of the extension for which the override should be applied. If not specified, the override will be applied independent of the extension version.
uk: Визначає версію розширення, для якої слід застосувати переоприділення. Якщо не вказано, переоприділення буде застосовано незалежно від версії розширення.

# extensions.supportVirtualWorkspaces
source: Override the virtual workspaces support of an extension.
uk: Перезаписати підтримку віртуальних робочих просторів розширення.

# extensions.verifySignature
source: When enabled, extensions are verified to be signed before getting installed.
uk: Коли ввімкнено, розширення перевіряються на наявність підпису перед установкою.

# extensionsCheckUpdates
source: When enabled, automatically checks extensions for updates. If an extension has an update, it is marked as outdated in the Extensions view. The updates are fetched from a Microsoft online service.
uk: Коли увімкнено, автоматично перевіряє розширення на наявність оновлень. Якщо розширення має оновлення, воно позначається як застаріле у вигляді розширень. Оновлення отримуються з онлайн-сервісу Microsoft.

# extensionsCloseExtensionDetailsOnViewChange
source: When enabled, editors with extension details will be automatically closed upon navigating away from the Extensions View.
uk: Коли увімкнено, редактори з деталями розширення будуть автоматично закриті при переході від перегляду розширень.

# extensionsConfigurationTitle
source: Extensions
uk: Розширення

# extensionsDeferredStartupFinishedActivation
source: When enabled, extensions which declare the `onStartupFinished` activation event will be activated after a timeout.
uk: Коли увімкнено, розширення, які оголошують подію активації `onStartupFinished`, будуть активовані після тайм-ауту.

# extensionsIgnoreRecommendations
source: When enabled, the notifications for extension recommendations will not be shown.
uk: Коли увімкнено, сповіщення про рекомендації розширень не будуть показані.

# extensionsInQuickAccess
source: When enabled, extensions can be searched for via Quick Access and report issues from there.
uk: Коли увімкнено, розширення можна шукати через Швидкий доступ і повідомляти про проблеми звідти.

# extensionsShowRecommendationsOnlyOnDemand_Deprecated
source: This setting is deprecated. Use extensions.ignoreRecommendations setting to control recommendation notifications. Use Extensions view's visibility actions to hide Recommended view by default.
uk: Це налаштування застаріле. Використовуйте налаштування extensions.ignoreRecommendations для контролю сповіщень про рекомендації. Використовуйте дії видимості в режимі розширень, щоб за замовчуванням приховати перегляд Рекомендовані.

# extensionsWebWorker
source: Enable web worker extension host.
uk: Увімкнути хост розширення веб-працівника.

# extensionsWebWorker.auto
source: The Web Worker Extension Host will be launched when a web extension needs it.
uk: Хост розширення Web Worker буде запущено, коли веб-розширення в цьому потребуватиме.

# extensionsWebWorker.false
source: The Web Worker Extension Host will never be launched.
uk: Розширення Web Worker ніколи не буде запущено.

# extensionsWebWorker.true
source: The Web Worker Extension Host will always be launched.
uk: Розширення Web Worker завжди буде запущено.

# featured filter
source: Featured
uk: Вибране

# filter by category
source: Category
uk: Категорія

source: Filter Extensions...
uk: Фільтрувати розширення...

# focusExtensions
source: Focus on Extensions View
uk: Зосередьтеся на перегляді розширень

# handleUriConfirmedExtensions
source: When an extension is listed here, a confirmation prompt will not be shown when that extension handles a URI.
uk: Коли розширення зазначено тут, підтверджувальне вікно не буде показано, коли це розширення обробляє URI.

# id required
source: Extension id required.
uk: Необхідний ідентифікатор розширення.

# importKeyboardShortcutsFroms
source: Migrate Keyboard Shortcuts from...
uk: Міграція клавішних комбінацій з...

# install button
source: Install
uk: Встановити

# install installAndDonotSync
source: Install (Do not Sync)
uk: Встановити (Не синхронізувати)

# installButton
source: &&Install
uk: &&Встановити

source: Install Extension from Location...
uk: Встановити розширення з місця...

# installExtensionQuickAccessHelp
source: Install or Search Extensions
uk: Встановити або Шукати Розширення

# installExtensionQuickAccessPlaceholder
source: Type the name of an extension to install or search.
uk: Введіть назву розширення для встановлення або пошуку.

source: Install Extensions
uk: Встановити розширення

# installFromLocation
source: Install Extension from Location
uk: Встановити розширення з місця

# installFromLocationPlaceHolder
source: Location of the web extension
uk: Розташування веб-розширення

source: Install from VSIX
uk: Встановити з VSIX

# installPrereleaseAndDonotSync
source: Install Pre-Release (Do not Sync)
uk: Встановити попередню версію (Не синхронізувати)

# installVSIX
source: Install Extension VSIX
uk: Встановити розширення VSIX

source: Install Workspace Recommended Extensions
uk: Встановити рекомендовані розширення для робочого простору

# manageExtensionsHelp
source: Manage Extensions
uk: Керувати розширеннями

# manageExtensionsQuickAccessPlaceholder
source: Press Enter to manage extensions.
uk: Натисніть Enter, щоб керувати розширеннями.

# miPreferencesExtensions
source: &&Extensions
uk: &&Розширення

# miViewExtensions
source: E&&xtensions
uk: Р&&озширення

# most popular filter
source: Most Popular
uk: Найпопулярніший

# most popular recommended
source: Recommended
uk: Рекомендовано

# noUpdatesAvailable
source: All extensions are up to date.
uk: Усі розширення оновлені.

source: None
uk: Ні

# notFound
source: Extension '{0}' not found.
uk: Розширення '{0}' не знайдено.

# notInstalled
source: Extension '{0}' is not installed. Make sure you use the full extension ID, including the publisher, e.g.: ms-dotnettools.csharp.
uk: Розширення '{0}' не встановлено. Переконайтеся, що ви використовуєте повний ідентифікатор розширення, включаючи видавця, наприклад: ms-dotnettools.csharp.

# recently published filter
source: Recently Published
uk: Нещодавно опубліковано

# recentlyPublishedExtensions
source: Show Recently Published Extensions
uk: Показати нещодавно опубліковані розширення

# refreshExtension
source: Refresh
uk: Оновити

source: Show Pre-Release Version
uk: Показати версію до випуску

# show released version
source: Show Release Version
uk: Показати версію випуску

source: Show Built-in Extensions
uk: Показати вбудовані розширення
