Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_welcomeGettingStarted.xlf
Languages: uk

# acessibleViewHint
source: Inspect this in the accessible view ({0}).
uk: Перегляньте це в доступному вигляді ({0}).

# acessibleViewHintNoKbOpen
source: Inspect this in the accessible view via the command Open Accessible View which is currently not triggerable via keybinding.
uk: Перегляньте це в доступному режимі за допомогою команди Відкрити доступний режим, яка наразі не може бути активована за допомогою комбінації клавіш.

# allDone
source: Mark Done
uk: Позначити як виконане

# checkboxTitle
source: When checked, this page will be shown on startup.
uk: Коли вибрано, ця сторінка буде показана під час запуску.

# close
source: Hide
uk: Сховати

# closeAriaLabel
source: Hide
uk: Сховати

# footer
source: {0} collects usage data. Read our {1} and learn how to {2}.
uk: {0} збирає дані про використання. Ознайомтеся з нашим {1} та дізнайтеся, як {2}.

# gettingStarted.allStepsComplete
source: All {0} steps complete!
uk: Усі {0} кроки завершено!

# gettingStarted.editingEvolved
source: Editing evolved
uk: Редагування еволюціонувало

# gettingStarted.keyboardTip
source: Tip: Use keyboard shortcut
uk: Порада: Використовуйте комбінацію клавіш

# gettingStarted.someStepsComplete
source: {0} of {1} steps complete
uk: {0} з {1} кроків завершено

source: Go Back
uk: Повернутися назад

# imageShowing
source: Image showing {0}
uk: Зображення, що показує {0}

source: New
uk: Новий

# newItems
source: Updated
uk: Оновлено

# nextOne
source: Next Section
uk: Наступний розділ

# noRecents
source: You have no recent folders,
uk: У вас немає нещодавніх папок,

# openFolder
source: open a folder
uk: відкрити папку

source: opt out
uk: вийти

# pickWalkthroughs
source: Open Walkthrough...
uk: Відкрити посібник...

source: privacy statement
uk: заява про конфіденційність

source: Recent
uk: Останній

# show more recents
source: Show All Recent Folders {0}
uk: Показати всі нещодавні папки {0}

# showAll
source: More...
uk: Більше...

source: Start
uk: Почати

source: to start.
uk: щоб почати.

# videoAltText
source: Video for {0}
uk: Відео для {0}

# videoShowing
source: Video showing {0}
uk: Відео, що показує {0}

source: Walkthroughs
uk: Проходження

source: Welcome
uk: Ласкаво просимо

# welcomeAriaLabel
source: Overview of how to get up to speed with your editor.
uk: Огляд того, як швидко освоїти ваш редактор.

# welcomePage.openFolderWithPath
source: Open folder {0} with path {1}
uk: Відкрити папку {0} з шляхом {1}

# welcomePage.showOnStartup
source: Show welcome page on startup
uk: Показати сторінку вітання при запуску

# deprecationMessage
source: Deprecated, use the global `workbench.reduceMotion`.
uk: Застаріло, використовуйте глобальний `workbench.reduceMotion`.

# miWelcome
source: Welcome
uk: Ласкаво просимо

# minWelcomeDescription
source: Opens a Walkthrough to help you get started in VS Code.
uk: Відкриває посібник, щоб допомогти вам почати працювати у VS Code.

# pickWalkthroughs
source: Select a walkthrough to open
uk: Відкрити посібник...

# welcome.goBack
source: Go Back
uk: Повернутися назад

# welcome.markStepComplete
source: Mark Step Complete
uk: Позначити крок як завершений

# welcome.markStepInomplete
source: Mark Step Incomplete
uk: Позначити крок як незавершений

# welcome.showAllWalkthroughs
source: Open Walkthrough...
uk: Відкрити посібник...

# workbench.startupEditor
source: Controls which editor is shown at startup, if none are restored from the previous session.
uk: Контролює, який редактор відображається при запуску, якщо жоден не відновлено з попередньої сесії.

# workbench.startupEditor.newUntitledFile
source: Open a new untitled text file (only applies when opening an empty window).
uk: Відкрийте новий неназваний текстовий файл (застосовується лише при відкритті порожнього вікна).

# workbench.startupEditor.none
source: Start without an editor.
uk: Почати без редактора.

# workbench.startupEditor.readme
source: Open the README when opening a folder that contains one, fallback to 'welcomePage' otherwise. Note: This is only observed as a global configuration, it will be ignored if set in a workspace or folder configuration.
uk: Відкрийте README при відкритті папки, яка його містить, в іншому випадку використовуйте 'welcomePage'. Примітка: Це спостерігається лише як глобальна конфігурація, вона буде проігнорована, якщо встановлена в конфігурації робочого простору або папки.

# workbench.startupEditor.terminal
source: Open a new terminal in the editor area.
uk: Відкрийте новий термінал у зоні редактора.

# workbench.startupEditor.welcomePage
source: Open the Welcome page, with content to aid in getting started with VS Code and extensions.
uk: Відкрийте сторінку 'Welcome', з вмістом, що допомагає розпочати роботу з VS Code та розширеннями.

# workbench.startupEditor.welcomePageInEmptyWorkbench
source: Open the Welcome page when opening an empty workbench.
uk: Відкрити сторінку Привітання при відкритті порожньої робочої області.

# workbench.welcomePage.preferReducedMotion
source: When enabled, reduce motion in welcome page.
uk: Коли увімкнено, зменшити рух на сторінці вітання.

# workbench.welcomePage.walkthroughs.openOnInstall
source: When enabled, an extension's walkthrough will open upon install of the extension.
uk: Коли увімкнено, посібник розширення відкриється після встановлення розширення.

# workspacePlatform
source: The platform of the current workspace, which in remote or serverless contexts may be different from the platform of the UI
uk: Платформа поточного робочого простору, яка в контекстах віддаленого доступу або безсерверних рішень може відрізнятися від платформи UI

# gettingStarted.description
source: Description: {0}
uk: Опис: {0}

# gettingStarted.title
source: Title: {0}
uk: Заголовок: {0}

# walkthrough.stepTitle.foreground
source: Foreground color of the heading of each walkthrough step
uk: Колір переднього плану заголовка кожного етапу інструкції

# welcomePage.background
source: Background color for the Welcome page.
uk: Колір фону для сторінки Вітання.

# welcomePage.progress.background
source: Foreground color for the Welcome page progress bars.
uk: Колір переднього плану для індикаторів прогресу на сторінці Привітання.

# welcomePage.progress.foreground
source: Background color for the Welcome page progress bars.
uk: Колір фону для прогрес-барів на сторінці Вітання.

# welcomePage.tileBackground
source: Background color for the tiles on the Welcome page.
uk: Колір фону для плиток на сторінці Привітання.

# welcomePage.tileBorder
source: Border color for the tiles on the Welcome page.
uk: Колір рамки для плиток на сторінці Привітання.

# welcomePage.tileHoverBackground
source: Hover background color for the tiles on the Welcome.
uk: Колір фону при наведенні для плиток на сторінці Привітання.

# pathDeprecated
source: Deprecated. Please use `image` or `markdown` instead
uk: Застаріло. Будь ласка, використовуйте `image` або `markdown` замість цього.

source: Title
uk: Назва

# walkthroughs
source: Contribute walkthroughs to help users getting started with your extension.
uk: Проходження

# walkthroughs.description
source: Description of walkthrough.
uk: Опис проходження.

# walkthroughs.featuredFor
source: Walkthroughs that match one of these glob patterns appear as 'featured' in workspaces with the specified files. For example, a walkthrough for TypeScript projects might specify `tsconfig.json` here.
uk: Проходження, які відповідають одному з цих шаблонів glob, з'являються як 'рекомендовані' у робочих просторах з вказаними файлами. Наприклад, проходження для проектів TypeScript може вказувати `tsconfig.json` тут.

# walkthroughs.icon
source: Relative path to the icon of the walkthrough. The path is relative to the extension location. If not specified, the icon defaults to the extension icon if available.
uk: Відносний шлях до іконки посібника. Шлях є відносним до місця розташування розширення. Якщо не вказано, іконка за замовчуванням використовує іконку розширення, якщо вона доступна.

# walkthroughs.id
source: Unique identifier for this walkthrough.
uk: Унікальний ідентифікатор для цього посібника.

# walkthroughs.steps
source: Steps to complete as part of this walkthrough.
uk: Кроки, які потрібно виконати в рамках цього посібника.

# walkthroughs.steps.button.deprecated.interpolated
source: Deprecated. Use markdown links in the description instead, i.e. {0}, {1}, or {2}
uk: Застаріло. Замість цього використовуйте маркдаун посилання в описі, тобто {0}, {1} або {2}.

# walkthroughs.steps.completionEvents
source: Events that should trigger this step to become checked off. If empty or not defined, the step will check off when any of the step's buttons or links are clicked; if the step has no buttons or links it will check on when it is selected.
uk: Події, які повинні спровокувати виконання цього кроку. Якщо порожньо або не визначено, крок буде відмічено, коли буде натиснуто будь-яку з кнопок або посилань кроку; якщо у кроку немає кнопок або посилань, він буде відмічено, коли його виберуть.

# walkthroughs.steps.completionEvents.extensionInstalled
source: Check off step when an extension with the given id is installed. If the extension is already installed, the step will start off checked.
uk: Позначте крок, коли розширення з вказаним ідентифікатором встановлено. Якщо розширення вже встановлено, крок буде спочатку позначений як виконаний.

# walkthroughs.steps.completionEvents.onCommand
source: Check off step when a given command is executed anywhere in VS Code.
uk: Позначте крок, коли дану команду виконано де завгодно в VS Code.

# walkthroughs.steps.completionEvents.onContext
source: Check off step when a context key expression is true.
uk: Позначте крок, коли вираз контекстного ключа є істинним.

# walkthroughs.steps.completionEvents.onLink
source: Check off step when a given link is opened via a walkthrough step.
uk: Позначте крок, коли задане посилання відкривається через крок інструкції.

# walkthroughs.steps.completionEvents.onSettingChanged
source: Check off step when a given setting is changed
uk: Позначте крок, коли задане налаштування змінено

# walkthroughs.steps.completionEvents.onView
source: Check off step when a given view is opened
uk: Позначте крок, коли відкрито вказане подання

# walkthroughs.steps.completionEvents.stepSelected
source: Check off step as soon as it is selected.
uk: Позначте крок, як тільки він буде обраний.

# walkthroughs.steps.description.interpolated
source: Description of step. Supports ``preformatted``, __italic__, and **bold** text. Use markdown-style links for commands or external links: {0}, {1}, or {2}. Links on their own line will be rendered as buttons.
uk: Опис кроку. Підтримує ``попередньо відформатований``, __курсив__, і **жирний** текст. Використовуйте посилання в стилі markdown для команд або зовнішніх посилань: {0}, {1}, або {2}. Посилання на окремому рядку будуть відображатися як кнопки.

# walkthroughs.steps.doneOn
source: Signal to mark step as complete.
uk: Сигнал для позначення кроку як завершеного.

# walkthroughs.steps.doneOn.deprecation
source: doneOn is deprecated. By default steps will be checked off when their buttons are clicked, to configure further use completionEvents
uk: doneOn застаріло. За замовчуванням кроки будуть позначені як виконані, коли їх кнопки будуть натиснуті, для подальшої конфігурації використовуйте completionEvents.

# walkthroughs.steps.id
source: Unique identifier for this step. This is used to keep track of which steps have been completed.
uk: Унікальний ідентифікатор для цього кроку. Це використовується для відстеження, які кроки були завершені.

# walkthroughs.steps.media
source: Media to show alongside this step, either an image or markdown content.
uk: Медіа для відображення поряд з цим кроком, або зображення, або контент у форматі markdown.

# walkthroughs.steps.media.altText
source: Alternate text to display when the image cannot be loaded or in screen readers.
uk: Альтернативний текст для відображення, коли зображення не може бути завантажено або в програмах для читання з екрану.

# walkthroughs.steps.media.image.path.dark.string
source: Path to the image for dark themes, relative to extension directory.
uk: Шлях до зображення для темних тем, відносно каталогу розширення.

# walkthroughs.steps.media.image.path.hc.string
source: Path to the image for hc themes, relative to extension directory.
uk: Шлях до зображення для тем hc, відносно директорії розширення.

# walkthroughs.steps.media.image.path.hcLight.string
source: Path to the image for hc light themes, relative to extension directory.
uk: Шлях до зображення для світлих тем hc, відносно каталогу розширення.

# walkthroughs.steps.media.image.path.light.string
source: Path to the image for light themes, relative to extension directory.
uk: Шлях до зображення для світлих тем, відносно каталогу розширення.

# walkthroughs.steps.media.image.path.string
source: Path to an image - or object consisting of paths to light, dark, and hc images - relative to extension directory. Depending on context, the image will be displayed from 400px to 800px wide, with similar bounds on height. To support HIDPI displays, the image will be rendered at 1.5x scaling, for example a 900 physical pixels wide image will be displayed as 600 logical pixels wide.
uk: Шлях до зображення - або об'єкта, що складається з шляхів до світлих, темних та hc зображень - відносно каталогу розширення. Залежно від контексту, зображення буде відображатися шириною від 400px до 800px, з подібними межами по висоті. Щоб підтримувати дисплеї HIDPI, зображення буде відтворено з масштабуванням 1.5x, наприклад, зображення шириною 900 фізичних пікселів буде відображатися як 600 логічних пікселів.

# walkthroughs.steps.media.image.path.svg
source: Path to an svg, color tokens are supported in variables to support theming to match the workbench.
uk: Шлях до svg, кольорові токени підтримуються у змінних для підтримки тем, що відповідають робочій області.

# walkthroughs.steps.media.markdown.path
source: Path to the markdown document, relative to extension directory.
uk: Шлях до документа markdown, відносно каталогу розширення.

# walkthroughs.steps.oneOn.command
source: Mark step done when the specified command is executed.
uk: Позначте крок як виконаний, коли вказана команда буде виконана.

# walkthroughs.steps.title
source: Title of step.
uk: Назва кроку.

# walkthroughs.steps.when
source: Context key expression to control the visibility of this step.
uk: Контекстний ключ виразу для контролю видимості цього кроку.

# walkthroughs.title
source: Title of walkthrough.
uk: Назва посібника.

# walkthroughs.when
source: Context key expression to control the visibility of this walkthrough.
uk: Контекстний ключовий вираз для контролю видимості цього посібника.

# gettingStartedChecked
source: Used to represent walkthrough steps which have been completed
uk: Використовується для представлення кроків проходження, які були завершені.

# gettingStartedUnchecked
source: Used to represent walkthrough steps which have not been completed
uk: Використовується для представлення кроків проходження, які не були завершені

# getStarted
source: Welcome
uk: Ласкаво просимо

# walkthroughPageTitle
source: Walkthrough: {0}
uk: Посібник: {0}

source: Built-In
uk: Вбудований

source: Developer
uk: Розробник

# resetGettingStartedProgressDescription
source: Reset the progress of all Walkthrough steps on the Welcome Page to make them appear as if they are being viewed for the first time, providing a fresh start to the getting started experience.
uk: Скинути прогрес усіх кроків Посібника на Сторінці вітання, щоб вони виглядали так, ніби їх переглядають вперше, надаючи новий старт досвіду початку роботи.

source: Reset Welcome Page Walkthrough Progress
uk: Скинути прогрес проходження вітальної сторінки

# startupPage.markdownPreviewError
source: Could not open markdown preview: {0}. Please make sure the markdown extension is enabled.
uk: Не вдалося відкрити попередній перегляд markdown: {0}. Будь ласка, переконайтеся, що розширення markdown увімкнено.

# welcome.displayName
source: Welcome Page
uk: Сторінка привітання

# browseLangExts
source: Browse Language Extensions
uk: Переглядати мовні розширення

# browsePopular
source: Browse Popular Extensions
uk: Перегляд популярних розширень

# browsePopularWeb
source: Browse Popular Web Extensions
uk: Перегляд популярних веб-розширень

# cloneRepo
source: Clone Repository
uk: Клонувати репозиторій

# commandPalette
source: Open Command Palette
uk: Відкрити палітру команд

# enableSync
source: Backup and Sync Settings
uk: Налаштування резервного копіювання та синхронізації

source: enable trust
uk: увімкнути довіру

# getting-started-beginner-icon
source: Icon used for the beginner category of welcome page
uk: Іконка, що використовується для категорії початківців на сторінці привітання

# getting-started-setup-icon
source: Icon used for the setup category of welcome page
uk: Іконка, що використовується для категорії налаштувань на сторінці вітання

# gettingStarted.accessibilityHelp.description.interpolated
source: The accessibility help dialog provides information about what to expect from a feature and the commands/keybindings to operate them. With focus in an editor, terminal, notebook, chat response, comment, or debug console, the relevant dialog can be opened with the Open Accessibility Help command. {0}
uk: Діалог допомоги з доступності надає інформацію про те, чого очікувати від функції, а також команди/гарячі клавіші для їх використання. Зосередившись на редакторі, терміналі, нотатнику, відповіді в чаті, коментарі або консолі налагодження, відповідний діалог можна відкрити за допомогою команди Відкрити допомогу з доступності. {0}

# gettingStarted.accessibilityHelp.title
source: Use the accessibility help dialog to learn about features
uk: Використовуйте діалогове вікно допомоги з доступності, щоб дізнатися про функції

# gettingStarted.accessibilitySettings.description.interpolated
source: Accessibility settings can be configured by running the Open Accessibility Settings command. {0}
uk: Налаштування доступності можна налаштувати, виконавши команду Відкрити налаштування доступності. {0}

# gettingStarted.accessibilitySettings.title
source: Configure accessibility settings
uk: Налаштувати параметри доступності

# gettingStarted.accessibilitySignals.description.interpolated
source: Accessibility sounds and announcements are played around the workbench for different events. These can be discovered and configured using the List Signal Sounds and List Signal Announcements commands. {0} {1}
uk: Звуки доступності та оголошення відтворюються навколо робочого місця для різних подій. Ці можна виявити та налаштувати за допомогою команд List Signal Sounds та List Signal Announcements. {0} {1}

# gettingStarted.accessibilitySignals.title
source: Fine tune which accessibility signals you want to receive via audio or a braille device
uk: Тонко налаштуйте, які сигнали доступності ви хочете отримувати через аудіо або брайлівський пристрій.

# gettingStarted.accessibleView.description.interpolated
source: The accessible view is available for the terminal, hovers, notifications, comments, notebook output, chat responses, inline completions, and debug console output. With focus in any of those features, it can be opened with the Open Accessible View command. {0}
uk: Доступний вигляд доступний для терміналу, спливаючих вікон, сповіщень, коментарів, виходу з блокнота, відповідей у чаті, вбудованих завершень та виходу з консолі налагодження. Зосередившись на будь-якій з цих функцій, його можна відкрити за допомогою команди Відкрити доступний вигляд. {0}

# gettingStarted.accessibleView.title
source: Screen reader users can inspect content line by line, character by character in the accessible view.
uk: Користувачі програм читання з екрану можуть переглядати вміст рядок за рядком, символ за символом у доступному вигляді.

# gettingStarted.beginner.description
source: Get an overview of the most essential features
uk: Отримайте огляд найважливіших функцій

# gettingStarted.beginner.title
source: Learn the Fundamentals
uk: Вивчіть основи

# gettingStarted.beginner.walkthroughPageTitle
source: Essential Features
uk: Основні функції

# gettingStarted.codeFolding.description.interpolated
source: Fold or unfold a code section with the Toggle Fold command. {0} Fold or unfold recursively with the Toggle Fold Recursively Command {1}
uk: Згорнути або розгорнути секцію коду за допомогою команди Згорнути/Розгорнути. {0} Згорнути або розгорнути рекурсивно за допомогою команди Згорнути/Розгорнути рекурсивно {1}

# gettingStarted.codeFolding.title
source: Use code folding to collapse blocks of code and focus on the code you're interested in.
uk: Використовуйте згортання коду, щоб згорнути блоки коду та зосередитися на коді, який вас цікавить.

# gettingStarted.commandPalette.description.interpolated
source: Run commands without reaching for your mouse to accomplish any task in VS Code. {0}
uk: Виконуйте команди, не дістаючи миші, щоб виконати будь-яке завдання у VS Code. {0}

# gettingStarted.commandPalette.title
source: Unlock productivity with the Command Palette
uk: Розблокуйте продуктивність за допомогою палітри команд

# gettingStarted.commandPaletteAccessibility.description.interpolated
source: Run commands without reaching for your mouse to accomplish any task in VS Code. {0}
uk: Виконуйте команди, не дістаючи миші, щоб виконати будь-яке завдання у VS Code. {0}

# gettingStarted.commandPaletteAccessibility.title
source: Unlock productivity with the Command Palette
uk: Розблокуйте продуктивність за допомогою палітри команд

# gettingStarted.copilotSetup.description
source: You can use [Copilot]({0}) to generate code across multiple files, fix errors, ask questions about your code and much more using natural language.
uk: Ви можете використовувати [Copilot]({0}), щоб генерувати код у кількох файлах, виправляти помилки, ставити запитання про свій код і багато іншого, використовуючи природну мову.

# gettingStarted.copilotSetup.title
source: Use AI features with Copilot for free
uk: Використовуйте функції ШІ з Copilot безкоштовно

# gettingStarted.debug.description.interpolated
source: Accelerate your edit, build, test, and debug loop by setting up a launch configuration. {0}
uk: Прискорте свій цикл редагування, збірки, тестування та налагодження, налаштувавши конфігурацію запуску. {0}

# gettingStarted.debug.title
source: Watch your code in action
uk: Дивіться, як ваш код працює в дії

# gettingStarted.extensions.description.interpolated
source: Extensions are VS Code's power-ups. They range from handy productivity hacks, expanding out-of-the-box features, to adding completely new capabilities. {0}
uk: Розширення - це підсилювачі можливостей VS Code. Вони варіюються від зручних хаків продуктивності, розширення стандартних функцій до додавання абсолютно нових можливостей. {0}

# gettingStarted.extensions.title
source: Code with extensions
uk: Код з розширеннями

# gettingStarted.extensionsWeb.description.interpolated
source: Extensions are VS Code's power-ups. A growing number are becoming available in the web. {0}
uk: Розширення - це підсилювачі можливостей VS Code. Зростаюча кількість з них стає доступною в мережі. {0}

# gettingStarted.findLanguageExts.description.interpolated
source: Code smarter with syntax highlighting, code completion, linting and debugging. While many languages are built-in, many more can be added as extensions. {0}
uk: Пишіть код розумніше з підсвічуванням синтаксису, автозавершенням коду, перевіркою якості коду та налагодженням. Хоча багато мов вбудовані, ще більше можна додати як розширення. {0}

# gettingStarted.findLanguageExts.title
source: Rich support for all your languages
uk: Багатий супровід для всіх ваших мов
