Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_notebook.xlf
Languages: uk

# notebookActions.changeCellToCode
source: Change Cell to Code
uk: Змінити клітинку на код

# notebookActions.changeCellToMarkdown
source: Change Cell to Markdown
uk: Змінити комірку на Markdown

# notebookActions.collapseAllCellInput
source: Collapse All Cell Inputs
uk: Згорнути всі вхідні дані комірок

# notebookActions.collapseAllCellOutput
source: Collapse All Cell Outputs
uk: Згорнути всі виходи комірок

# notebookActions.collapseCellInput
source: Collapse Cell Input
uk: Згорнути введення клітинки

# notebookActions.collapseCellOutput
source: Collapse Cell Output
uk: Сховати вихід клітини

# notebookActions.copyCellDown
source: Copy Cell Down
uk: Копіювати клітинку вниз

# notebookActions.copyCellUp
source: Copy Cell Up
uk: Копіювати клітинку вгору

# notebookActions.expandAllCellInput
source: Expand All Cell Inputs
uk: Розгорнути всі вхідні дані клітинок

# notebookActions.expandAllCellOutput
source: Expand All Cell Outputs
uk: Розгорнути всі виходи клітинок

# notebookActions.expandCellInput
source: Expand Cell Input
uk: Розширити введення в клітинку

# notebookActions.expandCellOutput
source: Expand Cell Output
uk: Розгорнути вихід клітинки

# notebookActions.joinCellAbove
source: Join With Previous Cell
uk: Об'єднати з попередньою коміркою

# notebookActions.joinCellBelow
source: Join With Next Cell
uk: Приєднати з наступною коміркою

# notebookActions.joinSelectedCells
source: Join Selected Cells
uk: Об'єднати вибрані клітини

# notebookActions.moveCellDown
source: Move Cell Down
uk: Перемістити клітинку вниз

# notebookActions.moveCellUp
source: Move Cell Up
uk: Перемістити клітину вгору

# notebookActions.splitCell
source: Split Cell
uk: Розділити клітинку

# notebookActions.toggleOutputs
source: Toggle Outputs
uk: Перемикання виходів

# notebookActions.toggleScrolling
source: Toggle Scroll Cell Output
uk: Перемикання виводу комірки прокрутки

# cellCommands.quickFix.noneMessage
source: No code actions available
uk: Доступних дій без коду немає

# notebookActions.cellFailureActions
source: Show Cell Failure Actions
uk: Показати дії при відмові осередку

# notebookActions.chatExplainCellError
source: Explain Cell Error
uk: Пояснити помилку клітини

# notebookActions.chatFixCellError
source: Fix Cell Error
uk: Виправити помилку клітини

# notebook.cell.status.diagnostic
source: Quick Actions {0}
uk: Швидкі дії {0}

# notebook.cell.status.executing
source: Executing
uk: Виконання

# notebook.cell.status.failed
source: Failed
uk: Не вдалося

# notebook.cell.status.pending
source: Pending
uk: Очікується

# notebook.cell.status.success
source: Success
uk: Успіх

# notebook.cell.statusBar.timerTooltip
source: **Last Execution** {0} **Execution Time** {1} **Overhead Time** {2} **Render Times** {3}
uk: **Останнє виконання** {0} **Час виконання** {1} **Час накладних витрат** {2} **Час рендерингу** {3}

# notebook.cell.statusBar.timerTooltip.reportIssueFootnote
source: Use the links above to file an issue using the issue reporter.
uk: Використовуйте посилання вище, щоб подати запит за допомогою репортера проблем.

# notebook.cell.statusBar.timerVerbose
source: Last Execution: {0}, Duration: {1}
uk: Останнє виконання: {0}, Тривалість: {1}

# notebook.cell.status.autoDetectLanguage
source: Accept Detected Language: {0}
uk: Прийняти виявлену мову: {0}

# notebook.cell.status.language
source: Select Cell Language Mode
uk: Вибрати режим мови клітинки

# notebook.cell.status.searchLanguageExtensions
source: Unknown cell language. Click to search for '{0}' extensions
uk: Невідомий мовний код клітинки. Натисніть, щоб знайти розширення '{0}'

# notebookOutputCellLabel
source: {0} • Cell {1} • Output {2}
uk: {0} • Ячейка {1} • Вихід {2}

# notebook.cell.output.selectAll
source: Select All
uk: Вибрати все

# notebookActions.copy
source: Copy Cell
uk: Копіювати комірку

# notebookActions.cut
source: Cut Cell
uk: Вирізати клітинку

# notebookActions.paste
source: Paste Cell
uk: Вставити клітинку

# notebookActions.pasteAbove
source: Paste Cell Above
uk: Вставити клітинку вище

# toggleNotebookClipboardLog
source: Toggle Notebook Clipboard Troubleshooting
uk: Перемикання усунення неполадок буфера обміну блокнота

# kernel.select.label
source: Select Kernel
uk: Вибрати ядро

# notebook.activeCellStatusName
source: Notebook Editor Selections
uk: Вибір редактора нотаток

source: Notebook Indentation
uk: Відступ нотатника

# notebook.info
source: Notebook Kernel Info
uk: Інформація про ядро нотатника

# notebook.multiActiveCellIndicator
source: Cell {0} ({1} selected)
uk: Клітинка {0} ({1} вибрано)

# notebook.select
source: Notebook Kernel Selection
uk: Вибір ядра блокнота

# notebook.singleActiveCellIndicator
source: Cell {0} of {1}
uk: Ячейка {0} з {1}

# selectNotebookIndentation
source: Select Indentation
uk: Виберіть відступ

# tooltop
source: {0} (suggestion)
uk: {0} (пропозиція)

# notebook.findNext.enter
source: Find Next
uk: Знайти далі

# notebook.findNext.fromWidget
source: Find Next
uk: Знайти наступний

# notebook.findPrevious.fromWidget
source: Find Previous
uk: Знайти попереднє

# notebookActions.findInNotebook
source: Find in Notebook
uk: Знайти в Блокноті

# notebookActions.hideFind
source: Hide Find in Notebook
uk: Сховати Пошук у Блокноті

# findFilterIcon
source: Icon for Find Filter in find widget.
uk: Іконка для фільтра пошуку у віджеті пошуку.

# label.closeButton
source: Close
uk: Закрити

# label.find
source: Find
uk: Знайти

# label.nextMatchButton
source: Next Match
uk: Наступний матч

# label.previousMatchButton
source: Previous Match
uk: Попередній матч

# label.replace
source: Replace
uk: Замінити

# label.replaceAllButton
source: Replace All
uk: Замінити все

# label.replaceButton
source: Replace
uk: Замінити

# label.toggleReplaceButton
source: Toggle Replace
uk: Переключити заміну

# label.toggleSelectionFind
source: Find in Selection
uk: Знайти в виборі

# notebook.find.filter.filterAction
source: Find Filters
uk: Знайти фільтри

# notebook.find.filter.findInCodeInput
source: Code Cell Source
uk: Джерело комірки коду

# notebook.find.filter.findInCodeOutput
source: Code Cell Output
uk: Вихід комірки коду

# notebook.find.filter.findInMarkupInput
source: Markdown Source
uk: Джерело Markdown

# notebook.find.filter.findInMarkupPreview
source: Rendered Markdown
uk: Відрендерений Markdown

# placeholder.find
source: Find
uk: Знайти

# placeholder.replace
source: Replace
uk: Замінити

# ariaSearchNoResult
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# ariaSearchNoResultEmpty
source: {0} found
uk: {0} знайдено

# ariaSearchNoResultWithLineNumNoCurrentMatch
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# format.title
source: Format Notebook
uk: Форматувати блокнот

# formatCell.label
source: Format Cell
uk: Форматувати клітинку

# formatCells.label
source: Format Cells
uk: Форматувати клітини

# label
source: Format Notebook
uk: Форматувати блокнот

# workbench.notebook.layout.gettingStarted.label
source: Reset notebook getting started
uk: Скинути ноутбук, почати

# notebook.toggleCellToolbarPosition
source: Toggle Cell Toolbar Position
uk: Перемикання положення панелі інструментів комірки

# addFindMatchToSelection
source: Add Selection to Next Find Match
uk: Додати вибір до наступного збігу

# deleteLeftMultiSelection
source: Delete Left
uk: Видалити ліворуч

# deleteRightMultiSelection
source: Delete Right
uk: Видалити праворуч

# exitMultiSelection
source: Exit Multi Cursor Mode
uk: Вийти з режиму багатокурсора

# selectAllFindMatches
source: Select All Occurrences of Find Match
uk: Вибрати всі збіги знайденого

# cursorMoveDown
source: Focus Next Cell Editor
uk: Фокус на наступному редакторі клітинки

# cursorMoveUp
source: Focus Previous Cell Editor
uk: Фокус на редакторі попередньої клітинки

# cursorPageDown
source: Cell Cursor Page Down
uk: Сторінка вниз курсора клітинки

# cursorPageDownSelect
source: Cell Cursor Page Down Select
uk: Селектор комірки Сторінка вниз Вибрати

# cursorPageUp
source: Cell Cursor Page Up
uk: Сторінка вгору курсора комірки

# cursorPageUpSelect
source: Cell Cursor Page Up Select
uk: Селектор комірки Сторінка вгору Вибрати

source: Focus First Cell
uk: Сфокусувати першу клітинку

source: Focus Last Cell
uk: Зосередити останню клітинку

# focusOutput
source: Focus In Active Cell Output
uk: Фокус на активній клітині виходу

# focusOutputOut
source: Focus Out Active Cell Output
uk: Вивід активної клітини при зосередженні поза

# notebook.cell.webviewHandledEvents
source: Keypresses that should be handled by the focused element in the cell output.
uk: Натискання клавіш, які повинні оброблятися фокусованим елементом у виході клітинки.

# notebook.navigation.allowNavigateToSurroundingCells
source: When enabled cursor can navigate to the next/previous cell when the current cursor in the cell editor is at the first/last line.
uk: Коли увімкнено, курсор може переходити до наступної/попередньої комірки, коли поточний курсор у редакторі комірки знаходиться на першому/останньому рядку.

# notebookActions.centerActiveCell
source: Center Active Cell
uk: Центрувати активну клітинку

source: Clear All Inline Values
uk: Очистити всі вбудовані значення

# copyWorkspaceVariableValue
source: Copy Value
uk: Скопіювати значення

source: Execute Notebook Variable Provider
uk: Виконати постачальника змінних блокнота

source: Notebook Variables
uk: Змінні нотатника

# notebook.indexedChildrenLimitReached
source: Display limit reached
uk: Досягнуто межі відображення

# notebook.ReplVariables
source: REPL Variables
uk: Змінні REPL

# notebook.notebookVariables
source: Notebook Variables
uk: Змінні блокнота

# notebookVariableAriaLabel
source: Variable {0}, value {1}
uk: Змінна {0}, значення {1}

# breadcrumbs.showCodeCells
source: When enabled, notebook breadcrumbs contain code cells.
uk: Коли увімкнено, навігаційні елементи блокнота містять кодові клітини.

# filter
source: Filter Entries
uk: Фільтрувати записи

# notebook.gotoSymbols.showAllSymbols
source: When enabled, the Go to Symbol Quick Pick will display full code symbols from the notebook, as well as Markdown headers.
uk: Коли увімкнено, швидкий вибір Перейти до символу відобразить повні кодові символи з блокнота, а також заголовки Markdown.

# outline.showCodeCellSymbols
source: When enabled, notebook outline shows code cell symbols. Relies on `#notebook.outline.showCodeCells#` being enabled.
uk: Коли увімкнено, контур блокнота показує символи кодових клітин. Потребує, щоб `#notebook.outline.showCodeCells#` було увімкнено.

# outline.showCodeCells
source: When enabled, notebook outline shows code cells.
uk: Коли увімкнено, контур нотатника показує кодові клітини.

# outline.showMarkdownHeadersOnly
source: When enabled, notebook outline will show only markdown cells containing a header.
uk: Коли увімкнено, контур блокнота показуватиме лише markdown-осередки, які містять заголовок.

# toggleCodeCellSymbols
source: Code Cell Symbols
uk: Символи осередків коду

# toggleCodeCells
source: Code Cells
uk: Кодові клітини

# toggleShowMarkdownHeadersOnly
source: Markdown Headers Only
uk: Тільки заголовки Markdown

# setProfileTitle
source: Set Profile
uk: Налаштувати профіль

# codeAction.apply
source: Applying code action '{0}'.
uk: Застосування дії коду '{0}'.

# codeaction.get2
source: Getting code actions from '{0}' ([configure]({1})).
uk: Отримання дій коду з '{0}' ([налаштувати]({1})).

source: Format Notebook
uk: Форматувати блокнот

source: Insert Final New Line
uk: Вставити фінальний новий рядок

# notebookFormatSave.formatting
source: Formatting
uk: Форматування

# notebookSaveParticipants.cellCodeActions
source: Running 'Cell' code actions
uk: Виконання дій коду 'Cell'

# notebookSaveParticipants.formatCodeActions
source: Running 'Format' code actions
uk: Виконання дій коду 'Формат'

# notebookSaveParticipants.notebookCodeActions
source: Running 'Notebook' code actions
uk: Виконання дій коду 'Notebook'

# trimNotebookNewlines
source: Trim Final New Lines
uk: Обрізати фінальні нові рядки

# trimNotebookWhitespace
source: Notebook Trim Trailing Whitespace
uk: Обрізати пробіли в кінці нотатки

# workbench.notebook.clearNotebookEdtitorTypeCache
source: Clear Notebook Editor Type Cache
uk: Очистити кеш типу редактора нотаток

# workbench.notebook.inspectLayout
source: Inspect Notebook Layout
uk: Перевірити макет нотатки

# workbench.notebook.toggleLayoutTroubleshoot
source: Toggle Notebook Layout Troubleshoot
uk: Перемикання макета блокнота Усунення неполадок

# notebookActions.joinSelectedCells
source: Cannot join cells of different kinds
uk: Об'єднати вибрані клітини

# notebookActions.joinSelectedCells.label
source: Join Notebook Cells
uk: Об'єднати осередки блокнота

# notebookActions.copyOutput
source: Copy Cell Output
uk: Копіювати вихід клітинки

# notebookActions.openOutputInEditor
source: Open Cell Output in Text Editor
uk: Відкрити вихід клітини в текстовому редакторі

# notebookActions.openOutputInNotebookOutputEditor
source: Open in Output Preview
uk: Відкрити в попередньому перегляді виходу

# notebookActions.showAllOutput
source: Show Empty Outputs
uk: Показати порожні виходи

# notebook.apply1
source: Accept and Run
uk: Прийняти та запустити

# notebook.apply2
source: Accept & Run
uk: Прийняти та запустити

# notebook.apply3
source: Accept the changes and run the cell
uk: Прийміть зміни та запустіть клітинку

# notebookActions.menu.insertCode.ontoolbar
source: Generate
uk: Генерувати

# notebookActions.menu.insertCode.tooltip
source: Start Chat to Generate Code
uk: Почати чат для генерації коду

# notebookActions.menu.insertCodeCellWithChat
source: Generate
uk: Генерувати

# notebookActions.menu.insertCodeCellWithChat.tooltip
source: Start Chat to Generate Code
uk: Почати чат для генерації коду

# chatContext.notebook.kernelVariable
source: Kernel Variable...
uk: Змінна ядра...

# chatContext.notebook.kernelVariable.placeholder
source: Select a kernel variable
uk: Виберіть змінну ядра

# noKernelVariables
source: No kernel variables found
uk: Не знайдено змінних ядра

# notebookActions.addOutputToChat
source: Add Cell Output to Chat
uk: Додати вихідні дані осередку до чату

# pickKernelVariableLabel
source: Pick a variable from the kernel
uk: Виберіть змінну з ядра

# selectKernelVariablePlaceholder
source: Select a kernel variable
uk: Виберіть змінну ядра

# notebookChatAgentRegistered
source: Whether a chat agent for notebook is registered
uk: Чи зареєстрований агент чату для ноутбука

# miShare
source: Share
uk: Поділитися

# notebookActions.category
source: Notebook
uk: Блокнот

# notebookMenu.cellTitle
source: Notebook Cell
uk: Ноутбук Комірка

# notebookMenu.insertCell
source: Insert Cell
uk: Вставити комірку

source: Auto Detect
uk: Авто виявлення

# changeLanguage
source: Change Cell Language
uk: Змінити мову комірки

# clearAllCellsOutputs
source: Clear All Outputs
uk: Очистити всі виходи

source: Clear Cell Outputs
uk: Очистити виходи комірок

source: Comment Selected Cells
uk: Коментувати вибрані клітини

# confirmDeleteButton
source: Delete
uk: Видалити

# confirmDeleteButtonMessage
source: This cell is running, are you sure you want to delete it?
uk: Ця клітинка працює, ви впевнені, що хочете її видалити?

# detectLanguage
source: Accept Detected Language for Cell
uk: Прийняти виявлену мову для осередку

# doNotAskAgain
source: Do not ask me again
uk: Не питай мене знову.

# indentConvert
source: convert file
uk: конвертувати файл

# indentView
source: change view
uk: змінити вигляд

# languageDescription
source: ({0}) - Current Language
uk: ({0}) - Поточна мова

# languagesPicks
source: languages (identifier)
uk: мови (ідентифікатор)

# noDetection
source: Unable to detect cell language
uk: Не вдалося визначити мову клітинки

# noNotebookEditor
source: No notebook editor active at this time
uk: На даний момент немає активного редактора нотаток.

# noWritableCodeEditor
source: The active notebook editor is read-only.
uk: Активний редактор нотаток доступний лише для читання.

# notebookActions.deleteCell
source: Delete Cell
uk: Видалити комірку

# notebookActions.editCell
source: Edit Cell
uk: Редагувати комірку

# notebookActions.quitEdit
source: Stop Editing Cell
uk: Припинити редагування клітинки

# notebookActions.quitEditAllCells
source: Stop Editing All Cells
uk: Припинити редагування всіх клітинок

# pickAction
source: Select Action
uk: Вибрати дію

# pickLanguageToConfigure
source: Select Language Mode
uk: Виберіть режим мови

# notebookActions.cancel
source: Stop Cell Execution
uk: Зупинити виконання клітинки

# notebookActions.cancelNotebook
source: Stop Execution
uk: Зупинити виконання

# notebookActions.execute
source: Execute Cell
uk: Виконати осередок

# notebookActions.executeAbove
source: Execute Above Cells
uk: Виконати вище наведені клітини

# notebookActions.executeAndFocusContainer
source: Execute Cell and Focus Container
uk: Виконати комірку та зосередити контейнер

# notebookActions.executeAndInsertBelow
source: Execute Notebook Cell and Insert Below
uk: Виконати клітинку блокнота та вставити нижче

# notebookActions.executeAndSelectBelow
source: Execute Notebook Cell and Select Below
uk: Виконати клітинку блокнота та вибрати нижче

# notebookActions.executeBelow
source: Execute Cell and Below
uk: Виконати комірку та нижче

# notebookActions.executeNotebook
source: Run All
uk: Запустити все

# notebookActions.interruptNotebook
source: Interrupt
uk: Перервати

# notebookActions.renderMarkdown
source: Render All Markdown Cells
uk: Відобразити всі Markdown-осередки

# revealLastFailedCell
source: Go to Most Recently Failed Cell
uk: Перейти до останньої невдалої комірки

# revealLastFailedCellShort
source: Go to Most Recently Failed Cell
uk: Перейти до останньої неуспішної комірки

# revealRunningCell
source: Go to Running Cell
uk: Перейти до виконання клітини

# revealRunningCellShort
source: Go To
uk: Перейти до

source: Fold Cell
uk: Складена клітина

source: Unfold Cell
uk: Розгорнути комірку

# notebookActions.insertCodeCellAbove
source: Insert Code Cell Above
uk: Вставити кодову клітинку вище

# notebookActions.insertCodeCellAboveAndFocusContainer
source: Insert Code Cell Above and Focus Container
uk: Вставити комірку коду вище та зосередити контейнер

# notebookActions.insertCodeCellAtTop
source: Add Code Cell At Top
uk: Додати кодову клітинку вгорі

# notebookActions.insertCodeCellBelow
source: Insert Code Cell Below
uk: Вставте кодову клітинку нижче

# notebookActions.insertCodeCellBelowAndFocusContainer
source: Insert Code Cell Below and Focus Container
uk: Вставте кодову клітинку нижче та зосередьте контейнер

# notebookActions.insertMarkdownCellAbove
source: Insert Markdown Cell Above
uk: Вставити Markdown клітинку вище

# notebookActions.insertMarkdownCellAtTop
source: Add Markdown Cell At Top
uk: Додати Markdown клітинку вгорі

# notebookActions.insertMarkdownCellBelow
source: Insert Markdown Cell Below
uk: Вставте Markdown-осередок нижче

# notebookActions.menu.insertCode
source: Code
uk: Код

# notebookActions.menu.insertCode.minimalToolbar
source: Add Code
uk: Додати код

# notebookActions.menu.insertCode.minimaltoolbar
source: Add Code
uk: Додати код

# notebookActions.menu.insertCode.ontoolbar
source: Code
uk: Генерувати

# notebookActions.menu.insertCode.tooltip
source: Add Code Cell
uk: Почати чат для генерації коду

# notebookActions.menu.insertMarkdown.tooltip
source: Add Markdown Cell
uk: Додати Markdown комірку

source: Customize Notebook...
uk: Налаштувати блокнот...

# mitoggleNotebookStickyScroll
source: &&Toggle Notebook Sticky Scroll
uk: &&Перемкнути закріплене прокручування нотатника

# notebook.placeholder
source: Settings file to save in
uk: Файл налаштувань для збереження в

# notebook.saveMimeTypeOrder
source: Save Mimetype Display Order
uk: Зберегти порядок відображення типу MIME

# notebook.showLineNumbers
source: Notebook Line Numbers
uk: Номери рядків блокнота

# notebook.toggleBreadcrumb
source: Toggle Breadcrumbs
uk: Переключити хлібні крихти

# notebook.toggleLineNumbers
source: Toggle Notebook Line Numbers
uk: Перемкнути номери рядків блокнота

# notebookStickyScroll
source: Toggle Notebook Sticky Scroll
uk: Перемкнути закріплену прокрутку нотатника

# saveTarget.machine
source: User Settings
uk: Налаштування користувача

# saveTarget.workspace
source: Workspace Settings
uk: Налаштування робочого простору

# toggleStickyScroll
source: Toggle Notebook Sticky Scroll
uk: Перемикання фіксованого прокручування нотатника

# workbench.notebook.layout.configure.label
source: Customize Notebook Layout
uk: Налаштувати макет блокнота

# workbench.notebook.layout.select.label
source: Select between Notebook Layouts
uk: Виберіть між макетами ноутбука

# workbench.notebook.layout.webview.reset.label
source: Reset Notebook Webview
uk: Скинути веб-перегляд блокнота

source: Change Tab Display Size
uk: Змінити розмір відображення вкладки

source: Convert Indentation
uk: Перетворити відступи

source: Convert Indentation to Spaces
uk: Перетворити відступи на пробіли

source: Convert Indentation to Tabs
uk: Перетворити відступи на табуляцію

source: Indent Using Spaces
uk: Відступ за допомогою пробілів

source: Indent Using Tabs
uk: Відступ за допомогою табуляції

# selectTabWidth
source: Select Tab Size for Current File
uk: Виберіть розмір табуляції для поточного файлу

source: Expand Section
uk: Розгорнути секцію

source: Fold Section
uk: Сховати секцію

# miexpandSection
source: &&Expand Section
uk: &&Розгорнути розділ

# mifoldSection
source: &&Fold Section
uk: &&Скласти секцію

# mirunCell
source: &&Run Cell
uk: &&Запустити комірку

# mirunCellsInSection
source: &&Run Cells In Section
uk: &&Запустити комірки в секції

source: Run Cell
uk: Запустити комірку

source: Run Cells In Section
uk: Запустити клітини в секції

# notebookActions.openVariablesView
source: Variables
uk: Змінні

# hiddenCell
source: {0} hidden cell
uk: {0} прихована клітинка

# hiddenCells
source: {0} hidden cells
uk: {0} прихованих клітинок

source: Hide Unchanged Cells
uk: Сховати незмінені клітини

source: Show Unchanged Cells
uk: Показати незмінені клітини

# builtinRenderInfo
source: built-in
uk: вбудований

# curruentActiveMimeType
source: Currently Active
uk: Наразі активний

# empty
source: Cell has no output
uk: Клітинка не має виходу

# mimeTypePicker
source: Choose a different output mimetype, available mimetypes: {0}
uk: Виберіть інший тип виходу, доступні типи: {0}

# noRenderer.2
source: No renderer could be found for output. It has the following mimetypes: {0}
uk: Не вдалося знайти рендерер для виходу. Він має такі типи MIME: {0}

# promptChooseMimeType.placeHolder
source: Select mimetype to render for current output
uk: Виберіть тип MIME для відображення для поточного виходу

# promptChooseMimeTypeInSecure.placeHolder
source: Select mimetype to render for current output. Rich mimetypes are available only when the notebook is trusted
uk: Виберіть тип MIME для відображення для поточного виходу. Багаті типи MIME доступні лише тоді, коли блокнот довірений.

source: Go To Cell
uk: Перейти до осередку

# ignoreTrimWhitespace.label
source: Show Leading/Trailing Whitespace Differences
uk: Показати різницю в провідному/завершальному пробілі

# notebook.diff.action.next.title
source: Show Next Change
uk: Показати наступну зміну

# notebook.diff.action.previous.title
source: Show Previous Change
uk: Показати попередню зміну

# notebook.diff.cell.revertInput
source: Revert Input
uk: Повернути введення

# notebook.diff.cell.revertMetadata
source: Revert Metadata
uk: Відновити метадані

# notebook.diff.cell.revertOutputs
source: Revert Outputs
uk: Повернути виходи

# notebook.diff.cell.switchOutputRenderingStyleToText
source: Switch Output Rendering
uk: Перемкнути рендеринг виходу
