Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_preferences.xlf
Languages: uk

# defineKeybinding.chordsTo
source: chord to
uk: акорд до

# defineKeybinding.existing
source: {0} existing commands have this keybinding
uk: {0} існуючих команд мають це прив'язування клавіш

# defineKeybinding.initial
source: Press desired key combination and then press ENTER.
uk: Натисніть бажану комбінацію клавіш, а потім натисніть ENTER.

# defineKeybinding.oneExists
source: 1 existing command has this keybinding
uk: 1 існуюча команда має це призначення клавіші

# SearchKeybindings.FullTextSearchPlaceholder
source: Type to search in keybindings
uk: Введіть для пошуку в прив'язках клавіш

# SearchKeybindings.KeybindingsSearchPlaceholder
source: Recording Keys. Press Escape to exit
uk: Записування клавіш. Натисніть Escape, щоб вийти

# addKeybindingLabel
source: Add Keybinding
uk: Додати прив'язку клавіші

# addKeybindingLabelWithKey
source: Add Keybinding {0}
uk: Додати клавішне поєднання {0}

# addLabel
source: Add Keybinding...
uk: Додати комбінацію клавіш...

# changeLabel
source: Change Keybinding...
uk: Змінити прив'язку клавіші...

# clearInput
source: Clear Keybindings Search Input
uk: Очистити поле пошуку прив'язок клавіш

source: Command
uk: Команда

# copyCommandLabel
source: Copy Command ID
uk: Скопіювати ID команди

# copyCommandTitleLabel
source: Copy Command Title
uk: Копіювати заголовок команди

# copyLabel
source: Copy
uk: Копіювати

# editKeybindingLabel
source: Change Keybinding
uk: Змінити прив'язку клавіші

# editKeybindingLabelWithKey
source: Change Keybinding {0}
uk: Змінити прив'язку клавіші {0}

# editWhen
source: Change When Expression
uk: Змінити, коли вираз

# error
source: Error '{0}' while editing the keybinding. Please open 'keybindings.json' file and check for errors.
uk: Помилка '{0}' під час редагування прив'язки клавіш. Будь ласка, відкрийте файл 'keybindings.json' і перевірте на наявність помилок.

# extension label
source: Extension ({0})
uk: Розширення ({0})

# foundResults
source: {0} results
uk: {0} результати

source: Keybinding
uk: Призначення клавіш

# keybindingsLabel
source: Keybindings
uk: Призначення клавіш

# keyboard shortcuts aria label
source: use space or enter to change the keybinding.
uk: використовуйте пробіл або клавішу enter, щоб змінити прив'язку клавіші.

# noKeybinding
source: No keybinding assigned
uk: Не призначено жодного ключового зв'язку

# noWhen
source: No when context
uk: Ні, коли контекст

# recordKeysLabel
source: Record Keys
uk: Записати ключі

# recording
source: Recording Keys
uk: Запис ключів

# removeLabel
source: Remove Keybinding
uk: Видалити прив'язку клавіші

# resetLabel
source: Reset Keybinding
uk: Скинути прив'язку клавіш

# show keybindings
source: Showing {0} Keybindings in alphabetical order
uk: Показано {0} клавішних комбінацій в алфавітному порядку

# show sorted keybindings
source: Showing {0} Keybindings in precedence order
uk: Показано {0} клавішних комбінацій у порядку пріоритету

source: Show Same Keybindings
uk: Показати ті ж комбінації клавіш

# sortByPrecedeneLabel
source: Sort by Precedence (Highest first)
uk: Сортувати за пріоритетом (найвищий спочатку)

source: Source
uk: Джерело

source: When
uk: Коли

# defineKeybinding.kbLayoutErrorMessage
source: You won't be able to produce this key combination under your current keyboard layout.
uk: Ви не зможете ввести цю комбінацію клавіш з вашою поточною розкладкою клавіатури.

# defineKeybinding.kbLayoutLocalAndUSMessage
source: **{0}** for your current keyboard layout (**{1}** for US standard).
uk: **{0}** для вашої поточної розкладки клавіатури (**{1}** для стандарту США).

# defineKeybinding.kbLayoutLocalMessage
source: **{0}** for your current keyboard layout.
uk: **{0}** для вашої поточної розкладки клавіатури.

source: Auto Detect
uk: Авто виявлення

source: Configure Keyboard Layout
uk: Налаштувати розкладку клавіатури

# displayLanguage
source: Defines the keyboard layout used in VS Code in the browser environment.
uk: Визначає розкладку клавіатури, що використовується у VS Code в браузерному середовищі.

# doc
source: Open VS Code and run "Developer: Inspect Key Mappings (JSON)" from Command Palette.
uk: Відкрийте VS Code і запустіть "Розробник: Перевірити ключові відображення (JSON)" з палітри команд.

# fail.createSettings
source: Unable to create '{0}' ({1}).
uk: Не вдалося створити '{0}' ({1}).

# keyboard.chooseLayout
source: Change Keyboard Layout
uk: Змінити розкладку клавіатури

# keyboardLayout
source: Layout: {0}
uk: Макет: {0}

# layoutPicks
source: Keyboard Layouts ({0})
uk: Розкладки клавіатури ({0})

# pickKeyboardLayout
source: Select Keyboard Layout
uk: Виберіть розкладку клавіатури

# status.workbench.keyboardLayout
source: Keyboard Layout
uk: Розкладка клавіатури

# clear
source: Clear Search Results
uk: Очистити результати пошуку

# clearHistory
source: Clear Keyboard Shortcuts Search History
uk: Очистити історію пошуку комбінацій клавіш

# defineKeybinding.start
source: Define Keybinding
uk: Визначити клавішне сполучення

# filterUntrusted
source: Show untrusted workspace settings
uk: Показати налаштування ненадійного робочого простору

source: Keybindings Editor
uk: Редактор прив'язок клавіш

source: Keyboard Shortcuts
uk: Комбінації клавіш

# miOpenOnlineSettings
source: &&Online Services Settings
uk: &&Налаштування онлайн-сервісів

# miOpenSettings
source: &&Settings
uk: &&Налаштування

# miOpenTelemetrySettings
source: &&Telemetry Settings
uk: &&Налаштування телеметрії

# miPreferences
source: &&Preferences
uk: &&Налаштування

source: Open Accessibility Settings
uk: Відкрити налаштування доступності

source: Open Application Settings (JSON)
uk: Відкрити налаштування програми (JSON)

# openDefaultKeybindingsFile
source: Open Default Keyboard Shortcuts (JSON)
uk: Відкрити стандартні клавіатурні скорочення (JSON)

source: Open Folder Settings
uk: Відкрити налаштування папки

# openFolderSettingsFile
source: Open Folder Settings (JSON)
uk: Відкрити налаштування папки (JSON)

# openGlobalKeybindings
source: Open Keyboard Shortcuts
uk: Відкрити клавіші швидкого доступу

# openGlobalKeybindingsFile
source: Open Keyboard Shortcuts (JSON)
uk: Відкрити клавіатурні скорочення (JSON)

# openGlobalSettings
source: Open User Settings
uk: Відкрити налаштування користувача

# openRawDefaultSettings
source: Open Default Settings (JSON)
uk: Відкрити стандартні налаштування (JSON)

# openRemoteSettings
source: Open Remote Settings ({0})
uk: Відкрити віддалені налаштування ({0})

# openRemoteSettingsJSON
source: Open Remote Settings (JSON) ({0})
uk: Відкрити віддалені налаштування (JSON) ({0})

# openSettings2
source: Open Settings (UI)
uk: Відкрити Налаштування (UI)

source: Open Settings (JSON)
uk: Відкрити Налаштування (JSON)

source: Open User Settings (JSON)
uk: Відкрити налаштування користувача (JSON)

source: Open Workspace Settings
uk: Відкрити налаштування робочого простору

# openWorkspaceSettingsFile
source: Open Workspace Settings (JSON)
uk: Відкрити налаштування робочого простору (JSON)

source: Preferences
uk: Налаштування

source: Settings
uk: Налаштування

# settings.clearResults
source: Clear Settings Search Results
uk: Очистити результати пошуку налаштувань

# settings.focusFile
source: Focus settings file
uk: Файл налаштувань фокусу

# settings.focusLevelUp
source: Move Focus Up One Level
uk: Перемістити фокус на один рівень вгору

# settings.focusSearch
source: Focus Settings Search
uk: Налаштування фокусу Пошук

# settings.focusSettingControl
source: Focus Setting Control
uk: Контроль налаштування фокусу

# settings.focusSettingsList
source: Focus settings list
uk: Список налаштувань фокусу

# settings.focusSettingsTOC
source: Focus Settings Table of Contents
uk: Налаштування фокусу Зміст

# settings.showContextMenu
source: Show Setting Context Menu
uk: Показати контекстне меню налаштувань

source: Settings Editor 2
uk: Редактор налаштувань 2

# showDefaultKeybindings
source: Show System Keybindings
uk: Показати системні комбінації клавіш

source: Show Extension Keybindings
uk: Показати ключові комбінації розширення

source: Show User Keybindings
uk: Показати ключові прив'язки користувача

# workbench.action.openSettingsJson.description
source: Opens the JSON file containing the current user profile settings
uk: Відкриває файл JSON, що містить налаштування профілю поточного користувача

# configureLanguageBasedSettings
source: Configure Language Specific Settings...
uk: Налаштувати специфічні для мови налаштування...

# pickLanguage
source: Select Language
uk: Вибрати мову

# keybindingsAddIcon
source: Icon for the add action in the keybinding UI.
uk: Іконка для дії додавання в інтерфейсі прив'язки клавіш.

# keybindingsEditIcon
source: Icon for the edit action in the keybinding UI.
uk: Іконка для дії редагування в інтерфейсі прив'язки клавіш.

# keybindingsRecordKeysIcon
source: Icon for the 'record keys' action in the keybinding UI.
uk: Іконка для дії 'записати клавіші' в інтерфейсі налаштування клавіш.

# keybindingsSortIcon
source: Icon for the 'sort by precedence' toggle in the keybinding UI.
uk: Іконка для перемикача 'сортувати за пріоритетом' у інтерфейсі налаштування клавіш.

# preferencesClearInput
source: Icon for clear input in the Settings and keybinding UI.
uk: Іконка для очищення введення в налаштуваннях та інтерфейсі прив'язки клавіш.

# preferencesDiscardIcon
source: Icon for the discard action in the Settings UI.
uk: Іконка для дії скасування в інтерфейсі налаштувань.

# preferencesOpenSettings
source: Icon for open settings commands.
uk: Іконка для відкриття команд налаштувань.

# settingsEditIcon
source: Icon for the edit action in the Settings UI.
uk: Іконка для дії редагування в інтерфейсі налаштувань.

# settingsFilter
source: Icon for the button that suggests filters for the Settings UI.
uk: Іконка для кнопки, яка пропонує фільтри для інтерфейсу налаштувань.

# settingsMoreActionIcon
source: Icon for the 'more actions' action in the Settings UI.
uk: Іконка для дії 'більше дій' в інтерфейсі налаштувань.

# settingsRemoveIcon
source: Icon for the remove action in the Settings UI.
uk: Іконка для дії видалення в інтерфейсі налаштувань.

# settingsScopeDropDownIcon
source: Icon for the folder dropdown button in the split JSON Settings editor.
uk: Іконка для кнопки випадаючого меню папки в редакторі налаштувань JSON.

# allProfileSettingWhileInNonDefaultProfileSetting
source: This setting cannot be applied because it is configured to be applied in all profiles using setting {0}. Value from the default profile will be used instead.
uk: Цю настройку не можна застосувати, оскільки вона налаштована на застосування в усіх профілях, використовуючи налаштування {0}. Замість цього буде використано значення з профілю за замовчуванням.

# copyDefaultValue
source: Copy to Settings
uk: Копіювати в Налаштування

# defaultProfileSettingWhileNonDefaultActive
source: This setting cannot be applied while a non-default profile is active. It will be applied when the default profile is active.
uk: Цю настройку не можна застосувати, поки активний профіль, що не є профілем за замовчуванням. Вона буде застосована, коли активний профіль за замовчуванням.

# editTtile
source: Edit
uk: Редагувати

source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# replaceDefaultValue
source: Replace in Settings
uk: Замінити в Налаштуваннях

source: Unknown Configuration Setting
uk: Невідома конфігураційна настройка

# unsupportLanguageOverrideSetting
source: This setting cannot be applied because it is not registered as language override setting.
uk: Цю настройку не можна застосувати, оскільки вона не зареєстрована як настройка переваги мови.

# unsupportedApplicationSetting
source: This setting has an application scope and can be set only in the user settings file.
uk: Це налаштування має область застосування і може бути встановлено лише у файлі налаштувань користувача.

# unsupportedMachineSetting
source: This setting can only be applied in user settings in local window or in remote settings in remote window.
uk: Це налаштування можна застосувати лише в налаштуваннях користувача у локальному вікні або в віддалених налаштуваннях у віддаленому вікні.

# unsupportedPolicySetting
source: This setting cannot be applied because it is configured in the system policy.
uk: Цю настройку не можна застосувати, оскільки вона налаштована в системній політиці.

source: Unsupported Property
uk: Непідтримувана властивість

# unsupportedRemoteMachineSetting
source: This setting cannot be applied in this window. It will be applied when you open a local window.
uk: Це налаштування не може бути застосоване в цьому вікні. Воно буде застосоване, коли ви відкриєте локальне вікно.

# unsupportedWindowSetting
source: This setting cannot be applied in this workspace. It will be applied when you open the containing workspace folder directly.
uk: Цю настройку не можна застосувати в цьому робочому просторі. Вона буде застосована, коли ви відкриєте папку робочого простору безпосередньо.

# untrustedSetting
source: This setting can only be applied in a trusted workspace.
uk: Цю настройку можна застосувати лише в надійному робочому просторі.

# folderSettings
source: Folder
uk: Папка

# settingsSwitcherBarAriaLabel
source: Settings Switcher
uk: Перемикач налаштувань

# userSettings
source: User
uk: Користувач

# userSettingsRemote
source: Remote
uk: Віддалений

# workspaceSettings
source: Workspace
uk: Робоча область

# SearchSettings.AriaLabel
source: Search settings
uk: Налаштування пошуку

# clearInput
source: Clear Settings Search Input
uk: Очистити поле пошуку прив'язок клавіш

# clearSearchFilters
source: Clear Filters
uk: Очистити фільтри

# filterInput
source: Filter Settings
uk: Налаштування фільтра

# lastSyncedLabel
source: Last synced: {0}
uk: Остання синхронізація: {0}

# moreThanOneResult
source: {0} Settings Found
uk: {0} Налаштувань Знайдено

# noResults
source: No Settings Found
uk: Налаштувань не знайдено

# oneResult
source: 1 Setting Found
uk: 1 Налаштування знайдено

# settings require trust
source: Workspace Trust
uk: Довіра до робочого простору

# turnOnSyncButton
source: Backup and Sync Settings
uk: Налаштування резервного копіювання та синхронізації

# alsoConfiguredElsewhere
source: Also modified elsewhere
uk: Також змінено в іншому місці

# alsoConfiguredIn
source: Also modified in
uk: Також змінено в

# alsoModifiedInScopes
source: The setting has also been modified in the following scopes:
uk: Налаштування також було змінено в наступних областях:

# applicationSetting
source: Applies to all profiles
uk: Застосовується до всіх профілів

# applicationSettingDescription
source: The setting is not specific to the current profile, and will retain its value when switching profiles.
uk: Налаштування не є специфічним для поточного профілю і зберігатиме своє значення при переключенні профілів.

# applicationSettingDescriptionAccessible
source: Setting value retained when switching profiles
uk: Значення налаштування зберігається при перемиканні профілів

# configuredElsewhere
source: Modified elsewhere
uk: Змінено в іншому місці

# configuredIn
source: Modified in
uk: Змінено в

# defaultOverriddenDetails
source: Default setting value overridden by `{0}`
uk: Значення налаштування за замовчуванням перекрито `{0}`

# defaultOverriddenDetailsAriaLabel
source: {0} overrides the default value
uk: {0} перевизначає значення за замовчуванням

# defaultOverriddenLabel
source: Default value changed
uk: Значення за замовчуванням змінено

# defaultOverriddenLanguagesList
source: Language-specific default values exist for {0}
uk: Існують значення за замовчуванням, специфічні для мови, для {0}

# experimentalLabel
source: Experimental
uk: Експериментальний

# extensionSyncIgnoredLabel
source: Not synced
uk: Не синхронізовано

# hasDefaultOverridesForLanguages
source: The following languages have default overrides:
uk: Наступні мови мають значення за замовчуванням:

source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# modifiedInScopeForLanguage
source: The {0} scope for {1}
uk: Обсяг {0} для {1}

# modifiedInScopeForLanguageMidSentence
source: the {0} scope for {1}
uk: обсяг {0} для {1}

# modifiedInScopes
source: The setting has been modified in the following scopes:
uk: Налаштування було змінено в наступних сферах:

# multipleDefaultOverriddenDetailsAriaLabel
source: {0} override the default value
uk: {0} переозначити значення за замовчуванням

# multipledefaultOverriddenDetails
source: A default values has been set by {0}
uk: Значення за замовчуванням було встановлено {0}

# policyDescription
source: This setting is managed by your organization and its actual value cannot be changed.
uk: Це налаштування керується вашою організацією, і його фактичне значення не може бути змінене.

# policyDescriptionAccessible
source: Managed by organization policy; setting value not applied
uk: Керовано політикою організації; значення налаштування не застосовано

# policyFilterLink
source: View policy settings
uk: Переглянути налаштування політики

# policyLabelText
source: Managed by organization
uk: Керовано організацією

# previewLabel
source: Preview
uk: Попередній перегляд

source: Remote
uk: Віддалений

# syncIgnoredAriaLabel
source: Setting ignored during sync
uk: Налаштування ігноруються під час синхронізації

# syncIgnoredTitle
source: This setting is ignored during sync
uk: Це налаштування ігнорується під час синхронізації

# trustLabel
source: The setting value can only be applied in a trusted workspace.
uk: Значення налаштування може бути застосоване лише в надійному робочому просторі.

source: User
uk: Користувач

source: Workspace
uk: Робоча область

# workspaceUntrustedAriaLabel
source: Workspace untrusted; setting value not applied
uk: Ненадійний робочий простір; значення не застосовано

# workspaceUntrustedLabel
source: Requires workspace trust
uk: Вимагає довіри до робочого простору

source: Accessibility
uk: Доступність

source: Accessibility Signals
uk: Сигнали доступності

source: Appearance
uk: Зовнішній вигляд

source: Application
uk: Застосунок

source: Breadcrumbs
uk: Хлібні крихти

source: Chat
uk: Чат

source: Comments
uk: Коментарі

source: Commonly Used
uk: Зазвичай використовуваний

source: Cursor
uk: Курсор

source: Debug
uk: Виправлення помилок

source: Diff Editor
uk: Редактор відмінностей

source: Editor Management
uk: Управління редакторами

source: Experimental
uk: Експериментальний

source: Extensions
uk: Розширення

source: Features
uk: Особливості

# fileExplorer
source: Explorer
uk: Експлорер

source: Files
uk: Файли

source: Find
uk: Знайти

source: Font
uk: Шрифт

source: Formatting
uk: Форматування

source: Issue Reporter
uk: Звіт про проблему

source: Keyboard
uk: Клавіатура

source: Merge Editor
uk: Редактор злиття

source: Minimap
uk: Мінікарта

# multiDiffEditor
source: Multi-File Diff Editor
uk: Редактор різниць для кількох файлів

source: New Window
uk: Нове вікно

source: Notebook
uk: Блокнот

source: Other
uk: Інше

source: Output
uk: Вихід

source: Problems
uk: Проблеми

source: Proxy
uk: Проксі

# scm
source: Source Control
uk: Контроль версій

source: Screencast Mode
uk: Режим запису екрану

source: Search
uk: Пошук

source: Security
uk: Безпека

# settings
source: Settings Editor
uk: Налаштування

source: Settings Sync
uk: Синхронізація налаштувань

source: Suggestions
uk: Пропозиції

source: Task
uk: Завдання

source: Telemetry
uk: Телеметрія

source: Terminal
uk: Термінал

source: Testing
uk: Тестування

source: Text Editor
uk: Текстовий редактор

source: Timeline
uk: Хронологія

source: Update
uk: Оновити

source: Window
uk: Вікно

source: Workbench
uk: Робочий стіл

source: Zen Mode
uk: Режим Зен

# extSettingsSearch
source: Extension ID...
uk: Ідентифікатор розширення...

# extSettingsSearchTooltip
source: Add extension ID filter
uk: Додати фільтр за ідентифікатором розширення

# featureSettingsSearch
source: Feature...
uk: Функція...

# featureSettingsSearchTooltip
source: Add feature filter
uk: Додати фільтр функцій

# langSettingsSearch
source: Language...
uk: Мова...

# langSettingsSearchTooltip
source: Add language ID filter
uk: Додати фільтр за ідентифікатором мови

# modifiedSettingsSearch
source: Modified
uk: Модифіковано

# modifiedSettingsSearchTooltip
source: Add or remove modified settings filter
uk: Додати або видалити фільтр змінених налаштувань

# onlineSettingsSearch
source: Online services
uk: Онлайн послуги

# onlineSettingsSearchTooltip
source: Show settings for online services
uk: Показати налаштування для онлайн-сервісів

# policySettingsSearch
source: Policy services
uk: Послуги політики

# policySettingsSearchTooltip
source: Show settings for policy services
uk: Показати налаштування для служб політики

# tagSettingsSearch
source: Tag...
uk: Тег...

# tagSettingsSearchTooltip
source: Add tag filter
uk: Додати фільтр за тегом

# applyToAllProfiles
source: Apply Setting to all Profiles
uk: Застосувати налаштування до всіх профілів

# copySettingAsJSONLabel
source: Copy Setting as JSON
uk: Скопіювати налаштування як JSON

# copySettingAsURLLabel
source: Copy Setting as URL
uk: Скопіювати налаштування як URL

# copySettingIdLabel
source: Copy Setting ID
uk: Скопіювати ID налаштування

source: Dismiss
uk: Відхилити

source: Edit in settings.json
uk: Редагувати в settings.json

# editLanguageSettingLabel
source: Edit settings for {0}
uk: Редагувати налаштування для {0}

# modified
source: The setting has been configured in the current scope.
uk: Налаштування було сконфігуровано в поточному контексті.

# newExtensionsButtonLabel
source: Show matching extensions
uk: Показати відповідні розширення

# resetSettingLabel
source: Reset Setting
uk: Скинути налаштування

# settings.Default
source: default
uk: за замовчуванням

# settings.Modified
source: Modified.
uk: Змінено.

# settingsContextMenuTitle
source: More Actions...
uk: Більше дій...

source: Show Extension
uk: Показати розширення

# stopSyncingSetting
source: Sync This Setting
uk: Синхронізувати це налаштування

source: Validation Error.
uk: Помилка валідації.

source: Add Item
uk: Додати елемент

source: Add Pattern
uk: Додати шаблон

# cancelButton
source: Cancel
uk: Скасувати

source: Edit Exclude Item
uk: Редагувати виключений елемент

source: Edit Include Item
uk: Редагувати включений елемент

source: Edit Item
uk: Редагувати елемент

# excludeIncludeSource
source: . Default value provided by `{0}`
uk: . Значення за замовчуванням, надане `{0}`

# excludePatternHintLabel
source: Exclude files matching `{0}`
uk: Виключити файли, що відповідають `{0}`

# excludePatternInputPlaceholder
source: Exclude Pattern...
uk: Виключити шаблон...

# excludeSiblingHintLabel
source: Exclude files matching `{0}`, only when a file matching `{1}` is present
uk: Виключити файли, що відповідають `{0}`, лише коли присутній файл, що відповідає `{1}`

# excludeSiblingInputPlaceholder
source: When Pattern Is Present...
uk: Коли шаблон присутній...

# includePatternHintLabel
source: Include files matching `{0}`
uk: Включити файли, що відповідають `{0}`

# includePatternInputPlaceholder
source: Include Pattern...
uk: Включити шаблон...

# includeSiblingHintLabel
source: Include files matching `{0}`, only when a file matching `{1}` is present
uk: Включити файли, що відповідають `{0}`, тільки коли присутній файл, що відповідає `{1}`

# includeSiblingInputPlaceholder
source: When Pattern Is Present...
uk: Коли шаблон присутній...

# itemInputPlaceholder
source: Item...
uk: Елемент...

# listSiblingHintLabel
source: List item `{0}` with sibling `${1}`
uk: Елемент списку `{0}` з сусіднім `${1}`

# listSiblingInputPlaceholder
source: Sibling...
uk: Сиблінг...

# listValueHintLabel
source: List item `{0}`
uk: Елемент списку `{0}`

# objectKeyHeader
source: Item
uk: Елемент

# objectKeyInputPlaceholder
source: Key
uk: Ключ
