Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

source: Add Client Registration Details
uk: Додати деталі реєстрації клієнта

source: &&Allow
uk: &&Дозволити

source: Cancel
uk: Скасувати

# clientIdPlaceholder
source: OAuth client ID (azye39d...)
uk: OAuth клієнтський ID (azye39d...)

# clientIdPrompt
source: Enter an existing client ID that has been registered with the following redirect URIs: http://127.0.0.1:33418, https://vscode.dev/redirect
uk: Введіть існуючий ідентифікатор клієнта, який був зареєстрований з наступними URI перенаправлення: http://127.0.0.1:33418, https://vscode.dev/redirect

# clientIdRequired
source: Client ID is required
uk: Необхідний ідентифікатор клієнта.

# clientSecretPlaceholder
source: OAuth client secret (wer32o50f...) or leave it blank
uk: Секрет клієнта OAuth (wer32o50f...) або залиште його порожнім

# clientSecretPrompt
source: (optional) Enter an existing client secret associated with the client id '{0}' or leave this field blank
uk: (необов'язково) Введіть існуючий секрет клієнта, пов'язаний з ідентифікатором клієнта '{0}', або залиште це поле порожнім

# confirmLogin
source: The extension '{0}' wants to sign in using {1}.
uk: Розширення '{0}' хоче увійти, використовуючи {1}.

# confirmRelogin
source: The extension '{0}' wants you to sign in again using {1}.
uk: Розширення '{0}' хоче, щоб ви знову ввійшли, використовуючи {1}.

# copyAndContinue
source: Copy & Continue
uk: Копіювати та продовжити

# dcrNotSupported
source: Dynamic Client Registration not supported
uk: Динамічна реєстрація клієнта не підтримується

# dcrNotSupportedDetail
source: The authorization server '{0}' does not support automatic client registration. Do you want to proceed by manually providing a client registration (client ID)? Note: When registering your OAuth application, make sure to include these redirect URIs: http://127.0.0.1:33418 https://vscode.dev/redirect
uk: Сервер авторизації '{0}' не підтримує автоматичну реєстрацію клієнтів. Чи хочете ви продовжити, надавши реєстрацію клієнта вручну (ідентифікатор клієнта)? Примітка: При реєстрації вашого OAuth додатку, переконайтеся, що ви включили ці URI для перенаправлення: http://127.0.0.1:33418 https://vscode.dev/redirect

# deviceCodeDetail
source: Your code: {0} To complete authentication, navigate to {1} and enter the code above.
uk: Ваш код: {0} Щоб завершити аутентифікацію, перейдіть за посиланням {1} і введіть код вище.

# deviceCodeTitle
source: Device Code Authentication
uk: Аутентифікація за кодом пристрою

# failedToOpenUri
source: Failed to open {0}
uk: Не вдалося відкрити {0}

# incorrectAccount
source: Incorrect account detected
uk: Виявлено неправильний обліковий запис

# incorrectAccountDetail
source: The chosen account, {0}, does not match the requested account, {1}.
uk: Вибраний обліковий запис, {0}, не відповідає запитаному обліковому запису, {1}.

# keep
source: Keep {0}
uk: Зберегти {0}

source: Learn more
uk: Дізнатися більше

# loginWith
source: Login with {0}
uk: Увійти з {0}

source: No
uk: Ні

# provideClientDetails
source: Proceed
uk: Продовжити

source: Yes
uk: Так

# cannot be installed
source: Cannot install the '{0}' extension because it is declared to not run in this setup.
uk: Не вдається встановити розширення '{0}', оскільки воно оголошено таким, що не працює в цій конфігурації.

# interruptActiveResponse
source: Are you sure you want to interrupt the active session?
uk: Ви впевнені, що хочете перервати активну сесію?

# commentsViewIcon
source: View icon of the comments view.
uk: Переглянути іконку перегляду коментарів.

# defaultEditLabel
source: Edit
uk: Редагувати

# vetoExtHostRestart
source: An extension provided editor for '{0}' is still open that would close otherwise.
uk: Редактор, наданий розширенням для '{0}', все ще відкритий, який інакше закрився б.

# timeout.onWillCreateEditSessionIdentity
source: Aborted onWillCreateEditSessionIdentity-event after 10000ms
uk: Скасовано на події WillCreateEditSessionIdentity після 10000мс

# disabledDep
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension which is disabled. Would you like to enable the extension and reload the window?
uk: Не вдається активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке вимкнене. Чи бажаєте ви увімкнути розширення та перезавантажити вікно?

# disabledDepNoAction
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension which is disabled.
uk: Не вдається активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке вимкнено.

# enable dep
source: Enable and Reload
uk: Увімкнути та перезавантажити

# install missing dep
source: Install and Reload
uk: Встановити та перезавантажити

source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# notSupportedInWorkspace
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension which is not supported in the current workspace
uk: Не вдалося активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке не підтримується в поточному робочому просторі.

# reload
source: Reload Window
uk: Перезавантажити вікно

# reload window
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension, which is not loaded. Would you like to reload the window to load the extension?
uk: Не вдається активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке не завантажене. Бажаєте перезавантажити вікно, щоб завантажити розширення?

# restrictedMode
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension which is not supported in Restricted Mode
uk: Не вдається активувати розширення '{0}', оскільки воно залежить від розширення '{1}', яке не підтримується в обмеженому режимі.

# uninstalledDep
source: Cannot activate the '{0}' extension because it depends on the '{1}' extension from '{2}', which is not installed. Would you like to install the extension and reload the window?
uk: Не вдалося активувати розширення '{0}', оскільки воно залежить від розширення '{1}' з '{2}', яке не встановлено. Бажаєте встановити розширення та перезавантажити вікно?

# unknownDep
source: Cannot activate the '{0}' extension because it depends on an unknown '{1}' extension.
uk: Не вдається активувати розширення '{0}', оскільки воно залежить від невідомого розширення '{1}'.

# again
source: Do not ask me again
uk: Не питай мене знову

# ask.1.copy
source: Extension '{0}' wants to make refactoring changes with this file copy
uk: Розширення '{0}' хоче внести зміни до рефакторингу з цією копією файлу

# ask.1.create
source: Extension '{0}' wants to make refactoring changes with this file creation
uk: Розширення '{0}' хоче внести зміни в рефакторинг з цим створенням файлу

# ask.1.delete
source: Extension '{0}' wants to make refactoring changes with this file deletion
uk: Розширення '{0}' хоче внести зміни в рефакторинг, видаливши цей файл

# ask.1.move
source: Extension '{0}' wants to make refactoring changes with this file move
uk: Розширення '{0}' хоче внести зміни в рефакторинг з цим переміщенням файлу

# ask.N.copy
source: {0} extensions want to make refactoring changes with this file copy
uk: {0} розширень хочуть внести зміни в рефакторинг з цією копією файлу

# ask.N.create
source: {0} extensions want to make refactoring changes with this file creation
uk: {0} розширень хочуть внести зміни в рефакторинг з цим створенням файлу

# ask.N.delete
source: {0} extensions want to make refactoring changes with this file deletion
uk: {0} розширень хочуть внести зміни в рефакторинг з видаленням цього файлу

# ask.N.move
source: {0} extensions want to make refactoring changes with this file move
uk: {0} розширень хочуть внести зміни в рефакторинг з цим переміщенням файлу

# cancel
source: Skip Changes
uk: Скасувати

# label
source: Reset choice for 'File operation needs preview'
uk: Скинути вибір для 'Операція з файлом потребує попереднього перегляду'

# msg-copy
source: Running 'File Copy' participants...
uk: Запуск учасників 'Копіювання файлів'...

# msg-create
source: Running 'File Create' participants...
uk: Запуск учасників 'Створення файлу'...

# msg-delete
source: Running 'File Delete' participants...
uk: Виконання 'Видалення файлу' учасників...

# msg-rename
source: Running 'File Rename' participants...
uk: Виконання учасників 'Перейменування файлу'...

# msg-write
source: Running 'File Write' participants...
uk: Виконання учасників 'Запису файлу'...

source: &&OK
uk: &&Гаразд

# preview
source: Show &&Preview
uk: Показати &&попередній перегляд

# confirmLanguageModelAccess
source: The extension '{0}' wants to access the language models provided by {1}.
uk: Розширення '{0}' хоче отримати доступ до мовних моделей, наданих {1}.

# languageModelsAccountId
source: Language Models
uk: Моделі мови

# confirmLogin
source: The MCP Server Definition '{0}' wants to authenticate to {1}.
uk: Розширення '{0}' хоче увійти, використовуючи {1}.

# confirmRelogin
source: The MCP Server Definition '{0}' wants you to authenticate to {1}.
uk: Розширення '{0}' хоче, щоб ви знову ввійшли, використовуючи {1}.

# defaultSource
source: Extension
uk: Розширення

source: Manage Extension
uk: Керувати розширенням

# timeout.onWillSave
source: Aborted onWillSaveNotebookDocument-event after 1750ms
uk: Скасовано на події onWillSaveNotebookDocument після 1750мс

# status.showOutput
source: Show Output
uk: Показати вихід

# status.showOutputAria
source: Show {0} Output Channel
uk: Показати {0} Канал Виходу

# status.showOutputTooltip
source: Show {0} Output Channel
uk: Показати {0} Канал Виводу

# timeout.onWillSave
source: Aborted onWillSaveTextDocument-event after 1750ms
uk: Скасовано на події onWillSaveNotebookDocument після 1750мс

# remote.tunnel.openTunnel
source: The extension {0} has forwarded port {1}. You'll need to run as superuser to use port {2} locally.
uk: Розширення {0} перенаправило порт {1}. Вам потрібно запустити як суперкористувач, щоб використовувати порт {2} локально.

# remote.tunnelsView.elevationButton
source: Use Port {0} as Sudo...
uk: Використовуйте порт {0} як Sudo...

# openerFailedMessage
source: Could not open uri with '{0}': {1}
uk: Не вдалося відкрити uri з '{0}': {1}

# openerFailedUseDefault
source: Open using default opener
uk: Відкрити за допомогою стандартного відкривача

# errorMessage
source: An error occurred while loading view: {0}
uk: Виникла помилка під час завантаження перегляду: {0}

# folderStatusChangeFolder
source: Extension '{0}' changed folders of the workspace
uk: Розширення '{0}' змінило папки робочого простору

# folderStatusMessageAddMultipleFolders
source: Extension '{0}' added {1} folders to the workspace
uk: Розширення '{0}' додало {1} папок до робочого простору

# folderStatusMessageAddSingleFolder
source: Extension '{0}' added 1 folder to the workspace
uk: Розширення '{0}' додало 1 папку до робочого простору

# folderStatusMessageRemoveMultipleFolders
source: Extension '{0}' removed {1} folders from the workspace
uk: Розширення '{0}' видалило {1} папок з робочого простору

# folderStatusMessageRemoveSingleFolder
source: Extension '{0}' removed 1 folder from the workspace
uk: Розширення '{0}' видалило 1 папку з робочого простору

# accessibilityInformation
source: Defines the role and aria label to be used when the status bar entry is focused.
uk: Визначає роль і aria-мітку, які будуть використовуватися, коли елемент статусного рядка має фокус.

# accessibilityInformation.label
source: The aria label of the status bar entry. Defaults to the entry's text.
uk: aria-мітка запису статусного рядка. За замовчуванням - текст запису.

# accessibilityInformation.role
source: The role of the status bar entry which defines how a screen reader interacts with it. More about aria roles can be found here https://w3c.github.io/aria/#widget_roles
uk: Роль елемента статусного рядка, яка визначає, як з ним взаємодіє екранний рідер. Більше про ролі aria можна знайти тут https://w3c.github.io/aria/#widget_roles

# alignment
source: The alignment of the status bar entry.
uk: Вирівнювання запису в рядку стану.

# command
source: The command to execute when the status bar entry is clicked.
uk: Команда, яка виконується при натисканні на запис у рядку стану.

# id
source: The identifier of the status bar entry. Must be unique within the extension. The same value must be used when calling the `vscode.window.createStatusBarItem(id, ...)`-API
uk: Ідентифікатор елемента статусного рядка. Повинен бути унікальним в межах розширення. Те саме значення повинно використовуватися при виклику API `vscode.window.createStatusBarItem(id, ...)`.

# invalid
source: Invalid status bar item contribution.
uk: Недійсний внесок елемента статусного рядка.

# name
source: The name of the entry, like 'Python Language Indicator', 'Git Status' etc. Try to keep the length of the name short, yet descriptive enough that users can understand what the status bar item is about.
uk: Назва запису, наприклад, 'Індикатор мови Python', 'Статус Git' тощо. Спробуйте зберегти довжину назви короткою, але достатньо описовою, щоб користувачі могли зрозуміти, про що йдеться в елементі статусного рядка.

# priority
source: The priority of the status bar entry. Higher value means the item should be shown more to the left.
uk: Пріоритет запису в рядку стану. Вищий показник означає, що елемент має бути показаний більше зліва.

# text
source: The text to show for the entry. You can embed icons in the text by leveraging the `$(<name>)`-syntax, like 'Hello $(globe)!'
uk: Текст, який відображається для запису. Ви можете вбудовувати іконки в текст, використовуючи синтаксис `$(<name>)`, наприклад, 'Привіт $(globe)!'

# tooltip
source: The tooltip text for the entry.
uk: Текст підказки для запису.

# vscode.extension.contributes.statusBarItems
source: Contributes items to the status bar.
uk: Додає елементи до панелі стану.

# ViewContainerDoesnotExist
source: View container '{0}' does not exist and all views registered to it will be added to 'Explorer'.
uk: Контейнер '{0}' не існує, і всі перегляди, зареєстровані в ньому, будуть додані до 'Explorer'.

# ViewContainerRequiresProposedAPI
source: View container '{0}' requires 'enabledApiProposals: ["contribViewsRemote"]' to be added to 'Remote'.
uk: Перегляд контейнера '{0}' вимагає, щоб 'enabledApiProposals: ["contribViewsRemote"]' було додано до 'Remote'.

# duplicateView1
source: Cannot register multiple views with same id `{0}`
uk: Неможливо зареєструвати кілька подань з однаковим ідентифікатором `{0}`

# duplicateView2
source: A view with id `{0}` is already registered.
uk: Вид з ідентифікатором `{0}` вже зареєстровано.

# optenum
source: property `{0}` can be omitted or must be one of {1}
uk: властивість `{0}` може бути пропущена або повинна бути однією з {1}

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string`

# requirearray
source: views must be an array
uk: views повинні бути масивом

# requireidstring
source: property `{0}` is mandatory and must be of type `string` with non-empty value. Only alphanumeric characters, '_', and '-' are allowed.
uk: властивість `{0}` є обов'язковою і повинна бути типу `string` з непорожнім значенням. Дозволені лише алфавітно-цифрові символи, '_', і '-'.

# requirenonemptystring
source: property `{0}` is mandatory and must be of type `string` with non-empty value
uk: властивість `{0}` є обов'язковою і повинна бути типу `string` з непорожнім значенням

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# unknownViewType
source: Unknown view type `{0}`.
uk: Невідомий тип перегляду `{0}`.

# view container location
source: Where
uk: Де

# view container title
source: Title
uk: Назва

# view name title
source: Name
uk: Ім'я

# viewcontainer requirearray
source: views containers must be an array
uk: контейнери переглядів повинні бути масивом

source: Views
uk: Перегляди

# views.container.activitybar
source: Contribute views containers to Activity Bar
uk: Додати контейнери переглядів до панелі активності

# views.container.panel
source: Contribute views containers to Panel
uk: Внесіть контейнери переглядів до Панелі

# views.contributed
source: Contributes views to contributed views container
uk: Додає перегляди до контейнера внесених переглядів

# views.debug
source: Contributes views to Debug container in the Activity bar
uk: Вносить подання до контейнера Debug на панелі активності

# views.explorer
source: Contributes views to Explorer container in the Activity bar
uk: Вносить подання до контейнера Explorer в панелі активності

# views.remote
source: Contributes views to Remote container in the Activity bar. To contribute to this container, enableProposedApi needs to be turned on
uk: Вносить подання до віддаленого контейнера в панелі активності. Щоб внести внесок у цей контейнер, потрібно увімкнути enableProposedApi.

# views.scm
source: Contributes views to SCM container in the Activity bar
uk: Додає подання до контейнера SCM на панелі активності

# views.test
source: Contributes views to Test container in the Activity bar
uk: Додає подання до контейнера Тест у панелі Діяльності

# viewsContainers
source: View Containers
uk: Переглянути контейнери

# vscode.extension.contributes.view.accessibilityHelpContent
source: When the accessibility help dialog is invoked in this view, this content will be presented to the user as a markdown string. Keybindings will be resolved when provided in the format of <keybinding:commandId>. If there is no keybinding, that will be indicated and this command will be included in a quickpick for easy configuration.
uk: Коли діалог допомоги з доступністю викликається в цьому вигляді, цей вміст буде представлений користувачу у вигляді рядка markdown. Прив'язки клавіш будуть розпізнані, коли вони надані у форматі <keybinding:commandId>. Якщо прив'язки клавіш немає, це буде вказано, і ця команда буде включена в швидкий вибір для зручної конфігурації.

# vscode.extension.contributes.view.contextualTitle
source: Human-readable context for when the view is moved out of its original location. By default, the view's container name will be used.
uk: Людсько-зрозумілий контекст для випадків, коли вид переміщується з його початкового місця. За замовчуванням буде використано ім'я контейнера виду.

# vscode.extension.contributes.view.group
source: Nested group in the viewlet
uk: Вкладена група в вьюлеті

# vscode.extension.contributes.view.icon
source: Path to the view icon. View icons are displayed when the name of the view cannot be shown. It is recommended that icons be in SVG, though any image file type is accepted.
uk: Шлях до іконки перегляду. Іконки перегляду відображаються, коли назву перегляду не можна показати. Рекомендується використовувати іконки у форматі SVG, хоча приймаються будь-які типи файлів зображень.

# vscode.extension.contributes.view.id
source: Identifier of the view. This should be unique across all views. It is recommended to include your extension id as part of the view id. Use this to register a data provider through `vscode.window.registerTreeDataProviderForView` API. Also to trigger activating your extension by registering `onView:${id}` event to `activationEvents`.
uk: Ідентифікатор перегляду. Він повинен бути унікальним серед усіх переглядів. Рекомендується включити ідентифікатор вашого розширення як частину ідентифікатора перегляду. Використовуйте це для реєстрації постачальника даних через API `vscode.window.registerTreeDataProviderForView`. Також для активації вашого розширення, зареєструвавши подію `onView:${id}` в `activationEvents`.

# vscode.extension.contributes.view.initialState
source: Initial state of the view when the extension is first installed. Once the user has changed the view state by collapsing, moving, or hiding the view, the initial state will not be used again.
uk: Початковий стан вигляду, коли розширення вперше встановлено. Як тільки користувач змінив стан вигляду, згорнувши, перемістивши або приховавши вигляд, початковий стан більше не буде використовуватися.

# vscode.extension.contributes.view.initialState.collapsed
source: The view will show in the view container, but will be collapsed.
uk: Подання відображатиметься в контейнері подання, але буде згорнуте.

# vscode.extension.contributes.view.initialState.hidden
source: The view will not be shown in the view container, but will be discoverable through the views menu and other view entry points and can be un-hidden by the user.
uk: Вид не буде показаний у контейнері видів, але буде доступний через меню видів та інші точки входу в види і може бути знову відкритий користувачем.

# vscode.extension.contributes.view.initialState.visible
source: The default initial state for the view. In most containers the view will be expanded, however; some built-in containers (explorer, scm, and debug) show all contributed views collapsed regardless of the `visibility`.
uk: Початковий стан за замовчуванням для вигляду. У більшості контейнерів вигляд буде розгорнутий, однак деякі вбудовані контейнери (провідник, scm та налагодження) показують всі внесені вигляди згорнутими, незалежно від `visibility`.

# vscode.extension.contributes.view.name
source: The human-readable name of the view. Will be shown
uk: Людсько-зрозуміла назва перегляду. Буде показано

# vscode.extension.contributes.view.remoteName
source: The name of the remote type associated with this view
uk: Назва віддаленого типу, пов'язаного з цим видом

# vscode.extension.contributes.view.tree
source: The view is backed by a `TreeView` created by `createTreeView`.
uk: Вид підтримується `TreeView`, створеним за допомогою `createTreeView`.

# vscode.extension.contributes.view.type
source: Type of the view. This can either be `tree` for a tree view based view or `webview` for a webview based view. The default is `tree`.
uk: Тип перегляду. Це може бути або `tree` для перегляду на основі дерева, або `webview` для перегляду на основі вебу. За замовчуванням використовується `tree`.

# vscode.extension.contributes.view.webview
source: The view is backed by a `WebviewView` registered by `registerWebviewViewProvider`.
uk: Вид підтримується `WebviewView`, зареєстрованим за допомогою `registerWebviewViewProvider`.

# vscode.extension.contributes.view.when
source: Condition which must be true to show this view
uk: Умова, яка повинна бути істинною, щоб показати цей вигляд

# vscode.extension.contributes.views
source: Contributes views to the editor
uk: Вносить погляди до редактора

# vscode.extension.contributes.views.containers.icon
source: Path to the container icon. Icons are 24x24 centered on a 50x40 block and have a fill color of 'rgb(215, 218, 224)' or '#d7dae0'. It is recommended that icons be in SVG, though any image file type is accepted.
uk: Шлях до іконки контейнера. Іконки мають розміри 24x24, центровані на блоці 50x40, і мають колір заповнення 'rgb(215, 218, 224)' або '#d7dae0'. Рекомендується використовувати SVG для іконок, хоча приймаються будь-які типи файлів зображень.

# vscode.extension.contributes.views.containers.id
source: Unique id used to identify the container in which views can be contributed using 'views' contribution point
uk: Унікальний ідентифікатор, що використовується для ідентифікації контейнера, в якому можна додавати подання за допомогою точки внесення 'views'.

# vscode.extension.contributes.views.containers.title
source: Human readable string used to render the container
uk: Людськочитний рядок, що використовується для відображення контейнера

# vscode.extension.contributes.viewsContainers
source: Contributes views containers to the editor
uk: Вносить контейнери для переглядів до редактора
