Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_issue.xlf
Languages: uk

# acknowledge
source: Confirm Version Acknowledgement
uk: Підтвердити визнання версії

# bugDescription
source: Share the steps needed to reliably reproduce the problem. Please include actual and expected results. We support GitHub-flavored Markdown. You will be able to edit your issue and add screenshots when we preview it on GitHub.
uk: Поділіться кроками, необхідними для надійного відтворення проблеми. Будь ласка, включіть фактичні та очікувані результати. Ми підтримуємо Markdown з розширеннями GitHub. Ви зможете редагувати свою проблему та додавати скріншоти, коли ми попередньо переглянемо її на GitHub.

# bugReporter
source: Bug Report
uk: Звіт про помилку

source: Closed
uk: Закрито

# create
source: Create on GitHub
uk: Створити на GitHub

source: Create Internally
uk: Створити всередині

source: Create on GitHub
uk: Створити на GitHub

source: Description
uk: Опис

# disabledExtensions
source: Extensions are disabled
uk: Розширення вимкнені

# elsewhereDescription
source: The '{0}' extension prefers to use an external issue reporter. To be taken to that issue reporting experience, click the button below.
uk: Розширення '{0}' надає перевагу використанню зовнішнього репортера проблем. Щоб перейти до цього досвіду звітування про проблеми, натисніть кнопку нижче.

# extension
source: A VS Code extension
uk: Розширення для VS Code

# extensionPlaceholder
source: E.g. Missing alt text on extension readme image
uk: Наприклад, відсутній альтернативний текст на зображенні README розширення

source: Feature Request
uk: Запит на функцію

# featureRequestDescription
source: Please describe the feature you would like to see. We support GitHub-flavored Markdown. You will be able to edit your issue and add screenshots when we preview it on GitHub.
uk: Будь ласка, опишіть функцію, яку ви хотіли б бачити. Ми підтримуємо Markdown у стилі GitHub. Ви зможете редагувати вашу проблему та додавати скріншоти, коли ми попередньо переглянемо її на GitHub.

# handlesIssuesElsewhere
source: This extension handles issues outside of VS Code
uk: Ця розширення вирішує проблеми поза межами VS Code

source: hide
uk: сховати

# internalPreviewMessage
source: If your copilot debug logs contain private information:
uk: Якщо журнали налагодження вашого співпілота містять приватну інформацію:

# marketplace
source: Extensions Marketplace
uk: Маркетплейс розширень

# marketplacePlaceholder
source: E.g Cannot disable installed extension
uk: Наприклад, не можна вимкнути встановлене розширення.

source: Open
uk: Відкрити

# openIssueReporter
source: Open External Issue Reporter
uk: Відкрити зовнішній репортер проблем

# pasteData
source: We have written the needed data into your clipboard because it was too large to send. Please paste.
uk: Ми скопіювали необхідні дані у ваш буфер обміну, оскільки вони були занадто великими для відправки. Будь ласка, вставте.

# performanceIssue
source: Performance Issue (freeze, slow, crash)
uk: Проблема продуктивності (зависання, повільна робота, аварія)

# performanceIssueDesciption
source: When did this performance issue happen? Does it occur on startup or after a specific series of actions? We support GitHub-flavored Markdown. You will be able to edit your issue and add screenshots when we preview it on GitHub.
uk: Коли виникла ця проблема з продуктивністю? Вона виникає під час запуску чи після певної серії дій? Ми підтримуємо Markdown у стилі GitHub. Ви зможете редагувати вашу проблему та додавати скріншоти, коли ми попередньо переглянемо її на GitHub.

# preview
source: Preview on GitHub
uk: Попередній перегляд на GitHub

source: Preview on GitHub
uk: Попередній перегляд на GitHub

# privateCreate
source: Create Internally
uk: Створити всередині

source: Save Extension Data
uk: Зберегти дані розширення

source: Select extension
uk: Виберіть розширення

source: Select source
uk: Виберіть джерело

source: show
uk: показати

source: Similar issues
uk: Схожі проблеми

source: Steps to Reproduce
uk: Кроки для відтворення

# undefinedPlaceholder
source: Please enter a title
uk: Будь ласка, введіть заголовок

# unknown
source: Don't know
uk: Не знаю

# vscodePlaceholder
source: E.g Workbench is missing problems panel
uk: Наприклад, панель проблем у робочій області відсутня

# statusUnsupported
source: The --status argument is not yet supported in browsers.
uk: Аргумент --status ще не підтримується в браузерах.

source: Cancel
uk: Скасувати

# confirmCloseIssueReporter
source: Your input will not be saved. Are you sure you want to close this window?
uk: Ваші дані не будуть збережені. Ви впевнені, що хочете закрити це вікно?

# issueReporterWriteToClipboard
source: There is too much data to send to GitHub directly. The data will be copied to the clipboard, please paste it into the GitHub issue page that is opened.
uk: Занадто багато даних, щоб надіслати їх безпосередньо на GitHub. Дані будуть скопійовані в буфер обміну, будь ласка, вставте їх на сторінку проблеми GitHub, яка відкрилася.

source: &&OK
uk: &&Гаразд

source: &&Yes
uk: &&Так

# contributedIssuePage
source: Open Extension Page
uk: Відкрити сторінку розширення

source: Extensions
uk: Розширення

# reportExtensionMarketplace
source: Extension Marketplace
uk: Маркетплейс розширень

# acknowledgements
source: I acknowledge that my VS Code version is not updated and this issue may be closed.
uk: Я визнаю, що моя версія VS Code не оновлена, і це питання може бути закрито.

# chooseExtension
source: Extension
uk: Розширення

# completeInEnglish
source: Please complete the form in English.
uk: Будь ласка, заповніть форму англійською мовою.

# descriptionEmptyValidation
source: A description is required.
uk: Опис є обов'язковим.

# descriptionTooShortValidation
source: Please provide a longer description.
uk: Будь ласка, надайте більш детальний опис.

# details
source: Please enter details.
uk: Будь ласка, введіть деталі.

# disableExtensions
source: disabling all extensions and reloading the window
uk: вимкнення всіх розширень та перезавантаження вікна

# disableExtensionsLabelText
source: Try to reproduce the problem after {0}. If the problem only reproduces when extensions are active, it is likely an issue with an extension.
uk: Спробуйте відтворити проблему після {0}. Якщо проблема відтворюється лише тоді, коли активні розширення, ймовірно, це проблема з розширенням.

source: Download Extension Data
uk: Завантажити дані розширення

# extensionData
source: Extension does not have additional data to include.
uk: Розширення не має додаткових даних для включення.

# extensionWithNoBugsUrl
source: The issue reporter is unable to create issues for this extension, as it does not specify a URL for reporting issues. Please check the marketplace page of this extension to see if other instructions are available.
uk: Звітник проблем не може створити проблеми для цього розширення, оскільки воно не вказує URL для звітування про проблеми. Будь ласка, перевірте сторінку цього розширення в маркетплейсі, щоб дізнатися, чи доступні інші інструкції.

# extensionWithNonstandardBugsUrl
source: The issue reporter is unable to create issues for this extension. Please visit {0} to report an issue.
uk: Звітник проблем не може створити проблеми для цього розширення. Будь ласка, відвідайте {0}, щоб повідомити про проблему.

# issueSourceEmptyValidation
source: An issue source is required.
uk: Необхідне джерело проблеми.

# issueSourceLabel
source: For
uk: Для

# issueTitleLabel
source: Title
uk: Заголовок

# issueTitleRequired
source: Please enter a title.
uk: Будь ласка, введіть заголовок.

# issueTypeLabel
source: This is a
uk: Це є

# reviewGuidanceLabel
source: Before you report an issue here please <a href="https://github.com/microsoft/vscode/wiki/Submitting-Bugs-and-Suggestions" target="_blank">review the guidance we provide</a>. Please complete the form in English.
uk: Перед тим, як ви повідомите про проблему тут, будь ласка, <a href="https://github.com/microsoft/vscode/wiki/Submitting-Bugs-and-Suggestions" target="_blank">ознайомтеся з рекомендаціями, які ми надаємо</a>. Будь ласка, заповніть форму англійською мовою.

# sendExperiments
source: Include A/B experiment info
uk: Включити інформацію про A/B експеримент

# sendExtensionData
source: Include additional extension info
uk: Додати додаткову інформацію про розширення

# sendExtensions
source: Include my enabled extensions
uk: Включити мої активовані розширення

# sendProcessInfo
source: Include my currently running processes
uk: Включити мої процеси, що зараз виконуються

# sendSystemInfo
source: Include my system information
uk: Включити інформацію про мою систему

# sendWorkspaceInfo
source: Include my workspace metadata
uk: Включити метадані мого робочого простору

# titleEmptyValidation
source: A title is required.
uk: Назва є обов'язковою.

# titleLengthValidation
source: The title is too long.
uk: Заголовок занадто довгий.

# I cannot reproduce
source: I Can't Reproduce
uk: Я не можу відтворити

source: Stop
uk: Зупинити

# This is Bad
source: I Can Reproduce
uk: Я можу відтворити

# ask to download insiders
source: Please try to download and reproduce the issue in {0} insiders.
uk: Будь ласка, спробуйте завантажити та відтворити проблему в {0} інсайдерах.

# ask to reproduce issue
source: Please try to reproduce the issue in {0} insiders and confirm if the issue exists there.
uk: Будь ласка, спробуйте відтворити проблему в {0} insiders і підтвердіть, чи існує проблема там.

# bad
source: I can reproduce
uk: Я можу відтворити

# detail.start
source: Issue troubleshooting is a process to help you identify the cause for an issue. The cause for an issue can be a misconfiguration, due to an extension, or be {0} itself. During the process the window reloads repeatedly. Each time you must confirm if you are still seeing the issue.
uk: Вирішення проблем є процесом, який допомагає вам визначити причину проблеми. Причиною проблеми може бути неправильна конфігурація, через розширення або бути {0} самим. Під час процесу вікно повторно перезавантажується. Щоразу ви повинні підтвердити, чи все ще бачите проблему.

# download insiders
source: Download {0} Insiders
uk: Завантажити {0} Insiders

# empty.profile
source: Issue troubleshooting is active and has temporarily reset your configurations to defaults. Check if you can still reproduce the problem and proceed by selecting from these options.
uk: Вирішення проблем активне і тимчасово скинуло ваші налаштування до значень за замовчуванням. Перевірте, чи можете ви все ще відтворити проблему, і продовжте, вибравши з цих варіантів.

# good
source: I can't reproduce
uk: Я не можу відтворити

# issue is in core
source: Issue troubleshooting has identified that the issue is with {0}.
uk: Вирішення проблеми виявило, що проблема полягає в {0}.

# issue is with configuration
source: Issue troubleshooting has identified that the issue is caused by your configurations. Please report the issue by exporting your configurations using "Export Profile" command and share the file in the issue report.
uk: Вирішення проблеми виявило, що проблема викликана вашими налаштуваннями. Будь ласка, повідомте про проблему, експортувавши свої налаштування за допомогою команди "Експортувати профіль" та поділіться файлом у звіті про проблему.

# msg
source: &&Troubleshoot Issue
uk: &&Виправити проблему

# profile.extensions.disabled
source: Issue troubleshooting is active and has temporarily disabled all installed extensions. Check if you can still reproduce the problem and proceed by selecting from these options.
uk: Вирішення проблем активне і тимчасово вимкнуло всі встановлені розширення. Перевірте, чи можете ви все ще відтворити проблему, і продовжте, вибравши з цих варіантів.

# report anyway
source: Report Issue Anyway
uk: Повідомити про проблему в будь-якому випадку

source: Stop
uk: Зупинити

# title.stop
source: Stop Troubleshoot Issue
uk: Припинити усунення проблеми

source: Troubleshoot Issue
uk: Виправлення проблеми

source: Troubleshoot Issue...
uk: Виправити проблему...

# use insiders
source: This likely means that the issue has been addressed already and will be available in an upcoming release. You can safely use {0} insiders until the new stable version is available.
uk: Це, ймовірно, означає, що проблема вже була вирішена і буде доступна в наступному випуску. Ви можете безпечно використовувати {0} інсайдерів, поки нова стабільна версія не стане доступною.

# miReportIssue
source: Report &&Issue
uk: Повідомити про &&проблему

# reportIssueInEnglish
source: Report Issue...
uk: Повідомити про проблему...

source: Open Issue Reporter
uk: Відкрити зовнішній репортер проблем

source: Report Performance Issue...
uk: Повідомити про проблему з продуктивністю...

# tasksQuickAccessPlaceholder
source: Type the name of an extension to report on.
uk: Введіть назву розширення, про яке потрібно скласти звіт.

source: No current experiments.
uk: Немає поточних експериментів.

# updateAvailable
source: A new version of {0} is available.
uk: Доступна нова версія {0}.
