Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_views.xlf
Languages: uk

# hideView
source: Hide '{0}'
uk: Сховати '{0}'

# hideViewDescription
source: Hides the {0} view if it is visible and the view container it is located in is visible
uk: Сховати {0} вигляд, якщо він видимий, і контейнер вигляду, в якому він знаходиться, також видимий.

# resetViewLocation
source: Reset Location
uk: Скинути місцезнаходження

# toggleVisibilityDescription
source: Toggles the visibility of the {0} view if the view container it is located in is visible
uk: Перемикає видимість {0} перегляду, якщо контейнер перегляду, в якому він розташований, видимий

# user
source: User View Container
uk: Контейнер перегляду користувача

# editor
source: Text Editor
uk: Текстовий редактор

# focus view
source: Focus on {0} View
uk: Зосередьтеся на {0} Перегляді

# show view
source: Show {0}
uk: Показати {0}

# toggle view
source: Toggle {0}
uk: Перемкнути {0}

source: Test View 1
uk: Тестовий перегляд 1

source: Test View 2
uk: Тестовий перегляд 2

source: Test View 3
uk: Тестовий перегляд 3

source: Test View 4
uk: Тестовий перегляд 4

source: Test View 5
uk: Перегляд тесту 5

source: test
uk: тест
