Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_files.xlf
Languages: uk

# binaryFileEditor
source: Binary File Viewer
uk: Переглядач двійкових файлів

source: Create File
uk: Створити файл

# fileIsDirectory
source: The file is not displayed in the text editor because it is a directory.
uk: Файл не відображається в текстовому редакторі, оскільки це каталог.

# fileTooLargeForHeapErrorWithSize
source: The file is not displayed in the text editor because it is very large ({0}).
uk: Файл не відображається в текстовому редакторі, оскільки він дуже великий ({0}).

# fileTooLargeForHeapErrorWithoutSize
source: The file is not displayed in the text editor because it is very large.
uk: Файл не відображається в текстовому редакторі, оскільки він дуже великий.

source: Open Folder
uk: Відкрити папку

# reveal
source: Reveal Folder
uk: Показати папку

source: Text File Editor
uk: Редактор текстових файлів

# unavailableResourceErrorEditorText
source: The editor could not be opened because the file was not found.
uk: Редактор не вдалося відкрити, оскільки файл не знайдено.

# compareChanges
source: Compare
uk: Порівняти

source: Configure
uk: Налаштувати

source: Don't Show Again
uk: Не показувати знову

# genericSaveError
source: Failed to save '{0}': {1}
uk: Не вдалося зберегти '{0}': {1}

source: Learn More
uk: Дізнатися більше

source: Overwrite
uk: Перезаписати

# overwriteElevated
source: Overwrite as Admin...
uk: Перезаписати як адміністратор...

# overwriteElevatedSudo
source: Overwrite as Sudo...
uk: Перезаписати як Sudo...

# permissionDeniedSaveError
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': Недостатньо прав. Виберіть 'Спробувати знову як адміністратор', щоб спробувати ще раз від імені адміністратора.

# permissionDeniedSaveErrorSudo
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Sudo' to retry as superuser.
uk: Не вдалося зберегти '{0}': Недостатньо прав. Виберіть 'Спробувати знову як Sudo', щоб спробувати ще раз як суперкористувач.

# readonlySaveError
source: Failed to save '{0}': File is read-only. Select 'Overwrite' to attempt to make it writeable.
uk: Не вдалося зберегти '{0}': Файл є лише для читання. Виберіть 'Перезаписати', щоб спробувати зробити його записуваним.

# readonlySaveErrorAdmin
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': Файл доступний лише для читання. Виберіть 'Перезаписати як адміністратор', щоб спробувати ще раз як адміністратор.

# readonlySaveErrorSudo
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Sudo' to retry as superuser.
uk: Не вдалося зберегти '{0}': Файл доступний лише для читання. Виберіть 'Перезаписати як Sudo', щоб спробувати ще раз як суперкористувач.

source: Retry
uk: Спробувати ще раз

source: Revert
uk: Повернути

# saveConflictDiffLabel
source: {0} (in file) ↔ {1} (in {2}) - Resolve save conflict
uk: {0} (в файлі) ↔ {1} (в {2}) - Вирішити конфлікт збереження

# saveElevated
source: Retry as Admin...
uk: Спробувати знову як адміністратор...

# saveElevatedSudo
source: Retry as Sudo...
uk: Спробуйте ще раз як Sudo...

# staleSaveError
source: Failed to save '{0}': The content of the file is newer. Please compare your version with the file contents or overwrite the content of the file with your changes.
uk: Не вдалося зберегти '{0}': Вміст файлу новіший. Будь ласка, порівняйте вашу версію з вмістом файлу або перезапишіть вміст файлу вашими змінами.

# userGuide
source: Use the actions in the editor tool bar to either undo your changes or overwrite the content of the file with your changes.
uk: Використовуйте дії в панелі інструментів редактора, щоб скасувати свої зміни або перезаписати вміст файлу своїми змінами.

source: add a folder
uk: додати папку

# explore
source: Explorer
uk: Провідник

# explorerViewIcon
source: View icon of the explorer view.
uk: Переглянути іконку оглядача.

source: Folders
uk: Папки

# miViewExplorer
source: &&Explorer
uk: &&Провідник

# noFolderButEditorsHelp
source: You have not yet opened a folder. {0} Opening a folder will close all currently open editors. To keep them open, {1} instead.
uk: Ви ще не відкрили папку. {0} Відкриття папки закриє всі наразі відкриті редактори. Щоб залишити їх відкритими, {1} замість.

# noFolderHelp
source: You have not yet opened a folder. {0}
uk: Ви ще не відкрили папку. {0}

# noFolderHelpWeb
source: You have not yet opened a folder. {0} {1}
uk: Ви ще не відкрили папку. {0} {1}

# noWorkspaceHelp
source: You have not yet added a folder to the workspace. {0}
uk: Ви ще не додали папку до робочого простору. {0}

# openEditorsIcon
source: View icon of the open editors view.
uk: Переглянути іконку відкритих редакторів.

source: Open Recent
uk: Відкрити нещодавні

# remoteNoFolderHelp
source: Connected to remote. {0}
uk: Підключено до віддаленого. {0}

# binFailed
source: Failed to delete using the Recycle Bin. Do you want to permanently delete instead?
uk: Не вдалося видалити за допомогою Кошика. Ви хочете видалити назавжди?

# clipboardComparisonLabel
source: Clipboard ↔ {0}
uk: Буфер обміну ↔ {0}

source: Close Group
uk: Закрити групу

# compareFileWithMeta
source: Opens a picker to select a file to diff with the active editor.
uk: Відкриває вибірник для вибору файлу для порівняння з активним редактором.

source: Compare New Untitled Text Files
uk: Порівняти нові неназвані текстові файли

# compareNewUntitledTextFilesMeta
source: Opens a new diff editor with two untitled files.
uk: Відкриває новий редактор відмінностей з двома неназваними файлами.

# compareWithClipboard
source: Compare Active File with Clipboard
uk: Порівняти активний файл з буфером обміну

# compareWithClipboardMeta
source: Opens a new diff editor to compare the active file with the contents of the clipboard.
uk: Відкриває новий редактор відмінностей для порівняння активного файлу з вмістом буфера обміну.

# confirmDeleteMessageFile
source: Are you sure you want to permanently delete '{0}'?
uk: Ви впевнені, що хочете назавжди видалити '{0}'?

# confirmDeleteMessageFilesAndDirectories
source: Are you sure you want to permanently delete the following {0} files/directories and their contents?
uk: Ви впевнені, що хочете назавжди видалити наступні {0} файли/каталоги та їх вміст?

# confirmDeleteMessageFolder
source: Are you sure you want to permanently delete '{0}' and its contents?
uk: Ви впевнені, що хочете назавжди видалити '{0}' та його вміст?

# confirmDeleteMessageMultiple
source: Are you sure you want to permanently delete the following {0} files?
uk: Ви впевнені, що хочете назавжди видалити наступні {0} файли?

# confirmDeleteMessageMultipleDirectories
source: Are you sure you want to permanently delete the following {0} directories and their contents?
uk: Ви впевнені, що хочете назавжди видалити наступні {0} каталоги та їх вміст?

# confirmMoveTrashMessageFile
source: Are you sure you want to delete '{0}'?
uk: Ви впевнені, що хочете видалити '{0}'?

# confirmMoveTrashMessageFilesAndDirectories
source: Are you sure you want to delete the following {0} files/directories and their contents?
uk: Ви впевнені, що хочете видалити наступні {0} файли/каталоги та їх вміст?

# confirmMoveTrashMessageFolder
source: Are you sure you want to delete '{0}' and its contents?
uk: Ви впевнені, що хочете видалити '{0}' та його вміст?

# confirmMoveTrashMessageMultiple
source: Are you sure you want to delete the following {0} files?
uk: Ви впевнені, що хочете видалити наступні {0} файли?

# confirmMoveTrashMessageMultipleDirectories
source: Are you sure you want to delete the following {0} directories and their contents?
uk: Ви впевнені, що хочете видалити наступні {0} каталоги та їх вміст?

# confirmMultiPasteNative
source: Are you sure you want to paste the following {0} items?
uk: Ви впевнені, що хочете вставити наступні {0} елементи?

# confirmOverwrite
source: A file or folder with the name '{0}' already exists in the destination folder. Do you want to replace it?
uk: Файл або папка з назвою '{0}' вже існує в папці призначення. Ви хочете його замінити?

# confirmPasteNative
source: Are you sure you want to paste '{0}'?
uk: Ви впевнені, що хочете вставити '{0}'?

# continueButtonLabel
source: Continue
uk: Продовжити

# continueDetail
source: The read-only protection will be overridden if you continue.
uk: Захист тільки для читання буде скасовано, якщо ви продовжите.

# copyBulkEdit
source: Paste {0} files
uk: Вставте {0} файлів

# copyFile
source: Copy
uk: Копіювати

# copyFileBulkEdit
source: Paste {0}
uk: Вставте {0}

# copyingBulkEdit
source: Copying {0} files
uk: Копіювання {0} файлів

# copyingFileBulkEdit
source: Copying {0}
uk: Копіювання {0}

# createBulkEdit
source: Create {0}
uk: Створити {0}

# creatingBulkEdit
source: Creating {0}
uk: Створення {0}

source: Delete
uk: Видалити

# deleteBulkEdit
source: Delete {0} files
uk: Видалити {0} файлів

# deleteButtonLabel
source: &&Delete
uk: &&Видалити

# deleteButtonLabelRecycleBin
source: &&Move to Recycle Bin
uk: &&Перемістити до Кошика

# deleteButtonLabelTrash
source: &&Move to Trash
uk: &&Перемістити до кошика

# deleteFileBulkEdit
source: Delete {0}
uk: Видалити {0}

# deletePermanentlyButtonLabel
source: &&Delete Permanently
uk: &&Видалити назавжди

# deletingBulkEdit
source: Deleting {0} files
uk: Видалення {0} файлів

# deletingFileBulkEdit
source: Deleting {0}
uk: Видалення {0}

# dirtyMessageFileDelete
source: You are deleting {0} with unsaved changes. Do you want to continue?
uk: Ви видаляєте {0} з незбереженими змінами. Ви хочете продовжити?

# dirtyMessageFilesDelete
source: You are deleting files with unsaved changes. Do you want to continue?
uk: Ви видаляєте файли з незбереженими змінами. Бажаєте продовжити?

# dirtyMessageFolderDelete
source: You are deleting a folder {0} with unsaved changes in {1} files. Do you want to continue?
uk: Ви видаляєте папку {0} з незбереженими змінами в {1} файлах. Ви хочете продовжити?

# dirtyMessageFolderOneDelete
source: You are deleting a folder {0} with unsaved changes in 1 file. Do you want to continue?
uk: Ви видаляєте папку {0} з незбереженими змінами в 1 файлі. Ви хочете продовжити?

# dirtyWarning
source: Your changes will be lost if you don't save them.
uk: Ваші зміни будуть втрачені, якщо ви їх не збережете.

# doNotAskAgain
source: Do not ask me again
uk: Не питай мене знову

source: Download...
uk: Завантажити...

# emptyFileNameError
source: A file or folder name must be provided.
uk: Необхідно вказати ім'я файлу або папки.

# fileDeleted
source: The file(s) to paste have been deleted or moved since you copied them. {0}
uk: Файл(и), які потрібно вставити, були видалені або переміщені з моменту їх копіювання. {0}

# fileIsAncestor
source: File to paste is an ancestor of the destination folder
uk: Файл для вставки є предком папки призначення

# fileNameExistsError
source: A file or folder **{0}** already exists at this location. Please choose a different name.
uk: Файл або папка **{0}** вже існує за цією адресою. Будь ласка, виберіть іншу назву.

# fileNameStartsWithSlashError
source: A file or folder name cannot start with a slash.
uk: Ім'я файлу або папки не може починатися зі слешу.

# fileNameWhitespaceWarning
source: Leading or trailing whitespace detected in file or folder name.
uk: Виявлено провідний або кінцевий пробіл у назві файлу або папки.

# focusFilesExplorer
source: Focus on Files Explorer
uk: Зосередьтеся на Провіднику файлів

# focusFilesExplorerMetadata
source: Moves focus to the file explorer view container.
uk: Переміщує фокус до контейнера перегляду файлового провідника.

# globalCompareFile
source: Compare Active File With...
uk: Порівняти активний файл з...

# invalidFileNameError
source: The name **{0}** is not valid as a file or folder name. Please choose a different name.
uk: Ім'я **{0}** недійсне як ім'я файлу або папки. Будь ласка, виберіть інше ім'я.

# irreversible
source: This action is irreversible!
uk: Цю дію неможливо скасувати!

# moveBulkEdit
source: Move {0} files
uk: Перемістити {0} файлів

# moveFileBulkEdit
source: Move {0}
uk: Перемістити {0}

# movingBulkEdit
source: Moving {0} files
uk: Переміщення {0} файлів

# movingFileBulkEdit
source: Moving {0}
uk: Переміщення {0}

source: New File...
uk: Новий файл...

source: New Folder...
uk: Нова папка...

# openFileInEmptyWorkspace
source: Open Active File in New Empty Workspace
uk: Відкрити активний файл у новому порожньому робочому просторі

# openFileInEmptyWorkspaceMetadata
source: Opens the active file in a new window with no folders open.
uk: Відкриває активний файл у новому вікні без відкритих папок.

# openFileToShowInNewWindow.unsupportedschema
source: The active editor must contain an openable resource.
uk: Активний редактор повинен містити відкриваємий ресурс.

# pasteButtonLabel
source: &&Paste
uk: &&Вставити

# pasteFile
source: Paste
uk: Вставити

# readonlyMessageFilesDelete
source: You are deleting files that are configured to be read-only. Do you want to continue?
uk: Ви видаляєте файли, які налаштовані на режим тільки для читання. Ви хочете продовжити?

# readonlyMessageFolderDelete
source: You are deleting a file {0} that is configured to be read-only. Do you want to continue?
uk: Ви видаляєте файл {0}, який налаштований як тільки для читання. Ви хочете продовжити?

# readonlyMessageFolderOneDelete
source: You are deleting a folder {0} that is configured to be read-only. Do you want to continue?
uk: Ви видаляєте папку {0}, яка налаштована на режим тільки для читання. Ви хочете продовжити?

source: Rename...
uk: Перейменувати...

# renameBulkEdit
source: Rename {0} to {1}
uk: Перейменувати {0} на {1}

# renamingBulkEdit
source: Renaming {0} to {1}
uk: Перейменування {0} на {1}

# replaceButtonLabel
source: &&Replace
uk: &&Замінити

source: Reset Active Editor Read-only in Session
uk: Скинути активний редактор тільки для читання в сесії

# restore
source: You can restore this file using the Undo command.
uk: Ви можете відновити цей файл, використовуючи команду Скасувати.

# restorePlural
source: You can restore these files using the Undo command.
uk: Ви можете відновити ці файли, використовуючи команду Скасувати.

# retryButtonLabel
source: &&Retry
uk: &&Спробувати знову

source: Save All in Group
uk: Зберегти все в групі

source: Set Active Editor Read-only in Session
uk: Встановити активний редактор лише для читання в сесії

source: Set Active Editor Writeable in Session
uk: Встановити активний редактор доступним для запису в сесії

# showInExplorer
source: Reveal Active File in Explorer View
uk: Показати активний файл у вигляді провідника

# showInExplorerMetadata
source: Reveals and selects the active file within the explorer view.
uk: Відкриває та вибирає активний файл у вигляді провідника.

source: Toggle Active Editor Read-only in Session
uk: Перемкнути активний редактор у режимі лише для читання в сесії

source: Toggle Auto Save
uk: Переключити Автозбереження

# toggleAutoSaveDescription
source: Toggle the ability to save files automatically after typing
uk: Перемикати можливість автоматичного збереження файлів після введення

# trashFailed
source: Failed to delete using the Trash. Do you want to permanently delete instead?
uk: Не вдалося видалити за допомогою Кошика. Ви хочете замість цього назавжди видалити?

# undoBin
source: You can restore this file from the Recycle Bin.
uk: Ви можете відновити цей файл з Кошика.

# undoBinFiles
source: You can restore these files from the Recycle Bin.
uk: Ви можете відновити ці файли з Кошика.

# undoTrash
source: You can restore this file from the Trash.
uk: Ви можете відновити цей файл з Кошика.

# undoTrashFiles
source: You can restore these files from the Trash.
uk: Ви можете відновити ці файли з Кошика.

source: Upload...
uk: Завантажити...

# acceptLocalChanges
source: Use your changes and overwrite file contents
uk: Використайте свої зміни та перезапишіть вміст файлу

source: Close
uk: Закрити

source: Close All
uk: Закрити все

source: Close Others
uk: Закрити інших

source: Close Saved
uk: Закрити збережене

# compareActiveWithSaved
source: Compare Active File with Saved
uk: Порівняти активний файл із збереженим

# compareActiveWithSavedMeta
source: Opens a new diff editor to compare the active file with the version on disk.
uk: Відкриває новий редактор відмінностей для порівняння активного файлу з версією на диску.

source: Compare Selected
uk: Порівняти вибране

# compareSource
source: Select for Compare
uk: Вибрати для порівняння

source: Compare with Saved
uk: Порівняти з збереженим

source: Compare with Selected
uk: Порівняти з вибраним

source: Copy Path
uk: Копіювати шлях

# copyPathOfActive
source: Copy Path of Active File
uk: Скопіювати шлях активного файлу

source: Copy Relative Path
uk: Копіювати відносний шлях

# copyRelativePathOfActive
source: Copy Relative Path of Active File
uk: Скопіювати відносний шлях активного файлу

source: Cut
uk: Вирізати

# deleteFile
source: Delete Permanently
uk: Видалити назавжди

# explorerOpenWith
source: Open With...
uk: Відкрити з...

# miAutoSave
source: A&&uto Save
uk: A&&втоматичне збереження

# miCloseEditor
source: &&Close Editor
uk: &&Закрити редактор

# miGotoFile
source: Go to &&File...
uk: Перейти до &&файлу...

# miNewFile
source: &&New Text File
uk: &&Новий текстовий файл

# miRevert
source: Re&&vert File
uk: Ві&&дновити файл

# miSave
source: &&Save
uk: &&Зберегти

# miSaveAll
source: Save A&&ll
uk: Зберегти в&&се

# miSaveAs
source: Save &&As...
uk: Зберегти &&як...

# newFile
source: New Text File
uk: Новий файл...

# newFolderDescription
source: Create a new folder or directory
uk: Створити нову папку або каталог

source: Open File...
uk: Відкрити файл...

# openToSide
source: Open to the Side
uk: Відкрити вбік

# reopenWith
source: Reopen Editor With...
uk: Відкрити редактор з...

# revealInSideBar
source: Reveal in Explorer View
uk: Відкрити в режимі Провідника

# revert
source: Revert File
uk: Повернути

# revertLocalChanges
source: Discard your changes and revert to file contents
uk: Відкинути зміни та повернутися до вмісту файлу

source: Save All
uk: Зберегти все

# saveFiles
source: Save All Files
uk: Зберегти всі файли

# genericRevertError
source: Failed to revert '{0}': {1}
uk: Не вдалося скасувати '{0}': {1}

# modifiedLabel
source: {0} (in file) ↔ {1}
uk: {0} (в файлі) ↔ {1}

# newFileCommand.saveLabel
source: Create File
uk: Створити файл

source: Revert All
uk: Відмінити все

# newUntitledFile
source: New Untitled Text File
uk: Новий неназваний текстовий файл

source: Remove Folder from Workspace
uk: Видалити папку з робочого простору

source: Save
uk: Зберегти

source: Save As...
uk: Зберегти як...

source: Save without Formatting
uk: Зберегти без форматування

# addFolder
source: &&Add Folder to Workspace
uk: &&Додати папку до робочого простору

# addFolders
source: &&Add Folders to Workspace
uk: &&Додати папки до робочого простору

source: Choose Where to Download
uk: Виберіть, куди завантажити

# confirmManyOverwrites
source: The following {0} files and/or folders already exist in the destination folder. Do you want to replace them?
uk: Наступні {0} файли та/або папки вже існують у папці призначення. Ви хочете їх замінити?

source: &&Copy Folder
uk: &&Копіювати папку

source: &&Copy Folders
uk: &&Копіювати папки

# copyfolder
source: Are you sure to want to copy '{0}'?
uk: Ви впевнені, що хочете скопіювати '{0}'?

# copyfolders
source: Are you sure to want to copy folders?
uk: Ви впевнені, що хочете скопіювати папки?

# copyingFile
source: Copying {0}
uk: Копіювання {0}

# copyingFiles
source: Copying...
uk: Копіювання...

# copyingnFile
source: Copying {0} resources
uk: Копіювання {0} ресурсів

# downloadBulkEdit
source: Download {0}
uk: Завантажити {0}

# downloadButton
source: Download
uk: Завантажити

# downloadProgressLarge
source: {0} ({1} of {2}, {3}/s)
uk: {0} ({1} з {2}, {3}/с)

# downloadProgressSmallMany
source: {0} of {1} files ({2}/s)
uk: {0} з {1} файлів ({2}/с)

# downloadingBulkEdit
source: Downloading {0}
uk: Завантаження {0}

# downloadingFiles
source: Downloading
uk: Завантаження

# dropFolder
source: Do you want to copy '{0}' or add '{0}' as a folder to the workspace?
uk: Ви хочете скопіювати '{0}' чи додати '{0}' як папку до робочого простору?

# dropFolders
source: Do you want to copy the folders or add the folders to the workspace?
uk: Ви хочете скопіювати папки чи додати папки до робочого простору?

# fileInaccessible
source: The dropped file could not be accessed for import.
uk: Не вдалося отримати доступ до скинутого файлу для імпорту.

# filesInaccessible
source: Some or all of the dropped files could not be accessed for import.
uk: Деякі або всі скинуті файли не вдалося отримати для імпорту.

# importFile
source: Import {0}
uk: Імпорт {0}

# importnFile
source: Import {0} resources
uk: Імпортувати {0} ресурси

# overwrite
source: Overwrite {0}
uk: Перезаписати

# overwriting
source: Overwriting {0}
uk: Перезаписування {0}

# uploadProgressLarge
source: {0} ({1} of {2}, {3}/s)
uk: {0} ({1} з {2}, {3}/с)

# uploadProgressSmallMany
source: {0} of {1} files ({2}/s)
uk: {0} з {1} файлів ({2}/с)

# uploadingFiles
source: Uploading
uk: Завантаження

# askUser
source: Will refuse to save and ask for resolving the save conflict manually.
uk: Відмовиться зберігати та попросить вирішити конфлікт збереження вручну.

# associations
source: Configure [glob patterns](https://aka.ms/vscode-glob-patterns) of file associations to languages (for example `"*.extension": "html"`). Patterns will match on the absolute path of a file if they contain a path separator and will match on the name of the file otherwise. These have precedence over the default associations of the languages installed.
uk: Налаштуйте [глобальні шаблони](https://aka.ms/vscode-glob-patterns) асоціацій файлів з мовами (наприклад, `"*.extension": "html"`). Шаблони відповідатимуть абсолютному шляху файлу, якщо містять роздільник шляху, і відповідатимуть імені файлу в іншому випадку. Ці шаблони мають пріоритет над стандартними асоціаціями встановлених мов.

# autoGuessEncoding
source: When enabled, the editor will attempt to guess the character set encoding when opening files. This setting can also be configured per language. Note, this setting is not respected by text search. Only {0} is respected.
uk: Коли увімкнено, редактор намагатиметься вгадати кодування набору символів під час відкриття файлів. Цю налаштування також можна налаштувати для кожної мови. Зверніть увагу, що це налаштування не враховується при текстовому пошуку. Лише {0} враховується.

# autoOpenDroppedFile
source: Controls whether the Explorer should automatically open a file when it is dropped into the explorer
uk: Контролює, чи повинен Провідник автоматично відкривати файл, коли він скидається в провідник

# autoReveal
source: Controls whether the Explorer should automatically reveal and select files when opening them.
uk: Контролює, чи повинен Провідник автоматично показувати та вибирати файли при їх відкритті.

# autoReveal.focusNoScroll
source: Files will not be scrolled into view, but will still be focused.
uk: Файли не будуть прокручуватися в поле зору, але все ще будуть в фокусі.

# autoReveal.off
source: Files will not be revealed and selected.
uk: Файли не будуть розкриті та вибрані.

# autoReveal.on
source: Files will be revealed and selected.
uk: Файли будуть розкриті та вибрані.
