Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_debug.xlf
Languages: uk

# debug.lazyButton.tooltip
source: Click to expand
uk: Натисніть, щоб розгорнути

source: Add Breakpoint
uk: Додати точку зупинки

source: Add Conditional Breakpoint...
uk: Додати умовну точку зупинки...

source: Add Logpoint...
uk: Додати Logpoint...

source: Add Triggered Breakpoint...
uk: Додати тригерний брейкпоінт...

source: Breakpoint
uk: Точка зупинки

# breakpointHasConditionDisabled
source: This {0} has a {1} that will get lost on remove. Consider enabling the {0} instead.
uk: Цей {0} має {1}, який буде втрачений при видаленні. Розгляньте можливість увімкнення {0} замість цього.

# breakpointHasConditionEnabled
source: This {0} has a {1} that will get lost on remove. Consider disabling the {0} instead.
uk: Цей {0} має {1}, який буде втрачено при видаленні. Розгляньте можливість вимкнення {0} замість цього.

# breakpointHelper
source: Click to add a breakpoint
uk: Натисніть, щоб додати точку зупинки

source: condition
uk: умова

# debugIcon.breakpointCurrentStackframeForeground
source: Icon color for the current breakpoint stack frame.
uk: Колір значка для поточного стекового фрейму точки зупинки.

# debugIcon.breakpointDisabledForeground
source: Icon color for disabled breakpoints.
uk: Колір іконки для вимкнених точок зламу.

# debugIcon.breakpointForeground
source: Icon color for breakpoints.
uk: Колір іконки для брейкпоінтів.

# debugIcon.breakpointStackframeForeground
source: Icon color for all breakpoint stack frames.
uk: Колір значка для всіх стекових фреймів точок зупинки.

# debugIcon.breakpointUnverifiedForeground
source: Icon color for unverified breakpoints.
uk: Колір значка для непідтверджених точок зупинки.

source: &&Disable
uk: &&Вимкнути

# disableBreakpoint
source: Disable {0}
uk: Вимкнути {0}

# disableBreakpointOnLine
source: Disable Line Breakpoint
uk: Вимкнути точку перерви рядка

# disableInlineColumnBreakpoint
source: Disable Inline Breakpoint on Column {0}
uk: Вимкнути вбудований точку зупинки на стовпці {0}

# editBreakpoint
source: Edit {0}...
uk: Редагувати {0}...

source: Edit Breakpoints
uk: Редагувати точки зупинки

# editInlineBreakpointOnColumn
source: Edit Inline Breakpoint on Column {0}
uk: Редагувати вбудований контрольний пункт у стовпці {0}

source: Edit Line Breakpoint
uk: Редагувати точку перерви в рядку

source: &&Enable
uk: &&Увімкнути

# enableBreakpoint
source: Enable {0}
uk: Увімкнути {0}

# enableBreakpointOnLine
source: Enable Line Breakpoint
uk: Увімкнути лінійний контрольний пункт

# enableBreakpoints
source: Enable Inline Breakpoint on Column {0}
uk: Увімкнути вбудований контрольний пункт у стовпці {0}

source: Enable/Disable Breakpoints
uk: Увімкнути/Вимкнути Точки Перерви

source: message
uk: повідомлення

# removeBreakpoint
source: Remove {0}
uk: Видалити {0}

source: Remove Breakpoints
uk: Видалити точки зупинки

# removeInlineBreakpointOnColumn
source: Remove Inline Breakpoint on Column {0}
uk: Видалити вбудований точку зупинки на стовпці {0}

source: Remove Line Breakpoint
uk: Видалити точку перерви рядка

# removeLogPoint
source: &&Remove {0}
uk: &&Видалити {0}

source: Run to Line
uk: Запустити до лінії

# bpMode
source: Mode
uk: Режим

source: Breakpoint Type
uk: Тип точки зупинки

# breakpointWidgetExpressionPlaceholder
source: Break when expression evaluates to true. '{0}' to accept, '{1}' to cancel.
uk: Перервати, коли вираз оцінюється як істинний. '{0}' для прийняття, '{1}' для скасування.

# breakpointWidgetHitCountPlaceholder
source: Break when hit count condition is met. '{0}' to accept, '{1}' to cancel.
uk: Перервати, коли умова лічильника ударів буде виконана. '{0}' для прийняття, '{1}' для скасування.

# breakpointWidgetLogMessagePlaceholder
source: Message to log when breakpoint is hit. Expressions within {} are interpolated. '{0}' to accept, '{1}' to cancel.
uk: Повідомлення для запису, коли досягається точка зупинки. Вирази в {} інтерполюються. '{0}' для підтвердження, '{1}' для скасування.

source: Expression
uk: Вираз

source: Hit Count
uk: Кількість ударів

source: Log Message
uk: Повідомлення журналу

# noBpSource
source: Could not load source.
uk: Не вдалося завантажити джерело.

# noTriggerByBreakpoint
source: None
uk: Ні

source: OK
uk: Гаразд

source: Select breakpoint
uk: Виберіть точку зупинки

# triggerByLoading
source: Loading...
uk: Завантаження...

# triggeredBy
source: Wait for Breakpoint
uk: Чекайте на точку зупинки

source: Access
uk: Доступ

# activateBreakpoints
source: Toggle Activate Breakpoints
uk: Перемикати активацію точок зупинки

# addDataBreakpointOnAddress
source: Add Data Breakpoint at Address
uk: Додати точку перерви даних за адресою

source: Add Function Breakpoint
uk: Додати функціональну точку зупинки

# breakpointUnsupported
source: Breakpoints of this type are not supported by the debugger
uk: Точки зупинки цього типу не підтримуються відладчиком

source: Breakpoints
uk: Точки зупинки

# dataBreakPointExpresionAriaLabel
source: Type expression. Data breakpoint will break when expression evaluates to true
uk: Введіть вираз. Точка зупинки даних зупиниться, коли вираз буде оцінений як істинний

# dataBreakPointHitCountAriaLabel
source: Type hit count. Data breakpoint will break when hit count is met.
uk: Введіть кількість спроб. Точка зупинки даних зупиниться, коли буде досягнута кількість спроб.

source: Data Breakpoint
uk: Точка зупинки даних

# dataBreakpointAccessType
source: Select the access type to monitor
uk: Виберіть тип доступу для моніторингу

# dataBreakpointAddrFormat
source: Address should be a range of numbers the form "[Start] - [End]" or "[Start] + [Bytes]"
uk: Адреса повинна бути діапазоном чисел у формі "[Start] - [End]" або "[Start] + [Bytes]"

# dataBreakpointAddrStartEnd
source: Number must be a decimal integer or hex value starting with "0x", got {0}
uk: Число повинно бути десятковим цілим або шістнадцятковим значенням, що починається з "0x", отримано {0}

# dataBreakpointError
source: Failed to set data breakpoint at {0}: {1}
uk: Не вдалося встановити точку зупинки даних на {0}: {1}

# dataBreakpointExpressionPlaceholder
source: Break when expression evaluates to true
uk: Перервати, коли вираз оцінюється як істинний

# dataBreakpointHitCountPlaceholder
source: Break when hit count is met
uk: Зупинити, коли досягнуто кількість ударів

# dataBreakpointMemoryRangePlaceholder
source: Absolute range (0x1234 - 0x1300) or range of bytes after an address (0x1234 + 0xff)
uk: Абсолютний діапазон (0x1234 - 0x1300) або діапазон байтів після адреси (0x1234 + 0xff)

# dataBreakpointMemoryRangePrompt
source: Enter a memory range in which to break
uk: Введіть діапазон пам'яті, в якому потрібно зупинитися

# dataBreakpointUnsupported
source: Data breakpoints not supported by this debug type
uk: Точки зупинки даних не підтримуються цим типом налагодження

# dataBreakpointsNotSupported
source: Data breakpoints are not supported by this debug type
uk: Точки зупинки даних не підтримуються цим типом налагодження

source: Disable All Breakpoints
uk: Вимкнути всі точки зупинки

source: Disabled Breakpoint
uk: Вимкнений контрольний пункт

source: Disabled Logpoint
uk: Вимкнений Logpoint

# editBreakpoint
source: Edit Function Condition...
uk: Редагувати {0}...

source: Edit Condition...
uk: Редагувати умову...

# editDataBreakpointOnAddress
source: Edit Address...
uk: Редагувати адресу...

source: Edit Hit Count...
uk: Редагувати кількість хітів...

source: Edit Mode...
uk: Режим редагування...

source: Enable All Breakpoints
uk: Увімкнути всі точки зупинки

# exceptionBreakpointAriaLabel
source: Type exception breakpoint condition
uk: Введіть умову для зупинки на винятку

# exceptionBreakpointPlaceholder
source: Break when expression evaluates to true
uk: Перервати, коли вираз оцінюється як істинний

# expression
source: Condition: {0}
uk: Вираз

# expressionAndHitCount
source: Condition: {0} | Hit Count: {1}
uk: Стан: {0} | Кількість попадань: {1}

# expressionCondition
source: Expression condition: {0}
uk: Умова виразу: {0}

# functionBreakPointExpresionAriaLabel
source: Type expression. Function breakpoint will break when expression evaluates to true
uk: Введіть вираз. Точка зупинки функції спрацює, коли вираз оцінюється як істинний

# functionBreakPointHitCountAriaLabel
source: Type hit count. Function breakpoint will break when hit count is met.
uk: Введіть кількість спроб. Точка зупинки функції зупиниться, коли буде досягнута кількість спроб.

# functionBreakPointInputAriaLabel
source: Type function breakpoint.
uk: Введіть функцію зупинки.

source: Function Breakpoint
uk: Точка зупинки функції

# functionBreakpointExpressionPlaceholder
source: Break when expression evaluates to true
uk: Перервати, коли вираз оцінюється як істинний

# functionBreakpointHitCountPlaceholder
source: Break when hit count is met
uk: Зупинитися, коли досягнуто кількість ударів

# functionBreakpointPlaceholder
source: Function to break on
uk: Функція для перерви на

# functionBreakpointUnsupported
source: Function breakpoints not supported by this debug type
uk: Точки зупинки функцій не підтримуються цим типом налагодження

# functionBreakpointsNotSupported
source: Function breakpoints are not supported by this debug type
uk: Точки зупинки функцій не підтримуються цим типом налагодження

# hitCount
source: Hit Count: {0}
uk: Кількість ударів

source: Instruction breakpoint
uk: Точка зупинки інструкції

# instructionBreakpointAtAddress
source: Instruction breakpoint at address {0}
uk: Точка зупинки інструкції за адресою {0}

# instructionBreakpointUnsupported
source: Instruction breakpoints not supported by this debug type
uk: Точки зупинки інструкцій не підтримуються цим типом налагодження

# logMessage
source: Log Message: {0}
uk: Повідомлення журналу

# miDataBreakpoint
source: &&Data Breakpoint...
uk: &&Дані точки зупинки...

# miDisableAllBreakpoints
source: Disable A&&ll Breakpoints
uk: Вимкнути в&&сі точки зупинки

# miEnableAllBreakpoints
source: &&Enable All Breakpoints
uk: &&Увімкнути всі точки зупинки

# miFunctionBreakpoint
source: &&Function Breakpoint...
uk: &&Точка зупинки функції...

# miRemoveAllBreakpoints
source: Remove &&All Breakpoints
uk: Видалити &&усі точки зупинки

source: Read
uk: Читати

source: Reapply All Breakpoints
uk: Знову застосувати всі точки зупинки

source: Remove All Breakpoints
uk: Видалити всі точки зупинки

source: Remove Breakpoint
uk: Видалити {0}

source: Select Breakpoint Mode
uk: Виберіть режим зупинки

# triggeredBy
source: Hit after breakpoint: {0}
uk: Чекайте на точку зупинки

source: Unverified Breakpoint
uk: Непідтверджений контрольний пункт

source: Unverified Exception Breakpoint
uk: Неавторизований точка зупинки виключення

source: Unverified Logpoint
uk: Непідтверджений Logpoint

source: Write
uk: Написати

# focusedStackFrameLineHighlight
source: Background color for the highlight of line at focused stack frame position.
uk: Колір фону для виділення рядка на позиції зосередженого стекового фрейму.

# topStackFrameLineHighlight
source: Background color for the highlight of line at the top stack frame position.
uk: Колір фону для виділення рядка на верхній позиції стекового фрейму.

# callStackAriaLabel
source: Debug Call Stack
uk: Стеки викликів для налагодження

# collapse
source: Collapse All
uk: Згорнути все

# loadAllStackFrames
source: Load More Stack Frames
uk: Завантажити більше стекових кадрів

source: Paused
uk: Призупинено

# pausedOn
source: Paused on {0}
uk: Призупинено на {0}

source: Restart Frame
uk: Перезапустити кадр

source: Running
uk: Виконання

source: Session
uk: Сесія

# sessionLabel
source: Session {0} {1}
uk: Сесія {0} {1}

# showMoreAndOrigin
source: Show {0} More: {1}
uk: Показати {0} більше: {1}

# showMoreStackFrames
source: Show {0} More Stack Frames
uk: Показати {0} додаткових стекових фреймів

# showMoreStackFrames2
source: Show More Stack Frames
uk: Показати більше стекових кадрів

# stackFrameAriaLabel
source: Stack Frame {0}, line {1}, {2}
uk: Стековий кадр {0}, рядок {1}, {2}

# threadAriaLabel
source: Thread {0} {1}
uk: Потік {0} {1}

# failedToLoadFrames
source: Failed to load stack frames: {0}
uk: Не вдалося завантажити стекові фрейми: {0}

# goToFile
source: Open File
uk: Відкрити файл

# stackFrameLocation
source: Line {0} column {1}
uk: Рядок {0} стовпець {1}

source: Stack Trace
uk: Слід викликів

# stackTraceLabel
source: {0}, line {1} in {2}
uk: {0}, рядок {1} у {2}

source: Set Next Statement
uk: Встановити наступну інструкцію

# allowBreakpointsEverywhere
source: Allow setting breakpoints in any file.
uk: Дозволити встановлення точок зупинки в будь-якому файлі.

# always
source: Always show debug in Status bar
uk: Завжди показувати налагодження в рядку стану

# breakWhenValueChanges
source: Break on Value Change
uk: Перервати при зміні значення

# breakWhenValueIsAccessed
source: Break on Value Access
uk: Перервати при доступі до значення

# breakWhenValueIsRead
source: Break on Value Read
uk: Перервати при читанні значення

source: Call Stack
uk: Стек викликів

# cancel
source: Cancel debugging.
uk: Скасувати налагодження.

# closeReadonlyTabsOnEnd
source: At the end of a debug session, all the read-only tabs associated with that session will be closed
uk: Наприкінці сесії налагодження всі вкладки лише для читання, пов'язані з цією сесією, будуть закриті.

# copyStackTrace
source: Copy Call Stack
uk: Копіювати стек викликів

source: Copy Value
uk: Копіювати значення

# debug.autoExpandLazyVariables
source: Controls whether variables that are lazily resolved, such as getters, are automatically resolved and expanded by the debugger.
uk: Контролює, чи змінні, які вирішуються ліниво, такі як геттери, автоматично вирішуються та розширюються відладчиком.

# debug.autoExpandLazyVariables.auto
source: When in screen reader optimized mode, automatically expand lazy variables.
uk: Коли в режимі оптимізації для екранних читалок, автоматично розгортайте ліниві змінні.

# debug.autoExpandLazyVariables.off
source: Never automatically expand lazy variables.
uk: Ніколи автоматично не розширюйте ліниві змінні.

# debug.autoExpandLazyVariables.on
source: Always automatically expand lazy variables.
uk: Завжди автоматично розширювати ліниві змінні.

# debug.confirmOnExit
source: Controls whether to confirm when the window closes if there are active debug sessions.
uk: Контролює, чи підтверджувати закриття вікна, якщо є активні сеанси налагодження.

# debug.confirmOnExit.always
source: Always confirm if there are debug sessions.
uk: Завжди підтверджуйте, чи є сеанси налагодження.

# debug.confirmOnExit.never
source: Never confirm.
uk: Ніколи не підтверджуйте.

# debug.console.acceptSuggestionOnEnter
source: Controls whether suggestions should be accepted on Enter in the Debug Console. Enter is also used to evaluate whatever is typed in the Debug Console.
uk: Контролює, чи слід приймати пропозиції при натисканні Enter у Консолі налагодження. Enter також використовується для оцінки всього, що введено в Консолі налагодження.

# debug.console.closeOnEnd
source: Controls if the Debug Console should be automatically closed when the debug session ends.
uk: Контролює, чи має Дебаг Консоль автоматично закриватися, коли закінчується сесія налагодження.

# debug.console.collapseIdenticalLines
source: Controls if the Debug Console should collapse identical lines and show a number of occurrences with a badge.
uk: Контролює, чи має Консоль налагодження згортати ідентичні рядки та показувати кількість появ з бейджем.

# debug.console.fontFamily
source: Controls the font family in the Debug Console.
uk: Контролює сімейство шрифтів у Консолі налагодження.

# debug.console.fontSize
source: Controls the font size in pixels in the Debug Console.
uk: Контролює розмір шрифту в пікселях у Консолі налагодження.

# debug.console.historySuggestions
source: Controls if the Debug Console should suggest previously typed input.
uk: Контролює, чи має Консоль налагодження пропонувати раніше введений текст.

# debug.console.lineHeight
source: Controls the line height in pixels in the Debug Console. Use 0 to compute the line height from the font size.
uk: Контролює висоту рядка в пікселях у Консолі налагодження. Використовуйте 0, щоб обчислити висоту рядка з розміру шрифту.

# debug.console.maximumLines
source: Controls the maximum number of lines in the Debug Console.
uk: Контролює максимальну кількість рядків у консолі налагодження.

# debug.console.wordWrap
source: Controls if the lines should wrap in the Debug Console.
uk: Контролює, чи повинні рядки обгортатися в консолі налагодження.

# debug.disassemblyView.showSourceCode
source: Show Source Code in Disassembly View.
uk: Показати вихідний код у вигляді дизасемблера.

# debug.enableStatusBarColor
source: Color of the Status bar when debugger is active.
uk: Колір панелі стану, коли відладчик активний.

# debug.focusEditorOnBreak
source: Controls whether the editor should be focused when the debugger breaks.
uk: Контролює, чи має бути сфокусований редактор, коли відбувається зупинка відладчика.

# debug.focusWindowOnBreak
source: Controls whether the workbench window should be focused when the debugger breaks.
uk: Контролює, чи повинно вікно робочої області бути в фокусі, коли відладчик зупиняється.

# debug.gutterMiddleClickAction.conditionalBreakpoint
source: Add Conditional Breakpoint.
uk: Додати умовну точку зупинки.

# debug.gutterMiddleClickAction.logpoint
source: Add Logpoint.
uk: Додати Logpoint.

# debug.gutterMiddleClickAction.none
source: Don't perform any action.
uk: Не виконуйте жодних дій.

# debug.gutterMiddleClickAction.triggeredBreakpoint
source: Add Triggered Breakpoint.
uk: Додати спрацьований контрольний пункт.

# debug.hideLauncherWhileDebugging
source: Hide 'Start Debugging' control in title bar of 'Run and Debug' view while debugging is active. Only relevant when {0} is not `docked`.
uk: Сховати елемент управління 'Почати налагодження' в заголовку панелі перегляду 'Запустити та налагодити', поки налагодження активне. Важливо лише, коли {0} не `прикріплено`.

# debug.hideSlowPreLaunchWarning
source: Hide the warning shown when a `preLaunchTask` has been running for a while.
uk: Сховати попередження, яке відображається, коли `preLaunchTask` виконується протягом деякого часу.

# debug.onTaskErrors
source: Controls what to do when errors are encountered after running a preLaunchTask.
uk: Контролює, що робити, коли виникають помилки після виконання preLaunchTask.

# debug.saveBeforeStart
source: Controls what editors to save before starting a debug session.
uk: Контролює, які редактори зберігати перед початком сеансу налагодження.

# debug.saveBeforeStart.allEditorsInActiveGroup
source: Save all editors in the active group before starting a debug session.
uk: Збережіть усіх редакторів у активній групі перед початком сеансу налагодження.

# debug.saveBeforeStart.nonUntitledEditorsInActiveGroup
source: Save all editors in the active group except untitled ones before starting a debug session.
uk: Збережіть усіх редакторів у активній групі, крім неназваних, перед початком сеансу налагодження.

# debug.saveBeforeStart.none
source: Don't save any editors before starting a debug session.
uk: Не зберігайте жодних редакторів перед початком сесії налагодження.

# debug.terminal.clearBeforeReusing
source: Before starting a new debug session in an integrated or external terminal, clear the terminal.
uk: Перед початком нової сесії налагодження в інтегрованому або зовнішньому терміналі очистіть термінал.

# debugAnyway
source: Ignore task errors and start debugging.
uk: Ігноруйте помилки завдань і почніть налагодження.

# debugCategory
source: Debug
uk: Виправлення помилок

# debugConfigurationTitle
source: Debug
uk: Виправлення помилок

# debugPanel
source: Debug Console
uk: Консоль налагодження

# debugToolBar.commandCenter
source: `(Experimental)` Show debug toolbar in the command center.
uk: `(Експериментальний)` Показати панель налагодження в командному центрі.

# debugToolBar.docked
source: Show debug toolbar only in debug views.
uk: Показувати панель налагодження лише в режимі налагодження.

# debugToolBar.floating
source: Show debug toolbar in all views.
uk: Показати панель налагодження у всіх поданнях.

# debugToolBar.hidden
source: Do not show debug toolbar.
uk: Не показувати панель налагодження.

source: Disassembly
uk: Розбирання

# editWatchExpression
source: Edit Expression
uk: Редагувати вираз

# gutterMiddleClickAction
source: Controls the action to perform when clicking the editor gutter with the middle mouse button.
uk: Контролює дію, яку потрібно виконати при натисканні на край редактора середньою кнопкою миші.

source: Inline Breakpoint
uk: Вбудований контрольний пункт

# inlineValues
source: Show variable values inline in editor while debugging.
uk: Показувати значення змінних в рядку в редакторі під час налагодження.

# inlineValues.focusNoScroll
source: Show variable values inline in editor while debugging when the language supports inline value locations.
uk: Показувати значення змінних в рядку в редакторі під час налагодження, коли мова підтримує розташування значень в рядку.

# inlineValues.off
source: Never show variable values inline in editor while debugging.
uk: Ніколи не показуйте значення змінних в рядку в редакторі під час налагодження.

# inlineValues.on
source: Always show variable values inline in editor while debugging.
uk: Завжди показувати значення змінних в рядку в редакторі під час налагодження.

source: Jump to Cursor
uk: Перейти до курсора

# launch
source: Global debug launch configuration. Should be used as an alternative to 'launch.json' that is shared across workspaces.
uk: Глобальна конфігурація запуску для налагодження. Слід використовувати як альтернативу 'launch.json', яка спільна для робочих просторів.

source: Loaded Scripts
uk: Завантажені скрипти

# mRun
source: &&Run
uk: &&Запустити

# miAddConfiguration
source: A&&dd Configuration...
uk: Д&&одати конфігурацію...

# miContinue
source: &&Continue
uk: &&Продовжити

# miInlineBreakpoint
source: Inline Breakp&&oint
uk: Вбудована &&точка зупинки

# miInstallAdditionalDebuggers
source: &&Install Additional Debuggers...
uk: &&Встановити додаткові налагоджувачі...

# miNewBreakpoint
source: &&New Breakpoint
uk: &&Нова точка зупинки

# miRestart Debugging
source: &&Restart Debugging
uk: &&Перезапустити налагодження

# miRun
source: Run &&Without Debugging
uk: Запустити &&без відлагодження

# miStartDebugging
source: &&Start Debugging
uk: &&Почати налагодження

# miStepInto
source: Step &&Into
uk: Крок &&в

# miStepOut
source: Step O&&ut
uk: Крок н&&азад

# miStepOver
source: Step &&Over
uk: Крок &&над

# miStopDebugging
source: &&Stop Debugging
uk: &&Зупинити налагодження

# miToggleBreakpoint
source: Toggle Breakpoint
uk: Перемикання Точки зупинки

# miToggleDebugConsole
source: De&&bug Console
uk: &&Консоль налагодження

# miViewRun
source: &&Run
uk: &&Запустити

# never
source: Never show debug in Status bar
uk: Ніколи не показувати налагодження в рядку стану

# onFirstSessionStart
source: Show debug in Status bar only after debug was started for the first time
uk: Показувати налагодження в рядку стану лише після того, як налагодження було розпочато вперше

# openDebug
source: Controls when the debug view should open.
uk: Контролює, коли має відкритися режим налагодження.

# openExplorerOnEnd
source: Automatically open the explorer view at the end of a debug session.
uk: Автоматично відкривати вигляд провідника в кінці сеансу налагодження.

# prompt
source: Prompt user.
uk: Запросити користувача.

# removeWatchExpression
source: Remove Expression
uk: Видалити вираз

# run
source: Run or Debug...
uk: Запустити або налагодити...

source: Run and Debug
uk: Запустити та налагодити

# runMenu
source: Run
uk: Запустити

source: Set Value
uk: Встановити значення
