Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_searchEditor.xlf
Languages: uk

# label.excludes
source: Search Exclude Patterns
uk: Шукати виключення шаблонів

# label.includes
source: Search Include Patterns
uk: Шукати шаблони включення

# moreSearch
source: Toggle Search Details
uk: Переключити деталі пошуку

source: Run Search
uk: Запустити пошук

# searchEditor
source: Search
uk: Пошук

# searchResultItem
source: Matched {0} at {1} in file {2}
uk: Знайдено {0} в {1} у файлі {2}

# searchScope.excludes
source: files to exclude
uk: файли для виключення

# searchScope.includes
source: files to include
uk: файли для включення

# textInputBoxBorder
source: Search editor text input box border.
uk: Кордон текстового поля вводу редактора пошуку.

# promptOpenWith.searchEditor.displayName
source: Search Editor
uk: Редактор пошуку

# search
source: Search Editor
uk: Редактор пошуку

# search.action.focusFilesToExclude
source: Focus Search Editor Files to Exclude
uk: Фокус пошуку Редактор файлів для виключення

# search.action.focusFilesToInclude
source: Focus Search Editor Files to Include
uk: Сфокусуватися на файлах редактора пошуку для включення

# search.action.focusQueryEditorWidget
source: Focus Search Editor Input
uk: Фокус на редакторі пошуку вводу

# search.openNewEditor
source: Open New Search Editor
uk: Відкрити новий редактор пошуку

# search.openNewEditorToSide
source: Open New Search Editor to the Side
uk: Відкрити новий редактор пошуку збоку

# search.openNewSearchEditor
source: New Search Editor
uk: Новий редактор пошуку

# search.openResultsInEditor
source: Open Results in Editor
uk: Відкрити результати в редакторі

# search.openSearchEditor
source: Open Search Editor
uk: Відкрити редактор пошуку

# search.rerunSearchInEditor
source: Search Again
uk: Шукати знову

source: Search Editor
uk: Пошук

# searchEditor.action.decreaseSearchEditorContextLines
source: Decrease Context Lines
uk: Зменшити контекстні рядки

# searchEditor.action.increaseSearchEditorContextLines
source: Increase Context Lines
uk: Збільшити контекстні рядки

# searchEditor.action.selectAllSearchEditorMatches
source: Select All Matches
uk: Вибрати всі збіги

# searchEditor.action.toggleSearchEditorCaseSensitive
source: Toggle Match Case
uk: Перемикати регістр

# searchEditor.action.toggleSearchEditorContextLines
source: Toggle Context Lines
uk: Переключити контекстні рядки

# searchEditor.action.toggleSearchEditorRegex
source: Toggle Use Regular Expression
uk: Перемкнути Використовувати Регулярний Вираз

# searchEditor.action.toggleSearchEditorWholeWord
source: Toggle Match Whole Word
uk: Перемикати відповідність цілого слова

# searchEditor.deleteResultBlock
source: Delete File Results
uk: Видалити результати файлу

# searchEditorLabelIcon
source: Icon of the search editor label.
uk: Іконка мітки редактора пошуку.

# searchTitle
source: Search
uk: Пошук

# searchTitle.withQuery
source: Search: {0}
uk: Пошук: {0}

# invalidQueryStringError
source: All backslashes in Query string must be escaped (\\)
uk: Усі зворотні слеші в рядку запиту повинні бути екрановані (\\)

source: No Results
uk: Немає результатів

# numFiles
source: {0} files
uk: {0} файлів

# numResults
source: {0} results
uk: {0} результати

# oneFile
source: 1 file
uk: 1 файл

# oneResult
source: 1 result
uk: 1 результат

# searchMaxResultsWarning
source: The result set only contains a subset of all matches. Be more specific in your search to narrow down the results.
uk: Набір результатів містить лише підмножину всіх збігів. Будьте більш конкретними у своєму пошуку, щоб звузити результати.
