Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_bulkEdit.xlf
Languages: uk

# areYouSureQuiteBulkEdit.detail
source: '{0}' is in progress.
uk: '{0}' в процесі.

source: Change &&Workspace
uk: Змінити &&Робочий простір

# changeWorkspace.message
source: Are you sure you want to change the workspace?
uk: Ви впевнені, що хочете змінити робочий простір?

# closeTheWindow
source: &&Close Window
uk: &&Закрити Вікно

# closeTheWindow.message
source: Are you sure you want to close the window?
uk: Ви впевнені, що хочете закрити вікно?

source: File operation
uk: Операція з файлом

# nothing
source: Made no edits
uk: Не було внесено жодних правок

source: &&Quit
uk: &&Вихід

# quit.message
source: Are you sure you want to quit?
uk: Ви впевнені, що хочете вийти?

# refactoring.autoSave
source: Controls if files that were part of a refactoring are saved automatically
uk: Контролює, чи файли, які були частиною рефакторингу, зберігаються автоматично

# reloadTheWindow
source: &&Reload Window
uk: &&Перезавантажити Вікно

# reloadTheWindow.message
source: Are you sure you want to reload the window?
uk: Ви впевнені, що хочете перезавантажити вікно?

# summary.0
source: Made no edits
uk: Не було внесено жодних змін

# summary.n0
source: Made {0} text edits in one file
uk: Зроблено {0} текстових редагувань в одному файлі

# summary.nm
source: Made {0} text edits in {1} files
uk: Зроблено {0} редагувань тексту в {1} файлах

# summary.textFiles
source: Made {0} text edits in {1} files, also created or deleted {2} files
uk: Зроблено {0} текстових змін у {1} файлах, також створено або видалено {2} файлів

source: Workspace Edit
uk: Редагування робочого простору

# Discard
source: Discard Refactoring
uk: Відкинути рефакторинг

# apply
source: Apply Refactoring
uk: Застосувати рефакторинг

# cat
source: Refactor Preview
uk: Перегляд рефакторингу

source: &&Continue
uk: &&Продовжити

# detail
source: Press 'Continue' to discard the previous refactoring and continue with the current refactoring.
uk: Натисніть 'Продовжити', щоб скасувати попереднє рефакторинг і продовжити з поточним рефакторингом.

# groupByFile
source: Group Changes By File
uk: Зміни групи за файлом

# groupByType
source: Group Changes By Type
uk: Зміни групи за типом

# overlap
source: Another refactoring is being previewed.
uk: Ще одне рефакторингування попередньо переглядається.

# panel
source: Refactor Preview
uk: Перегляд рефакторингу

# refactorPreviewViewIcon
source: View icon of the refactor preview view.
uk: Переглянути значок попереднього перегляду рефакторингу.

# toogleSelection
source: Toggle Change
uk: Перемикання зміни

# cancel
source: Discard
uk: Видалити

# conflict.1
source: Cannot apply refactoring because '{0}' has changed in the meantime.
uk: Не вдається застосувати рефакторинг, оскільки '{0}' змінився тим часом.

# conflict.N
source: Cannot apply refactoring because {0} other files have changed in the meantime.
uk: Не можна застосувати рефакторинг, оскільки {0} інших файлів змінилися в цей час.

# empty.msg
source: Invoke a code action, like rename, to see a preview of its changes here.
uk: Викличте дію коду, наприклад, перейменування, щоб побачити попередній перегляд її змін тут.

# ok
source: Apply
uk: Застосувати

# default
source: Other
uk: Інше

# aria.create
source: Creating {0}
uk: Створення {0}

# aria.createAndEdit
source: Creating {0}, also making text edits
uk: Створення {0}, також редагування тексту

# aria.del
source: line {0}, removing {1}
uk: рядок {0}, видалення {1}

# aria.delete
source: Deleting {0}
uk: Видалення {0}

# aria.deleteAndEdit
source: Deleting {0}, also making text edits
uk: Видалення {0}, також внесення текстових правок

# aria.editOnly
source: {0}, making text edits
uk: {0}, вносячи зміни в текст

# aria.insert
source: line {0}, inserting {1}
uk: рядок {0}, вставка {1}

# aria.rename
source: Renaming {0} to {1}
uk: Перейменування {0} на {1}

# aria.renameAndEdit
source: Renaming {0} to {1}, also making text edits
uk: Перейменування {0} на {1}, також внесення текстових правок

# aria.replace
source: line {0}, replacing {1} with {2}
uk: рядок {0}, замінюючи {1} на {2}

source: Bulk Edit
uk: Масове редагування

# detail.create
source: (creating)
uk: (створення)

# detail.del
source: (deleting)
uk: (видалення)

# detail.rename
source: (renaming)
uk: (перейменування)
