Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# workbench.activityBar.location.bottom
source: Show the Activity Bar at the bottom of the Primary and Secondary Side Bars.
uk: Показати панель активності внизу основної та вторинної бічних панелей.

# workbench.activityBar.location.default
source: Show the Activity Bar on the side of the Primary Side Bar and on top of the Secondary Side Bar.
uk: Показати панель активності з боку основної бічної панелі та зверху вторинної бічної панелі.

# workbench.activityBar.location.hide
source: Hide the Activity Bar in the Primary and Secondary Side Bars.
uk: Сховати панель активності в основних і вторинних бічних панелях.

# workbench.activityBar.location.top
source: Show the Activity Bar on top of the Primary and Secondary Side Bars.
uk: Показати панель активності вгорі основної та вторинної бокових панелей.

# workbench.editor.doubleClickTabToToggleEditorGroupSizes.expand
source: The editor group takes as much space as possible by making all other editor groups as small as possible.
uk: Група редакторів займає якомога більше місця, роблячи всі інші групи редакторів якомога меншими.

# workbench.editor.doubleClickTabToToggleEditorGroupSizes.maximize
source: All other editor groups are hidden and the current editor group is maximized to take up the entire editor area.
uk: Усі інші групи редакторів приховані, а поточна група редакторів розгорнута на всю область редактора.

# workbench.editor.doubleClickTabToToggleEditorGroupSizes.off
source: No editor group is resized when double clicking on a tab.
uk: Жодна група редакторів не змінює розмір при двократному клацанні на вкладці.

# workbench.editor.editorActionsLocation.default
source: Show editor actions in the window title bar when {0} is set to {1}. Otherwise, editor actions are shown in the editor tab bar.
uk: Показувати дії редактора в заголовку вікна, коли {0} встановлено на {1}. В іншому випадку дії редактора відображаються на панелі вкладок редактора.

# workbench.editor.editorActionsLocation.hidden
source: Editor actions are not shown.
uk: Дії редактора не відображаються.

# workbench.editor.editorActionsLocation.titleBar
source: Show editor actions in the window title bar. If {0} is set to {1}, editor actions are hidden.
uk: Показати дії редактора в рядку заголовка вікна. Якщо {0} встановлено на {1}, дії редактора приховані.

# workbench.editor.empty.hint
source: Controls if the empty editor text hint should be visible in the editor.
uk: Контролює, чи має бути видимим підказка тексту порожнього редактора в редакторі.

# workbench.editor.historyBasedLanguageDetection
source: Enables use of editor history in language detection. This causes automatic language detection to favor languages that have been recently opened and allows for automatic language detection to operate with smaller inputs.
uk: Дозволяє використовувати історію редактора в детекції мови. Це призводить до того, що автоматична детекція мови віддає перевагу мовам, які були нещодавно відкриті, і дозволяє автоматичній детекції мови працювати з меншими вхідними даними.

# workbench.editor.label.dirname
source: `${dirname}`: name of the folder in which the file is located (e.g. `WORKSPACE_FOLDER/folder/file.txt -> folder`).
uk: `${dirname}`: назва папки, в якій знаходиться файл (наприклад, `WORKSPACE_FOLDER/folder/file.txt -> folder`).

# workbench.editor.label.enabled
source: Controls whether the custom workbench editor labels should be applied.
uk: Контролює, чи слід застосовувати користувацькі мітки редактора робочої області.

# workbench.editor.label.extname
source: `${extname}`: the file extension (e.g. `WORKSPACE_FOLDER/folder/file.txt -> txt`).
uk: `${extname}`: розширення файлу (наприклад, `WORKSPACE_FOLDER/folder/file.txt -> txt`).

# workbench.editor.label.filename
source: `${filename}`: name of the file without the file extension (e.g. `WORKSPACE_FOLDER/folder/file.txt -> file`).
uk: `${filename}`: назва файлу без розширення (наприклад, `WORKSPACE_FOLDER/folder/file.txt -> file`).

# workbench.editor.label.nthdirname
source: `${dirname(N)}`: name of the nth parent folder in which the file is located (e.g. `N=2: WORKSPACE_FOLDER/static/folder/file.txt -> WORKSPACE_FOLDER`). Folders can be picked from the start of the path by using negative numbers (e.g. `N=-1: WORKSPACE_FOLDER/folder/file.txt -> WORKSPACE_FOLDER`). If the __Item__ is an absolute pattern path, the first folder (`N=-1`) refers to the first folder in the absolute path, otherwise it corresponds to the workspace folder.
uk: `${dirname(N)}`: ім'я n-го батьківського каталогу, в якому знаходиться файл (наприклад, `N=2: WORKSPACE_FOLDER/static/folder/file.txt -> WORKSPACE_FOLDER`). Каталоги можна вибирати з початку шляху, використовуючи від'ємні числа (наприклад, `N=-1: WORKSPACE_FOLDER/folder/file.txt -> WORKSPACE_FOLDER`). Якщо __Item__ є абсолютним шляхом до шаблону, перший каталог (`N=-1`) відноситься до першого каталогу в абсолютному шляху, в іншому випадку він відповідає каталогу робочого простору.

# workbench.editor.label.nthextname
source: `${extname(N)}`: the nth extension of the file separated by '.' (e.g. `N=2: WORKSPACE_FOLDER/folder/file.ext1.ext2.ext3 -> ext1`). Extension can be picked from the start of the extension by using negative numbers (e.g. `N=-1: WORKSPACE_FOLDER/folder/file.ext1.ext2.ext3 -> ext2`).
uk: `${extname(N)}`: n-та розширення файлу, розділене '.' (наприклад, `N=2: WORKSPACE_FOLDER/folder/file.ext1.ext2.ext3 -> ext1`). Розширення можна вибрати з початку розширення, використовуючи від'ємні числа (наприклад, `N=-1: WORKSPACE_FOLDER/folder/file.ext1.ext2.ext3 -> ext2`).

# workbench.editor.label.patterns
source: Controls the rendering of the editor label. Each __Item__ is a pattern that matches a file path. Both relative and absolute file paths are supported. The relative path must include the WORKSPACE_FOLDER (e.g `WORKSPACE_FOLDER/src/**.tsx` or `*/src/**.tsx`). Absolute patterns must start with a `/`. In case multiple patterns match, the longest matching path will be picked. Each __Value__ is the template for the rendered editor when the __Item__ matches. Variables are substituted based on the context:
uk: Контролює рендеринг мітки редактора. Кожен __Item__ є шаблоном, який відповідає шляху до файлу. Підтримуються як відносні, так і абсолютні шляхи до файлів. Відносний шлях повинен включати WORKSPACE_FOLDER (наприклад, `WORKSPACE_FOLDER/src/**.tsx` або `*/src/**.tsx`). Абсолютні шаблони повинні починатися з `/`. У разі, якщо кілька шаблонів відповідають, буде обрано найдовший відповідний шлях. Кожен __Value__ є шаблоном для відрендереного редактора, коли __Item__ відповідає. Змінні підставляються на основі контексту:

# workbench.editor.label.template
source: The template which should be rendered when the pattern matches. May include the variables ${dirname}, ${filename} and ${extname}.
uk: Шаблон, який має бути відображений, коли шаблон збігається. Може містити змінні ${dirname}, ${filename} та ${extname}.

# workbench.editor.labelFormat.default
source: Show the name of the file. When tabs are enabled and two files have the same name in one group the distinguishing sections of each file's path are added. When tabs are disabled, the path relative to the workspace folder is shown if the editor is active.
uk: Показати назву файлу. Коли вкладки увімкнені і два файли мають однакову назву в одній групі, додаються відмінні частини шляху кожного файлу. Коли вкладки вимкнені, показується шлях відносно папки робочого простору, якщо редактор активний.

# workbench.editor.labelFormat.long
source: Show the name of the file followed by its absolute path.
uk: Показати назву файлу, за якою слідує його абсолютний шлях.

# workbench.editor.labelFormat.medium
source: Show the name of the file followed by its path relative to the workspace folder.
uk: Показати назву файлу, за якою слідує його шлях відносно папки робочого простору.

# workbench.editor.labelFormat.short
source: Show the name of the file followed by its directory name.
uk: Показати назву файлу, за якою йде назва його каталогу.

# workbench.editor.languageDetection
source: Controls whether the language in a text editor is automatically detected unless the language has been explicitly set by the language picker. This can also be scoped by language so you can specify which languages you do not want to be switched off of. This is useful for languages like Markdown that often contain other languages that might trick language detection into thinking it's the embedded language and not Markdown.
uk: Контролює, чи мова в текстовому редакторі автоматично визначається, якщо мова не була явно встановлена за допомогою вибору мови. Це також може бути обмежено за мовами, тому ви можете вказати, які мови не хочете, щоб були вимкнені. Це корисно для мов, таких як Markdown, які часто містять інші мови, що можуть обманути виявлення мови, змушуючи його думати, що це вбудована мова, а не Markdown.

# workbench.editor.navigationScopeDefault
source: Navigate across all opened editors and editor groups.
uk: Переміщуйтеся між усіма відкритими редакторами та групами редакторів.

# workbench.editor.navigationScopeEditor
source: Navigate only in the active editor.
uk: Переміщуйтеся лише в активному редакторі.

# workbench.editor.navigationScopeEditorGroup
source: Navigate only in editors of the active editor group.
uk: Переміщуйтеся лише в редакторах активної групи редакторів.

# workbench.editor.pinnedTabSizing.compact
source: A pinned tab will show in a compact form with only icon or first letter of the editor name.
uk: Закріплена вкладка буде відображатися в компактному вигляді лише з іконкою або першою літерою назви редактора.

# workbench.editor.pinnedTabSizing.normal
source: A pinned tab inherits the look of non pinned tabs.
uk: Закріплена вкладка успадковує вигляд незакріплених вкладок.

# workbench.editor.pinnedTabSizing.shrink
source: A pinned tab shrinks to a compact fixed size showing parts of the editor name.
uk: Закріплена вкладка зменшується до компактного фіксованого розміру, показуючи частини назви редактора.

# workbench.editor.pinnedTabsOnSeparateRow
source: When enabled, displays pinned tabs in a separate row above all other tabs. This value is ignored when {0} is not set to {1}.
uk: Коли увімкнено, відображає закріплені вкладки в окремому рядку над усіма іншими вкладками. Це значення ігнорується, коли {0} не встановлено на {1}.

# workbench.editor.preferBasedLanguageDetection
source: When enabled, a language detection model that takes into account editor history will be given higher precedence.
uk: Коли увімкнено, модель виявлення мови, яка враховує історію редагування, матиме вищий пріоритет.

# workbench.editor.preventPinnedEditorClose
source: Controls whether pinned editors should close when keyboard or middle mouse click is used for closing.
uk: Контролює, чи повинні закриватися закріплені редактори, коли для закриття використовується клавіатура або середня кнопка миші.

# workbench.editor.preventPinnedEditorClose.always
source: Always prevent closing the pinned editor when using mouse middle click or keyboard.
uk: Завжди запобігайте закриттю закріпленого редактора при використанні середнього клацання миші або клавіатури.

# workbench.editor.preventPinnedEditorClose.never
source: Never prevent closing a pinned editor.
uk: Ніколи не заважайте закриттю закріпленого редактора.

# workbench.editor.preventPinnedEditorClose.onlyKeyboard
source: Prevent closing the pinned editor when using the keyboard.
uk: Запобігти закриттю закріпленого редактора при використанні клавіатури.

# workbench.editor.preventPinnedEditorClose.onlyMouse
source: Prevent closing the pinned editor when using mouse middle click.
uk: Запобігти закриттю закріпленого редактора при використанні середнього клацання миші.

# workbench.editor.showLanguageDetectionHints
source: When enabled, shows a Status bar Quick Fix when the editor language doesn't match detected content language.
uk: Коли увімкнено, показує швидке виправлення на панелі стану, коли мова редактора не відповідає виявленій мові вмісту.

# workbench.editor.showLanguageDetectionHints.editors
source: Show in untitled text editors
uk: Показати в неназваних текстових редакторах

# workbench.editor.showLanguageDetectionHints.notebook
source: Show in notebook editors
uk: Показати в редакторах нотаток

# workbench.editor.showTabs.multiple
source: Each editor is displayed as a tab in the editor title area.
uk: Кожен редактор відображається як вкладка в області заголовка редактора.

# workbench.editor.showTabs.none
source: The editor title area is not displayed.
uk: Область заголовка редактора не відображається.

# workbench.editor.showTabs.single
source: The active editor is displayed as a single large tab in the editor title area.
uk: Активний редактор відображається як одна велика вкладка в області заголовка редактора.

# workbench.editor.splitInGroupLayoutHorizontal
source: Editors are positioned from left to right.
uk: Редактори розташовані зліва направо.

# workbench.editor.splitInGroupLayoutVertical
source: Editors are positioned from top to bottom.
uk: Редактори розташовані зверху вниз.

# workbench.editor.splitSizingAuto
source: Splits the active editor group to equal parts, unless all editor groups are already in equal parts. In that case, splits all the editor groups to equal parts.
uk: Розділяє активну групу редакторів на рівні частини, якщо всі групи редакторів ще не розділені на рівні частини. У цьому випадку розділяє всі групи редакторів на рівні частини.

# workbench.editor.splitSizingDistribute
source: Splits all the editor groups to equal parts.
uk: Розділяє всі групи редактора на рівні частини.

# workbench.editor.splitSizingSplit
source: Splits the active editor group to equal parts.
uk: Розділяє активну групу редакторів на рівні частини.

# workbench.editor.tabActionCloseVisibility
source: Controls the visibility of the tab close action button.
uk: Контролює видимість кнопки закриття вкладки.

# workbench.editor.tabActionUnpinVisibility
source: Controls the visibility of the tab unpin action button.
uk: Контролює видимість кнопки дії відкріплення вкладки.

# workbench.editor.tabHeight
source: Controls the height of editor tabs. Also applies to the title control bar when {0} is not set to {1}.
uk: Контролює висоту вкладок редактора. Також застосовується до панелі заголовка, коли {0} не встановлено на {1}.

# workbench.editor.tabSizing.fit
source: Always keep tabs large enough to show the full editor label.
uk: Завжди тримайте вкладки достатньо великими, щоб показати повну назву редактора.

# workbench.editor.tabSizing.fixed
source: Make all tabs the same size, while allowing them to get smaller when the available space is not enough to show all tabs at once.
uk: Зробіть всі вкладки однакового розміру, дозволяючи їм зменшуватися, коли доступного простору недостатньо, щоб відобразити всі вкладки одночасно.

# workbench.editor.tabSizing.shrink
source: Allow tabs to get smaller when the available space is not enough to show all tabs at once.
uk: Дозволити вкладкам зменшуватися, коли доступного простору недостатньо, щоб показати всі вкладки одночасно.

# workbench.editor.tabSizingFixedMaxWidth
source: Controls the maximum width of tabs when {0} size is set to {1}.
uk: Контролює максимальну ширину вкладок, коли розмір {0} встановлено на {1}.

# workbench.editor.tabSizingFixedMinWidth
source: Controls the minimum width of tabs when {0} size is set to {1}.
uk: Контролює мінімальну ширину вкладок, коли розмір {0} встановлено на {1}.

# workbench.editor.titleScrollbarSizing.default
source: The default size.
uk: Розмір за замовчуванням.

# workbench.editor.titleScrollbarSizing.large
source: Increases the size, so it can be grabbed more easily with the mouse.
uk: Збільшує розмір, щоб його можна було легше захопити мишкою.

# workbench.editor.titleScrollbarVisibility.auto
source: The horizontal scrollbar will be visible only when necessary.
uk: Горизонтальна смуга прокрутки буде видима лише за необхідності.

# workbench.editor.titleScrollbarVisibility.hidden
source: The horizontal scrollbar will always be hidden.
uk: Горизонтальна смуга прокрутки завжди буде прихована.

# workbench.editor.titleScrollbarVisibility.visible
source: The horizontal scrollbar will always be visible.
uk: Горизонтальна смуга прокрутки завжди буде видимою.

# workbench.editor.untitled.labelFormat.content
source: The name of the untitled file is derived from the contents of its first line unless it has an associated file path. It will fallback to the name in case the line is empty or contains no word characters.
uk: Ім'я файлу без назви походить з вмісту його першого рядка, якщо у нього немає асоційованого шляху до файлу. У разі, якщо рядок порожній або не містить жодних буквено-цифрових символів, буде використано ім'я за замовчуванням.

# workbench.editor.untitled.labelFormat.name
source: The name of the untitled file is not derived from the contents of the file.
uk: Ім'я неназваного файлу не походить з вмісту файлу.

# workbench.fontAliasing.antialiased
source: Smooth the font on the level of the pixel, as opposed to the subpixel. Can make the font appear lighter overall.
uk: Згладьте шрифт на рівні пікселя, на відміну від субпікселя. Це може зробити шрифт загалом легшим.

# workbench.fontAliasing.auto
source: Applies `default` or `antialiased` automatically based on the DPI of displays.
uk: Застосовує `default` або `antialiased` автоматично на основі DPI дисплеїв.

# workbench.fontAliasing.default
source: Sub-pixel font smoothing. On most non-retina displays this will give the sharpest text.
uk: Субпіксельне згладжування шрифтів. На більшості дисплеїв без ретини це забезпечить найрізкіший текст.

# workbench.fontAliasing.none
source: Disables font smoothing. Text will show with jagged sharp edges.
uk: Вимикає згладжування шрифтів. Текст буде відображатися з рваними гострими краями.

# workbench.hover.delay
source: Controls the delay in milliseconds after which the hover is shown for workbench items (ex. some extension provided tree view items). Already visible items may require a refresh before reflecting this setting change.
uk: Контролює затримку в мілісекундах, після якої відображається підказка для елементів робочого столу (наприклад, деякі елементи дерева, надані розширенням). Вже видимі елементи можуть вимагати оновлення перед відображенням зміни цього налаштування.

# workbench.panel.opensMaximized.always
source: Always maximize the panel when opening it.
uk: Завжди розгортайте панель на повний екран при її відкритті.

# workbench.panel.opensMaximized.never
source: Never maximize the panel when opening it.
uk: Ніколи не розгортайте панель на весь екран при її відкритті.

# workbench.panel.opensMaximized.preserve
source: Open the panel to the state that it was in, before it was closed.
uk: Відкрийте панель у тому стані, в якому вона була, перед тим як була закрита.

# workbench.panel.output
source: Output view
uk: Вид виводу

# workbench.quickOpen.preserveInput
source: Controls whether the last typed input to Quick Open should be restored when opening it the next time.
uk: Контролює, чи слід відновити останній введений текст у Quick Open при наступному його відкритті.

# workbench.reduceMotion
source: Controls whether the workbench should render with fewer animations.
uk: Контролює, чи повинна робоча панель відображатися з меншою кількістю анімацій.

# workbench.reduceMotion.auto
source: Render with reduced motion based on OS configuration.
uk: Відображати з зменшеним рухом на основі конфігурації ОС.

# workbench.reduceMotion.off
source: Do not render with reduced motion
uk: Не відображати з зменшеним рухом

# workbench.reduceMotion.on
source: Always render with reduced motion.
uk: Завжди відображати з зменшеною анімацією.

# workbench.secondarySideBar.defaultVisibility.hidden
source: The secondary side bar is hidden by default.
uk: Бічна панель вторинного рівня за замовчуванням прихована.

# workbench.secondarySideBar.defaultVisibility.maximized
source: The secondary side bar is visible and maximized by default.
uk: Бічна панель вторинного рівня видима та розгорнута за замовчуванням.

# workbench.secondarySideBar.defaultVisibility.maximizedInWorkspace
source: The secondary side bar is visible and maximized by default if a workspace is opened.
uk: Бічна панель вторинного рівня видима і розгорнута за замовчуванням, якщо відкрито робоче середовище.

# workbench.secondarySideBar.defaultVisibility.visible
source: The secondary side bar is visible by default.
uk: Бічна панель вторинного рівня видима за замовчуванням.

# workbench.secondarySideBar.defaultVisibility.visibleInWorkspace
source: The secondary side bar is visible by default if a workspace is opened.
uk: Бічна панель вторинного рівня видима за замовчуванням, якщо відкрито робочий простір.

# workbench.view.showQuietly
source: If an extension requests a hidden view to be shown, display a clickable status bar indicator instead.
uk: Якщо розширення запитує показати прихований вигляд, замість цього відобразіть клікабельний індикатор статусу.

# wrapTabs
source: Controls whether tabs should be wrapped over multiple lines when exceeding available space or whether a scrollbar should appear instead. This value is ignored when {0} is not set to '{1}'.
uk: Контролює, чи повинні вкладки обгортатися на кілька рядків при перевищенні доступного простору, або чи повинен з'явитися прокрутка замість цього. Це значення ігнорується, коли {0} не встановлено на '{1}'.

# zenMode.centerLayout
source: Controls whether turning on Zen Mode also centers the layout.
uk: Контролює, чи ввімкнення режиму Zen також центрирує макет.

# zenMode.fullScreen
source: Controls whether turning on Zen Mode also puts the workbench into full screen mode.
uk: Контролює, чи ввімкнення режиму Zen також переводить верстак у повноекранний режим.

# zenMode.hideActivityBar
source: Controls whether turning on Zen Mode also hides the activity bar either at the left or right of the workbench.
uk: Контролює, чи ввімкнення режиму Zen також приховує панель активності зліва чи справа від робочого столу.

# zenMode.hideLineNumbers
source: Controls whether turning on Zen Mode also hides the editor line numbers.
uk: Контролює, чи ввімкнення режиму Zen також приховує номери рядків редактора.

# zenMode.hideStatusBar
source: Controls whether turning on Zen Mode also hides the status bar at the bottom of the workbench.
uk: Контролює, чи ввімкнення режиму Zen також приховує панель стану внизу робочої області.

# zenMode.restore
source: Controls whether a window should restore to Zen Mode if it was exited in Zen Mode.
uk: Контролює, чи вікно повинно відновитися в режимі Zen, якщо його було закрито в режимі Zen.

# zenMode.showTabs
source: Controls whether turning on Zen Mode should show multiple editor tabs, a single editor tab, or hide the editor title area completely.
uk: Контролює, чи має увімкнення режиму Zen показувати кілька вкладок редактора, одну вкладку редактора або повністю приховувати область заголовка редактора.

# zenMode.showTabs.multiple
source: Each editor is displayed as a tab in the editor title area.
uk: Кожен редактор відображається як вкладка в області заголовка редактора.

# zenMode.showTabs.none
source: The editor title area is not displayed.
uk: Область заголовка редактора не відображається.

# zenMode.showTabs.single
source: The active editor is displayed as a single large tab in the editor title area.
uk: Активний редактор відображається як одна велика вкладка в області заголовка редактора.

# zenMode.silentNotifications
source: Controls whether notifications do not disturb mode should be enabled while in Zen Mode. If true, only error notifications will pop out.
uk: Контролює, чи має бути увімкнено режим не турбувати під час Zen Mode. Якщо так, з'являтимуться лише сповіщення про помилки.

# zenModeConfigurationTitle
source: Zen Mode
uk: Режим Зен
