Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_timeline.xlf
Languages: uk

# files.openTimeline
source: Open Timeline
uk: Відкрити Хронологію

source: Filter Timeline
uk: Фільтр Хронології

# timeline.pageOnScroll
source: Controls whether the Timeline view will load the next page of items when you scroll to the end of the list.
uk: Контролює, чи буде перегляд Хронології завантажувати наступну сторінку елементів, коли ви прокручуєте до кінця списку.

# timeline.pageSize
source: The number of items to show in the Timeline view by default and when loading more items. Setting to `null` will automatically choose a page size based on the visible area of the Timeline view.
uk: Кількість елементів, які слід відображати в режимі Хронології за замовчуванням та під час завантаження додаткових елементів. Встановлення значення `null` автоматично вибере розмір сторінки на основі видимої області режиму Хронології.

# timelineConfigurationTitle
source: Timeline
uk: Хронологія

# timelineFilter
source: Icon for the filter timeline action.
uk: Іконка для дії фільтра часової шкали.

# timelineOpenIcon
source: Icon for the open timeline action.
uk: Іконка для дії відкритої часової шкали.

# timelineViewIcon
source: View icon of the timeline view.
uk: Переглянути значок вигляду хронології.

source: Refresh
uk: Оновити

source: Timeline
uk: Хронологія

# timeline.editorCannotProvideTimeline
source: The active editor cannot provide timeline information.
uk: Активний редактор не може надати інформацію про часову шкалу.

# timeline.loadMore
source: Load more
uk: Завантажити більше

# timeline.loading
source: Loading timeline for {0}...
uk: Завантаження хронології для {0}...

# timeline.loadingMore
source: Loading...
uk: Завантаження...

# timeline.noLocalHistoryYet
source: Local History will track recent changes as you save them unless the file has been excluded or is too large.
uk: Локальна історія буде відстежувати недавні зміни, поки ви їх зберігаєте, якщо файл не був виключений або не є занадто великим.

# timeline.noSCM
source: Source Control has not been configured.
uk: Систему контролю версій не було налаштовано.

# timeline.noTimelineInfo
source: No timeline information was provided.
uk: Не було надано інформації про терміни.

# timeline.noTimelineInfoFromEnabledSources
source: No filtered timeline information was provided.
uk: Не було надано інформації про відфільтрований хронологічний рядок.

# timeline.noTimelineSourcesEnabled
source: All timeline sources have been filtered out.
uk: Всі джерела хронології були відфільтровані.

# timeline.toggleFollowActiveEditorCommand.follow
source: Pin the Current Timeline
uk: Закріпити поточну часову шкалу

# timeline.toggleFollowActiveEditorCommand.unfollow
source: Unpin the Current Timeline
uk: Відкріпити поточну часову шкалу

# timelinePin
source: Icon for the pin timeline action.
uk: Іконка для дії на часовій шкалі з пінами.

# timelineRefresh
source: Icon for the refresh timeline action.
uk: Іконка для дії оновлення хронології.

# timelineUnpin
source: Icon for the unpin timeline action.
uk: Іконка для дії з відкріплення хронології.
