Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_themes.xlf
Languages: uk

# browseColorThemeInMarketPlace.label
source: Browse Color Themes in Marketplace
uk: Перегляд кольорових тем на ринку

# browseColorThemes
source: Browse Additional Color Themes...
uk: Переглянути додаткові кольорові теми...

# browseProductIconThemes
source: Browse Additional Product Icon Themes...
uk: Переглянути додаткові теми іконок продуктів...

# cannotToggle
source: Cannot toggle between light and dark themes when `{0}` is enabled in settings.
uk: Не можна перемикатися між світлою та темною темами, коли `{0}` увімкнено в налаштуваннях.

# defaultProductIconThemeLabel
source: Default
uk: За замовчуванням

# fileIconThemeCategory
source: file icon themes
uk: темы значков файлов

# generateColorTheme.label
source: Generate Color Theme From Current Settings
uk: Генерувати кольорову тему з поточних налаштувань

# goToSetting
source: Open Settings
uk: Відкрити Налаштування

# installColorThemes
source: Install Additional Color Themes...
uk: Встановити додаткові кольорові теми...

# installExtension.button.ok
source: OK
uk: Гаразд

# installExtension.confirm
source: This will install extension '{0}' published by '{1}'. Do you want to continue?
uk: Це встановить розширення '{0}', опубліковане '{1}'. Ви хочете продовжити?

# installIconThemes
source: Install Additional File Icon Themes...
uk: Встановити додаткові теми значків файлів...

# installProductIconThemes
source: Install Additional Product Icon Themes...
uk: Встановити додаткові теми значків продукту...

# installing extensions
source: Installing Extension {0}...
uk: Встановлення розширення {0}...

source: Manage Extension
uk: Керувати розширенням

# manageExtensionIcon
source: Icon for the 'Manage' action in the theme selection quick pick.
uk: Іконка для дії 'Управління' у швидкому виборі теми.

# miSelectTheme
source: &&Themes
uk: &&Теми

# noIconThemeDesc
source: Disable File Icons
uk: Вимкнути значки файлів

# noIconThemeLabel
source: None
uk: Ніщо

# productIconThemeCategory
source: product icon themes
uk: теми значків продукту

# search.error
source: Error while searching for themes: {0}
uk: Помилка під час пошуку тем: {0}

# selectIconTheme.label
source: File Icon Theme
uk: Тема значків файлів

# selectProductIconTheme.label
source: Product Icon Theme
uk: Тема значка продукту

# selectTheme.label
source: Color Theme
uk: Тема кольору

source: Themes
uk: Теми

# themes.category.dark
source: dark themes
uk: темні теми

# themes.category.hc
source: high contrast themes
uk: висококонтрастні теми

# themes.category.light
source: light themes
uk: світлі теми

# themes.configure.switchingDisabled
source: Detect system color mode disabled. Click to configure.
uk: Виявлення режиму кольору системи вимкнено. Натисніть, щоб налаштувати.

# themes.configure.switchingEnabled
source: Detect system color mode enabled. Click to configure.
uk: Виявлено увімкнений режим кольору системи. Натисніть, щоб налаштувати.

# themes.selectIconTheme
source: Select File Icon Theme (Up/Down Keys to Preview)
uk: Виберіть тему значків файлів (клавіші Вгору/Вниз для попереднього перегляду)

# themes.selectIconTheme.label
source: File Icon Theme
uk: Тема значків файлів

# themes.selectMarketplaceTheme
source: Type to Search More. Select to Install. Up/Down Keys to Preview
uk: Введіть для пошуку більше. Виберіть для встановлення. Клавіші Вгору/Вниз для попереднього перегляду

# themes.selectProductIconTheme
source: Select Product Icon Theme (Up/Down Keys to Preview)
uk: Виберіть тему значка продукту (клавіші Вгору/Вниз для попереднього перегляду)

# themes.selectProductIconTheme.label
source: Product Icon Theme
uk: Тема значка продукту

# themes.selectTheme.darkHC
source: Select Color Theme for High Contrast Dark Mode
uk: Виберіть кольорову тему для режиму високого контрасту темного

# themes.selectTheme.darkScheme
source: Select Color Theme for System Dark Mode
uk: Виберіть кольорову тему для темного режиму системи

# themes.selectTheme.default
source: Select Color Theme (detect system color mode disabled)
uk: Виберіть кольорову тему (виявлення кольорового режиму системи вимкнено)

# themes.selectTheme.lightHC
source: Select Color Theme for High Contrast Light Mode
uk: Виберіть кольорову тему для режиму високого контрасту з світлим фоном

# themes.selectTheme.lightScheme
source: Select Color Theme for System Light Mode
uk: Виберіть кольорову тему для світлого режиму системи

# toggleLightDarkThemes.label
source: Toggle between Light/Dark Themes
uk: Перемикати між світлою/темною темами
