Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

source: Active Window
uk: Активне вікно

# applicationConfigurationTitle
source: Application
uk: Застосунок

# newWindowProfile
source: Specifies the profile to use when opening a new window. If a profile name is provided, the new window will use that profile. If no profile name is provided, the new window will use the profile of the active window or the Default profile if no active window exists.
uk: Вказує профіль, який слід використовувати при відкритті нового вікна. Якщо вказано ім'я профілю, нове вікно використовуватиме цей профіль. Якщо ім'я профілю не вказано, нове вікно використовуватиме профіль активного вікна або профіль за замовчуванням, якщо активне вікно не існує.

# problemsConfigurationTitle
source: Problems
uk: Проблеми

# security.allowedUNCHosts
source: A set of UNC host names (without leading or trailing backslash, for example `192.168.0.1` or `my-server`) to allow without user confirmation. If a UNC host is being accessed that is not allowed via this setting or has not been acknowledged via user confirmation, an error will occur and the operation stopped. A restart is required when changing this setting. Find out more about this setting at https://aka.ms/vscode-windows-unc.
uk: Набір імен UNC-хостів (без провідного або кінцевого зворотного слешу, наприклад `192.168.0.1` або `my-server`), які дозволяються без підтвердження користувача. Якщо доступ до UNC-хоста, який не дозволений через цю настройку або не був підтверджений користувачем, буде спробовано, виникне помилка, і операцію буде зупинено. Після зміни цієї настройки потрібен перезапуск. Дізнайтеся більше про цю настройку за адресою https://aka.ms/vscode-windows-unc.

# security.allowedUNCHosts.patternErrorMessage
source: UNC host names must not contain backslashes.
uk: Імена хостів UNC не повинні містити зворотні слеші.

# security.restrictUNCAccess
source: If enabled, only allows access to UNC host names that are allowed by the `#security.allowedUNCHosts#` setting or after user confirmation. Find out more about this setting at https://aka.ms/vscode-windows-unc.
uk: Якщо увімкнено, дозволяє доступ лише до UNC-імен хостів, які дозволені налаштуванням `#security.allowedUNCHosts#` або після підтвердження користувача. Дізнайтеся більше про це налаштування за адресою https://aka.ms/vscode-windows-unc.

# securityConfigurationTitle
source: Security
uk: Безпека

# windowConfigurationTitle
source: Window
uk: Вікно

# workbenchConfigurationTitle
source: Workbench
uk: Робоча станція

# SelectedEditorsInGroupFileOrUntitledResourceContextKey
source: Whether all selected editors in a group have a file or untitled resource associated
uk: Чи мають усі вибрані редактори в групі файл або ресурс без назви, пов'язаний з ними

# activeAuxiliary
source: The identifier of the active auxiliary panel
uk: Ідентифікатор активної допоміжної панелі

# activeCompareEditorCanSwap
source: Whether the active compare editor can swap sides
uk: Чи може активний редактор порівняння змінювати сторони

# activeEditor
source: The identifier of the active editor
uk: Ідентифікатор активного редактора

# activeEditorAvailableEditorIds
source: The available editor identifiers that are usable for the active editor
uk: Доступні ідентифікатори редактора, які можна використовувати для активного редактора

# activeEditorCanRevert
source: Whether the active editor can revert
uk: Чи може активний редактор скасувати

# activeEditorCanToggleReadonly
source: Whether the active editor can toggle between being read-only or writeable
uk: Чи може активний редактор перемикатися між режимом тільки для читання та режимом запису

# activeEditorGroupEmpty
source: Whether the active editor group is empty
uk: Чи є група активних редакторів порожньою

# activeEditorGroupIndex
source: The index of the active editor group
uk: Індекс активної групи редакторів

# activeEditorGroupLast
source: Whether the active editor group is the last group
uk: Чи є активна група редакторів останньою групою

# activeEditorGroupLocked
source: Whether the active editor group is locked
uk: Чи заблокована активна група редакторів

# activeEditorIsDirty
source: Whether the active editor has unsaved changes
uk: Чи має активний редактор незбережені зміни

# activeEditorIsFirstInGroup
source: Whether the active editor is the first one in its group
uk: Чи є активний редактор першим у своїй групі

# activeEditorIsLastInGroup
source: Whether the active editor is the last one in its group
uk: Чи є активний редактор останнім у своїй групі

# activeEditorIsNotPreview
source: Whether the active editor is not in preview mode
uk: Чи активний редактор не в режимі попереднього перегляду

# activeEditorIsPinned
source: Whether the active editor is pinned
uk: Чи закріплений активний редактор

# activeEditorIsReadonly
source: Whether the active editor is read-only
uk: Чи активний редактор є лише для читання

# activePanel
source: The identifier of the active panel
uk: Ідентифікатор активної панелі

# activeViewlet
source: The identifier of the active viewlet
uk: Ідентифікатор активного вьюлету

# auxiliaryBarFocus
source: Whether the auxiliary bar has keyboard focus
uk: Чи має допоміжна панель фокус клавіатури

# auxiliaryBarMaximized
source: Whether the auxiliary bar is maximized
uk: Чи максимізовано допоміжну панель

# auxiliaryBarVisible
source: Whether the auxiliary bar is visible
uk: Показано бічну панель вторинного боку

# bannerFocused
source: Whether the banner has keyboard focus
uk: Чи має банер фокус клавіатури

# dirtyWorkingCopies
source: Whether there are any working copies with unsaved changes
uk: Чи є якісь робочі копії з незбереженими змінами

# editorIsOpen
source: Whether an editor is open
uk: Чи відкритий редактор

# editorPartEditorGroupMaximized
source: Editor Part has a maximized group
uk: Частина редактора має розгорнуту групу

# editorPartMultipleEditorGroups
source: Whether there are multiple editor groups opened in an editor part
uk: Чи відкрито кілька груп редакторів у частині редактора

# editorTabsVisible
source: Whether editor tabs are visible
uk: Чи видимі вкладки редактора

# embedderIdentifier
source: The identifier of the embedder according to the product service, if one is defined
uk: Ідентифікатор вбудовувача відповідно до служби продукту, якщо він визначений

# focusedView
source: The identifier of the view that has keyboard focus
uk: `${focusedView}`: назва виду, який наразі має фокус.

# groupEditorsCount
source: The number of opened editor groups
uk: Кількість відкритих груп редакторів

# inZenMode
source: Whether Zen mode is enabled
uk: Чи увімкнено режим Zen

# isAuxiliaryWindow
source: Window is an auxiliary window
uk: Вікно є допоміжним вікном

# isAuxiliaryWindowFocusedContext
source: Whether an auxiliary window is focused
uk: Чи зосереджено вікно допоміжного елемента

# isCompactTitleBar
source: Title bar is in compact mode
uk: Заголовок у компактному режимі

# isFileSystemResource
source: Whether the resource is backed by a file system provider
uk: Чи ресурс підтримується постачальником файлової системи

# isFullscreen
source: Whether the main window is in fullscreen mode
uk: Чи головне вікно знаходиться в режимі повноекранного відображення

# isMainEditorCenteredLayout
source: Whether centered layout is enabled for the main editor
uk: Чи увімкнено центровану розкладку для основного редактора

# isWindowAlwaysOnTop
source: Whether the window is always on top
uk: Чи вікно завжди поверх інших

# mainEditorAreaVisible
source: Whether the editor area in the main window is visible
uk: Чи видима область редактора в головному вікні

# multipleEditorGroups
source: Whether there are multiple editor groups opened
uk: Чи відкрито кілька груп редакторів

# multipleEditorsSelectedInGroup
source: Whether multiple editors have been selected in an editor group
uk: Чи було вибрано кілька редакторів у групі редакторів

# notificationCenterVisible
source: Whether the notifications center is visible
uk: Чи видимий центр сповіщень

# notificationFocus
source: Whether a notification has keyboard focus
uk: Чи має сповіщення фокус клавіатури

# notificationToastsVisible
source: Whether a notification toast is visible
uk: Чи видимий сповіщувальний тост

# panelAlignment
source: The alignment of the panel, either 'center', 'left', 'right' or 'justify'
uk: Вирівнювання панелі

# panelFocus
source: Whether the panel has keyboard focus
uk: Чи має панель фокус клавіатури

# panelMaximized
source: Whether the panel is maximized
uk: Чи панель розгорнута на весь екран

# panelPosition
source: The position of the panel, always 'bottom'
uk: Позиція панелі завжди 'внизу'

# panelVisible
source: Whether the panel is visible
uk: Чи панель видима

# remoteName
source: The name of the remote the window is connected to or an empty string if not connected to any remote
uk: `${remoteName}`: наприклад, SSH

# resource
source: The full value of the resource including scheme and path
uk: Повна вартість ресурсу, включаючи схему та шлях

# resourceDirname
source: The folder name the resource is contained in
uk: Назва папки, в якій міститься ресурс

# resourceExtname
source: The extension name of the resource
uk: Ім'я розширення ресурсу

# resourceFilename
source: The file name of the resource
uk: Ім'я файлу ресурсу

# resourceLangId
source: The language identifier of the resource
uk: Ідентифікатор мови ресурсу

# resourcePath
source: The full path of the resource
uk: Повний шлях до ресурсу

# resourceScheme
source: The scheme of the resource
uk: Схема ресурсу

# resourceSet
source: Whether a resource is present or not
uk: Чи присутній ресурс чи ні

# sideBarFocus
source: Whether the sidebar has keyboard focus
uk: Чи має бокова панель фокус клавіатури

# sideBarVisible
source: Whether the sidebar is visible
uk: Чи видима бічна панель

# sideBySideEditorActive
source: Whether a side by side editor is active
uk: Чи активний редактор поруч

# splitEditorsVertically
source: Whether editors split vertically
uk: Чи розділяють редактори вертикально

# statusBarFocused
source: Whether the status bar has keyboard focus
uk: Чи має рядок стану фокус клавіатури

# temporaryWorkspace
source: The scheme of the current workspace is from a temporary file system.
uk: Схема поточного робочого простору походить з тимчасової файлової системи.

# textCompareEditorActive
source: Whether a text compare editor is active
uk: Чи активний редактор порівняння тексту

# textCompareEditorVisible
source: Whether a text compare editor is visible
uk: Чи видимий редактор порівняння тексту

# titleBarStyle
source: Style of the window title bar
uk: Стиль заголовка вікна

# titleBarVisible
source: Whether the title bar is visible
uk: Чи видима панель заголовка

# twoEditorsSelectedInGroup
source: Whether exactly two editors have been selected in an editor group
uk: Чи було обрано точно двох редакторів у групі редакторів

# virtualWorkspace
source: The scheme of the current workspace is from a virtual file system or an empty string.
uk: Схема поточного робочого простору походить з віртуальної файлової системи або є порожнім рядком.

# workbenchState
source: The kind of workspace opened in the window, either 'empty' (no workspace), 'folder' (single folder) or 'workspace' (multi-root workspace)
uk: Тип робочого простору, відкритий у вікні, може бути 'порожнім' (без робочого простору), 'папкою' (одна папка) або 'робочим простором' (багатокореневий робочий простір)

# workspaceFolderCount
source: The number of root folders in the workspace
uk: Кількість кореневих папок у робочому просторі

# builtinProviderDisplayName
source: Built-in
uk: Вбудований

# configureEditorLargeFileConfirmation
source: Configure Limit
uk: Налаштувати обмеження

# openLargeFile
source: Open Anyway
uk: Відкрити все одно

# promptOpenWith.defaultEditor.displayName
source: Text Editor
uk: Текстовий редактор

# languageAutoDetected
source: Language {0} was automatically detected and set as the language mode.
uk: Мову {0} було автоматично виявлено і встановлено як режим мови.

# activityBarActiveBackground
source: Activity bar background color for the active item. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір фону панелі активності для активного елемента. Панель активності розташована зліва або справа і дозволяє перемикатися між переглядами бокової панелі.

# activityBarActiveBorder
source: Activity bar border color for the active item. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір межі панелі активності для активного елемента. Панель активності відображається зліва або справа і дозволяє перемикатися між переглядами бокової панелі.

# activityBarActiveFocusBorder
source: Activity bar focus border color for the active item. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір межі фокусу панелі активності для активного елемента. Панель активності розташована зліва або справа і дозволяє перемикатися між виглядами бокової панелі.

# activityBarBackground
source: Activity bar background color. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір фону панелі активності. Панель активності відображається зліва або справа і дозволяє перемикатися між виглядами бокової панелі.

# activityBarBadgeBackground
source: Activity notification badge background color. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір фону значка сповіщення про активність. Панель активності відображається зліва або справа і дозволяє перемикатися між виглядами бокової панелі.

# activityBarBadgeForeground
source: Activity notification badge foreground color. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір переднього плану значка сповіщення про активність. Панель активності відображається з крайнього лівого або правого боку і дозволяє перемикатися між поданнями бічної панелі.

# activityBarBorder
source: Activity bar border color separating to the side bar. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір межі панелі активності, що відокремлює її від бокової панелі. Панель активності розташована з крайнього лівого або правого боку і дозволяє перемикатися між виглядами бокової панелі.

# activityBarDragAndDropBorder
source: Drag and drop feedback color for the activity bar items. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Перетягніть і відпустіть колір зворотного зв'язку для елементів панелі активності. Панель активності відображається зліва або справа і дозволяє перемикатися між виглядами бокової панелі.

# activityBarForeground
source: Activity bar item foreground color when it is active. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір переднього плану елемента панелі активності, коли він активний. Панель активності розташована зліва або справа і дозволяє перемикатися між поданнями бокової панелі.

# activityBarInActiveForeground
source: Activity bar item foreground color when it is inactive. The activity bar is showing on the far left or right and allows to switch between views of the side bar.
uk: Колір переднього плану елемента панелі активності, коли він неактивний. Панель активності розташована зліва або справа і дозволяє перемикатися між виглядами бічної панелі.

# activityBarTop
source: Active foreground color of the item in the Activity bar when it is on top / bottom. The activity allows to switch between views of the side bar.
uk: Активний колір переднього плану елемента в панелі активності, коли вона зверху / знизу. Дія дозволяє перемикатися між виглядами бокової панелі.

# activityBarTopActiveBackground
source: Background color for the active item in the Activity bar when it is on top / bottom. The activity allows to switch between views of the side bar.
uk: Колір фону для активного елемента в панелі активності, коли вона зверху / знизу. Дія дозволяє перемикатися між виглядами бокової панелі.

# activityBarTopActiveFocusBorder
source: Focus border color for the active item in the Activity bar when it is on top / bottom. The activity allows to switch between views of the side bar.
uk: Колір рамки фокусу для активного елемента в панелі активності, коли вона зверху / знизу. Дія дозволяє перемикатися між виглядами бокової панелі.

# activityBarTopBackground
source: Background color of the activity bar when set to top / bottom.
uk: Колір фону панелі активності, коли встановлено зверху / знизу.

# activityBarTopDragAndDropBorder
source: Drag and drop feedback color for the items in the Activity bar when it is on top / bottom. The activity allows to switch between views of the side bar.
uk: Перетягніть і скиньте колір зворотного зв'язку для елементів у панелі активності, коли вона знаходиться зверху / знизу. Дія дозволяє перемикатися між виглядами бокової панелі.

# activityBarTopInActiveForeground
source: Inactive foreground color of the item in the Activity bar when it is on top / bottom. The activity allows to switch between views of the side bar.
uk: Неактивний колір переднього плану елемента в панелі активності, коли вона зверху / знизу. Активність дозволяє перемикатися між виглядами бокової панелі.

# banner.background
source: Banner background color. The banner is shown under the title bar of the window.
uk: Колір фону банера. Банер відображається під заголовком вікна.

# banner.foreground
source: Banner foreground color. The banner is shown under the title bar of the window.
uk: Колір переднього плану банера. Банер відображається під рядком заголовка вікна.

# banner.iconForeground
source: Banner icon color. The banner is shown under the title bar of the window.
uk: Колір значка банера. Банер відображається під заголовком вікна.

# commandCenter-activeBackground
source: Active background color of the command center
uk: Активний колір фону командного центру

# commandCenter-activeBorder
source: Active border color of the command center
uk: Активний колір межі командного центру

# commandCenter-activeForeground
source: Active foreground color of the command center
uk: Активний колір переднього плану командного центру

# commandCenter-background
source: Background color of the command center
uk: Колір фону командного центру

# commandCenter-border
source: Border color of the command center
uk: Колір рамки командного центру

# commandCenter-foreground
source: Foreground color of the command center
uk: Колір переднього плану командного центру

# commandCenter-inactiveBorder
source: Border color of the command center when the window is inactive
uk: Колір рамки командного центру, коли вікно неактивне

# commandCenter-inactiveForeground
source: Foreground color of the command center when the window is inactive
uk: Колір переднього плану командного центру, коли вікно неактивне

# editorDragAndDropBackground
source: Background color when dragging editors around. The color should have transparency so that the editor contents can still shine through.
uk: Колір фону під час перетягування редакторів. Колір повинен мати прозорість, щоб вміст редактора все ще був видимим.

# editorDropIntoPromptBackground
source: Background color of text shown over editors when dragging files. This text informs the user that they can hold shift to drop into the editor.
uk: Колір фону тексту, що відображається над редакторами під час перетягування файлів. Цей текст інформує користувача, що він може утримувати shift, щоб скинути в редактор.

# editorDropIntoPromptBorder
source: Border color of text shown over editors when dragging files. This text informs the user that they can hold shift to drop into the editor.
uk: Колір рамки тексту, що відображається над редакторами під час перетягування файлів. Цей текст інформує користувача про те, що він може утримувати shift, щоб скинути в редактор.

# editorDropIntoPromptForeground
source: Foreground color of text shown over editors when dragging files. This text informs the user that they can hold shift to drop into the editor.
uk: Колір тексту на передньому плані, що відображається над редакторами під час перетягування файлів. Цей текст інформує користувача про те, що він може утримувати shift, щоб скинути в редактор.

# editorGroupBorder
source: Color to separate multiple editor groups from each other. Editor groups are the containers of editors.
uk: Колір для розділення кількох груп редакторів один від одного. Групи редакторів є контейнерами редакторів.

# editorGroupEmptyBackground
source: Background color of an empty editor group. Editor groups are the containers of editors.
uk: Колір фону порожньої групи редакторів. Групи редакторів є контейнерами для редакторів.

# editorGroupFocusedEmptyBorder
source: Border color of an empty editor group that is focused. Editor groups are the containers of editors.
uk: Колір рамки порожньої групи редакторів, яка має фокус. Групи редакторів є контейнерами редакторів.

# editorGroupHeaderBackground
source: Background color of the editor group title header when (`"workbench.editor.showTabs": "single"`). Editor groups are the containers of editors.
uk: Колір фону заголовка групи редакторів, коли (`"workbench.editor.showTabs": "single"`). Групи редакторів є контейнерами для редакторів.

# editorPaneBackground
source: Background color of the editor pane visible on the left and right side of the centered editor layout.
uk: Колір фону панелі редактора, видимої зліва та справа від центруваного макета редактора.

# editorTitleContainerBorder
source: Border color of the editor group title header. Editor groups are the containers of editors.
uk: Колір рамки заголовка групи редакторів. Групи редакторів є контейнерами для редакторів.

# extensionBadge.remoteBackground
source: Background color for the remote badge in the extensions view.
uk: Колір фону для віддаленого значка в перегляді розширень.

# extensionBadge.remoteForeground
source: Foreground color for the remote badge in the extensions view.
uk: Колір переднього плану для віддаленого значка у вигляді розширень.

# lastPinnedTabBorder
source: Border to separate pinned tabs from other tabs. Tabs are the containers for editors in the editor area. Multiple tabs can be opened in one editor group. There can be multiple editor groups.
uk: Кордон для відокремлення закріплених вкладок від інших вкладок. Вкладки - це контейнери для редакторів в області редактора. У одній групі редакторів можна відкрити кілька вкладок. Може бути кілька груп редакторів.

# menubarSelectionBackground
source: Background color of the selected menu item in the menubar.
uk: Колір фону вибраного елемента меню в панелі меню.

# menubarSelectionBorder
source: Border color of the selected menu item in the menubar.
uk: Колір рамки вибраного елемента меню в рядку меню.

# menubarSelectionForeground
source: Foreground color of the selected menu item in the menubar.
uk: Колір переднього плану вибраного елемента меню в панелі меню.

# notificationCenterBorder
source: Notifications center border color. Notifications slide in from the bottom right of the window.
uk: Колір рамки центру сповіщень. Сповіщення з'являються з нижнього правого кута вікна.

# notificationCenterHeaderBackground
source: Notifications center header background color. Notifications slide in from the bottom right of the window.
uk: Колір фону заголовка центру сповіщень. Сповіщення з'являються з правого нижнього кута вікна.
