Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_editTelemetry.xlf
Languages: uk

# aiStats.statusBar.configure
source: Configure
uk: Налаштувати

# aiStatsStatusBarHeader
source: AI Usage Statistics
uk: Статистика використання ШІ

source: Inline Suggestions
uk: Вбудовані пропозиції

source: Inline suggestions status bar
uk: Панель стану вбудованих пропозицій

# text1
source: AI vs Typing Average: {0}
uk: Штучний інтелект проти середнього набору тексту: {0}

# text2
source: Accepted inline suggestions today: {0}
uk: Прийняті інлайн-пропозиції сьогодні: {0}

source: Edit Telemetry
uk: Редагувати телеметрію

# editor.aiStats.enabled
source: Controls whether to enable AI statistics in the editor. The gauge represents the average amount of code inserted by AI vs manual typing over a 24 hour period.
uk: Контролює, чи потрібно увімкнути статистику AI в редакторі. Індикатор представляє середню кількість коду, вставленого AI в порівнянні з ручним введенням за 24 години.

# telemetry.editStats.detailed.enabled
source: Controls whether to enable telemetry for detailed edit statistics (only sends statistics if general telemetry is enabled).
uk: Контролює, чи потрібно увімкнути телеметрію для детальної статистики редагування (статистика надсилається лише якщо загальна телеметрія увімкнена).

# telemetry.editStats.enabled
source: Controls whether to enable telemetry for edit statistics (only sends statistics if general telemetry is enabled).
uk: Контролює, чи потрібно увімкнути телеметрію для статистики редагування (статистика надсилається лише якщо загальна телеметрія увімкнена).

# telemetry.editStats.showDecorations
source: Controls whether to show decorations for edit telemetry.
uk: Контролює, чи показувати декорації для редагування телеметрії.

# telemetry.editStats.showStatusBar
source: Controls whether to show the status bar for edit telemetry.
uk: Контролює, чи показувати панель стану для редагування телеметрії.
