Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_remote.xlf
Languages: uk

# remote.portsAttributes.port
source: A port, range of ports (ex. "40000-55000"), host and port (ex. "db:1234"), or regular expression (ex. ".+\\/server.js"). For a port number or range, the attributes will apply to that port number or range of port numbers. Attributes which use a regular expression will apply to ports whose associated process command line matches the expression.
uk: Порт, діапазон портів (наприклад, "40000-55000"), хост і порт (наприклад, "db:1234") або регулярний вираз (наприклад, ".+\\/server.js"). Для номера порту або діапазону атрибути будуть застосовуватися до цього номера порту або діапазону номерів портів. Атрибути, які використовують регулярний вираз, будуть застосовуватися до портів, команда процесу яких відповідає виразу.

# remote.portsAttributes.protocol
source: The protocol to use when forwarding this port.
uk: Протокол, який слід використовувати при переадресації цього порту.

# remote.portsAttributes.requireLocalPort
source: When true, a modal dialog will show if the chosen local port isn't used for forwarding.
uk: Коли істинно, модальне вікно з'явиться, якщо обраний локальний порт не використовується для пересилання.

# remote.portsAttributes.silent
source: Shows no notification and takes no action when this port is automatically forwarded.
uk: Не показує жодних сповіщень і не вживає жодних дій, коли цей порт автоматично перенаправляється.

# remote.restoreForwardedPorts
source: Restores the ports you forwarded in a workspace.
uk: Відновлює порти, які ви перенаправили в робочій області.

# triggerReconnect
source: Connection: Trigger Reconnect
uk: З'єднання: Викликати повторне з'єднання

# ui
source: UI extension kind. In a remote window, such extensions are enabled only when available on the local machine.
uk: Тип розширення UI. У віддаленому вікні такі розширення активуються лише тоді, коли вони доступні на локальному комп'ютері.

# workspace
source: Workspace extension kind. In a remote window, such extensions are enabled only when available on the remote.
uk: Тип розширення робочого простору. У віддаленому вікні такі розширення активуються лише тоді, коли вони доступні на віддаленому сервері.

# remote.downloadExtensionsLocally
source: When enabled extensions are downloaded locally and installed on remote.
uk: Коли увімкнено, розширення завантажуються локально та встановлюються на віддаленому.

# wslFeatureInstalled
source: Whether the platform has the WSL feature installed
uk: Чи має платформа встановлену функцію WSL
