Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_replNotebook.xlf
Languages: uk

# repl.execute
source: Execute REPL input
uk: Виконати введення REPL

# repl.focusLastReplOutput
source: Focus Most Recent REPL Execution
uk: Зосередитися на останньому виконанні REPL

# repl.input.focus
source: Focus Input Editor
uk: Редактор введення фокусу

# replEditorInput
source: REPL Input
uk: Вхід REPL

# replEditor.accessibilityView
source: Run the Open Accessbility View command{0} while navigating the history for an accessible view of the item's output.
uk: Виконайте команду Open Accessbility View{0}, переходячи по історії для доступного перегляду виходу елемента.

# replEditor.autoFocusRepl
source: The setting `accessibility.replEditor.autoFocusReplExecution` controls if focus will automatically move to the REPL after executing code.
uk: Налаштування `accessibility.replEditor.autoFocusReplExecution` контролює, чи буде фокус автоматично переміщено на REPL після виконання коду.

# replEditor.cellNavigation
source: The Quit Edit command{0} will move focus to the cell container, where the up and down arrows will also move focus between cells in the history.
uk: Команда Виходу з Редагування{0} перемістить фокус на контейнер комірок, де стрілки вгору та вниз також перемістять фокус між комірками в історії.

# replEditor.configReadExecution
source: The setting `accessibility.replEditor.readLastExecutionOutput` controls if output will be automatically read when execution completes.
uk: Налаштування `accessibility.replEditor.readLastExecutionOutput` контролює, чи буде вивід автоматично прочитано після завершення виконання.

# replEditor.execute
source: The Execute command{0} will evaluate the expression in the input box.
uk: Команда Execute{0} оцінить вираз у полі введення.

# replEditor.focusCellEditor
source: The Edit Cell command{0} will move focus to the read-only editor for the input of the cell.
uk: Команда Edit Cell{0} перемістить фокус до редактора лише для читання для введення даних у клітинку.

# replEditor.focusInOutput
source: The Focus Output command{0} will set focus on the output when focused on a previously executed item.
uk: Команда Focus Output{0} встановить фокус на вихід, коли фокус буде на раніше виконаному елементі.

# replEditor.focusLastItemAdded
source: The Focus Last executed command{0} will move focus to the last executed item in the REPL history.
uk: Команда останнього виконання фокусу {0} перемістить фокус на останній виконаний елемент в історії REPL.

# replEditor.focusReplInput
source: The Focus Input Editor command{0} will bring the focus back to this editor.
uk: Команда Focus Input Editor {0} поверне фокус назад до цього редактора.

# replEditor.focusReplInputFromHistory
source: The Focus Input Editor command{0} will move focus to the REPL input box.
uk: Команда Focus Input Editor{0} перемістить фокус на поле вводу REPL.

# replEditor.historyOverview
source: You are in a REPL History which is a list of cells that have been executed in the REPL. Each cell has an input, an output, and the cell container.
uk: Ви знаходитесь у історії REPL, яка є списком комірок, що були виконані в REPL. Кожна комірка має вхідні дані, вихідні дані та контейнер комірки.

# replEditor.inputAccessibilityView
source: When you run the Open Accessbility View command{0} from this input box, the output from the last execution will be shown in the accessibility view.
uk: Коли ви виконуєте команду Open Accessbility View{0} з цього поля введення, вихідні дані з останнього виконання будуть показані в режимі доступності.

# replEditor.inputOverview
source: You are in a REPL Editor Input box which will accept code to be executed in the REPL.
uk: Ви знаходитесь у полі введення редактора REPL, яке прийматиме код для виконання в REPL.

# replEditorLabelIcon
source: Icon of the REPL editor label.
uk: Іконка мітки редактора REPL.
