Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_extensions.xlf
Languages: uk

# vscode.extension.qna
source: Controls the Q&A link in the Marketplace. Set to marketplace to enable the default Marketplace Q & A site. Set to a string to provide the URL of a custom Q & A site. Set to false to disable Q & A altogether.
uk: Контролює посилання на Q&A у Marketplace. Встановіть на marketplace, щоб увімкнути за замовчуванням сайт Q & A Marketplace. Встановіть на рядок, щоб надати URL кастомного сайту Q & A. Встановіть на false, щоб повністю вимкнути Q & A.

# vscode.extension.scripts.prepublish
source: Script executed before the package is published as a VS Code extension.
uk: Скрипт виконується перед публікацією пакету як розширення VS Code.

# vscode.extension.scripts.uninstall
source: Uninstall hook for VS Code extension. Script that gets executed when the extension is completely uninstalled from VS Code which is when VS Code is restarted (shutdown and start) after the extension is uninstalled. Only Node scripts are supported.
uk: Видалення хуку для розширення VS Code. Скрипт, який виконується, коли розширення повністю видаляється з VS Code, що відбувається, коли VS Code перезапускається (вимкнення та запуск) після видалення розширення. Підтримуються лише Node-скрипти.

# workspace
source: Workspace extension kind. In a remote window, such extensions are enabled only when available on the remote.
uk: Тип розширення робочого простору. У віддаленому вікні такі розширення активуються лише тоді, коли вони доступні на віддаленому.

# extensionUnderDevelopment
source: Loading development extension at {0}
uk: Завантаження розширення для розробки за адресою {0}

# overwritingExtension
source: Overwriting extension {0} with {1}.
uk: Перезаписування розширення {0} на {1}.

# overwritingWithWorkspaceExtension
source: Overwriting {0} with Workspace Extension {1}.
uk: Перезаписування {0} з Розширенням Робочого Простору {1}.

# extensionCache.invalid
source: Extensions have been modified on disk. Please reload the window.
uk: Розширення були змінені на диску. Будь ласка, перезавантажте вікно.

# extensionUnderDevelopment.invalid
source: Failed loading extension '{0}' under development because it is invalid: {1}
uk: Не вдалося завантажити розширення '{0}' під час розробки, оскільки воно є недійсним: {1}

# extensionsUnderDevelopment.invalid
source: Failed loading extensions {0} under development because they are invalid: {1}
uk: Не вдалося завантажити розширення {0} під час розробки, оскільки вони є недійсними: {1}

source: Reload Window
uk: Перезавантажити вікно

# extensionHost.startupFail
source: Extension host did not start in 10 seconds, that might be a problem.
uk: Хост розширення не запустився за 10 секунд, це може бути проблемою.

# extensionHost.startupFailDebug
source: Extension host did not start in 10 seconds, it might be stopped on the first line and needs a debugger to continue.
uk: Хост розширення не запустився за 10 секунд, можливо, він зупинився на першому рядку і потребує налагоджувача для продовження.

# join.extensionDevelopment
source: Terminating extension debug session
uk: Завершення сеансу налагодження розширення

# devTools
source: Open Developer Tools
uk: Відкрити інструменти розробника

# enable
source: Enable and Reload
uk: Увімкнути та перезавантажити

# enableResolver
source: Extension '{0}' is required to open the remote window. OK to enable?
uk: Розширення '{0}' необхідне для відкриття віддаленого вікна. Дозволити активацію?

# extensionService.autoRestart
source: The extension host terminated unexpectedly. Restarting...
uk: Віддалений хост розширення несподівано завершив роботу. Перезапуск...

# extensionService.crash
source: Extension host terminated unexpectedly 3 times within the last 5 minutes.
uk: Віддалений хост розширення несподівано завершив роботу 3 рази за останні 5 хвилин.

# extensionService.versionMismatchCrash
source: Extension host cannot start: version mismatch.
uk: Хост розширення не може запуститися: невідповідність версій.

# getEnvironmentFailure
source: Could not fetch remote environment
uk: Не вдалося отримати віддалене середовище

# install
source: Install and Reload
uk: Встановити та перезавантажити

# installResolver
source: Extension '{0}' is required to open the remote window. Do you want to install the extension?
uk: Розширення '{0}' необхідне для відкриття віддаленого вікна. Ви хочете встановити розширення?

source: Learn More
uk: Дізнатися більше

# relaunch
source: Relaunch VS Code
uk: Перезапустіть VS Code

# resolverExtensionNotFound
source: `{0}` not found on marketplace
uk: `{0}` не знайдено на ринку

# restart
source: Restart Extension Host
uk: Перезапустити віддалений хост розширення

source: Restart Extension Host
uk: Перезапустити хост розширення

# restartExtensionHost.reason
source: An explicit request
uk: Явний запит

# startBisect
source: Start Extension Bisect
uk: Почати розширення бісекту
