Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_editSessions.xlf
Languages: uk

# autoResumeWorkingChanges
source: Controls whether to automatically resume available working changes stored in the cloud for the current workspace.
uk: Контролює, чи автоматично відновлювати доступні робочі зміни, збережені в хмарі для поточного робочого простору.

# autoResumeWorkingChanges.off
source: Never attempt to resume working changes from the cloud.
uk: Ніколи не намагайтеся відновити зміни з хмари.

# autoResumeWorkingChanges.onReload
source: Automatically resume available working changes from the cloud on window reload.
uk: Автоматично відновити доступні робочі зміни з хмари при перезавантаженні вікна.

# autoStoreWorkingChanges
source: Storing current working changes...
uk: Зберігання поточних робочих змін...

# autoStoreWorkingChanges.off
source: Never attempt to automatically store working changes in the cloud.
uk: Ніколи не намагайтеся автоматично зберігати робочі зміни в хмарі.

# autoStoreWorkingChanges.onShutdown
source: Automatically store current working changes in the cloud on window close.
uk: Автоматично зберігати поточні зміни в хмарі при закритті вікна.

# autoStoreWorkingChangesDescription
source: Controls whether to automatically store available working changes in the cloud for the current workspace. This setting has no effect in the web.
uk: Контролює, чи автоматично зберігати доступні робочі зміни в хмарі для поточного робочого простору. Цей параметр не має жодного ефекту в вебі.

source: Check for pending cloud changes
uk: Перевірте наявність очікуючих змін у хмарі

# checkingForWorkingChanges
source: Checking for pending cloud changes...
uk: Перевірка наявності незавершених змін у хмарі...

# client too old
source: Please upgrade to a newer version of {0} to resume your working changes from the cloud.
uk: Будь ласка, оновіть до новішої версії {0}, щоб відновити ваші робочі зміни з хмари.

# cloudChangesPartialMatchesEnabled
source: Controls whether to surface cloud changes which partially match the current session.
uk: Контролює, чи відображати зміни в хмарі, які частково відповідають поточній сесії.

# continue edit session in local folder
source: Open In Local Folder
uk: Відкрити в локальній папці

# continue with cloud changes
source: Select whether to bring your working changes with you
uk: Виберіть, чи хочете ви принести свої робочі зміни з собою

source: Continue Working On...
uk: Продовжити роботу над...

# continueEditSession.openLocalFolder.title.v2
source: Select a local folder to continue working in
uk: Виберіть локальну папку, щоб продовжити роботу

# continueEditSessionExtPoint
source: Contributes options for continuing the current edit session in a different environment
uk: Вносить варіанти для продовження поточної сесії редагування в іншому середовищі

# continueEditSessionExtPoint.command
source: Identifier of the command to execute. The command must be declared in the 'commands'-section and return a URI representing a different environment where the current edit session can be continued.
uk: Ідентифікатор команди для виконання. Команда повинна бути оголошена в секції 'commands' і повертати URI, що представляє інше середовище, в якому можна продовжити потесійну сесію редагування.

# continueEditSessionExtPoint.description
source: The url, or a command that returns the url, to the option's documentation page.
uk: URL або команда, яка повертає URL, до сторінки документації опції.

# continueEditSessionExtPoint.group
source: Group into which this item belongs.
uk: Група, до якої належить цей елемент.

# continueEditSessionExtPoint.qualifiedName
source: A fully qualified name for this item which is used for display in menus.
uk: Повністю кваліфіковане ім'я для цього елемента, яке використовується для відображення в меню.

# continueEditSessionExtPoint.remoteGroup
source: Group into which this item belongs in the remote indicator.
uk: Група, до якої належить цей елемент у віддаленому індикаторі.

# continueEditSessionExtPoint.when
source: Condition which must be true to show this item.
uk: Умова, яка повинна бути істинною, щоб показати цей елемент.

# continueEditSessionItem.builtin
source: Built-in
uk: Вбудований

# continueEditSessionItem.openInLocalFolder.v2
source: Open in Local Folder
uk: Відкрити в локальній папці

# continueEditSessionPick.title.v2
source: Select a development environment to continue working on {0} in
uk: Виберіть середовище розробки, щоб продовжити роботу над {0} в

# continueOn.installAdditional
source: Install additional development environment options
uk: Встановіть додаткові параметри середовища розробки

# continueOnCloudChanges
source: Controls whether to prompt the user to store working changes in the cloud when using Continue Working On.
uk: Контролює, чи запитувати користувача про збереження робочих змін у хмарі під час використання функції Продовжити роботу над.

# continueOnCloudChanges.off
source: Do not store working changes in the cloud with Continue Working On unless the user has already turned on Cloud Changes.
uk: Не зберігайте робочі зміни в хмарі з Continue Working On, якщо користувач ще не ввімкнув Cloud Changes.

# continueOnCloudChanges.promptForAuth
source: Prompt the user to sign in to store working changes in the cloud with Continue Working On.
uk: Запросіть користувача увійти, щоб зберегти робочі зміни в хмарі з Continue Working On.

# continueWorkingOn.existingLocalFolder
source: Continue Working in Existing Local Folder
uk: Продовжити роботу в існуючій локальній папці

# editSessionPartialMatch
source: You have pending working changes in the cloud for this workspace. Would you like to resume them?
uk: У вас є незавершені зміни в хмарі для цього робочого простору. Бажаєте продовжити їх?

# learnMoreTooltip
source: Learn More
uk: Дізнатися більше

# no cloud changes
source: There are no changes to resume from the cloud.
uk: З хмари немає змін для відновлення.

# no cloud changes for ref
source: Could not resume changes from the cloud for ID {0}.
uk: Не вдалося відновити зміни з хмари для ID {0}.

# no working changes to store
source: Skipped storing working changes in the cloud as there are no edits to store.
uk: Пропущено зберігання робочих змін у хмарі, оскільки немає редагувань для зберігання.

# payload failed
source: Your working changes cannot be stored.
uk: Ваші зміни в роботі не можуть бути збережені.

# payload too large
source: Your working changes exceed the size limit and cannot be stored.
uk: Ваші робочі зміни перевищують обмеження розміру і не можуть бути збережені.

source: Resume
uk: Резюме

# resume cloud changes
source: Resume Changes from Serialized Data
uk: Відновити зміни з серіалізованих даних

# resume edit session warning 1
source: Resuming your working changes from the cloud will overwrite {0}. Do you want to proceed?
uk: Відновлення ваших робочих змін з хмари перезапише {0}. Ви хочете продовжити?

# resume edit session warning many
source: Resuming your working changes from the cloud will overwrite the following {0} files. Do you want to proceed?
uk: Відновлення ваших робочих змін з хмари перезапише наступні {0} файли. Ви хочете продовжити?

# resume failed
source: Failed to resume your working changes from the cloud.
uk: Не вдалося відновити ваші зміни з хмари.

# resume latest cloud changes
source: Resume Latest Changes from Cloud
uk: Відновити останні зміни з хмари

# resuming working changes window
source: Resuming working changes...
uk: Відновлення робочих змін...

source: Show Cloud Changes
uk: Показати зміни в хмарі

source: Show Log
uk: Показати журнал

# store working changes
source: Storing working changes...
uk: Зберігання робочих змін...

source: Store Working Changes in Cloud
uk: Зберегти робочі зміни в хмарі

# store your working changes
source: Storing your working changes...
uk: Зберігання ваших робочих змін...

source: Storing working changes...
uk: Зберігання робочих змін...

# with cloud changes
source: Yes, continue with my working changes
uk: Так, продовжте з моїми робочими змінами

# without cloud changes
source: No, continue without my working changes
uk: Ні, продовжити без моїх робочих змін

# choose account placeholder
source: Select an account to store your working changes in the cloud
uk: Виберіть обліковий запис для зберігання ваших робочих змін у хмарі

# choose account read placeholder
source: Select an account to restore your working changes from the cloud
uk: Виберіть обліковий запис, щоб відновити ваші робочі зміни з хмари

# delete all cloud changes
source: Delete all stored data from the cloud.
uk: Видалити всі збережені дані з хмари.

source: Others
uk: Інші

# reset auth.v3
source: Turn off Cloud Changes...
uk: Вимкнути зміни в хмарі...

# sign in
source: Turn on Cloud Changes...
uk: Увімкнути зміни в хмарі...

# sign in badge
source: Turn on Cloud Changes... (1)
uk: Увімкнути зміни в хмарі... (1)

# sign in using account
source: Sign in with {0}
uk: Увійти з {0}

# sign out of cloud changes clear data prompt
source: Do you want to disable storing working changes in the cloud?
uk: Ви хочете вимкнути зберігання робочих змін у хмарі?

source: Signed In
uk: Увійшли

source: Cloud Changes
uk: Зміни в хмарі

source: Compare Changes
uk: Порівняти зміни

# confirm delete all
source: Are you sure you want to permanently delete all stored changes from the cloud?
uk: Ви впевнені, що хочете назавжди видалити всі збережені зміни з хмари?

# confirm delete all detail
source: You cannot undo this action.
uk: Ви не можете скасувати цю дію.

# confirm delete detail.v2
source: You cannot undo this action.
uk: Ви не можете скасувати цю дію.

# confirm delete.v2
source: Are you sure you want to permanently delete your working changes with ref {0}?
uk: Ви впевнені, що хочете назавжди видалити свої робочі зміни з посиланням {0}?

source: Local Copy
uk: Локальна копія

# noStoredChanges
source: You have no stored changes in the cloud to display. {0}
uk: У вас немає збережених змін у хмарі для відображення. {0}

source: Open File
uk: Відкрити файл

# storeWorkingChangesTitle
source: Store Working Changes
uk: Зберегти робочі зміни

# workbench.editSessions.actions.delete.v2
source: Delete Working Changes
uk: Видалити робочі зміни

# workbench.editSessions.actions.deleteAll
source: Delete All Working Changes from Cloud
uk: Видалити всі робочі зміни з хмари

# workbench.editSessions.actions.resume.v2
source: Resume Working Changes
uk: Відновити зміни роботи

# workbench.editSessions.actions.store.v2
source: Store Working Changes
uk: Зберегти робочі зміни

# editSessionViewIcon
source: View icon of the cloud changes view.
uk: Іконка перегляду хмари змінює вигляд.

# cloudChangesLog
source: Cloud Changes
uk: Зміни в хмарі
