Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_actions.xlf
Languages: uk

# command title
source: Title
uk: Заголовок

source: Commands
uk: Команди

# comment.actions
source: The contributed comment context menu, rendered as buttons below the comment editor
uk: Контекстне меню коментарів, що додаються, відображається у вигляді кнопок під редактором коментарів

# comment.commentContext
source: The contributed comment context menu, rendered as a right click menu on the an individual comment in the comment thread's peek view.
uk: Контекстне меню коментарів, що додаються, відображається як меню правого кліку на окремому коментарі в попередньому перегляді потоку коментарів.

# comment.title
source: The contributed comment title menu
uk: Меню заголовків коментарів, що були додані

# commentThread.actions
source: The contributed comment thread context menu, rendered as buttons below the comment editor
uk: Контекстне меню потоку коментарів, що додаються, відображається як кнопки під редактором коментарів

# commentThread.editorActions
source: The contributed comment editor actions
uk: Дії редактора коментарів, що були внесені

# commentThread.title
source: The contributed comment thread title menu
uk: Меню заголовка потоку коментарів, що були надані

# commentThread.titleContext
source: The contributed comment thread title's peek context menu, rendered as a right click menu on the comment thread's peek title.
uk: Контекстне меню попереднього перегляду заголовка коментаря, яке відображається як меню правого кліка на заголовку попереднього перегляду потоку коментарів.

# commentsView.threadActions
source: The contributed comment thread context menu in the comments view
uk: Контекстне меню потоку коментарів у перегляді коментарів

# dup0
source: Command `{0}` already registered
uk: Команда `{0}` вже зареєстрована

# dup1
source: Command `{0}` already registered by {1} ({2})
uk: Команда `{0}` вже зареєстрована {1} ({2})

# dupe.command
source: Menu item references the same command as default and alt-command
uk: Елемент меню посилається на ту ж команду, що й за замовчуванням та альтернативна команда.

# editorLineNumberContext
source: The contributed editor line number context menu
uk: Контекстне меню номера рядка редактора, що вносить зміни

# file.newFile
source: The 'New File...' quick pick, shown on welcome page and File menu.
uk: Швидкий вибір 'Новий файл...', показаний на вітальній сторінці та в меню Файл.

# inlineCompletions.actions
source: The actions shown when hovering on an inline completion
uk: Дії, що відображаються при наведенні на вбудоване завершення

# interactive.cell.title
source: The contributed interactive cell title menu
uk: Меню заголовків інтерактивних клітинок, що були додані

# interactive.toolbar
source: The contributed interactive toolbar menu
uk: Внесене інтерактивне меню панелі інструментів

# issue.reporter
source: The contributed issue reporter menu
uk: Меню репортера проблем, що внесені

source: Keyboard Shortcuts
uk: Комбінації клавіш

source: Menu Contexts
uk: Контексти меню

# menus.changeTitle
source: The Source Control inline change menu
uk: Меню змін в рядку джерельного контролю

# menus.commandPalette
source: The Command Palette
uk: Палітра команд

# menus.debugCallstackContext
source: The debug callstack view context menu
uk: Контекстне меню перегляду стеку викликів налагодження

# menus.debugCreateConfiguation
source: The debug create configuration menu
uk: Меню конфігурації створення налагодження

# menus.debugToolBar
source: The debug toolbar menu
uk: Меню панелі інструментів налагодження

# menus.debugVariablesContext
source: The debug variables view context menu
uk: Контекстне меню перегляду змінних налагодження

# menus.diffEditorGutterToolBarMenus
source: The gutter toolbar in the diff editor
uk: Панель інструментів у лівій частині редактора порівняння

# menus.editorContext
source: The editor context menu
uk: Контекстне меню редактора

# menus.editorContextCopyAs
source: 'Copy as' submenu in the editor context menu
uk: Підменю 'Копіювати як' у контекстному меню редактора

# menus.editorContextShare
source: 'Share' submenu in the editor context menu
uk: Підменю 'Поділитися' у контекстному меню редактора

# menus.editorTabContext
source: The editor tabs context menu
uk: Контекстне меню вкладок редактора

# menus.editorTitle
source: The editor title menu
uk: Меню заголовка редактора

# menus.editorTitleContextShare
source: 'Share' submenu inside the editor title context menu
uk: Підменю 'Поділитися' у контекстному меню заголовка редактора

# menus.editorTitleRun
source: Run submenu inside the editor title menu
uk: Запустіть підменю всередині меню заголовка редактора

# menus.explorerContext
source: The file explorer context menu
uk: Контекстне меню провідника файлів

# menus.explorerContextShare
source: 'Share' submenu in the file explorer context menu
uk: Підменю 'Поділитися' у контекстному меню провідника файлів

# menus.extensionContext
source: The extension context menu
uk: Контекстне меню розширення

# menus.historyItemContext
source: The Source Control history item context menu
uk: Контекстне меню елемента історії контролю версій

# menus.historyItemHover
source: The Source Control history item hover menu
uk: Меню наведення курсора на елемент історії контролю версій

# menus.historyItemRefContext
source: The Source Control history item reference context menu
uk: Контекстне меню посилання на елемент історії контролю версій

# menus.home
source: The home indicator context menu (web only)
uk: Контекстне меню індикатора домашньої сторінки (тільки веб)

# menus.input
source: The Source Control input box menu
uk: Меню поля введення контролю версій

# menus.mergeEditorResult
source: The result toolbar of the merge editor
uk: Панель інструментів результатів редактора злиття

# menus.multiDiffEditorResource
source: The resource toolbar in the multi diff editor
uk: Панель інструментів ресурсів у редакторі багатократних відмінностей

# menus.notebookVariablesContext
source: The notebook variables view context menu
uk: Контекстне меню перегляду змінних блокнота

# menus.opy
source: 'Copy as' submenu in the top level Edit menu
uk: Підменю 'Копіювати як' у верхньому рівні меню Редагувати

# menus.resourceFolderContext
source: The Source Control resource folder context menu
uk: Контекстне меню папки ресурсу контролю версій

# menus.resourceGroupContext
source: The Source Control resource group context menu
uk: Контекстне меню групи ресурсів контролю версій

# menus.resourceStateContext
source: The Source Control resource state context menu
uk: Контекстне меню стану ресурсу контролю версій

# menus.scmHistoryTitle
source: The Source Control History title menu
uk: Меню заголовка історії контролю версій

# menus.scmSourceControl
source: The Source Control menu
uk: Меню контролю версій

# menus.scmSourceControlTitle
source: The Source Control title menu
uk: Меню заголовка контролю версій

# menus.scmTitle
source: The Source Control title menu
uk: Меню заголовка контролю версій

# menus.share
source: Share submenu shown in the top level File menu.
uk: Підменю "Поділитися" відображається у верхньому рівні меню "Файл".

# menus.statusBarRemoteIndicator
source: The remote indicator menu in the status bar
uk: Меню індикатора дистанційного керування в панелі стану

# menus.terminalContext
source: The terminal context menu
uk: Контекстне меню терміналу

# menus.terminalTabContext
source: The terminal tabs context menu
uk: Контекстне меню вкладок терміналу

# menus.touchBar
source: The touch bar (macOS only)
uk: Тач-бар (тільки для macOS)

# merge.toolbar
source: The prominent button in an editor, overlays its content
uk: Видима кнопка в редакторі накладається на його вміст.

# missing.altCommand
source: Menu item references an alt-command `{0}` which is not defined in the 'commands' section.
uk: Елемент меню посилається на альтернативну команду `{0}`, яка не визначена в розділі 'commands'.

# missing.command
source: Menu item references a command `{0}` which is not defined in the 'commands' section.
uk: Елемент меню посилається на команду `{0}`, яка не визначена в розділі 'commands'.

# missing.submenu
source: Menu item references a submenu `{0}` which is not defined in the 'submenus' section.
uk: Елемент меню посилається на підменю `{0}`, яке не визначено в секції 'підменю'.

# nonempty
source: expected non-empty value.
uk: очікуване ненульове значення.

# notebook.cell.execute
source: The contributed notebook cell execution menu
uk: Меню виконання комірки блокнота, що була внесена

# notebook.cell.title
source: The contributed notebook cell title menu
uk: Меню заголовка комірки нотатника, що було додано

# notebook.kernelSource
source: The contributed notebook kernel sources menu
uk: Меню джерел ядра блокнота, що були внесені

# notebook.toolbar
source: The contributed notebook toolbar menu
uk: Меню панелі інструментів внесеного блокнота

# opticon
source: property `icon` can be omitted or must be either a string or a literal like `{dark, light}`
uk: властивість `icon` може бути пропущена або повинна бути або рядком, або літералом, таким як `{dark, light}`

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість `{0}` може бути пропущена або повинна бути типу `string`

# proposed
source: Proposed API, requires `enabledApiProposal: ["{0}"]` - {1}
uk: Запропонований API, вимагає `enabledApiProposal: ["{0}"]` - {1}

# proposedAPI.invalid
source: {0} is a proposed menu identifier. It requires 'package.json#enabledApiProposals: ["{1}"]' and is only available when running out of dev or with the following command line switch: --enable-proposed-api {2}
uk: {0} є запропонованим ідентифікатором меню. Він вимагає 'package.json#enabledApiProposals: ["{1}"]' і доступний лише при запуску поза режимом розробника або з наступним параметром командного рядка: --enable-proposed-api {2}

# require
source: submenu items must be an object
uk: пункти підменю повинні бути об'єктом

# requireStringOrObject
source: property `{0}` is mandatory and must be of type `string` or `object`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string` або `object`

# requirearray
source: submenu items must be an array
uk: підменю елементи повинні бути масивом

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

# requirestrings
source: properties `{0}` and `{1}` are mandatory and must be of type `string`
uk: властивості `{0}` та `{1}` є обов'язковими і повинні бути типу `string`

# searchPanel.aiResultsCommands
source: The commands that will contribute to the menu rendered as buttons next to the AI search title
uk: Команди, які будуть сприяти меню, відображеному як кнопки поруч із заголовком пошуку AI.

# submenuId.duplicate.id
source: The `{0}` submenu was already previously registered.
uk: Підменю `{0}` вже було зареєстровано раніше.

# submenuId.invalid.id
source: `{0}` is not a valid submenu identifier
uk: `{0}` не є дійсним ідентифікатором підменю

# submenuId.invalid.label
source: `{0}` is not a valid submenu label
uk: `{0}` не є дійсною міткою підменю

# submenuItem.duplicate
source: The `{0}` submenu was already contributed to the `{1}` menu.
uk: Підменю `{0}` вже було додано до меню `{1}`.

# testing.item.context
source: The contributed test item menu
uk: Меню тестових елементів, що були надані

# testing.item.gutter.title
source: The menu for a gutter decoration for a test item
uk: Меню для декорації жолоба для тестового елемента

# testing.item.result.title
source: The menu for an item in the Test Results view or peek.
uk: Меню для елемента у вигляді тестових результатів або попереднього перегляду.

# testing.message.content.title
source: Context menu for the message in the results tree
uk: Контекстне меню для повідомлення в дереві результатів

# testing.message.context.title
source: A prominent button overlaying editor content where the message is displayed
uk: Видна кнопка, що накладається на вміст редактора, де відображається повідомлення.

# testing.profiles.context.title
source: The menu for configuring testing profiles.
uk: Меню для налаштування профілів тестування.

# unsupported.submenureference
source: Menu item references a submenu for a menu which doesn't have submenu support.
uk: Елемент меню посилається на підменю для меню, яке не підтримує підменю.

# view.containerTitle
source: The contributed view container title menu
uk: Меню заголовка контейнера внесеного виду

# view.itemContext
source: The contributed view item context menu
uk: Контекстне меню елемента перегляду, що було додано

# view.timelineContext
source: The Timeline view item context menu
uk: Контекстне меню елемента перегляду Хронології

# view.timelineTitle
source: The Timeline view title menu
uk: Меню заголовка вигляду Хронології

# view.tunnelContext
source: The Ports view item context menu
uk: Контекстне меню елемента перегляду Портів

# view.tunnelOriginInline
source: The Ports view item origin inline menu
uk: Меню вбудованого джерела елемента перегляду портів

# view.tunnelPortInline
source: The Ports view item port inline menu
uk: Портів перегляду елемента меню портів в рядку

# view.viewTitle
source: The contributed view title menu
uk: Меню заголовків внесених переглядів

# viewContainerTitle.when
source: The {0} menu contribution must check {1} in its {2} clause.
uk: Внесок меню {0} повинен перевіряти {1} у своєму положенні {2}.

# vscode.extension.contributes.commandType.category
source: (Optional) Category string by which the command is grouped in the UI
uk: (Необов'язково) Рядок категорії, за яким команда групується в інтерфейсі користувача

# vscode.extension.contributes.commandType.command
source: Identifier of the command to execute
uk: Ідентифікатор команди для виконання

# vscode.extension.contributes.commandType.icon
source: (Optional) Icon which is used to represent the command in the UI. Either a file path, an object with file paths for dark and light themes, or a theme icon references, like `\$(zap)`
uk: (Необов'язково) Іконка, яка використовується для представлення команди в інтерфейсі. Може бути шляхом до файлу, об'єктом з шляхами до файлів для темної та світлої теми або посиланнями на іконки теми, як `\$(zap)`

# vscode.extension.contributes.commandType.icon.dark
source: Icon path when a dark theme is used
uk: Шлях до іконки, коли використовується темна тема

# vscode.extension.contributes.commandType.icon.light
source: Icon path when a light theme is used
uk: Шлях до іконки, коли використовується світла тема

# vscode.extension.contributes.commandType.precondition
source: (Optional) Condition which must be true to enable the command in the UI (menu and keybindings). Does not prevent executing the command by other means, like the `executeCommand`-api.
uk: (Необов'язково) Умова, яка повинна бути істинною, щоб активувати команду в інтерфейсі користувача (меню та прив'язки клавіш). Не заважає виконанню команди іншими способами, такими як API `executeCommand`.

# vscode.extension.contributes.commandType.shortTitle
source: (Optional) Short title by which the command is represented in the UI. Menus pick either `title` or `shortTitle` depending on the context in which they show commands.
uk: (Необов'язково) Короткий заголовок, під яким команда представлена в інтерфейсі. Меню вибирають або `title`, або `shortTitle` в залежності від контексту, в якому вони показують команди.

# vscode.extension.contributes.commandType.title
source: Title by which the command is represented in the UI
uk: Назва, під якою команда представлена в інтерфейсі користувача

# vscode.extension.contributes.commands
source: Contributes commands to the command palette.
uk: Вносить команди до палітри команд.

# vscode.extension.contributes.menuItem.alt
source: Identifier of an alternative command to execute. The command must be declared in the 'commands'-section
uk: Ідентифікатор альтернативної команди для виконання. Команда повинна бути оголошена в секції 'commands'.

# vscode.extension.contributes.menuItem.command
source: Identifier of the command to execute. The command must be declared in the 'commands'-section
uk: Ідентифікатор команди для виконання. Команда повинна бути оголошена в секції 'commands'.

# vscode.extension.contributes.menuItem.group
source: Group into which this item belongs
uk: Група, до якої належить цей елемент

# vscode.extension.contributes.menuItem.submenu
source: Identifier of the submenu to display in this item.
uk: Ідентифікатор підменю, яке потрібно відобразити в цьому елементі.

# vscode.extension.contributes.menuItem.when
source: Condition which must be true to show this item
uk: Умова, яка повинна бути істинною, щоб показати цей елемент

# vscode.extension.contributes.menus
source: Contributes menu items to the editor
uk: Додає елементи меню до редактора

# vscode.extension.contributes.submenu.icon
source: (Optional) Icon which is used to represent the submenu in the UI. Either a file path, an object with file paths for dark and light themes, or a theme icon references, like `\$(zap)`
uk: (Необов'язково) Іконка, яка використовується для представлення підменю в інтерфейсі. Може бути шляхом до файлу, об'єктом з шляхами до файлів для теми темряви та світла, або посиланнями на іконки теми, такі як `\$(zap)`

# vscode.extension.contributes.submenu.icon.dark
source: Icon path when a dark theme is used
uk: Шлях до іконки, коли використовується темна тема

# vscode.extension.contributes.submenu.icon.light
source: Icon path when a light theme is used
uk: Шлях до іконки, коли використовується світла тема

# vscode.extension.contributes.submenu.id
source: Identifier of the menu to display as a submenu.
uk: Ідентифікатор меню, яке потрібно відобразити як підменю.

# vscode.extension.contributes.submenu.label
source: The label of the menu item which leads to this submenu.
uk: Мітка елемента меню, яка веде до цього підменю.

# vscode.extension.contributes.submenus
source: Contributes submenu items to the editor
uk: Вносить підменю елементи до редактора

# webview.context
source: The webview context menu
uk: Контекстне меню веб-перегляду
