Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_logs.xlf
Languages: uk

# remote name
source: {0} (Remote)
uk: {0} (Віддалено)

source: Set Default Log Level
uk: Встановити рівень журналювання за замовчуванням

source: Show Window Log
uk: Показати журнал вікна

source: All
uk: Усе

source: Current
uk: Поточний

source: Default
uk: За замовчуванням

source: Extension Logs
uk: Журнали розширення

# log placeholder
source: Select Log file
uk: Виберіть файл журналу

# loggers
source: Logs
uk: Журнали

# openSessionLogFile
source: Open Window Log File (Session)...
uk: Відкрити журнал файлу вікна (сесія)...

# resetLogLevel
source: Set as Default Log Level
uk: Встановити як рівень журналу за замовчуванням

source: Select log level
uk: Виберіть рівень журналювання

# selectLogLevelFor
source: {0}: Select log level
uk: {0}: Виберіть рівень журналювання

# selectlog
source: Set Log Level
uk: Встановити рівень журналювання

# sessions placeholder
source: Select Session
uk: Вибрати сесію

source: Set Log Level...
uk: Встановити рівень журналювання...

source: Open Extension Logs Folder
uk: Відкрити папку журналів розширення

source: Open Logs Folder
uk: Відкрити папку журналів
