Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_themes.xlf
Languages: uk

# error.cannotparseicontheme
source: Problems parsing file icons file: {0}
uk: Проблеми з розбором файлу значків: {0}

# error.invalidformat
source: Invalid format for file icons theme file: Object expected.
uk: Неправильний формат для файлу теми значків: очікувався об'єкт.

# defaultTheme
source: Default
uk: За замовчуванням

# error.cannotparseicontheme
source: Problems parsing product icons file: {0}
uk: Проблеми з розбором файлу значків: {0}

# error.fontId
source: Missing or invalid font id '{0}'. Skipping font definition.
uk: Відсутній або недійсний ідентифікатор шрифту '{0}'. Пропускаємо визначення шрифту.

# error.fontSrc
source: Invalid font source in font '{0}'. Ignoring source.
uk: Недійсне джерело шрифту в шрифті '{0}'. Джерело ігнорується.

# error.fontStyle
source: Invalid font style in font '{0}'. Ignoring setting.
uk: Недійсний стиль шрифту в шрифті '{0}'. Ігноруємо налаштування.

# error.fontWeight
source: Invalid font weight in font '{0}'. Ignoring setting.
uk: Неправильна вага шрифту в шрифті '{0}'. Ігноруємо налаштування.

# error.icon.font
source: Skipping icon definition '{0}'. Unknown font.
uk: Пропускаємо визначення іконки '{0}'. Невідомий шрифт.

# error.icon.fontCharacter
source: Skipping icon definition '{0}': Needs to be defined
uk: Пропускаємо визначення іконки '{0}': Потрібно визначити

# error.invalidformat
source: Invalid format for product icons theme file: Object expected.
uk: Неправильний формат для файлу теми значків: очікувався об'єкт.

# error.missingProperties
source: Invalid format for product icons theme file: Must contain iconDefinitions and fonts.
uk: Неправильний формат файлу теми значків продукту: Повинен містити iconDefinitions та fonts.

# error.noFontSrc
source: No valid font source in font '{0}'. Ignoring font definition.
uk: Немає дійсного джерела шрифту в шрифті '{0}'. Ігноруємо визначення шрифту.

# error.parseicondefs
source: Problems processing product icons definitions in {0}: {1}
uk: Проблеми з обробкою визначень іконок продуктів у {0}: {1}

# error.cannotloadtheme
source: Unable to load {0}: {1}
uk: Не вдалося завантажити {0}: {1}

source: Colors
uk: Кольори

# contributes.color
source: Contributes extension defined themable colors
uk: Сприяє розширенню визначених темних кольорів

# contributes.color.description
source: The description of the themable color
uk: Опис темізованого кольору

# contributes.color.id
source: The identifier of the themable color
uk: Ідентифікатор кольору, що підлягає темізації

# contributes.color.id.format
source: Identifiers must only contain letters, digits and dots and can not start with a dot
uk: Ідентифікатори можуть містити лише літери, цифри та крапки і не можуть починатися з крапки.

# contributes.defaults.dark
source: The default color for dark themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default.
uk: Колір за замовчуванням для темних тем. Або значення кольору в шістнадцятковому форматі (#RRGGBB[AA]), або ідентифікатор кольору, що підлягає темізації, який забезпечує значення за замовчуванням.

# contributes.defaults.highContrast
source: The default color for high contrast dark themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default. If not provided, the `dark` color is used as default for high contrast dark themes.
uk: Колір за замовчуванням для тем з високим контрастом у темних тонах. Або значення кольору в шістнадцятковому форматі (#RRGGBB[AA]), або ідентифікатор кольору, що підлягає темізації, який надає значення за замовчуванням. Якщо не вказано, використовується колір `dark` як значення за замовчуванням для тем з високим контрастом у темних тонах.

# contributes.defaults.highContrastLight
source: The default color for high contrast light themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default. If not provided, the `light` color is used as default for high contrast light themes.
uk: Колір за замовчуванням для світлих тем з високим контрастом. Або значення кольору в шістнадцятковому форматі (#RRGGBB[AA]), або ідентифікатор кольору, що підлягає темізації, який надає значення за замовчуванням. Якщо не вказано, використовується колір `light` як значення за замовчуванням для світлих тем з високим контрастом.

# contributes.defaults.light
source: The default color for light themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default.
uk: Колір за замовчуванням для світлих тем. Або значення кольору в шістнадцятковому форматі (#RRGGBB[AA]), або ідентифікатор кольору, що підлягає темізації, який надає значення за замовчуванням.

# defaultDark
source: Dark Default
uk: Темний за замовчуванням

# defaultHC
source: High Contrast Default
uk: Високий контраст за замовчуванням

# defaultLight
source: Light Default
uk: Світлий за замовчуванням

source: Description
uk: Опис

# invalid.colorConfiguration
source: 'configuration.colors' must be a array
uk: 'configuration.colors' має бути масивом

# invalid.default.colorType
source: {0} must be either a color value in hex (#RRGGBB[AA] or #RGB[A]) or the identifier of a themable color which provides the default.
uk: {0} повинен бути або значенням кольору в шістнадцятковому форматі (#RRGGBB[AA] або #RGB[A]), або ідентифікатором кольору, що підлягає темізації, який надає значення за замовчуванням.

# invalid.defaults
source: 'configuration.colors.defaults' must be defined and must contain 'light' and 'dark'
uk: 'configuration.colors.defaults' має бути визначено і повинно містити 'light' та 'dark'

# invalid.defaults.highContrast
source: If defined, 'configuration.colors.defaults.highContrast' must be a string.
uk: Якщо визначено, 'configuration.colors.defaults.highContrast' має бути рядком.

# invalid.defaults.highContrastLight
source: If defined, 'configuration.colors.defaults.highContrastLight' must be a string.
uk: Якщо визначено, 'configuration.colors.defaults.highContrastLight' має бути рядком.

# invalid.description
source: 'configuration.colors.description' must be defined and can not be empty
uk: 'configuration.colors.description' має бути визначено і не може бути порожнім

# invalid.id
source: 'configuration.colors.id' must be defined and can not be empty
uk: 'configuration.colors.id' повинен бути визначений і не може бути порожнім

# invalid.id.format
source: 'configuration.colors.id' must only contain letters, digits and dots and can not start with a dot
uk: 'configuration.colors.id' може містити лише літери, цифри та крапки і не може починатися з крапки.

# error.cannotload
source: Problems loading tmTheme file {0}: {1}
uk: Проблеми з завантаженням файлу tmTheme {0}: {1}

# error.cannotparse
source: Problems parsing tmTheme file: {0}
uk: Проблеми з парсингом файлу tmTheme: {0}

# error.cannotparsejson
source: Problems parsing JSON theme file: {0}
uk: Проблеми з розбором файлу теми JSON: {0}

# error.invalidformat
source: Invalid format for JSON theme file: Object expected.
uk: Неправильний формат для файлу теми значків: очікувався об'єкт.

# error.invalidformat.colors
source: Problem parsing color theme file: {0}. Property 'colors' is not of type 'object'.
uk: Проблема з розбором файлу кольорової теми: {0}. Властивість 'colors' не є типом 'object'.

# error.invalidformat.semanticTokenColors
source: Problem parsing color theme file: {0}. Property 'semanticTokenColors' contains a invalid selector
uk: Проблема з парсингом файлу кольорової теми: {0}. Властивість 'semanticTokenColors' містить недійсний селектор.

# error.invalidformat.tokenColors
source: Problem parsing color theme file: {0}. Property 'tokenColors' should be either an array specifying colors or a path to a TextMate theme file
uk: Проблема з розбором файлу кольорової теми: {0}. Властивість 'tokenColors' повинна бути або масивом, що вказує кольори, або шляхом до файлу теми TextMate.

# error.plist.invalidformat
source: Problem parsing tmTheme file: {0}. 'settings' is not array.
uk: Проблема з парсингом файлу tmTheme: {0}. 'settings' не є масивом.

# schema.colors
source: Colors for syntax highlighting
uk: Кольори для підсвічування синтаксису

# schema.fontStyle.error
source: Font style must be 'italic', 'bold', 'underline', 'strikethrough' or a combination or the empty string.
uk: Стиль шрифту повинен бути 'курсив', 'жирний', 'підкреслений', 'перекреслений' або комбінацією, або порожнім рядком.

# schema.properties.name
source: Description of the rule.
uk: Опис правила.

# schema.properties.scope
source: Scope selector against which this rule matches.
uk: Селектор області, з яким це правило співпадає.

# schema.semanticTokenColors
source: Colors for semantic tokens
uk: Кольори для семантичних токенів

# schema.supportsSemanticHighlighting
source: Whether semantic highlighting should be enabled for this theme.
uk: Чи слід увімкнути семантичне підсвічування для цієї теми.

# schema.token.background.warning
source: Token background colors are currently not supported.
uk: Фонові кольори токенів наразі не підтримуються.

# schema.token.fontStyle
source: Font style of the rule: 'italic', 'bold', 'underline', 'strikethrough' or a combination. The empty string unsets inherited settings.
uk: Стиль шрифту правила: 'курсив', 'жирний', 'підкреслений', 'перекреслений' або комбінація. Порожній рядок скидає успадковані налаштування.

# schema.token.fontStyle.none
source: None (clear inherited style)
uk: Немає (очистити успадкований стиль)

# schema.token.foreground
source: Foreground color for the token.
uk: Колір переднього плану для токена.

# schema.token.settings
source: Colors and styles for the token.
uk: Кольори та стилі для токена.

# schema.tokenColors.path
source: Path to a tmTheme file (relative to the current file).
uk: Шлях до файлу tmTheme (відносно поточного файлу).

# schema.workbenchColors
source: Colors in the workbench
uk: Кольори в робочій області

# schema.file
source: The default file icon, shown for all files that don't match any extension, filename or language id.
uk: Іконка файлу за замовчуванням, яка відображається для всіх файлів, що не відповідають жодному розширенню, імені файлу або ідентифікатору мови.

# schema.fileExtension
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значка для асоціації.

# schema.fileExtensions
source: Associates file extensions to icons. The object key is the file extension name. The extension name is the last segment of a file name after the last dot (not including the dot). Extensions are compared case insensitive.
uk: Асоціює розширення файлів з іконками. Ключ об'єкта - це назва розширення файлу. Назва розширення - це останній сегмент назви файлу після останньої крапки (не враховуючи крапку). Розширення порівнюються без урахування регістру.

# schema.fileName
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значка для асоціації.

# schema.fileNames
source: Associates file names to icons. The object key is the full file name, but not including any path segments. File name can include dots and a possible file extension. No patterns or wildcards are allowed. File name matching is case insensitive.
uk: Прив'язує імена файлів до значків. Ключ об'єкта - це повне ім'я файлу, але без будь-яких сегментів шляху. Ім'я файлу може містити крапки та можливе розширення файлу. Шаблони або символи підстановки не дозволяються. Порівняння імен файлів не залежить від регістру.

# schema.folder
source: The folder icon for collapsed folders, and if folderExpanded is not set, also for expanded folders.
uk: Іконка папки для згорнутіх папок, а якщо folderExpanded не встановлено, також для розгорнутіх папок.

# schema.folderExpanded
source: The folder icon for expanded folders. The expanded folder icon is optional. If not set, the icon defined for folder will be shown.
uk: Іконка папки для розгорнутого папки. Іконка розгорнутої папки є необов'язковою. Якщо не встановлено, буде показано іконку, визначену для папки.

# schema.folderName
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значка для асоціації.

# schema.folderNameExpanded
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення іконки для асоціації.

# schema.folderNames
source: Associates folder names to icons. The object key is the folder name, not including any path segments. No patterns or wildcards are allowed. Folder name matching is case insensitive.
uk: Прив'язує назви папок до значків. Ключ об'єкта - це назва папки, без урахування будь-яких сегментів шляху. Шаблони або символи підстановки не дозволяються. Порівняння назв папок не чутливе до регістру.

# schema.folderNamesExpanded
source: Associates folder names to icons for expanded folders. The object key is the folder name, not including any path segments. No patterns or wildcards are allowed. Folder name matching is case insensitive.
uk: Прив'язує імена папок до значків для розгорнутого папок. Ключ об'єкта - це ім'я папки, без урахування будь-яких сегментів шляху. Шаблони або символи підстановки не дозволяються. Порівняння імен папок не чутливе до регістру.

# schema.font-format
source: The format of the font.
uk: Формат шрифту.

# schema.font-path
source: The font path, relative to the current file icon theme file.
uk: Шлях до шрифту, відносно поточного файлу теми значків.

# schema.font-size
source: The default size of the font. We strongly recommend using a percentage value, for example: 125%.
uk: Розмір шрифту за замовчуванням. Ми настійно рекомендуємо використовувати значення у відсотках, наприклад: 125%.

# schema.font-style
source: The style of the font. See https://developer.mozilla.org/en-US/docs/Web/CSS/font-style for valid values.
uk: Стиль шрифту. Дивіться https://developer.mozilla.org/en-US/docs/Web/CSS/font-style для дійсних значень.

# schema.font-weight
source: The weight of the font. See https://developer.mozilla.org/en-US/docs/Web/CSS/font-weight for valid values.
uk: Вага шрифту. Дивіться https://developer.mozilla.org/en-US/docs/Web/CSS/font-weight для дійсних значень.

# schema.fontCharacter
source: When using a glyph font: The character in the font to use.
uk: Коли використовуєте шрифт гліфів: Символ у шрифті, який потрібно використовувати.

# schema.fontColor
source: When using a glyph font: The color to use.
uk: Коли використовуєте шрифт гліфів: Колір, який слід використовувати.

# schema.fontId
source: When using a font: The id of the font. If not set, defaults to the first font definition.
uk: Коли використовуєте шрифт: Ідентифікатор шрифту. Якщо не встановлено, за замовчуванням використовується перше визначення шрифту.

# schema.fontSize
source: When using a font: The font size in percentage to the text font. If not set, defaults to the size in the font definition.
uk: При використанні шрифту: Розмір шрифту у відсотках до текстового шрифту. Якщо не встановлено, за замовчуванням використовується розмір, визначений у шрифті.

# schema.fonts
source: Fonts that are used in the icon definitions.
uk: Шрифти, які використовуються в визначеннях ікон.

# schema.hidesExplorerArrows
source: Configures whether the file explorer's arrows should be hidden when this theme is active.
uk: Налаштовує, чи повинні бути приховані стрілки провідника файлів, коли ця тема активна.

# schema.highContrast
source: Optional associations for file icons in high contrast color themes.
uk: Додаткові асоціації для значків файлів у темах високого контрасту.

# schema.iconDefinition
source: An icon definition. The object key is the ID of the definition.
uk: Визначення іконки. Ключ об'єкта - це ID визначення.

# schema.iconDefinitions
source: Description of all icons that can be used when associating files to icons.
uk: Опис усіх значків, які можна використовувати при асоціюванні файлів з значками.

# schema.iconPath
source: When using a SVG or PNG: The path to the image. The path is relative to the icon set file.
uk: Коли використовуєте SVG або PNG: Шлях до зображення. Шлях є відносним до файлу набору іконок.

# schema.id
source: The ID of the font.
uk: Ідентифікатор шрифту.

# schema.languageId
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значка для асоціації.

# schema.languageIds
source: Associates languages to icons. The object key is the language id as defined in the language contribution point.
uk: Прив'язує мови до іконок. Ключ об'єкта - це ідентифікатор мови, визначений у точці внесення мови.

# schema.light
source: Optional associations for file icons in light color themes.
uk: Необов'язкові асоціації для значків файлів у світлих кольорових темах.

# schema.rootFolder
source: The folder icon for collapsed root folders, and if rootFolderExpanded is not set, also for expanded root folders.
uk: Іконка папки для згорнутого кореневого каталогу, а якщо rootFolderExpanded не встановлено, також для розгорнутого кореневого каталогу.

# schema.rootFolderExpanded
source: The folder icon for expanded root folders. The expanded root folder icon is optional. If not set, the icon defined for root folder will be shown.
uk: Іконка папки для розгорнутого кореневого каталогу. Іконка розгорнутого кореневого каталогу є необов'язковою. Якщо не встановлено, буде показано іконку, визначену для кореневого каталогу.

# schema.rootFolderNameExpanded
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значка для асоціації.

# schema.rootFolderNames
source: Associates root folder names to icons. The object key is the root folder name. No patterns or wildcards are allowed. Root folder name matching is case insensitive.
uk: Прив'язує імена кореневих папок до значків. Ключ об'єкта - це ім'я кореневої папки. Шаблони або символи підстановки не дозволяються. Відповідність імені кореневої папки не залежить від регістру.

# schema.rootFolderNamesExpanded
source: Associates root folder names to icons for expanded root folders. The object key is the root folder name. No patterns or wildcards are allowed. Root folder name matching is case insensitive.
uk: Прив'язує імена кореневих папок до значків для розгорнутого кореневого каталогу. Ключ об'єкта - це ім'я кореневої папки. Шаблони або символи підстановки не дозволяються. Порівняння імен кореневих папок не чутливе до регістру.

# schema.showLanguageModeIcons
source: Configures whether the default language icons should be used if the theme does not define an icon for a language.
uk: Налаштовує, чи слід використовувати значки за замовчуванням для мов, якщо тема не визначає значок для мови.

# schema.src
source: The location of the font.
uk: Місцезнаходження шрифту.

# contributes.icon.default
source: The default of the icon. Either a reference to an existing ThemeIcon or an icon in an icon font.
uk: За замовчуванням значок. Або посилання на існуючий ThemeIcon, або значок у шрифті значків.

# contributes.icon.default.fontCharacter
source: The character for the icon in the icon font.
uk: Символ для значка в шрифті значків.

# contributes.icon.default.fontPath
source: The path of the icon font that defines the icon.
uk: Шлях до шрифту значків, який визначає значок.

# contributes.icon.description
source: The description of the themable icon
uk: Опис темізованої іконки

# contributes.icon.id
source: The identifier of the themable icon
uk: Ідентифікатор темізованої іконки

# contributes.icon.id.format
source: Identifiers can only contain letters, digits and minuses and need to consist of at least two segments in the form `component-iconname`.
uk: Ідентифікатори можуть містити лише літери, цифри та дефіси і повинні складатися щонайменше з двох сегментів у формі `component-iconname`.

# contributes.icons
source: Contributes extension defined themable icons
uk: Сприяє розширенню, визначеному темами іконок

# invalid.icons.configuration
source: 'configuration.icons' must be an object with the icon names as properties.
uk: 'configuration.icons' повинен бути об'єктом з іменами іконок як властивостями.

# invalid.icons.default
source: 'configuration.icons.default' must be either a reference to the id of an other theme icon (string) or a icon definition (object) with properties `fontPath` and `fontCharacter`.
uk: 'configuration.icons.default' має бути або посиланням на ідентифікатор іншої іконки теми (рядок), або визначенням іконки (об'єкт) з властивостями `fontPath` та `fontCharacter`.

# invalid.icons.default.fontPath.extension
source: Expected `contributes.icons.default.fontPath` to have file extension 'woff', woff2' or 'ttf', is '{0}'.
uk: Очікувалося, що `contributes.icons.default.fontPath` матиме розширення файлу 'woff', 'woff2' або 'ttf', а є '{0}'.

# invalid.icons.default.fontPath.path
source: Expected `contributes.icons.default.fontPath` ({0}) to be included inside extension's folder ({0}).
uk: Очікувалося, що `contributes.icons.default.fontPath` ({0}) буде включено в папку розширення ({0}).

# invalid.icons.description
source: 'configuration.icons.description' must be defined and can not be empty
uk: 'configuration.icons.description' має бути визначено і не може бути порожнім

# invalid.icons.id.format
source: 'configuration.icons' keys represent the icon id and can only contain letter, digits and minuses. They need to consist of at least two segments in the form `component-iconname`.
uk: Ключі 'configuration.icons' представляють ідентифікатор іконки і можуть містити лише літери, цифри та дефіси. Вони повинні складатися принаймні з двох сегментів у формі `component-iconname`.

# schema.font-path
source: The font path, relative to the current product icon theme file.
uk: Шлях до шрифту, відносно поточного файлу теми значків.

# schema.iconDefinitions
source: Association of icon name to a font character.
uk: Опис усіх значків, які можна використовувати при асоціюванні файлів з значками.

# autoDetectHighContrast
source: If enabled, will automatically change to high contrast theme if the OS is using a high contrast theme. The high contrast theme to use is specified by {0} and {1}.
uk: Якщо увімкнено, автоматично зміниться на тему з високим контрастом, якщо ОС використовує тему з високим контрастом. Тему з високим контрастом, яку слід використовувати, вказують {0} та {1}.

# colorTheme
source: Specifies the color theme used in the workbench when {0} is not enabled.
uk: {0} стане посиланням на інше налаштування.

# colorThemeError
source: Theme is unknown or not installed.
uk: Тема невідома або не встановлена.

# defaultProductIconThemeDesc
source: Default
uk: За замовчуванням

# defaultProductIconThemeLabel
source: Default
uk: За замовчуванням

# detectColorScheme
source: If enabled, will automatically select a color theme based on the system color mode. If the system color mode is dark, {0} is used, else {1}.
uk: Якщо увімкнено, автоматично вибере кольорову тему на основі режиму кольору системи. Якщо режим кольору системи темний, використовується {0}, інакше {1}.

# editorColors
source: Overrides editor syntax colors and font style from the currently selected color theme.
uk: Перезаписує синтаксичні кольори редактора та стиль шрифту з поточно вибраної кольорової теми.

# editorColors.comments
source: Sets the colors and styles for comments
uk: Встановлює кольори та стилі для коментарів

# editorColors.functions
source: Sets the colors and styles for functions declarations and references.
uk: Встановлює кольори та стилі для оголошень функцій та посилань.

# editorColors.keywords
source: Sets the colors and styles for keywords.
uk: Встановлює кольори та стилі для ключових слів.

# editorColors.numbers
source: Sets the colors and styles for number literals.
uk: Встановлює кольори та стилі для числових літералів.
