Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_preferences.xlf
Languages: uk

# objectPairHintLabel
source: The property `{0}` is set to `{1}`.
uk: Властивість `{0}` встановлена на `{1}`.

# objectPairHintLabelWithSource
source: The property `{0}` is set to `{1}` by `{2}`.
uk: Властивість `{0}` встановлено на `{1}` від `{2}`.

# objectValueHeader
source: Value
uk: Значення

# objectValueInputPlaceholder
source: Value
uk: Значення

# okButton
source: OK
uk: Добре

source: Remove Exclude Item
uk: Видалити виключений елемент

source: Remove Include Item
uk: Видалити елемент включення

source: Remove Item
uk: Видалити елемент

source: Reset Item
uk: Скинути елемент

# groupRowAriaLabel
source: {0}, group
uk: {0}, група

# settingsTOC
source: Settings Table of Contents
uk: Зміст налаштувань

# experimentalIndicatorDescription
source: Experimental setting: this setting controls a new feature that is actively being developed and may be unstable. It is subject to change or removal.
uk: Експериментальні налаштування: це налаштування контролює нову функцію, яка активно розробляється і може бути нестабільною. Вона підлягає змінам або видаленню.

# previewIndicatorDescription
source: Preview setting: this setting controls a new feature that is still under refinement yet ready to use. Feedback is welcome.
uk: Налаштування попереднього перегляду: це налаштування контролює нову функцію, яка ще вдосконалюється, але вже готова до використання. Відгуки вітаються.

# enableNaturalLanguageSettingsSearch
source: Controls whether to enable the natural language search mode for settings. The natural language search is provided by a Microsoft online service.
uk: Контролює, чи потрібно увімкнути режим пошуку природною мовою для налаштувань. Пошук природною мовою надається онлайн-сервісом Microsoft.

# settingsSearchTocBehavior
source: Controls the behavior of the Settings editor Table of Contents while searching. If this setting is being changed in the Settings editor, the setting will take effect after the search query is modified.
uk: Контролює поведінку змісту редактора Налаштувань під час пошуку. Якщо це налаштування змінюється в редакторі Налаштувань, зміна набуде чинності після модифікації запиту пошуку.

# settingsSearchTocBehavior.filter
source: Filter the Table of Contents to just categories that have matching settings. Clicking on a category will filter the results to that category.
uk: Відфільтруйте зміст, щоб залишити лише категорії з відповідними налаштуваннями. Натискання на категорію відфільтрує результати за цією категорією.

# settingsSearchTocBehavior.hide
source: Hide the Table of Contents while searching.
uk: Сховати зміст під час пошуку.

# splitSettingsEditorLabel
source: Split Settings Editor
uk: Редактор налаштувань розділу

# useWeightedKeySearch
source: Controls whether to use an experimental ranking algorithm for search results in the Settings editor. The newer algorithm is still in development and aims to show fewer and more relevant results.
uk: Контролює, чи використовувати експериментальний алгоритм ранжування для результатів пошуку в редакторі Налаштувань. Новіший алгоритм все ще розробляється і має на меті показувати менше та більш релевантних результатів.

# focusedRowBackground
source: The background color of a settings row when focused.
uk: Колір фону рядка налаштувань при фокусуванні.

# headerForeground
source: The foreground color for a section header or active title.
uk: Колір переднього плану для заголовка секції або активного заголовка.

# modifiedItemForeground
source: The color of the modified setting indicator.
uk: Колір модифікованого індикатора налаштувань.

# numberInputBoxBackground
source: Settings editor number input box background.
uk: Фон поля введення чисел редактора налаштувань.

# numberInputBoxBorder
source: Settings editor number input box border.
uk: Кордон поля введення номера редактора налаштувань.

# numberInputBoxForeground
source: Settings editor number input box foreground.
uk: Поле введення чисел редактора налаштувань на передньому плані.

# settings.focusedRowBorder
source: The color of the row's top and bottom border when the row is focused.
uk: Колір верхньої та нижньої межі рядка, коли рядок має фокус.

# settings.rowHoverBackground
source: The background color of a settings row when hovered.
uk: Колір фону рядка налаштувань при наведенні.

# settingsCheckboxBackground
source: Settings editor checkbox background.
uk: Фон прапорця редактора налаштувань.

# settingsCheckboxBorder
source: Settings editor checkbox border.
uk: Кордон чекбокса редактора налаштувань.

# settingsCheckboxForeground
source: Settings editor checkbox foreground.
uk: Передній план прапорця редактора налаштувань.

# settingsDropdownBackground
source: Settings editor dropdown background.
uk: Фон випадаючого меню редактора налаштувань.

# settingsDropdownBorder
source: Settings editor dropdown border.
uk: Границя випадаючого списку редактора налаштувань.

# settingsDropdownForeground
source: Settings editor dropdown foreground.
uk: Фоновий колір випадаючого меню редактора налаштувань.

# settingsDropdownListBorder
source: Settings editor dropdown list border. This surrounds the options and separates the options from the description.
uk: Границя випадаючого списку редактора налаштувань. Це оточує варіанти та відокремлює їх від опису.

# settingsHeaderBorder
source: The color of the header container border.
uk: Колір рамки контейнера заголовка.

# settingsHeaderHoverForeground
source: The foreground color for a section header or hovered title.
uk: Колір переднього плану для заголовка секції або заголовка при наведенні.

# settingsSashBorder
source: The color of the Settings editor splitview sash border.
uk: Колір межі розділу редактора Налаштувань.

# textInputBoxBackground
source: Settings editor text input box background.
uk: Фон текстового поля вводу редактора налаштувань.

# textInputBoxBorder
source: Settings editor text input box border.
uk: Кордон текстового поля введення редактора налаштувань.

# textInputBoxForeground
source: Settings editor text input box foreground.
uk: Текстове поле вводу редактора налаштувань на передньому плані.
