Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_textMate.xlf
Languages: uk

# alreadyDebugging
source: Already Logging.
uk: Вже ведеться запис.

# invalid.embeddedLanguages
source: Invalid value in `contributes.{0}.embeddedLanguages`. Must be an object map from scope name to language. Provided value: {1}
uk: Неправильне значення в `contributes.{0}.embeddedLanguages`. Має бути об'єктною картою від імені області до мови. Надане значення: {1}

# invalid.injectTo
source: Invalid value in `contributes.{0}.injectTo`. Must be an array of language scope names. Provided value: {1}
uk: Недійсне значення в `contributes.{0}.injectTo`. Має бути масивом імен мовних областей. Надане значення: {1}

# invalid.language
source: Unknown language in `contributes.{0}.language`. Provided value: {1}
uk: Невідома мова в `contributes.{0}.language`. Надане значення: {1}

# invalid.path.0
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікується рядок у `contributes.{0}.path`. Надане значення: {1}

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікувалося, що `contributes.{0}.path` ({1}) буде включено в папку розширення ({2}). Це може зробити розширення непортативним.

# invalid.scopeName
source: Expected string in `contributes.{0}.scopeName`. Provided value: {1}
uk: Очікується рядок у `contributes.{0}.scopeName`. Надане значення: {1}

# invalid.tokenTypes
source: Invalid value in `contributes.{0}.tokenTypes`. Must be an object map from scope name to token type. Provided value: {1}
uk: Недійсне значення в `contributes.{0}.tokenTypes`. Має бути об'єктною картою від імені області до типу токена. Надане значення: {1}

# progress1
source: Preparing to log TM Grammar parsing. Press Stop when finished.
uk: Підготовка до запису розбору граматики TM. Натисніть Стоп, коли закінчите.

# progress2
source: Now logging TM Grammar parsing. Press Stop when finished.
uk: Тепер ведеться журнал розбору граматики TM. Натисніть Стоп, коли закінчите.

source: Stop
uk: Зупинитися

# vscode.extension.contributes.grammars
source: Contributes textmate tokenizers.
uk: Сприяє токенізаторам textmate.

# vscode.extension.contributes.grammars.balancedBracketScopes
source: Defines which scope names contain balanced brackets.
uk: Визначає, які імена областей містять збалансовані дужки.

# vscode.extension.contributes.grammars.embeddedLanguages
source: A map of scope name to language id if this grammar contains embedded languages.
uk: Карта імені області до ідентифікатора мови, якщо ця граматика містить вбудовані мови.

# vscode.extension.contributes.grammars.injectTo
source: List of language scope names to which this grammar is injected to.
uk: Список назв мовних областей, до яких ця граматика впроваджена.

# vscode.extension.contributes.grammars.language
source: Language identifier for which this syntax is contributed to.
uk: Ідентифікатор мови, для якої ця синтаксична конструкція була додана.

# vscode.extension.contributes.grammars.path
source: Path of the tmLanguage file. The path is relative to the extension folder and typically starts with './syntaxes/'.
uk: Шлях до файлу tmLanguage. Шлях є відносним до папки розширення і зазвичай починається з './syntaxes/'.

# vscode.extension.contributes.grammars.scopeName
source: Textmate scope name used by the tmLanguage file.
uk: Ім'я області Textmate, що використовується файлом tmLanguage.

# vscode.extension.contributes.grammars.tokenTypes
source: A map of scope name to token types.
uk: Карта імені області до типів токенів.

# vscode.extension.contributes.grammars.unbalancedBracketScopes
source: Defines which scope names do not contain balanced brackets.
uk: Визначає, які імена областей не містять збалансованих дужок.
