Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_accessibility.xlf
Languages: uk

# accessibility.debugWatchVariableAnnouncements
source: Controls whether variable changes should be announced in the debug watch view.
uk: Контролює, чи слід оголошувати зміни змінних у режимі перегляду відладки.

# accessibility.hideAccessibleView
source: Controls whether the Accessible View is hidden.
uk: Контролює, чи приховано Доступний вигляд.

# accessibility.replEditor.readLastExecutedOutput
source: Controls whether the output from an execution in the native REPL will be announced.
uk: Контролює, чи буде оголошено вихід з виконання в рідному REPL.

# accessibility.signalOptions.debouncePositionChanges
source: Whether or not position changes should be debounced
uk: Чи слід дебаунсити зміни позиції

# accessibility.signalOptions.delays.errorAtPosition.announcement
source: The delay in milliseconds before an announcement is made when there's an error at the position.
uk: Затримка в мілісекундах перед оголошенням, коли виникає помилка на позиції.

# accessibility.signalOptions.delays.errorAtPosition.sound
source: The delay in milliseconds before a sound is played when there's an error at the position.
uk: Затримка в мілісекундах перед відтворенням звуку, коли виникає помилка на позиції.

# accessibility.signalOptions.delays.general.announcement
source: The delay in milliseconds before an announcement is made.
uk: Затримка в мілісекундах перед оголошенням.

# accessibility.signalOptions.delays.general.sound
source: The delay in milliseconds before a sound is played.
uk: Затримка в мілісекундах перед відтворенням звуку.

# accessibility.signalOptions.delays.warningAtPosition.announcement
source: The delay in milliseconds before an announcement is made when there's a warning at the position.
uk: Затримка в мілісекундах перед оголошенням, коли є попередження на позиції.

# accessibility.signalOptions.delays.warningAtPosition.sound
source: The delay in milliseconds before a sound is played when there's a warning at the position.
uk: Затримка в мілісекундах перед відтворенням звуку, коли є попередження на позиції.

# accessibility.signalOptions.volume
source: The volume of the sounds in percent (0-100).
uk: Гучність звуків у відсотках (0-100).

# accessibility.signals.chatEditModifiedFile
source: Plays a sound / audio cue when revealing a file with changes from chat edits
uk: Відтворює звуковий / аудіо сигнал при відкритті файлу зі змінами з редагувань чату

# accessibility.signals.chatEditModifiedFile.sound
source: Plays a sound when revealing a file with changes from chat edits
uk: Відтворює звук при відкритті файлу з змінами з редагувань чату

# accessibility.signals.chatRequestSent
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a chat request is made.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли надсилається запит на чат.

# accessibility.signals.chatRequestSent.announcement
source: Announces when a chat request is made.
uk: Оголошує, коли надсилається запит на чат.

# accessibility.signals.chatRequestSent.sound
source: Plays a sound when a chat request is made.
uk: Відтворює звук, коли надсилається запит на чат.

# accessibility.signals.chatResponseReceived
source: Plays a sound / audio cue when the response has been received.
uk: Відтворює звуковий / аудіо сигнал, коли відповідь була отримана.

# accessibility.signals.chatResponseReceived.sound
source: Plays a sound on when the response has been received.
uk: Відтворює звук, коли відповідь була отримана.

# accessibility.signals.clear
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a feature is cleared (for example, the terminal, Debug Console, or Output channel).
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли функція очищається (наприклад, термінал, Консоль налагодження або канал виводу).

# accessibility.signals.clear.announcement
source: Announces when a feature is cleared.
uk: Оголошує, коли функцію очищено.

# accessibility.signals.clear.sound
source: Plays a sound when a feature is cleared.
uk: Відтворює звук, коли функцію очищено.

# accessibility.signals.codeActionApplied
source: Plays a sound / audio cue when the code action has been applied.
uk: Відтворює звуковий / аудіо сигнал, коли дія коду була застосована.

# accessibility.signals.codeActionApplied.sound
source: Plays a sound when the code action has been applied.
uk: Відтворює звук, коли дія коду була застосована.

# accessibility.signals.codeActionTriggered
source: Plays a sound / audio cue - when a code action has been triggered.
uk: Відтворює звуковий / аудіо сигнал - коли було активовано кодову дію.

# accessibility.signals.codeActionTriggered.sound
source: Plays a sound when a code action has been triggered.
uk: Відтворює звук, коли було активовано дію коду.

# accessibility.signals.diffLineDeleted
source: Plays a sound / audio cue when the focus moves to an deleted line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звуковий / аудіо сигнал, коли фокус переміщується на видалену лінію в режимі доступного порівняння або на наступну/попередню зміну.

# accessibility.signals.diffLineDeleted.sound
source: Plays a sound when the focus moves to an deleted line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звук, коли фокус переміщується на видалений рядок у режимі Accessible Diff Viewer або на наступну/попередню зміну.

# accessibility.signals.diffLineInserted
source: Plays a sound / audio cue when the focus moves to an inserted line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звуковий / аудіо сигнал, коли фокус переміщується на вставлений рядок у режимі Accessible Diff Viewer або на наступну/попередню зміну.

# accessibility.signals.diffLineModified
source: Plays a sound / audio cue when the focus moves to an modified line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звуковий / аудіо сигнал, коли фокус переміщується на змінену лінію в режимі Доступного перегляду змін або на наступну/попередню зміну.

# accessibility.signals.diffLineModified.sound
source: Plays a sound when the focus moves to a modified line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звук, коли фокус переміщується на змінену лінію в режимі доступного перегляду відмінностей або на наступну/попередню зміну.

# accessibility.signals.editsKept
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when edits are kept.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли редагування зберігаються.

# accessibility.signals.editsKept.announcement
source: Announces when edits are kept.
uk: Оголошує, коли зміни зберігаються.

# accessibility.signals.editsKept.sound
source: Plays a sound when edits are kept.
uk: Відтворює звук, коли зміни зберігаються.

# accessibility.signals.editsUndone
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when edits have been undone.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли редагування були скасовані.

# accessibility.signals.editsUndone.announcement
source: Announces when edits have been undone.
uk: Оголошує, коли зміни були скасовані.

# accessibility.signals.editsUndone.sound
source: Plays a sound when edits have been undone.
uk: Відтворює звук, коли редагування були скасовані.

# accessibility.signals.format
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a file or notebook is formatted.
uk: Відтворює сигнал - звук (аудіосигнал) та/або оголошення (сповіщення) - коли файл або блокнот форматуються.

# accessibility.signals.format.always
source: Plays the sound whenever a file is formatted, including if it is set to format on save, type, or, paste, or run of a cell.
uk: Відтворює звук щоразу, коли файл форматують, включаючи випадки, коли він налаштований на форматування під час збереження, введення, вставки або виконання команди в клітинці.

# accessibility.signals.format.announcement
source: Announces when a file or notebook is formatted.
uk: Оголошує, коли файл або блокнот відформатовано.

# accessibility.signals.format.announcement.always
source: Announces whenever a file is formatted, including if it is set to format on save, type, or, paste, or run of a cell.
uk: Оголошує щоразу, коли файл форматовано, включаючи випадки, коли він налаштований на форматування під час збереження, типу, вставки або виконання клітинки.

# accessibility.signals.format.announcement.never
source: Never announces.
uk: Ніколи не оголошує.

# accessibility.signals.format.announcement.userGesture
source: Announces when a user explicitly formats a file.
uk: Оголошує, коли користувач явно форматує файл.

# accessibility.signals.format.never
source: Never plays the sound.
uk: Ніколи не відтворює звук.

# accessibility.signals.format.sound
source: Plays a sound when a file or notebook is formatted.
uk: Відтворює звук, коли файл або блокнот форматується.

# accessibility.signals.format.userGesture
source: Plays the sound when a user explicitly formats a file.
uk: Відтворює звук, коли користувач явно форматує файл.

# accessibility.signals.lineHasBreakpoint
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the active line has a breakpoint.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли активний рядок має точку зупинки.

# accessibility.signals.lineHasBreakpoint.announcement
source: Announces when the active line has a breakpoint.
uk: Оголошує, коли активний рядок має точку зупинки.

# accessibility.signals.lineHasBreakpoint.sound
source: Plays a sound when the active line has a breakpoint.
uk: Відтворює звук, коли активний рядок має точку зупинки.

# accessibility.signals.lineHasError
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the active line has an error.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли активний рядок має помилку.

# accessibility.signals.lineHasError.announcement
source: Announces when the active line has an error.
uk: Оголошує, коли активна лінія має помилку.

# accessibility.signals.lineHasError.sound
source: Plays a sound when the active line has an error.
uk: Відтворює звук, коли активний рядок має помилку.

# accessibility.signals.lineHasFoldedArea
source: Plays a signal - sound (audio cue) and/or announcement (alert) - the active line has a folded area that can be unfolded.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - активний рядок має складену область, яку можна розгорнути.

# accessibility.signals.lineHasFoldedArea.announcement
source: Announces when the active line has a folded area that can be unfolded.
uk: Оголошує, коли активний рядок має складену область, яку можна розгорнути.

# accessibility.signals.lineHasFoldedArea.sound
source: Plays a sound when the active line has a folded area that can be unfolded.
uk: Відтворює звук, коли активний рядок має складену область, яку можна розгорнути.

# accessibility.signals.lineHasInlineSuggestion
source: Plays a sound / audio cue when the active line has an inline suggestion.
uk: Відтворює звуковий / аудіо сигнал, коли активний рядок має вбудовану пропозицію.

# accessibility.signals.lineHasInlineSuggestion.sound
source: Plays a sound when the active line has an inline suggestion.
uk: Відтворює звук, коли активний рядок має вбудовану пропозицію.

# accessibility.signals.lineHasWarning
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the active line has a warning.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (попередження) - коли активна лінія має попередження.

# accessibility.signals.lineHasWarning.announcement
source: Announces when the active line has a warning.
uk: Оголошує, коли активний рядок має попередження.

# accessibility.signals.lineHasWarning.sound
source: Plays a sound when the active line has a warning.
uk: Відтворює звук, коли активний рядок має попередження.

# accessibility.signals.noInlayHints
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when trying to read a line with inlay hints that has no inlay hints.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (попередження) - коли намагається прочитати рядок з вбудованими підказками, які не мають вбудованих підказок.

# accessibility.signals.noInlayHints.announcement
source: Announces when trying to read a line with inlay hints that has no inlay hints.
uk: Оголошує, коли намагається прочитати рядок з підказками, що не має підказок.

# accessibility.signals.noInlayHints.sound
source: Plays a sound when trying to read a line with inlay hints that has no inlay hints.
uk: Відтворює звук, коли намагається прочитати рядок з підказками, що не має підказок.

# accessibility.signals.notebookCellCompleted
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a notebook cell execution is successfully completed.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли виконання клітинки нотатника успішно завершено.

# accessibility.signals.notebookCellCompleted.announcement
source: Announces when a notebook cell execution is successfully completed.
uk: Оголошує, коли виконання клітинки блокнота успішно завершено.

# accessibility.signals.notebookCellCompleted.sound
source: Plays a sound when a notebook cell execution is successfully completed.
uk: Відтворює звук, коли виконання клітинки нотатника успішно завершено.

# accessibility.signals.notebookCellFailed
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a notebook cell execution fails.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли виконання клітинки блокнота завершується з помилкою.

# accessibility.signals.notebookCellFailed.announcement
source: Announces when a notebook cell execution fails.
uk: Оголошує, коли виконання клітинки блокнота не вдалося.

# accessibility.signals.notebookCellFailed.sound
source: Plays a sound when a notebook cell execution fails.
uk: Відтворює звук, коли виконання клітинки блокнота не вдається.

# accessibility.signals.onDebugBreak
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the debugger stopped on a breakpoint.
uk: Відтворює сигнал - звук (аудіосигнал) та/або оголошення (сповіщення) - коли налагоджувач зупинився на точці зупинки.

# accessibility.signals.onDebugBreak.announcement
source: Announces when the debugger stopped on a breakpoint.
uk: Оголошує, коли налагоджувач зупинився на точці зупинки.

# accessibility.signals.onDebugBreak.sound
source: Plays a sound when the debugger stopped on a breakpoint.
uk: Відтворює звук, коли налагоджувач зупинився на точці зупинки.

# accessibility.signals.positionHasError
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the active line has a warning.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли активна лінія має попередження.

# accessibility.signals.positionHasError.announcement
source: Announces when the active line has a warning.
uk: Оголошує, коли активний рядок має попередження.

# accessibility.signals.positionHasError.sound
source: Plays a sound when the active line has a warning.
uk: Відтворює звук, коли активний рядок має попередження.

# accessibility.signals.positionHasWarning
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the active line has a warning.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли активна лінія має попередження.

# accessibility.signals.positionHasWarning.announcement
source: Announces when the active line has a warning.
uk: Оголошує, коли активний рядок має попередження.

# accessibility.signals.positionHasWarning.sound
source: Plays a sound when the active line has a warning.
uk: Відтворює звук, коли активний рядок має попередження.

# accessibility.signals.progress
source: Plays a signal - sound (audio cue) and/or announcement (alert) - on loop while progress is occurring.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - в циклі під час виконання прогресу.

# accessibility.signals.progress.announcement
source: Alerts on loop while progress is occurring.
uk: Сповіщення в циклі під час виконання прогресу.

# accessibility.signals.progress.sound
source: Plays a sound on loop while progress is occurring.
uk: Відтворює звук в циклі під час виконання прогресу.

# accessibility.signals.save
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a file is saved.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли файл зберігається.

# accessibility.signals.save.announcement
source: Announces when a file is saved.
uk: Оголошує, коли файл збережено.

# accessibility.signals.save.announcement.always
source: Announces whenever a file is saved, including auto save.
uk: Оголошує щоразу, коли файл зберігається, включаючи автоматичне збереження.

# accessibility.signals.save.announcement.never
source: Never plays the announcement.
uk: Ніколи не відтворює оголошення.

# accessibility.signals.save.announcement.userGesture
source: Announces when a user explicitly saves a file.
uk: Оголошує, коли користувач явно зберігає файл.

# accessibility.signals.save.sound
source: Plays a sound when a file is saved.
uk: Відтворює звук, коли файл зберігається.

# accessibility.signals.save.sound.always
source: Plays the sound whenever a file is saved, including auto save.
uk: Відтворює звук щоразу, коли файл зберігається, включаючи автоматичне збереження.

# accessibility.signals.save.sound.never
source: Never plays the sound.
uk: Ніколи не відтворює звук.

# accessibility.signals.save.sound.userGesture
source: Plays the sound when a user explicitly saves a file.
uk: Відтворює звук, коли користувач явно зберігає файл.

# accessibility.signals.sound
source: Plays a sound when the focus moves to an inserted line in Accessible Diff Viewer mode or to the next/previous change.
uk: Відтворює звук, коли фокус переміщується на вставлений рядок у режимі доступного порівняння або на наступну/попередню зміну.

# accessibility.signals.taskCompleted
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a task is completed.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли завдання завершено.

# accessibility.signals.taskCompleted.announcement
source: Announces when a task is completed.
uk: Оголошує, коли завдання завершено.

# accessibility.signals.taskCompleted.sound
source: Plays a sound when a task is completed.
uk: Відтворює звук, коли завдання завершено.

# accessibility.signals.taskFailed
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a task fails (non-zero exit code).
uk: Відтворює сигнал - звук (аудіо підказка) та/або оголошення (сповіщення) - коли завдання не вдається (код виходу не нульовий).

# accessibility.signals.taskFailed.announcement
source: Announces when a task fails (non-zero exit code).
uk: Оголошує, коли завдання не вдалося (код виходу не нульовий).

# accessibility.signals.taskFailed.sound
source: Plays a sound when a task fails (non-zero exit code).
uk: Відтворює звук, коли задача не вдалася (код виходу не нульовий).

# accessibility.signals.terminalBell
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when the terminal bell is ringing.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли дзвоник терміналу дзвонить.

# accessibility.signals.terminalBell.announcement
source: Announces when the terminal bell is ringing.
uk: Оголошує, коли дзвінок терміналу дзвонить.

# accessibility.signals.terminalBell.sound
source: Plays a sound when the terminal bell is ringing.
uk: Відтворює звук, коли дзвоник терміналу дзвонить.

# accessibility.signals.terminalCommandFailed
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a terminal command fails (non-zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли команда терміналу не виконується (нульовий код виходу) або коли до команди з таким кодом виходу переходять у доступному вигляді.

# accessibility.signals.terminalCommandFailed.announcement
source: Announces when a terminal command fails (non-zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Оголошує, коли команда терміналу не вдалася (нульовий код виходу) або коли до команди з таким кодом виходу переходять у доступному вигляді.

# accessibility.signals.terminalCommandFailed.sound
source: Plays a sound when a terminal command fails (non-zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Відтворює звук, коли команда терміналу не виконується (код виходу не нульовий) або коли в доступному вигляді переходять до команди з таким кодом виходу.

# accessibility.signals.terminalCommandSucceeded
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when a terminal command succeeds (zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Відтворює сигнал - звук (аудіо підказка) та/або оголошення (сповіщення) - коли команда терміналу успішна (нульовий код виходу) або коли до команди з таким кодом виходу переходять у доступному вигляді.

# accessibility.signals.terminalCommandSucceeded.announcement
source: Announces when a terminal command succeeds (zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Оголошує, коли команда терміналу успішна (нульовий код виходу) або коли до команди з таким кодом виходу переходять у доступному вигляді.

# accessibility.signals.terminalCommandSucceeded.sound
source: Plays a sound when a terminal command succeeds (zero exit code) or when a command with such an exit code is navigated to in the accessible view.
uk: Відтворює звук, коли команда терміналу успішна (нульовий код виходу) або коли до команди з таким кодом виходу переходять у доступному вигляді.

# accessibility.signals.terminalQuickFix
source: Plays a signal - sound (audio cue) and/or announcement (alert) - when terminal Quick Fixes are available.
uk: Відтворює сигнал - звук (аудіо сигнал) та/або оголошення (сповіщення) - коли доступні термінальні швидкі виправлення.

# accessibility.signals.terminalQuickFix.announcement
source: Announces when terminal Quick Fixes are available.
uk: Оголошує, коли доступні термінальні швидкі виправлення.

# accessibility.signals.terminalQuickFix.sound
source: Plays a sound when terminal Quick Fixes are available.
uk: Відтворює звук, коли доступні термінальні швидкі виправлення.

# accessibility.signals.voiceRecordingStarted
source: Plays a sound / audio cue when the voice recording has started.
uk: Відтворює звуковий / аудіосигнал, коли запис голосу розпочато.

# accessibility.signals.voiceRecordingStarted.sound
source: Plays a sound when the voice recording has started.
uk: Відтворює звук, коли почалася запис голосу.

# accessibility.signals.voiceRecordingStopped
source: Plays a sound / audio cue when the voice recording has stopped.
uk: Відтворює звуковий / аудіо сигнал, коли запис голосу зупинено.

# accessibility.signals.voiceRecordingStopped.sound
source: Plays a sound when the voice recording has stopped.
uk: Відтворює звук, коли запис голосу завершено.

# accessibility.underlineLinks
source: Controls whether links should be underlined in the workbench.
uk: Контролює, чи повинні посилання бути підкресленими в робочій області.
