Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# newWindowDimensions
source: Controls the dimensions of opening a new window when at least one window is already opened. Note that this setting does not have an impact on the first window that is opened. The first window will always restore the size and location as you left it before closing.
uk: Контролює розміри відкриття нового вікна, коли принаймні одне вікно вже відкрите. Зверніть увагу, що ця настройка не впливає на перше вікно, яке відкривається. Перше вікно завжди відновлює розмір і місце, як ви залишили його перед закриттям.

# openWithoutArgumentsInNewWindow
source: Controls whether a new empty window should open when starting a second instance without arguments or if the last running instance should get focus. Note that there can still be cases where this setting is ignored (e.g. when using the `--new-window` or `--reuse-window` command line option).
uk: Контролює, чи має відкриватися нове порожнє вікно при запуску другого екземпляра без аргументів, або чи має отримати фокус останній запущений екземпляр. Зверніть увагу, що можуть бути випадки, коли ця настройка ігнорується (наприклад, при використанні параметра командного рядка `--new-window` або `--reuse-window`).

# restoreFullscreen
source: Controls whether a window should restore to full screen mode if it was exited in full screen mode.
uk: Контролює, чи повинно вікно відновлюватися в режимі повного екрану, якщо воно було закрито в режимі повного екрану.

# restoreWindows
source: Controls how windows and editors within are being restored when opening.
uk: Контролює, як вікна та редактори відновлюються під час відкриття.

# security.promptForLocalFileProtocolHandling
source: If enabled, a dialog will ask for confirmation whenever a local file or workspace is about to open through a protocol handler.
uk: Якщо увімкнено, діалогове вікно запитає підтвердження щоразу, коли локальний файл або робоче середовище збирається відкритися через обробник протоколів.

# security.promptForRemoteFileProtocolHandling
source: If enabled, a dialog will ask for confirmation whenever a remote file or workspace is about to open through a protocol handler.
uk: Якщо увімкнено, діалогове вікно запитуватиме підтвердження щоразу, коли віддалений файл або робоча область збираються відкритися через обробник протоколів.

source: Show Next Window Tab
uk: Показати наступну вкладку вікна

# showPreviousTab
source: Show Previous Window Tab
uk: Показати попередню вкладку вікна

# telemetry.enableCrashReporting
source: Enable crash reports to be collected. This helps us improve stability. This option requires restart to take effect.
uk: Увімкніть збір звітів про збої. Це допомагає нам покращити стабільність. Ця опція потребує перезавантаження для набуття чинності.

# telemetryConfigurationTitle
source: Telemetry
uk: Телеметрія

# titleBarStyle
source: Adjust the appearance of the window title bar to be native by the OS or custom. Changes require a full restart to apply.
uk: Стиль заголовка вікна

source: Toggle Window Tabs Bar
uk: Перемикати панель вкладок вікна

# touchbar.enabled
source: Enables the macOS touchbar buttons on the keyboard if available.
uk: Увімкнення кнопок touchbar macOS на клавіатурі, якщо вони доступні.

# touchbar.ignored
source: A set of identifiers for entries in the touchbar that should not show up (for example `workbench.action.navigateBack`).
uk: Набір ідентифікаторів для записів у панелі дотиків, які не повинні відображатися (наприклад, `workbench.action.navigateBack`).

# window.border
source: Controls the border color of the window. Set to `default` to respect Windows settings, `off` to disable or to a specific color in Hex, RGB, RGBA, HSL, HSLA format. This requires Windows to have the 'Show accent color on title bars and window borders' enabled and is ignored when {0} is set to {1}.
uk: Контролює колір рамки вікна. Встановіть на `default`, щоб дотримуватися налаштувань Windows, `off`, щоб вимкнути, або на конкретний колір у форматах Hex, RGB, RGBA, HSL, HSLA. Це вимагає, щоб у Windows була увімкнена опція 'Показувати акцентний колір на заголовках вікон і рамках вікон', і ігнорується, коли {0} встановлено на {1}.

# window.clickThroughInactive
source: If enabled, clicking on an inactive window will both activate the window and trigger the element under the mouse if it is clickable. If disabled, clicking anywhere on an inactive window will activate it only and a second click is required on the element.
uk: Якщо увімкнено, клацання на неактивному вікні активує вікно та викликає елемент під мишкою, якщо він клікабельний. Якщо вимкнено, клацання будь-де на неактивному вікні активує його лише, і для взаємодії з елементом потрібен другий клік.

# window.customTitleBarVisibility
source: Adjust when the custom title bar should be shown. The custom title bar can be hidden when in full screen mode with `windowed`. The custom title bar can only be hidden in non full screen mode with `never` when {0} is set to `native`.
uk: Налаштуйте, коли має з'являтися користувацька панель заголовка. Користувацька панель заголовка може бути прихована в режимі повного екрану з `windowed`. Користувацька панель заголовка може бути прихована лише в режимі не повного екрану з `never`, коли {0} встановлено на `native`.

# window.customTitleBarVisibility.auto
source: Automatically changes custom title bar visibility.
uk: Автоматично змінює видимість користувацької заголовної панелі.

# window.customTitleBarVisibility.never
source: Hide custom titlebar when {0} is set to `native`.
uk: Сховати користувацьку заголовну панель, коли {0} встановлено на `native`.

# window.customTitleBarVisibility.windowed
source: Hide custom titlebar in full screen. When not in full screen, automatically change custom title bar visibility.
uk: Сховати користувацьку панель заголовка у повноекранному режимі. Коли не в повноекранному режимі, автоматично змінювати видимість користувацької панелі заголовка.

# window.doubleClickIconToClose
source: If enabled, this setting will close the window when the application icon in the title bar is double-clicked. The window will not be able to be dragged by the icon. This setting is effective only if {0} is set to `custom`.
uk: Якщо увімкнено, ця налаштування закриє вікно, коли значок програми в заголовку буде двічі натиснуто. Вікно не можна буде перетягувати за значком. Це налаштування діє лише якщо {0} встановлено на `custom`.

# window.menuStyle
source: Adjust the menu style to either be native by the OS, custom, or inherited from the title bar style defined in {0}. This also affects the context menu appearance. Changes require a full restart to apply.
uk: Налаштуйте стиль меню, щоб він був або рідним для ОС, або кастомним, або успадкованим від стилю заголовка, визначеного в {0}. Це також вплине на вигляд контекстного меню. Зміни потребують повного перезапуску для застосування.

# window.menuStyle.custom
source: Use the custom menu.
uk: Використовуйте користувацьке меню.

# window.menuStyle.custom.mac
source: Use the custom context menu.
uk: Використовуйте контекстне меню за замовчуванням.

# window.menuStyle.inherit
source: Matches the menu style to the title bar style defined in {0}.
uk: Відповідає стилю меню стилю заголовка, визначеному в {0}.

# window.menuStyle.inherit.mac
source: Matches the context menu style to the title bar style defined in {0}.
uk: Відповідає стилю контекстного меню стилю заголовка, визначеному в {0}.

# window.menuStyle.mac
source: Adjust the context menu appearances to either be native by the OS, custom, or inherited from the title bar style defined in {0}.
uk: Налаштуйте зовнішній вигляд контекстного меню так, щоб він був або рідним для ОС, або кастомізованим, або успадкованим від стилю заголовка, визначеного в {0}.

# window.menuStyle.native
source: Use the native menu. This is ignored when {0} is set to {1}.
uk: Використовуйте рідне меню. Це ігнорується, коли {0} встановлено на {1}.

# window.menuStyle.native.mac
source: Use the native context menu.
uk: Використовуйте рідне контекстне меню.

# window.nativeFullScreen
source: Controls if native full-screen should be used on macOS. Disable this option to prevent macOS from creating a new space when going full-screen.
uk: Контролює, чи слід використовувати нативний повноекранний режим на macOS. Вимкніть цю опцію, щоб запобігти створенню нової області в macOS при переході в повноекранний режим.

# window.nativeTabs
source: Enables macOS Sierra window tabs. Note that changes require a full restart to apply and that native tabs will disable a custom title bar style if configured.
uk: Увімкнення вкладок вікон macOS Sierra. Зверніть увагу, що зміни потребують повного перезавантаження для застосування, і що рідні вкладки вимкнуть стиль заголовка вікна, якщо він налаштований.

# window.newWindowDimensions.default
source: Open new windows in the center of the screen.
uk: Відкривайте нові вікна в центрі екрану.

# window.newWindowDimensions.fullscreen
source: Open new windows in full screen mode.
uk: Відкривати нові вікна в режимі повного екрану.

# window.newWindowDimensions.inherit
source: Open new windows with same dimension as last active one.
uk: Відкривати нові вікна з такими ж розмірами, як у останнього активного.

# window.newWindowDimensions.maximized
source: Open new windows maximized.
uk: Відкривати нові вікна в максимальному розмірі.

# window.newWindowDimensions.offset
source: Open new windows with same dimension as last active one with an offset position.
uk: Відкрийте нові вікна з такими ж розмірами, як у останнього активного, з відступом.

# window.openWithoutArgumentsInNewWindow.off
source: Focus the last active running instance.
uk: Зосередьтеся на останньому активному запущеному екземплярі.

# window.openWithoutArgumentsInNewWindow.on
source: Open a new empty window.
uk: Відкрийте нове порожнє вікно.

# window.reopenFolders.all
source: Reopen all windows unless a folder, workspace or file is opened (e.g. from the command line). If a file is opened, it will replace any of the editors that were previously opened in a window.
uk: Відкрийте всі вікна знову, якщо не відкрито папку, робочу область або файл (наприклад, з командного рядка). Якщо файл відкрито, він замінить будь-які редактори, які раніше були відкриті у вікні.

# window.reopenFolders.folders
source: Reopen all windows that had folders or workspaces opened unless a folder, workspace or file is opened (e.g. from the command line). If a file is opened, it will replace any of the editors that were previously opened in a window.
uk: Відкрийте знову всі вікна, в яких були відкриті папки або робочі простори, якщо не відкрита папка, робочий простір або файл (наприклад, з командного рядка). Якщо файл відкритий, він замінить будь-які редактори, які раніше були відкриті у вікні.

# window.reopenFolders.none
source: Never reopen a window. Unless a folder or workspace is opened (e.g. from the command line), an empty window will appear.
uk: Ніколи не відкривайте вікно знову. Якщо папка або робоче середовище не відкриті (наприклад, з командного рядка), з'явиться порожнє вікно.

# window.reopenFolders.one
source: Reopen the last active window unless a folder, workspace or file is opened (e.g. from the command line). If a file is opened, it will replace any of the editors that were previously opened in a window.
uk: Відкрийте останнє активне вікно, якщо не відкрито папку, робочу область або файл (наприклад, з командного рядка). Якщо відкрито файл, він замінить будь-які редактори, які були раніше відкриті у вікні.

# window.reopenFolders.preserve
source: Always reopen all windows. If a folder or workspace is opened (e.g. from the command line) it opens as a new window unless it was opened before. If files are opened they will open in one of the restored windows together with editors that were previously opened.
uk: Завжди повторно відкривати всі вікна. Якщо папка або робочий простір відкриті (наприклад, з командного рядка), вони відкриваються як нове вікно, якщо не були відкриті раніше. Якщо файли відкриті, вони відкриються в одному з відновлених вікон разом з редакторами, які були відкриті раніше.

# zoomLevel
source: Adjust the default zoom level for all windows. Each increment above `0` (e.g. `1`) or below (e.g. `-1`) represents zooming `20%` larger or smaller. You can also enter decimals to adjust the zoom level with a finer granularity. See {0} for configuring if the 'Zoom In' and 'Zoom Out' commands apply the zoom level to all windows or only the active window.
uk: Відрегулюйте рівень масштабування за замовчуванням для всіх вікон. Кожне збільшення вище `0` (наприклад, `1`) або нижче (наприклад, `-1`) представляє масштабування на `20%` більше або менше. Ви також можете вводити десяткові дроби, щоб налаштувати рівень масштабування з більшою точністю. Дивіться {0} для налаштування, чи команди 'Масштабувати вгору' та 'Масштабувати вниз' застосовують рівень масштабування до всіх вікон або лише до активного вікна.

# zoomPerWindow
source: Controls if the 'Zoom In' and 'Zoom Out' commands apply the zoom level to all windows or only the active window. See {0} for configuring a default zoom level for all windows.
uk: Контролює, чи команди 'Збільшити' та 'Зменшити' застосовують рівень збільшення до всіх вікон або лише до активного вікна. Дивіться {0} для налаштування рівня збільшення за замовчуванням для всіх вікон.

# join.closeStorage
source: Saving UI state
uk: Збереження стану інтерфейсу користувача

# okButton
source: OK
uk: Гаразд

# appRootWarning.banner
source: Files you store within the installation folder ('{0}') may be OVERWRITTEN or DELETED IRREVERSIBLY without warning at update time.
uk: Файли, які ви зберігаєте в папці встановлення ('{0}'), можуть бути ПЕРЕПИСАНІ або УДАЛЕНІ НЕВІДМІННО без попередження під час оновлення.

source: Configure
uk: Налаштувати

# downloadArmBuild
source: Download
uk: Завантажити

# keychainWriteError
source: Writing login information to the keychain failed with error '{0}'.
uk: Запис інформації для входу в ключницю не вдався з помилкою '{0}'.

source: Learn More
uk: Дізнатися більше

# loginButton
source: &&Log In
uk: &&Увійти

source: Password
uk: Пароль

# proxyAuthRequired
source: Proxy Authentication Required
uk: Необхідна аутентифікація проксі

# proxyDetail
source: The proxy {0} requires a username and password.
uk: Проксі {0} вимагає ім'я користувача та пароль.

# rememberCredentials
source: Remember my credentials
uk: Запам'ятайте мої облікові дані

# resolveShellEnvironment
source: Resolving shell environment...
uk: Вирішення середовища оболонки...

source: Restart
uk: Перезапустити

# runningAsRoot
source: It is not recommended to run {0} as root user.
uk: Не рекомендується запускати {0} як користувача root.

# runningTranslated
source: You are running an emulated version of {0}. For better performance download the native arm64 version of {0} build for your machine.
uk: Ви використовуєте емульовану версію {0}. Для кращої продуктивності завантажте нативну версію arm64 {0}, призначену для вашої машини.

# sharedProcessCrash
source: A shared background process terminated unexpectedly. Please restart the application to recover.
uk: Спільний фоновий процес завершився несподівано. Будь ласка, перезапустіть додаток, щоб відновити роботу.

# showArgvParseWarning
source: The runtime arguments file 'argv.json' contains errors. Please correct them and restart.
uk: Файл аргументів виконання 'argv.json' містить помилки. Будь ласка, виправте їх і перезапустіть.

# showArgvParseWarningAction
source: Open File
uk: Відкрити файл

# shutdownErrorClose
source: An unexpected error prevented the window to close
uk: Несподівана помилка завадила закриттю вікна.

# shutdownErrorDetail
source: Error: {0}
uk: Робочий стіл був несподівано видалений під час виконання.

# shutdownErrorLoad
source: An unexpected error prevented to change the workspace
uk: Несподівана помилка завадила змінити робочий простір.

# shutdownErrorQuit
source: An unexpected error prevented the application to quit
uk: Несподівана помилка завадила закриттю програми.

# shutdownErrorReload
source: An unexpected error prevented the window to reload
uk: Несподівана помилка завадила перезавантаженню вікна.

# shutdownForceClose
source: Close Anyway
uk: Закрити в будь-якому випадку

# shutdownForceLoad
source: Change Anyway
uk: Змінити в будь-якому випадку

# shutdownForceQuit
source: Quit Anyway
uk: Кинути все одно

# shutdownForceReload
source: Reload Anyway
uk: Перезавантажити все одно

# shutdownTitleClose
source: Closing the window is taking a bit longer...
uk: Закриття вікна займає трохи більше часу...

# shutdownTitleLoad
source: Changing the workspace is taking a bit longer...
uk: Зміна робочого простору займає трохи більше часу...

# shutdownTitleQuit
source: Quitting the application is taking a bit longer...
uk: Вихід з програми займає трохи більше часу...

# shutdownTitleReload
source: Reloading the window is taking a bit longer...
uk: Перезавантаження вікна займає трохи більше часу...

# status.windowZoom
source: Window Zoom
uk: Вікно масштабування

# troubleshooting
source: Troubleshooting Guide
uk: Посібник з усунення несправностей

source: Username
uk: Ім'я користувача

# willShutdownDetail
source: The following operations are still running: {0}
uk: Наступні операції все ще виконуються: {0}

# zoomNumber
source: Zoom Level: {0} ({1}%)
uk: Рівень масштабування: {0} ({1}%)

# zoomReset
source: Reset
uk: Скинути масштаб

# zoomSettings
source: Settings
uk: Налаштування
