Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

# placeholder
source: Select instructions files to attach
uk: Виберіть файли інструкцій для прикріплення

# user-data-dir.capitalized
source: User data folder
uk: Папка даних користувача

# commands.mode.select-dialog.placeholder
source: Select the chat mode file to open
uk: Виберіть файл режиму чату для відкриття

# configure-modes
source: Configure Chat Modes...
uk: Налаштувати режими чату...

# configure-modes.short
source: Modes
uk: Режими

# select-mode
source: Configure Modes...
uk: Налаштувати режими...

# commands.new.instructions.local.title
source: New Instructions File...
uk: Новий файл інструкцій...

# commands.new.mode.local.title
source: New Mode File...
uk: Новий файл режиму...

# commands.new.prompt.local.title
source: New Prompt File...
uk: Новий файл запиту...

# commands.new.untitled.prompt.title
source: New Untitled Prompt File
uk: Новий файл запиту без назви

# enable.capitalized
source: Enable
uk: Увімкнути

# learnMore.capitalized
source: Learn More
uk: Дізнатися більше

# workbench.command.prompts.create.user.enable-sync-notification
source: Do you want to backup and sync your user prompt, instruction and mode files with Setting Sync?'
uk: Ви хочете створити резервну копію та синхронізувати свої файли запиту користувача, інструкцій та режиму з Налаштуваннями синхронізації?

# askForInstructionsFileName.placeholder
source: Enter the name of the instructions file
uk: Введіть назву файлу інструкцій

# askForModeFileName.placeholder
source: Enter the name of the custom chat mode file
uk: Введіть назву файлу користувацького режиму чату

# askForPromptFileName.error.empty
source: Please enter a name.
uk: Будь ласка, введіть ім'я.

# askForPromptFileName.error.exists
source: A file for the given name already exists.
uk: Файл з вказаним ім'ям вже існує.

# askForPromptFileName.error.invalid
source: The name contains invalid characters.
uk: Ім'я містить недійсні символи.

# askForPromptFileName.placeholder
source: Enter the name of the prompt file
uk: Введіть назву файлу запиту

# askForRenamedInstructionsFileName.placeholder
source: Enter a new name of the instructions file
uk: Введіть нову назву файлу інструкцій

# askForRenamedModeFileName.placeholder
source: Enter a new name of the custom chat mode file
uk: Введіть нову назву файлу користувацького режиму чату

# askForRenamedPromptFileName.placeholder
source: Enter a new name of the prompt file
uk: Введіть нову назву файлу запиту

# commands.instructions.create.ask-folder.empty.docs-label
source: Learn how to configure reusable instructions
uk: Дізнайтеся, як налаштувати повторювані інструкції

# commands.instructions.create.ask-folder.empty.placeholder
source: No instruction source folders found.
uk: Не знайдено папок джерел інструкцій.

# commands.mode.create.ask-folder.empty.docs-label
source: Learn how to configure custom chat modes
uk: Дізнайтеся, як налаштувати власні режими чату

# commands.mode.create.ask-folder.empty.placeholder
source: No custom chat mode source folders found.
uk: Не знайдено жодних користувацьких папок джерел режиму чату.

# commands.prompts.create.ask-folder.empty.docs-label
source: Learn how to configure reusable prompts
uk: Дізнайтеся, як налаштувати повторно використовувані запити

# commands.prompts.create.ask-folder.empty.placeholder
source: No prompt source folders found.
uk: Не знайдено жодних папок джерел підказок.

# commands.prompts.create.source-folder.current-workspace
source: Current Workspace
uk: Поточне робоче середовище

# commands.prompts.create.source-folder.user
source: User Data Folder
uk: Картка даних користувача

# current.folder
source: Current Location
uk: Поточне місцезнаходження

# instructions.copy.location.placeholder
source: Select a location to copy the instructions file to...
uk: Виберіть місце для копіювання файлу інструкцій...

# instructions.move.location.placeholder
source: Select a location to move the instructions file to...
uk: Виберіть місце для переміщення файлу інструкцій...

# mode.copy.location.placeholder
source: Select a location to copy the mode file to...
uk: Виберіть місце для копіювання файлу режиму...

# mode.move.location.placeholder
source: Select a location to move the mode file to...
uk: Виберіть місце для переміщення файлу режиму...

# prompt.copy.location.placeholder
source: Select a location to copy the prompt file to...
uk: Виберіть місце для копіювання файлу запиту...

# prompt.move.location.placeholder
source: Select a location to move the prompt file to...
uk: Виберіть місце для переміщення файлу підказки...

# workbench.command.instructions.create.location.placeholder
source: Select a location to create the instructions file in...
uk: Виберіть місце для створення файлу інструкцій...

# workbench.command.mode.create.location.placeholder
source: Select a location to create the mode file in...
uk: Виберіть місце для створення файлу режиму...

# workbench.command.prompt.create.location.placeholder
source: Select a location to create the prompt file in...
uk: Виберіть місце для створення файлу запиту...

# commands.new-instructionsfile.select-dialog.label
source: New instruction file...
uk: Новий файл інструкцій...

# commands.new-modefile.select-dialog.label
source: Create new custom chat mode file...
uk: Створити новий файл режиму чату...

# commands.new-promptfile.select-dialog.label
source: New prompt file...
uk: Новий файл запиту...

# commands.prompts.use.select-dialog.delete-prompt.confirm.message
source: Are you sure you want to delete '{0}'?
uk: Ви впевнені, що хочете видалити '{0}'?

# commands.update-instructions.select-dialog.label
source: Generate instructions...
uk: Згенерувати інструкції...

# copy
source: Copy or Move (press {0})
uk: Скопіювати або Перемістити (натисніть {0})

source: Delete
uk: Видалити

source: Help
uk: Допомога

# open
source: Open in Editor
uk: Відкрити в редакторі

source: Rename
uk: Перейменувати

# searching
source: Searching file system...
uk: Пошук файлової системи...

# runPromptWithCodingAgent
source: Run prompt file in a remote coding agent
uk: Запустіть файл запиту в віддаленому кодовому агенті

# runWithCodingAgent.label
source: {0} Delegate to Copilot coding agent
uk: {0} Делегувати кодувальному агенту Copilot

# configure-tools.capitalized.ellipsis
source: Configure Tools...
uk: Налаштувати інструменти...

# placeholder
source: Select tools
uk: Виберіть файли інструкцій для прикріплення

# confirmInstallInstructions
source: An external application wants to create an instructions file with content from a URL. Do you want to continue by selecting a destination folder and name?
uk: Зовнішній додаток хоче створити файл інструкцій з вмістом з URL. Ви хочете продовжити, вибравши папку призначення та ім'я?

# confirmInstallMode
source: An external application wants to create a chat mode with content from a URL. Do you want to continue by selecting a destination folder and name?
uk: Зовнішній додаток хоче створити режим чату з вмістом з URL. Ви хочете продовжити, вибравши папку призначення та ім'я?

# confirmInstallPrompt
source: An external application wants to create a prompt file with content from a URL. Do you want to continue by selecting a destination folder and name?
uk: Зовнішній додаток хоче створити файл запиту з вмістом з URL. Ви хочете продовжити, вибравши папку призначення та ім'я?

# confirmOpenDetail2
source: This will access {0}.
uk: Це отримує доступ до {0}.

# confirmOpenDetail3
source: If you did not initiate this request, it may represent an attempted attack on your system. Unless you took an explicit action to initiate this request, you should press 'No'
uk: Якщо ви не ініціювали цей запит, це може бути спробою атаки на вашу систему. Якщо ви не вжили явних дій для ініціювання цього запиту, вам слід натиснути 'Ні'.

# failed
source: Failed to fetch URL: {0}
uk: Не вдалося отримати URL: {0}

# noButton
source: No
uk: Ні

# yesButton
source: &&Yes
uk: &&Так

# commands.prompt.manage-dialog.placeholder
source: Select the prompt file to open
uk: Виберіть файл інструкцій для відкриття

# commands.prompt.select-dialog.placeholder
source: Select the prompt file to run (hold {0}-key to use in new chat)
uk: Виберіть файл запиту для запуску (утримуйте клавішу {0}, щоб використовувати в новому чаті)

# configure-prompts
source: Configure Prompt Files...
uk: Налаштувати файли запитів...

# configure-prompts.short
source: Prompt Files
uk: Файли запитів

# run-prompt-in-new-chat.capitalized
source: Run Prompt In New Chat
uk: Запустити запит у новому чаті

# run-prompt.capitalized
source: Run Prompt in Current Chat
uk: Запустити запит у поточному чаті

# run-prompt.capitalized.ellipses
source: Run Prompt...
uk: Запустити запит...

# workbench.actions.save-to-prompt.label
source: Save chat session to a prompt file
uk: Зберегти сесію чату у файл запиту

# bad_name1
source: Invalid file name
uk: Недійсна назва файлу

# bad_name2
source: '{0}' is not a valid file name
uk: '{0}' не є дійсною назвою файлу

# chat.configureToolSets
source: Configure Tool Sets...
uk: Налаштувати набори інструментів...

# chat.configureToolSets.add
source: Create new tool sets file...
uk: Створити новий файл наборів інструментів...

# chat.configureToolSets.placeholder
source: Select a tool set to configure
uk: Виберіть набір інструментів для налаштування

# chat.configureToolSets.short
source: Tool Sets
uk: Набори інструментів

# input.placeholder
source: Type tool sets file name
uk: Введіть ім'я файлу набору інструментів

# schema.default
source: Empty tool set
uk: Порожній набір інструментів

# schema.description
source: A short description of this tool set.
uk: Короткий опис цього набору інструментів.

# schema.icon
source: Icon to use for this tool set in the UI. Uses the `\$(name)`-syntax, like `\$(zap)`
uk: Іконка, яку використовувати для цього інструменту в інтерфейсі. Використовує синтаксис `\$(name)`, як-от `\$(zap)`

# schema.tools
source: A list of tools or tool sets to include in this tool set. Cannot be empty and must reference tools the way they are referenced in prompts.
uk: Список інструментів або наборів інструментів, які потрібно включити в цей набір інструментів. Не може бути порожнім і повинен посилатися на інструменти так, як вони згадуються в запитах.

# toolsetSchema.json
source: User tool sets configuration
uk: Конфігурація наборів інструментів користувача

# agentModeSubtitle
source: Agent Mode
uk: Режим агента

# suggestedPromptAriaLabel
source: Suggested prompt: {0}
uk: Запропонований запит: {0}

# chatViewsWelcome.content
source: The content of the welcome message. The first command link will be rendered as a button.
uk: Зміст вітального повідомлення. Перше посилання команди буде відображено як кнопку.

# chatViewsWelcome.icon
source: The icon for the welcome message.
uk: Іконка для вітального повідомлення.

# chatViewsWelcome.title
source: The title of the welcome message.
uk: Назва вітального повідомлення.

# chatViewsWelcome.when
source: Condition when the welcome message is shown.
uk: Умова, коли відображається вітальне повідомлення.

# vscode.extension.contributes.chatViewsWelcome
source: Contributes a welcome message to a chat view
uk: Додає привітальне повідомлення до перегляду чату

# chat.avatarBackground
source: The background color of a chat avatar.
uk: Колір фону аватара чату.

# chat.avatarForeground
source: The foreground color of a chat avatar.
uk: Передній план кольору аватара чату.

# chat.editedFileForeground
source: The foreground color of a chat edited file in the edited file list.
uk: Колір переднього плану файлу чату в списку відредагованих файлів.

# chat.linesAddedForeground
source: Foreground color of lines added in chat code block pill.
uk: Колір переднього плану рядків, доданих у блоку коду чату.

# chat.linesRemovedForeground
source: Foreground color of lines removed in chat code block pill.
uk: Колір переднього плану рядків, що були видалені в кодовому блоці чату.

# chat.requestBackground
source: The background color of a chat request.
uk: Колір фону запиту чату.

# chat.requestBorder
source: The border color of a chat request.
uk: Колір рамки запиту чату.

# chat.requestBubbleBackground
source: Background color of the chat request bubble.
uk: Колір фону бульбашки запиту чату.

# chat.requestBubbleHoverBackground
source: Background color of the chat request bubble on hover.
uk: Колір фону бульбашки запиту чату при наведенні.

# chat.requestCodeBorder
source: Border color of code blocks within the chat request bubble.
uk: Колір рамки кодових блоків у бульбашці запиту чату.

# chat.slashCommandBackground
source: The background color of a chat slash command.
uk: Колір фону команди чату зі слешем.

# chat.slashCommandForeground
source: The foreground color of a chat slash command.
uk: Колір переднього плану команди чату.

# chatCheckpointSeparator
source: Chat checkpoint separator color.
uk: Колір роздільника контрольної точки чату.

# chatEditApplied
source: True when the chat text edits have been applied.
uk: Істинно, коли зміни тексту чату були застосовані.

# chatEditingCanRedo
source: True when it is possible to redo an interaction in the editing panel.
uk: Істина, коли можливе повторення взаємодії в панелі редагування.

# chatEditingCanUndo
source: True when it is possible to undo an interaction in the editing panel.
uk: Істинно, коли можливо скасувати взаємодію в панелі редагування.

# chatEditingHasToolConfirmation
source: True when a tool confirmation is present.
uk: Істина, коли присутнє підтвердження інструмента.

# chatExtensionInvalid
source: True when the installed chat extension is invalid and needs to be updated.
uk: Істинно, коли встановлене розширення чату є недійсним і потребує оновлення.

# chatHasCustomChatModes
source: True when the chat has custom chat modes available.
uk: Істина, коли в чаті доступні користувацькі режими чату.

# chatHasFileAttachments
source: True when the chat has file attachments.
uk: Істина, коли в чаті є вкладення файлів.

# chatIsEnabled
source: True when chat is enabled because a default chat participant is activated with an implementation.
uk: Істинно, коли чат увімкнено, оскільки активовано учасника чату за замовчуванням з реалізацією.

# chatIsHistoryItem
source: True when the chat session item is from history.
uk: Істинно, коли елемент сесії чату є з історії.

# chatItemId
source: The id of the chat item.
uk: Ідентифікатор елемента чату.

# chatLastItemId
source: The id of the last chat item.
uk: Ідентифікатор останнього елемента чату.

# chatMode
source: The 'kind' of the current chat mode- Agent for custom modes.
uk: 'Тип' поточного режиму чату - Агент для користувацьких режимів.

# chatModelsAreUserSelectable
source: True when the chat model can be selected manually by the user.
uk: Істинно, коли модель чату може бути вибрана вручну користувачем.

# chatPanelExtensionParticipantRegistered
source: True when a default chat participant is registered for the panel from an extension.
uk: Істинно, коли стандартний учасник чату зареєстрований для панелі з розширення.

# chatPanelLocation
source: The location of the chat panel.
uk: Розташування панелі чату.

# chatParticipantRegistered
source: True when a default chat participant is registered for the panel.
uk: Істинно, коли учасник чату за замовчуванням зареєстрований для панелі.

# chatPromptFileAttachedContextDescription
source: True when the chat has a prompt file attached.
uk: Істинно, коли до чату прикріплено файл з підказкою.

# chatRemoteJobCreating
source: True when a remote coding agent job is being created.
uk: Істинно, коли створюється робота віддаленого кодувального агента.

# chatRequest
source: The chat item is a request
uk: Чат-елемент є запитом

# chatResponse
source: The chat item is a response.
uk: Чат-елемент є відповіддю.

# chatResponseErrored
source: True when the chat response resulted in an error.
uk: Істинно, коли відповідь чату призвела до помилки.

# chatResponseFiltered
source: True when the chat response was filtered out by the server.
uk: Істина, коли відповідь чату була відфільтрована сервером.

# chatResponseSupportsIssueReporting
source: True when the current chat response supports issue reporting.
uk: Істинно, коли поточна відповідь чату підтримує звітність про проблеми.

# chatSessionResponseDetectedAgentOrCommand
source: When the agent or command was automatically detected
uk: Коли агент або команда були автоматично виявлені

# chatSessionType
source: The type of the current chat session item.
uk: Тип елемента поточної чат-сесії.

# chatSkipRequestInProgressMessage
source: True when the chat request in progress message should be skipped.
uk: Істинно, коли повідомлення про запит чату в процесі повинно бути пропущене.

# chatToolCount
source: The number of tools available in the current chat mode.
uk: Кількість інструментів, доступних у поточному режимі чату.

# chatToolGroupingThreshold
source: The number of tools at which we start doing virtual grouping.
uk: Кількість інструментів, з яких ми починаємо виконувати віртуальне групування.

# enableRemoteCodingAgentPromptFileOverlay
source: Whether the remote coding agent prompt file overlay feature is enabled
uk: Чи увімкнено функцію накладення файлу запиту агента віддаленого кодування

# hasRemoteCodingAgent
source: Whether any remote coding agent is available
uk: Чи доступний будь-який віддалений агент кодування

# inChat
source: True when focus is in the chat widget, false otherwise.
uk: Істина, коли фокус знаходиться у віджеті чату, хибність в іншому випадку.

# inChatEditor
source: Whether focus is in a chat editor.
uk: Чи фокус знаходиться в редакторі чату.

# inInteractiveInput
source: True when focus is in the chat input, false otherwise.
uk: Істина, коли фокус знаходиться в полі вводу чату, хибність в іншому випадку.

# inQuickChat
source: True when the quick chat UI has focus, false otherwise.
uk: Істина, коли інтерфейс швидкого чату має фокус, хибно в іншому випадку.

# interactiveInputHasFocus
source: True when the chat input has focus.
uk: Істина, коли поле введення чату має фокус.

# interactiveInputHasText
source: True when the chat input has text.
uk: Істинно, коли вхідний текст чату містить текст.

# interactiveSessionCurrentlyEditing
source: True when the current request is being edited.
uk: Істина, коли поточний запит редагується.

# interactiveSessionCurrentlyEditingInput
source: True when the current request input at the bottom is being edited.
uk: Істина, коли внизу редагується вхідний запит.

# interactiveSessionRequestInProgress
source: True when the current request is still in progress.
uk: Істина, коли поточний запит все ще виконується.

# interactiveSessionResponseVote
source: When the response has been voted up, is set to 'up'. When voted down, is set to 'down'. Otherwise an empty string.
uk: Коли відповідь отримала голоси 'за', встановлюється значення 'up'. Коли голосують 'проти', встановлюється значення 'down'. В іншому випадку - порожній рядок.

# lockedToCodingAgent
source: True when the chat widget is locked to the coding agent session.
uk: Істина, коли віджет чату заблоковано для сесії кодувального агента.

# toolsCount
source: The count of tools available in the chat.
uk: Кількість інструментів, доступних у чаті.

# chatEditingAgentSupportsReadonlyReferences
source: Whether the chat editing agent supports readonly references (temporary)
uk: Чи підтримує агент редагування чату тільки для читання посилання (тимчасові)

# chatEditingWidgetFileState
source: The current state of the file in the chat editing widget
uk: Поточний стан файлу у віджеті редагування чату

source: OK
uk: Зрозумів.

# signUpInvalidResponseError
source: Invalid response contents.
uk: Недійсні вмісти відповіді.

# signUpNoResponseContentsError
source: Response has no contents.
uk: Відповідь не містить вмісту.

# signUpNoResponseError
source: No response received.
uk: Відповіді не отримано.

# signUpUnexpectedStatusError
source: Unexpected status code {0}.
uk: Несподіваний код статусу {0}.

# unknownSignUpError
source: An error occurred while signing up for the Copilot Free plan. Would you like to try again?
uk: Сталася помилка під час реєстрації на безкоштовний план Copilot. Хотіли б ви спробувати ще раз?

# unprocessableSignUpError
source: An error occurred while signing up for the Copilot Free plan.
uk: Виникла помилка під час реєстрації на безкоштовний план Copilot.

# codeCitation
source: Similar code found with 1 license type
uk: Знайдено подібний код з 1 типом ліцензії

# codeCitations
source: Similar code found with {0} license types
uk: Знайдено подібний код з {0} типами ліцензій

# copyrightContentRetry
source: Response cleared due to possible match to public code, retrying with modified prompt.
uk: Відповідь очищена через можливу відповідність публічному коду, повторна спроба з модифікованим запитом.

# filteredContentRetry
source: Response cleared due to content safety filters, retrying with modified prompt.
uk: Відповідь очищена через фільтри безпеки контенту, повторна спроба з модифікованим запитом.

# agentDescription
source: Provide instructions.
uk: Надайте інструкції.

# chatDescription
source: Ask a question.
uk: Запитайте про свій код.

# editsDescription
source: Edit files.
uk: Редагувати файли.

# toolInvocationMessage
source: Using {0}
uk: Використовуючи {0}

# emptyResponse
source: Provider returned null response
uk: Постачальник повернув нульовий відповідь

source: New Chat
uk: Новий чат

# join.chatSessionStore
source: Saving chat history
uk: Збереження історії чату

# chat.attachment.problems.all
source: All Problems
uk: Усі проблеми

# chat.attachment.problems.inFile
source: Problems in {0}
uk: Проблеми в {0}

# Language Models
source: Copilot
uk: Копілот

source: chat
uk: Чат

# languageModels
source: Language models usage statistics of this extension.
uk: Статистика використання мовних моделей цього розширення.

source: Built-In
uk: Вбудований

# mcp
source: MCP Server: {0}
uk: MCP Сервер: {0}

# user
source: User Defined
uk: Користувацьке визначення

# vscode.extension.contributes.languageModels
source: Contribute language models of a specific vendor.
uk: Внесіть мовні моделі конкретного постачальника.

# vscode.extension.contributes.languageModels.chatProviderRequired
source: This contribution point requires the 'chatProvider' proposal.
uk: Ця точка внеску вимагає пропозицію 'chatProvider'.

# vscode.extension.contributes.languageModels.displayName
source: The display name of the language model vendor.
uk: Відображуване ім'я постачальника мовної моделі.

# vscode.extension.contributes.languageModels.emptyVendor
source: The vendor field cannot be empty.
uk: Поле постачальника не може бути порожнім.

# vscode.extension.contributes.languageModels.managementCommand
source: A command to manage the language model vendor, e.g. 'Manage Copilot models'. This is used in the chat model picker. If not provided, a gear icon is not rendered during vendor selection.
uk: Команда для керування постачальником мовної моделі, наприклад, 'Керувати моделями Copilot'. Це використовується у виборі моделі чату. Якщо не вказано, іконка шестерні не відображається під час вибору постачальника.

# vscode.extension.contributes.languageModels.vendor
source: A globally unique vendor of language models.
uk: Глобально унікальний постачальник мовних моделей.

# vscode.extension.contributes.languageModels.vendorAlreadyRegistered
source: The vendor '{0}' is already registered and cannot be registered twice
uk: Постачальник '{0}' вже зареєстрований і не може бути зареєстрований двічі

# vscode.extension.contributes.languageModels.whitespaceVendor
source: The vendor field cannot start or end with whitespace.
uk: Поле постачальника не може починатися або закінчуватися пробілом.

# chat.modelPicker.other
source: Other Models
uk: Інші моделі
