Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_codeActions.xlf
Languages: uk

# alwaysSave
source: Triggers Code Actions on explicit saves and auto saves triggered by window or focus changes.
uk: Викликає кодові дії при явних збереженнях та автоматичних збереженнях, що ініціюються змінами вікна або фокусу.

# codeActionsOnSave.generic
source: Controls whether '{0}' actions should be run on file save.
uk: Контролює, чи повинні виконуватися дії '{0}' при збереженні файлу.

# editor.codeActionsOnSave
source: Run Code Actions for the editor on save. Code Actions must be specified and the editor must not be shutting down. When {0} is set to `afterDelay`, Code Actions will only be run when the file is saved explicitly. Example: `"source.organizeImports": "explicit" `
uk: Запустіть дії коду для редактора під час збереження. Дії коду повинні бути вказані, і редактор не повинен закриватися. Коли {0} встановлено на `afterDelay`, дії коду будуть виконуватися лише тоді, коли файл буде збережено явно. Приклад: `"source.organizeImports": "explicit"`

# explicit
source: Triggers Code Actions only when explicitly saved.
uk: Тригери кодові дії лише тоді, коли явно збережено.

# explicitBoolean
source: Triggers Code Actions only when explicitly saved. This value will be deprecated in favor of "explicit".
uk: Викликає кодові дії лише тоді, коли явно збережено. Це значення буде застарілим на користь "явного".

# explicitSave
source: Triggers Code Actions only when explicitly saved
uk: Запускає кодові дії лише тоді, коли явно збережено

# explicitSaveBoolean
source: Triggers Code Actions only when explicitly saved. This value will be deprecated in favor of "explicit".
uk: Запускає кодові дії лише коли явно збережено. Це значення буде застарілим на користь "явного".

# never
source: Never triggers Code Actions on save.
uk: Ніколи не викликає дії коду при збереженні.

# neverBoolean
source: Triggers Code Actions only when explicitly saved. This value will be deprecated in favor of "never".
uk: Викликає кодові дії лише коли явно збережено. Це значення буде знято з підтримки на користь "ніколи".

# neverSave
source: Never triggers Code Actions on save
uk: Ніколи не викликає дії коду при збереженні

# neverSaveBoolean
source: Never triggers Code Actions on save. This value will be deprecated in favor of "never".
uk: Ніколи не викликає дії коду при збереженні. Це значення буде застарілим на користь "ніколи".

# notebook.codeActionsOnSave
source: Run a series of Code Actions for a notebook on save. Code Actions must be specified and the editor must not be shutting down. When {0} is set to `afterDelay`, Code Actions will only be run when the file is saved explicitly. Example: `"notebook.source.organizeImports": "explicit"`
uk: Запустіть серію Кодових Дій для нотатника при збереженні. Кодові Дії повинні бути вказані, і редактор не повинен закриватися. Коли {0} встановлено на `afterDelay`, Кодові Дії будуть виконуватися лише тоді, коли файл буде явно збережено. Приклад: `"notebook.source.organizeImports": "explicit"`
