Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_url.xlf
Languages: uk

# trustedDomain.manageTrustedDomain
source: Manage Trusted Domains
uk: Керувати надійними доменами

# trustedDomain.manageTrustedDomains
source: Manage Trusted Domains
uk: Керувати надійними доменами

# trustedDomain.trustAllDomains
source: Trust all domains (disables link protection)
uk: Довіряти всім доменам (вимикає захист посилань)

# trustedDomain.trustAllPorts
source: Trust {0} on all ports
uk: Довіряти {0} на всіх портах

# trustedDomain.trustDomain
source: Trust {0}
uk: Довіра {0}

# trustedDomain.trustSubDomain
source: Trust {0} and all its subdomains
uk: Довіряти {0} та всім його піддоменам

source: Configure &&Trusted Domains
uk: Налаштувати &&Довірені домени

source: &&Copy
uk: &&Копіювати

source: &&Open
uk: &&Відкрити

# openExternalLinkAt
source: Do you want {0} to open the external website?
uk: Ви хочете, щоб {0} відкрив зовнішній веб-сайт?

source: Open URL
uk: Відкрити URL

source: URL to open
uk: URL для відкриття

# workbench.trustedDomains.promptInTrustedWorkspace
source: When enabled, trusted domain prompts will appear when opening links in trusted workspaces.
uk: Коли увімкнено, запити на довірені домени з'являться при відкритті посилань у довірених робочих просторах.
