Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_search.xlf
Languages: uk

# chat
source: Open Quick Chat
uk: Відкрити Швидкий Чат

# closeEditor
source: Remove from Recently Opened
uk: Видалити з нещодавно відкритих

# fileAndSymbolResultsSeparator
source: file and symbol results
uk: файл та результати символів

# filePickAriaLabelDirty
source: {0} unsaved changes
uk: {0} незбережені зміни

# fileResultsSeparator
source: file results
uk: файл результатів

# noAnythingResults
source: No matching results
uk: Немає відповідних результатів

# openToBottom
source: Open to the Bottom
uk: Відкрити внизу

# openToSide
source: Open to the Side
uk: Відкрити збоку

# recentlyOpenedSeparator
source: recently opened
uk: недавно відкритий

# chatContext.attach.files.placeholder
source: Search file or folder by name
uk: Шукати файл або папку за назвою

# chatContext.folder
source: Files & Folders...
uk: Файли та папки...

# chatContext.searchResults
source: Search Results
uk: Результати пошуку

# select.symb
source: Select a symbol
uk: Виберіть символ

source: Symbols...
uk: Символи...

# defaultLabel
source: input
uk: вхідний

# onlySearchInOpenEditors
source: Search only in Open Editors
uk: Шукати тільки в відкритих редакторах

# useExcludesAndIgnoreFilesDescription
source: Use Exclude Settings and Ignore Files
uk: Використовуйте Налаштування виключення та Ігнорування файлів

# QuickSearchMore
source: More
uk: Більше

# QuickSearchOpenInFile
source: Open File
uk: Відкрити файл

# QuickSearchSeeMoreFiles
source: See More Files
uk: Дивитися більше файлів

# enterSearchTerm
source: Enter a term to search for across your files.
uk: Введіть термін для пошуку у ваших файлах.

# goToSearch
source: Open in Search View
uk: Відкрити в режимі пошуку

# showMore
source: Open in Search View
uk: Відкрити в режимі пошуку

# fileReplaceChanges
source: {0} ↔ {1} (Replace Preview)
uk: {0} ↔ {1} (Попередній перегляд заміни)

# searchReplace.source
source: Search and Replace
uk: Пошук і заміна

# anythingQuickAccess
source: Go to File
uk: Перейти до Файлу

# anythingQuickAccessPlaceholder
source: Search files by name (append {0} to go to line or {1} to go to symbol)
uk: Шукати файли за назвою (додайте {0}, щоб перейти до рядка, або {1}, щоб перейти до символу)

# exclude
source: Configure [glob patterns](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options) for excluding files and folders in fulltext searches and file search in quick open. To exclude files from the recently opened list in quick open, patterns must be absolute (for example `**/node_modules/**`). Inherits all glob patterns from the `#files.exclude#` setting.
uk: Налаштуйте [глобальні шаблони](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options) для виключення файлів і папок у повнотекстових пошуках та пошуку файлів у швидкому відкритті. Щоб виключити файли зі списку нещодавно відкритих у швидкому відкритті, шаблони повинні бути абсолютними (наприклад, `**/node_modules/**`). Спадкує всі глобальні шаблони з налаштування `#files.exclude#`.

# exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
uk: Шаблон glob для порівняння з шляхами файлів. Встановіть значення true або false, щоб увімкнути або вимкнути шаблон.

# exclude.when
source: Additional check on the siblings of a matching file. Use \$(basename) as variable for the matching file name.
uk: Додаткова перевірка на сусідні файли, що відповідають. Використовуйте \$(basename) як змінну для імені відповідного файлу.

# filterSortOrder
source: Controls sorting order of editor history in quick open when filtering.
uk: Контролює порядок сортування історії редактора у швидкому відкритті під час фільтрації.

# filterSortOrder.default
source: History entries are sorted by relevance based on the filter value used. More relevant entries appear first.
uk: Записи історії сортуються за релевантністю на основі використаного значення фільтра. Більш релевантні записи з'являються першими.

# filterSortOrder.recency
source: History entries are sorted by recency. More recently opened entries appear first.
uk: Записи історії сортуються за новизною. Нещодавно відкриті записи з'являються першими.

# maintainFileSearchCacheDeprecated
source: The search cache is kept in the extension host which never shuts down, so this setting is no longer needed.
uk: Кеш пошуку зберігається в хості розширення, який ніколи не вимикається, тому ця настройка більше не потрібна.

# miViewSearch
source: &&Search
uk: &&Пошук

# scm.defaultViewMode.list
source: Shows search results as a list.
uk: Показує результати пошуку у вигляді списку.

# scm.defaultViewMode.tree
source: Shows search results as a tree.
uk: Показує результати пошуку у вигляді дерева.

source: Search
uk: Пошук

# search.actionsPosition
source: Controls the positioning of the actionbar on rows in the Search view.
uk: Контролює позиціонування панелі дій на рядках у вигляді пошуку.

# search.actionsPositionAuto
source: Position the actionbar to the right when the Search view is narrow, and immediately after the content when the Search view is wide.
uk: Розмістіть панель дій праворуч, коли область пошуку вузька, і безпосередньо після вмісту, коли область пошуку широка.

# search.actionsPositionRight
source: Always position the actionbar to the right.
uk: Завжди розміщуйте панель дій праворуч.

# search.collapseAllResults
source: Controls whether the search results will be collapsed or expanded.
uk: Контролює, чи будуть результати пошуку згорнуті чи розгорнуті.

# search.collapseResults.auto
source: Files with less than 10 results are expanded. Others are collapsed.
uk: Файли з менше ніж 10 результатами розгорнуті. Інші згорнуті.

# search.decorations.badges
source: Controls whether search file decorations should use badges.
uk: Контролює, чи повинні декорації файлів пошуку використовувати значки.

# search.decorations.colors
source: Controls whether search file decorations should use colors.
uk: Контролює, чи повинні прикраси файлів пошуку використовувати кольори.

# search.defaultViewMode
source: Controls the default search result view mode.
uk: Контролює режим перегляду результатів пошуку за замовчуванням.

# search.experimental.closedNotebookResults
source: Show notebook editor rich content results for closed notebooks. Please refresh your search results after changing this setting.
uk: Показати результати багатого контенту редактора блокнота для закритих блокнотів. Будь ласка, оновіть результати пошуку після зміни цього налаштування.

# search.followSymlinks
source: Controls whether to follow symlinks while searching.
uk: Контролює, чи слідувати символічним посиланням під час пошуку.

# search.globalFindClipboard
source: Controls whether the Search view should read or modify the shared find clipboard on macOS.
uk: Контролює, чи має режим пошуку читати або змінювати спільний буфер обміну для пошуку на macOS.

# search.location
source: Controls whether the search will be shown as a view in the sidebar or as a panel in the panel area for more horizontal space.
uk: Контролює, чи буде пошук відображатися як вигляд у бічній панелі, чи як панель у панельній області для більшого горизонтального простору.

# search.location.deprecationMessage
source: This setting is deprecated. You can drag the search icon to a new location instead.
uk: Це налаштування застаріле. Ви можете перетягнути значок пошуку в нове місце.

# search.maintainFileSearchCache
source: When enabled, the searchService process will be kept alive instead of being shut down after an hour of inactivity. This will keep the file search cache in memory.
uk: Коли увімкнено, процес searchService буде підтримуватися в активному стані замість того, щоб бути завершеним після години бездіяльності. Це дозволить зберегти кеш пошуку файлів в пам'яті.

# search.maxResults
source: Controls the maximum number of search results, this can be set to `null` (empty) to return unlimited results.
uk: Контролює максимальну кількість результатів пошуку, це можна встановити на `null` (пусто), щоб повернути необмежену кількість результатів.

# search.mode
source: Controls where new `Search: Find in Files` and `Find in Folder` operations occur: either in the Search view, or in a search editor.
uk: Контролює, де нові операції `Search: Find in Files` та `Find in Folder` відбуваються: або в перегляді пошуку, або в редакторі пошуку.

# search.mode.newEditor
source: Search in a new search editor.
uk: Шукати в новому редакторі пошуку.

# search.mode.reuseEditor
source: Search in an existing search editor if present, otherwise in a new search editor.
uk: Шукати в існуючому редакторі пошуку, якщо він присутній, інакше в новому редакторі пошуку.

# search.mode.view
source: Search in the Search view, either in the panel or side bars.
uk: Шукайте у вигляді пошуку, або в панелі, або в бічних панелях.

# search.quickAccess.preserveInput
source: Controls whether the last typed input to Quick Search should be restored when opening it the next time.
uk: Контролює, чи слід відновити останній введений текст у Швидкому пошуку при його відкритті наступного разу.

# search.quickOpen.includeHistory
source: Whether to include results from recently opened files in the file results for Quick Open.
uk: Чи включати результати з нещодавно відкритих файлів у результати файлів для Швидкого відкриття.

# search.quickOpen.includeSymbols
source: Whether to include results from a global symbol search in the file results for Quick Open.
uk: Чи включати результати з глобального пошуку символів у результати файлів для Швидкого відкриття.

# search.ripgrep.maxThreads
source: Number of threads to use for searching. When set to 0, the engine automatically determines this value.
uk: Кількість потоків, які використовувати для пошуку. Коли встановлено 0, движок автоматично визначає це значення.

# search.searchEditor.defaultNumberOfContextLines
source: The default number of surrounding context lines to use when creating new Search Editors. If using `#search.searchEditor.reusePriorSearchConfiguration#`, this can be set to `null` (empty) to use the prior Search Editor's configuration.
uk: Типове число рядків контексту навколо, які використовуються при створенні нових редакторів пошуку. Якщо використовується `#search.searchEditor.reusePriorSearchConfiguration#`, це можна встановити на `null` (порожнє), щоб використовувати конфігурацію попереднього редактора пошуку.

# search.searchEditor.doubleClickBehaviour
source: Configure effect of double-clicking a result in a search editor.
uk: Налаштуйте ефект подвійного клацання на результат у редакторі пошуку.

# search.searchEditor.doubleClickBehaviour.goToLocation
source: Double-clicking opens the result in the active editor group.
uk: Подвійне клацання відкриває результат у активній групі редакторів.

# search.searchEditor.doubleClickBehaviour.openLocationToSide
source: Double-clicking opens the result in the editor group to the side, creating one if it does not yet exist.
uk: Двоклік відкриває результат у групі редактора збоку, створюючи її, якщо вона ще не існує.

# search.searchEditor.doubleClickBehaviour.selectWord
source: Double-clicking selects the word under the cursor.
uk: Подвійний клік вибирає слово під курсором.

# search.searchEditor.focusResultsOnSearch
source: When a search is triggered, focus the Search Editor results instead of the Search Editor input.
uk: Коли виконується пошук, зосередьте увагу на результатах Редактора пошуку замість введення в Редакторі пошуку.

# search.searchEditor.reusePriorSearchConfiguration
source: When enabled, new Search Editors will reuse the includes, excludes, and flags of the previously opened Search Editor.
uk: Коли увімкнено, нові Редактори Пошуку повторно використовуватимуть параметри включення, виключення та прапорці попередньо відкритого Редактора Пошуку.

# search.searchEditor.singleClickBehaviour
source: Configure effect of single-clicking a result in a search editor.
uk: Налаштуйте ефект одиничного клацання на результат у редакторі пошуку.

# search.searchEditor.singleClickBehaviour.default
source: Single-clicking does nothing.
uk: Одноклікове натискання нічого не робить.

# search.searchEditor.singleClickBehaviour.peekDefinition
source: Single-clicking opens a Peek Definition window.
uk: Однокліком відкривається вікно Попереднього перегляду визначення.

# search.searchOnType
source: Search all files as you type.
uk: Шукайте всі файли під час введення.

# search.searchOnTypeDebouncePeriod
source: When {0} is enabled, controls the timeout in milliseconds between a character being typed and the search starting. Has no effect when {0} is disabled.
uk: Коли {0} увімкнено, контролює тайм-аут у мілісекундах між введенням символу та початком пошуку. Не має жодного ефекту, коли {0} вимкнено.

# search.searchView.keywordSuggestions
source: Enable keyword suggestions in the Search view.
uk: Увімкніть пропозиції ключових слів у вигляді пошуку.

# search.searchView.semanticSearchBehavior
source: Controls the behavior of the semantic search results displayed in the Search view.
uk: Контролює поведінку семантичних результатів пошуку, що відображаються в режимі пошуку.

# search.searchView.semanticSearchBehavior.auto
source: Request semantic results automatically with every search.
uk: Запитуйте семантичні результати автоматично з кожним пошуком.

# search.searchView.semanticSearchBehavior.manual
source: Only request semantic search results manually.
uk: Тільки запитуйте результати семантичного пошуку вручну.

# search.searchView.semanticSearchBehavior.runOnEmpty
source: Request semantic results automatically only when text search results are empty.
uk: Запитуйте семантичні результати автоматично лише тоді, коли результати текстового пошуку порожні.

# search.seedOnFocus
source: Update the search query to the editor's selected text when focusing the Search view. This happens either on click or when triggering the `workbench.views.search.focus` command.
uk: Оновіть запит пошуку на вибраний текст редактора при фокусуванні на вигляді Пошуку. Це відбувається або при натисканні, або при активації команди `workbench.views.search.focus`.

# search.seedWithNearestWord
source: Enable seeding search from the word nearest the cursor when the active editor has no selection.
uk: Увімкніть пошук насіння з найближчого до курсора слова, коли активний редактор не має виділення.

# search.showLineNumbers
source: Controls whether to show line numbers for search results.
uk: Контролює, чи показувати номери рядків для результатів пошуку.

# search.smartCase
source: Search case-insensitively if the pattern is all lowercase, otherwise, search case-sensitively.
uk: Шукайте без урахування регістру, якщо шаблон повністю написаний малими літерами, в іншому випадку шукайте з урахуванням регістру.

# search.sortOrder
source: Controls sorting order of search results.
uk: Контролює порядок сортування результатів пошуку.

# search.usePCRE2
source: Whether to use the PCRE2 regex engine in text search. This enables using some advanced regex features like lookahead and backreferences. However, not all PCRE2 features are supported - only features that are also supported by JavaScript.
uk: Чи використовувати движок регулярних виразів PCRE2 в пошуку тексту. Це дозволяє використовувати деякі розширені можливості регулярних виразів, такі як попередній перегляд і зворотні посилання. Однак не всі можливості PCRE2 підтримуються - лише ті, що також підтримуються JavaScript.

# search.useReplacePreview
source: Controls whether to open Replace Preview when selecting or replacing a match.
uk: Контролює, чи відкривати Попередній перегляд заміни при виборі або заміні збігу.

# searchConfigurationTitle
source: Search
uk: Пошук

# searchSortOrder.countAscending
source: Results are sorted by count per file, in ascending order.
uk: Результати відсортовані за кількістю на файл у порядку зростання.

# searchSortOrder.countDescending
source: Results are sorted by count per file, in descending order.
uk: Результати відсортовані за кількістю на файл у порядку спадання.

# searchSortOrder.default
source: Results are sorted by folder and file names, in alphabetical order.
uk: Результати відсортовані за назвами папок і файлів у алфавітному порядку.

# searchSortOrder.filesOnly
source: Results are sorted by file names ignoring folder order, in alphabetical order.
uk: Результати відсортовані за іменами файлів, ігноруючи порядок папок, в алфавітному порядку.

# searchSortOrder.modified
source: Results are sorted by file last modified date, in descending order.
uk: Результати відсортовані за датою останнього змінення файлу, у порядку спадання.

# searchSortOrder.type
source: Results are sorted by file extensions, in alphabetical order.
uk: Результати відсортовані за розширеннями файлів у алфавітному порядку.

# symbolsQuickAccess
source: Go to Symbol in Workspace
uk: Перейти до символу в робочому просторі

# symbolsQuickAccessPlaceholder
source: Type the name of a symbol to open.
uk: Введіть назву символу для відкриття.

# textSearchPickerHelp
source: Search for Text
uk: Шукати текст

# textSearchPickerPlaceholder
source: Search for text in your workspace files.
uk: Шукайте текст у файлах вашого робочого простору.

# useGlobalIgnoreFiles
source: Controls whether to use your global gitignore file (for example, from `$HOME/.config/git/ignore`) when searching for files. Requires {0} to be enabled.
uk: Контролює, чи використовувати ваш глобальний файл gitignore (наприклад, з `$HOME/.config/git/ignore`) під час пошуку файлів. Потребує, щоб {0} був увімкнений.

# useIgnoreFiles
source: Controls whether to use `.gitignore` and `.ignore` files when searching for files.
uk: Контролює, чи використовувати файли `.gitignore` та `.ignore` під час пошуку файлів.

# usePCRE2Deprecated
source: Deprecated. PCRE2 will be used automatically when using regex features that are only supported by PCRE2.
uk: Застаріло. PCRE2 буде використовуватися автоматично при використанні функцій regex, які підтримуються лише PCRE2.

# useParentIgnoreFiles
source: Controls whether to use `.gitignore` and `.ignore` files in parent directories when searching for files. Requires {0} to be enabled.
uk: Контролює, чи використовувати файли `.gitignore` та `.ignore` у батьківських каталогах під час пошуку файлів. Потрібно, щоб {0} був увімкнений.

# useRipgrep
source: This setting is deprecated and now falls back on "search.usePCRE2".
uk: Цей параметр застарів і тепер повертається до "search.usePCRE2".

# useRipgrepDeprecated
source: Deprecated. Consider "search.usePCRE2" for advanced regex feature support.
uk: Застаріло. Розгляньте "search.usePCRE2" для підтримки розширених функцій regex.

# copyAllLabel
source: Copy All
uk: Скопіювати все

# copyMatchLabel
source: Copy
uk: Копіювати

# copyPathLabel
source: Copy Path
uk: Копіювати шлях

# getSearchResultsLabel
source: Get Search Results
uk: Отримати результати пошуку

source: Exclude Folder from Search
uk: Виключити папку з пошуку

source: Find in Files
uk: Знайти у файлах

# findInFiles.args
source: A set of options for the search
uk: Набір параметрів для пошуку

# findInFiles.description
source: Open a workspace search
uk: Відкрити пошук робочого простору

source: Find in Folder...
uk: Знайти в папці...

source: Find in Workspace...
uk: Знайти в Робочій області...

# miFindInFiles
source: Find &&in Files
uk: Знайти &&в файлах

# restrictResultsToFolder
source: Restrict Search to Folder
uk: Обмежити пошук папкою

# revealInSideBar
source: Reveal in Explorer View
uk: Відкрити в режимі Провідника

# search.expandRecursively
source: Expand Recursively
uk: Розширити рекурсивно

# AddCursorsAtSearchResults.label
source: Add Cursors at Search Results
uk: Додати курсори в результатах пошуку

# CloseReplaceWidget.label
source: Close Replace Widget
uk: Закрити віджет заміни

# FocusNextInputAction.label
source: Focus Next Input
uk: Сфокусувати наступний ввід

# FocusNextSearchResult.label
source: Focus Next Search Result
uk: Зосередити наступний результат пошуку

# FocusPreviousInputAction.label
source: Focus Previous Input
uk: Зосередити попередній ввід

# FocusPreviousSearchResult.label
source: Focus Previous Search Result
uk: Зосередити попередній результат пошуку

# FocusSearchFromResults.label
source: Focus Search From Results
uk: Зосередити пошук за результатами

# OpenMatch.label
source: Open Match
uk: Відкрити матч

# OpenMatchToSide.label
source: Open Match To Side
uk: Відкрити матч вбік

# ToggleCaseSensitiveCommandId.label
source: Toggle Case Sensitive
uk: Перемикати чутливість до регістру

# TogglePreserveCaseId.label
source: Toggle Preserve Case
uk: Перемикати збереження регістру

# ToggleQueryDetailsAction.label
source: Toggle Query Details
uk: Перемкнути деталі запиту

# ToggleRegexCommandId.label
source: Toggle Regex
uk: Перемкнути Regex

# ToggleWholeWordCommandId.label
source: Toggle Whole Word
uk: Переключити ціле слово

# focusSearchListCommandLabel
source: Focus List
uk: Список фокусів

source: Replace in Files
uk: Замінити в файлах

# toggleTabs
source: Toggle Search on Type
uk: Перемикання пошуку за типом

# RemoveAction.label
source: Dismiss
uk: Відхилити

# file.replaceAll.label
source: Replace All
uk: Замінити все

# match.replace.label
source: Replace
uk: Замінити

# miGotoSymbolInWorkspace
source: Go to Symbol in &&Workspace...
uk: Перейти до символу в &&робочому просторі...

# showTriggerActions
source: Go to Symbol in Workspace...
uk: Перейти до Символу в Робочому просторі...

# quickTextSearch
source: Quick Search
uk: Швидкий пошук

# CancelSearchAction.label
source: Cancel Search
uk: Скасувати пошук

# ClearSearchResultsAction.label
source: Clear Search Results
uk: Очистити результати пошуку

# CollapseDeepestExpandedLevelAction.label
source: Collapse All
uk: Сховати все

# ExpandAllAction.label
source: Expand All
uk: Розгорнути все

# RefreshAction.label
source: Refresh
uk: Оновити

# SearchWithAIAction.label
source: Search with AI
uk: Пошук з AI

# ViewAsListAction.label
source: View as List
uk: Перегляд у вигляді списку

# ViewAsTreeAction.label
source: View as Tree
uk: Переглядати як Дерево

# clearSearchHistoryLabel
source: Clear Search History
uk: Очистити історію пошуку

# searchFindInputNotebookFilter.label
source: Notebook Find Filters
uk: Ноутбук Знайти Фільтри

# searchClearIcon
source: Icon for clear results in the search view.
uk: Іконка для чітких результатів у перегляді пошуку.

# searchCollapseAllIcon
source: Icon for collapse results in the search view.
uk: Іконка для згортання результатів у перегляді пошуку.

# searchDetailsIcon
source: Icon to make search details visible.
uk: Іконка для відображення деталей пошуку.

# searchExpandAllIcon
source: Icon for expand results in the search view.
uk: Іконка для розширення результатів у перегляді пошуку.

# searchHideReplaceIcon
source: Icon to collapse the replace section in the search view.
uk: Іконка для згортання секції заміни в режимі пошуку.

# searchNewEditorIcon
source: Icon for the action to open a new search editor.
uk: Іконка для дії відкриття нового редактора пошуку.

# searchOpenInFile
source: Icon for the action to go to the file of the current search result.
uk: Іконка для дії переходу до файлу поточного результату пошуку.

# searchRefreshIcon
source: Icon for refresh in the search view.
uk: Іконка для оновлення в режимі пошуку.

# searchRemoveIcon
source: Icon to remove a search result.
uk: Іконка для видалення результату пошуку.

# searchReplaceAllIcon
source: Icon for replace all in the search view.
uk: Іконка для заміни всіх у перегляді пошуку.

# searchReplaceIcon
source: Icon for replace in the search view.
uk: Іконка для заміни в режимі пошуку.

# searchSeeMoreIcon
source: Icon to view more context in the search view.
uk: Іконка для перегляду додаткового контексту в пошуковому вигляді.
