Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_typeHierarchy.xlf
Languages: uk

source: Close
uk: Закрити

# editorHasTypeHierarchyProvider
source: Whether a type hierarchy provider is available
uk: Чи доступний постачальник ієрархії типів

# error
source: Failed to show type hierarchy
uk: Не вдалося відобразити ієрархію типів

# no.item
source: No results
uk: Немає результатів

# title
source: Peek Type Hierarchy
uk: Переглянути ієрархію типів

# title.refocusTypeHierarchy
source: Refocus Type Hierarchy
uk: Переналаштувати ієрархію типів

# title.subtypes
source: Show Subtypes
uk: Показати підтипи

# title.supertypes
source: Show Supertypes
uk: Показати супертипи

# typeHierarchyDirection
source: whether type hierarchy shows super types or subtypes
uk: чи ієрархія типів показує супертеги чи підтипи

# typeHierarchyVisible
source: Whether type hierarchy peek is currently showing
uk: Чи наразі відображається перегляд ієрархії типів

# empt.subtypes
source: No subtypes of '{0}'
uk: Немає підтипів '{0}'

# empt.supertypes
source: No supertypes of '{0}'
uk: Немає супертотипів '{0}'

# subtypes
source: Subtypes of '{0}'
uk: Підтипи '{0}'

# supertypes
source: Supertypes of '{0}'
uk: Супертипи '{0}'

# title.loading
source: Loading...
uk: Завантаження...

# subtypes
source: subtypes of {0}
uk: Підтипи '{0}'

# supertypes
source: supertypes of {0}
uk: Супертипи '{0}'

# tree.aria
source: Type Hierarchy
uk: Ієрархія типів
