Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_search.xlf
Languages: uk

# searchShowAsList
source: Icon for viewing results as a list in the search view.
uk: Іконка для перегляду результатів у вигляді списку в режимі пошуку.

# searchShowAsTree
source: Icon for viewing results as a tree in the search view.
uk: Іконка для перегляду результатів у вигляді дерева в режимі пошуку.

# searchShowContextIcon
source: Icon for toggle the context in the search editor.
uk: Іконка для перемикання контексту в редакторі пошуку.

# searchShowReplaceIcon
source: Icon to expand the replace section in the search view.
uk: Іконка для розширення секції заміни в перегляді пошуку.

# searchSparkleEmpty
source: Icon to hide AI results in search.
uk: Іконка для приховування результатів ШІ в пошуку.

# searchSparkleFilled
source: Icon to show AI results in search.
uk: Іконка для відображення результатів ШІ в пошуку.

# searchStopIcon
source: Icon for stop in the search view.
uk: Іконка для зупинки в режимі пошуку.

# searchViewIcon
source: View icon of the search view.
uk: Переглянути значок пошукового перегляду.

# unable to open
source: Unable to open unknown link: {0}
uk: Неможливо відкрити невідоме посилання: {0}

# unable to open trust
source: Unable to open command link from untrusted source: {0}
uk: Неможливо відкрити командне посилання з ненадійного джерела: {0}

# fileMatchAriaLabel
source: {0} matches in file {1} of folder {2}, Search result
uk: {0} співпадінь у файлі {1} папки {2}, Результат пошуку

# folderMatchAriaLabel
source: {0} matches in folder root {1}, Search result
uk: {0} збігів у папці root {1}, Результат пошуку

# lineNumStr
source: From line {0}
uk: З рядка {0}

# numLinesStr
source: {0} more lines
uk: {0} ще рядків

# otherFilesAriaLabel
source: {0} matches outside of the workspace, Search result
uk: {0} збігається поза робочою областю, Результат пошуку

# replacePreviewResultAria
source: '{0}' at column {1} replace {2} with {3}
uk: '{0}' у стовпці {1} замініть {2} на {3}

# searchFileMatch
source: {0} file found
uk: Знайдено файл {0}

# searchFileMatches
source: {0} files found
uk: Знайдено {0} файлів

# searchFolderMatch.aiText.label
source: AI-assisted results
uk: Результати з підтримкою ШІ

# searchFolderMatch.other.label
source: Other files
uk: Інші файли

# searchFolderMatch.plainText.label
source: Text Results
uk: Текстові результати

# searchMatch
source: {0} match found
uk: Знайдено {0} матчів

# searchMatches
source: {0} matches found
uk: Знайдено {0} збігів

# searchResultAria
source: '{0}' at column {1} found {2}
uk: '{0}' у стовпці {1} знайдено {2}

# ariaSearchResultsStatus
source: Search returned {0} results in {1} files
uk: Пошук повернув {0} результатів у {1} файлах

# disableOpenEditors
source: Search in entire workspace
uk: Шукати в усьому робочому просторі

source: Empty Search
uk: Порожній пошук

# excludes.enable
source: enable
uk: увімкнути

# forTerm
source: - Search: {0}
uk: - Пошук: {0}

# keywordSuggestion.message
source: Search instead for:
uk: Шукати замість:

# moreSearch
source: Toggle Search Details
uk: Переключити деталі пошуку

# noOpenEditorResultsExcludes
source: No results found in open editors excluding '{0}' -
uk: Не знайдено результатів у відкритих редакторах, за винятком '{0}' -

# noOpenEditorResultsFound
source: No results found in open editors. Review your settings for configured exclusions and check your gitignore files -
uk: Не знайдено результатів у відкритих редакторах. Перегляньте свої налаштування для сконфігурованих виключень і перевірте свої файли .gitignore -

# noOpenEditorResultsIncludes
source: No results found in open editors matching '{0}' -
uk: Не знайдено результатів у відкритих редакторах, що відповідають '{0}' -

# noOpenEditorResultsIncludesExcludes
source: No results found in open editors matching '{0}' excluding '{1}' -
uk: Не знайдено результатів у відкритих редакторах, що відповідають '{0}', за винятком '{1}' -

# noResultsExcludes
source: No results found excluding '{0}' -
uk: Не знайдено результатів, виключаючи '{0}' -

# noResultsFallback
source: No results found.
uk: Не знайдено жодних результатів.

# noResultsFound
source: No results found. Review your settings for configured exclusions and check your gitignore files -
uk: Не знайдено результатів. Перегляньте свої налаштування для налаштованих виключень і перевірте свої файли .gitignore -

# noResultsIncludes
source: No results found in '{0}' -
uk: Не знайдено результатів у '{0}' -

# noResultsIncludesExcludes
source: No results found in '{0}' excluding '{1}' -
uk: Не знайдено результатів у '{0}', за винятком '{1}' -

# onlyOpenEditors
source: searching only in open files
uk: пошук тільки в відкритих файлах

# openEditors.disable
source: disable
uk: вимкнути

source: Open Folder
uk: Відкрити папку

# openInEditor.message
source: Open in editor
uk: Відкрити в редакторі

# openInEditor.tooltip
source: Copy current search results to an editor
uk: Скопіювати поточні результати пошуку в редактор

# openSettings.learnMore
source: Learn More
uk: Дізнатися більше

# openSettings.message
source: Open Settings
uk: Відкрити Налаштування

# placeholder.excludes
source: e.g. *.ts, src/**/exclude
uk: наприклад, *.ts, src/**/exclude

# placeholder.includes
source: e.g. *.ts, src/**/include
uk: наприклад, *.ts, src/**/include

# removeAll.occurrence.file.confirmation.message
source: Replace {0} occurrence across {1} file with '{2}'?
uk: Замінити {0} випадків у {1} файлі на '{2}'?

# removeAll.occurrence.file.message
source: Replaced {0} occurrence across {1} file.
uk: Замінено {0} випадків у {1} файлі.

# removeAll.occurrence.files.confirmation.message
source: Replace {0} occurrence across {1} files with '{2}'?
uk: Замінити {0} появу в {1} файлах на '{2}'?

# removeAll.occurrence.files.message
source: Replaced {0} occurrence across {1} files.
uk: Замінено {0} випадків у {1} файлах.

# removeAll.occurrences.file.confirmation.message
source: Replace {0} occurrences across {1} file with '{2}'?
uk: Замінити {0} випадків у {1} файлі на '{2}'?

# removeAll.occurrences.file.message
source: Replaced {0} occurrences across {1} file.
uk: Замінено {0} випадків у {1} файлі.

# removeAll.occurrences.files.confirmation.message
source: Replace {0} occurrences across {1} files with '{2}'?
uk: Замінити {0} випадків у {1} файлах на '{2}'?

# removeAll.occurrences.files.message
source: Replaced {0} occurrences across {1} files.
uk: Замінено {0} випадків у {1} файлах.

# replaceAll.confirm.button
source: &&Replace
uk: &&Замінити

# replaceAll.confirmation.title
source: Replace All
uk: Замінити все

# replaceAll.occurrence.file.confirmation.message
source: Replace {0} occurrence across {1} file?
uk: Замінити {0} випадок у {1} файлі?

# replaceAll.occurrence.file.message
source: Replaced {0} occurrence across {1} file with '{2}'.
uk: Замінено {0} випадків у {1} файлі на '{2}'.

# replaceAll.occurrence.files.confirmation.message
source: Replace {0} occurrence across {1} files?
uk: Замінити {0} випадків у {1} файлах?

# replaceAll.occurrence.files.message
source: Replaced {0} occurrence across {1} files with '{2}'.
uk: Замінено {0} випадків у {1} файлах на '{2}'.

# replaceAll.occurrences.file.confirmation.message
source: Replace {0} occurrences across {1} file?
uk: Замінити {0} випадків у {1} файлі?

# replaceAll.occurrences.file.message
source: Replaced {0} occurrences across {1} file with '{2}'.
uk: Замінено {0} випадків у {1} файлі на '{2}'.

# replaceAll.occurrences.files.confirmation.message
source: Replace {0} occurrences across {1} files?
uk: Замінити {0} випадків у {1} файлах?

# replaceAll.occurrences.files.message
source: Replaced {0} occurrences across {1} files with '{2}'.
uk: Замінено {0} випадків у {1} файлах на '{2}'.

# rerunSearch.message
source: Search again
uk: Шукати знову

# rerunSearchInAll.message
source: Search again in all files
uk: Шукати знову у всіх файлах

# search.file.result
source: {0} result in {1} file
uk: {0} результат у {1} файлі

# search.file.results
source: {0} results in {1} file
uk: {0} результати в {1} файлі

# search.files.result
source: {0} result in {1} files
uk: {0} призводить до {1} файлів

# search.files.results
source: {0} results in {1} files
uk: {0} результати в {1} файлах

# searchCanceled
source: Search was canceled before any results could be found -
uk: Пошук було скасовано до того, як були знайдені будь-які результати -

# searchMaxResultsWarning
source: The result set only contains a subset of all matches. Be more specific in your search to narrow down the results.
uk: Набір результатів містить лише підмножину всіх збігів. Будьте більш конкретними у вашому пошуку, щоб звузити результати.

# searchPathNotFoundError
source: Search path not found: {0}
uk: Шлях пошуку не знайдено: {0}

# searchScope.excludes
source: files to exclude
uk: файли для виключення

# searchScope.includes
source: files to include
uk: файли для включення

# searchWithAIButtonTooltip
source: Search with AI.
uk: Шукати з AI.

# searchWithoutFolder
source: You have not opened or specified a folder. Only open files are currently searched -
uk: Ви не відкрили або не вказали папку. В даний момент шукаються лише відкриті файли -

# triggerAISearch.tooltip
source: Search with AI.
uk: Пошук з AI.

# useIgnoresAndExcludesDisabled
source: exclude settings and ignore files are disabled
uk: виключення налаштувань та ігнорування файлів вимкнені

# label.Replace
source: Replace: Type replace term and press Enter to preview
uk: Замініть: Введіть термін заміни та натисніть Enter для попереднього перегляду

# label.Search
source: Search: Type Search Term and press Enter to search
uk: Пошук: введіть пошуковий запит і натисніть Enter, щоб виконати пошук

# search.action.replaceAll.disabled.label
source: Replace All (Submit Search to Enable)
uk: Замінити все (Надіслати пошук для активації)

# search.action.replaceAll.enabled.label
source: Replace All
uk: Замінити все

# search.placeHolder
source: Search
uk: Пошук

# search.replace.placeHolder
source: Replace
uk: Замінити

# search.replace.toggle.button.title
source: Toggle Replace
uk: Перемикання заміни

# showContext
source: Toggle Context Lines
uk: Перемикати контекстні рядки

# noSymbolResults
source: No matching workspace symbols
uk: Немає відповідних символів робочого простору
