Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# editorCommand.activeEditorMove.arg.description
source: Argument Properties: * 'to': String value providing where to move. * 'by': String value providing the unit for move (by tab or by group). * 'value': Number value providing how many positions or an absolute position to move.
uk: Властивості аргументів: * 'to': рядкове значення, що вказує, куди рухатися. * 'by': рядкове значення, що вказує одиницю для руху (по вкладці або по групі). * 'value': числове значення, що вказує, скільки позицій або абсолютну позицію для переміщення.

# editorCommand.activeEditorMove.arg.name
source: Active editor move argument
uk: Аргумент переміщення активного редактора

# editorCommand.activeEditorMove.description
source: Move the active editor by tabs or groups
uk: Перемістіть активний редактор за вкладками або групами

# editorGroupLayout.horizontal
source: Horizontal
uk: Горизонтальний

# editorGroupLayout.vertical
source: Vertical
uk: Вертикальний

# focusLeftSideEditor
source: Focus First Side in Active Editor
uk: Зосередити першу сторону в активному редакторі

# focusOtherSideEditor
source: Focus Other Side in Active Editor
uk: Фокус на інший бік в активному редакторі

# focusRightSideEditor
source: Focus Second Side in Active Editor
uk: Зосередити другу сторону в активному редакторі

source: Join Editor in Group
uk: Приєднатися до редактора в групі

source: Lock Editor Group
uk: Група блокування

source: Split Editor in Group
uk: Розділити редактор у групі

source: Toggle Editor Group Lock
uk: Перемикання блокування групи редакторів

# toggleJoinEditorInGroup
source: Toggle Split Editor in Group
uk: Перемикання розділеного редактора в групі

# toggleSplitEditorInGroupLayout
source: Toggle Layout of Split Editor in Group
uk: Перемкнути макет

source: Unlock Editor Group
uk: Розблокувати групу

# editor.editorAssociations
source: Configure [glob patterns](https://aka.ms/vscode-glob-patterns) to editors (for example `"*.hex": "hexEditor.hexedit"`). These have precedence over the default behavior.
uk: Налаштуйте [глобальні шаблони](https://aka.ms/vscode-glob-patterns) для редакторів (наприклад, `"*.hex": "hexEditor.hexedit"`). Вони мають пріоритет над поведінкою за замовчуванням.

# editorLargeFileSizeConfirmation
source: Controls the minimum size of a file in MB before asking for confirmation when opening in the editor. Note that this setting may not apply to all editor types and environments.
uk: Контролює мінімальний розмір файлу в МБ перед запитом підтвердження при відкритті в редакторі. Зверніть увагу, що ця настройка може не застосовуватися до всіх типів редакторів і середовищ.

source: Interactive Window
uk: Інтерактивне вікно

source: Live Preview
uk: Живий попередній перегляд

source: Markdown Preview
uk: Попередній перегляд Markdown

source: Simple Browser
uk: Простий браузер

# workbench.editor.autoLockGroups
source: If an editor matching one of the listed types is opened as the first in an editor group and more than one group is open, the group is automatically locked. Locked groups will only be used for opening editors when explicitly chosen by a user gesture (for example drag and drop), but not by default. Consequently, the active editor in a locked group is less likely to be replaced accidentally with a different editor.
uk: Якщо редактор, що відповідає одному з вказаних типів, відкривається першим у групі редакторів і відкрито більше ніж одну групу, група автоматично блокується. Заблоковані групи використовуватимуться лише для відкриття редакторів, коли це явно вибрано жестом користувача (наприклад, перетягуванням), але не за замовчуванням. Внаслідок цього активний редактор у заблокованій групі менш імовірно буде випадково замінено на інший редактор.

# workbench.editor.defaultBinaryEditor
source: The default editor for files detected as binary. If undefined, the user will be presented with a picker.
uk: Редактор за замовчуванням для файлів, виявлених як бінарні. Якщо не визначено, користувачеві буде запропоновано вибір.

# dropIntoEditorPrompt
source: Hold __{0}__ to drop into editor
uk: Утримуйте __{0}__ для переходу в редактор

# ariaLabelGroupActions
source: Empty editor group actions
uk: Дії порожньої групи редактора

# emptyEditorGroup
source: {0} (empty)
uk: {0} (порожньо)

# groupAriaLabel
source: Editor Group {0}
uk: Група редакторів {0}

# groupAriaLabelLong
source: {0}: Editor Group {1}
uk: {0}: Група редакторів {1}

# groupLabel
source: Group {0}
uk: Група {0}

# groupLabelLong
source: {0}: Group {1}
uk: {0}: Група {1}

# moveErrorDetails
source: Try saving or reverting the editor first and then try again.
uk: Спробуйте спочатку зберегти або скасувати зміни в редакторі, а потім спробуйте ще раз.

# editorLineHighlight
source: Foreground color for the labels in the editor watermark.
uk: Колір переднього плану для міток у водяному знаку редактора.

# watermark.findInFiles
source: Find in Files
uk: Знайти у файлах

# watermark.newUntitledFile
source: New Untitled Text File
uk: Новий неназваний текстовий файл

# watermark.openChat
source: Open Chat
uk: Відкрити чат

# watermark.openFile
source: Open File
uk: Відкрити файл

# watermark.openFileFolder
source: Open File or Folder
uk: Відкрити файл або папку

# watermark.openFolder
source: Open Folder
uk: Відкрити папку

# watermark.openRecent
source: Open Recent
uk: Відкрити нещодавні

# watermark.openSettings
source: Open Settings
uk: Відкрити Налаштування

# watermark.quickAccess
source: Go to File
uk: Перейти до Файлу

# watermark.showCommands
source: Show All Commands
uk: Показати всі команди

# watermark.startDebugging
source: Start Debugging
uk: Почати налагодження

# watermark.toggleTerminal
source: Toggle Terminal
uk: Переключити термінал

# editorOpenErrorDialog
source: Unable to open '{0}'
uk: Неможливо відкрити '{0}'

# groupLabel
source: Window {0}
uk: Група {0}

source: Error Editor
uk: Редактор помилок

# manageTrust
source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# requiresFolderTrustText
source: The file is not displayed in the editor because trust has not been granted to the folder.
uk: Файл не відображається в редакторі, оскільки довіра не була надана папці.

# requiresWorkspaceTrustText
source: The file is not displayed in the editor because trust has not been granted to the workspace.
uk: Файл не відображається в редакторі, оскільки довіра не була надана робочій області.

# retry
source: Try Again
uk: Спробуйте ще раз

source: Show Logs
uk: Показати журнали

# trustRequiredEditor
source: Workspace Trust Required
uk: Необхідна довіра до робочого простору

# unavailableResourceErrorEditorText
source: The editor could not be opened because the file was not found.
uk: Редактор не вдалося відкрити, оскільки файл не знайдено.

# unknownErrorEditorTextWithError
source: The editor could not be opened due to an unexpected error. Please consult the log for more details.
uk: Редактор не вдалося відкрити через несподівану помилку. Будь ласка, зверніться до журналу для отримання додаткової інформації.

# unknownErrorEditorTextWithoutError
source: The editor could not be opened due to an unexpected error.
uk: Редактор не вдалося відкрити через несподівану помилку.

# entryAriaLabelDirty
source: {0}, unsaved changes
uk: {0}, незбережені зміни

# entryAriaLabelWithGroupDirty
source: {0}, unsaved changes, {1}
uk: {0}, незбережені зміни, {1}

# noViewResults
source: No matching editors
uk: Немає відповідних редакторів

source: Auto Detect
uk: Авто виявлення

# changeEncoding
source: Change File Encoding
uk: Змінити кодування файлу

# changeEndOfLine
source: Change End of Line Sequence
uk: Змінити послідовність кінця рядка

# changeLanguageMode.arg.name
source: The name of the language mode to change to.
uk: Назва мовного режиму, на який потрібно змінити.

# changeLanguageMode.description
source: Change the language mode of the active text editor.
uk: Змініть мовний режим активного текстового редактора.

# changeMode
source: Change Language Mode
uk: Змінити мовний режим

# columnSelectionModeEnabled
source: Column Selection
uk: Вибір стовпця

# configureAssociationsExt
source: Configure File Association for '{0}'...
uk: Налаштувати асоціацію файлів для '{0}'...

# configureModeSettings
source: Configure '{0}' language based settings...
uk: Налаштуйте параметри мови '{0}'...

source: Current Association
uk: Поточна асоціація

source: Current Problem
uk: Поточна проблема

source: Disable Column Selection Mode
uk: Вимкнути режим вибору стовпців

# disableTabMode
source: Disable Accessibility Mode
uk: Вимкнути режим доступності

# fileInfo
source: File Information
uk: Інформація про файл

# gotoLine
source: Go to Line/Column
uk: Перейти до рядка/стовпця

# guessedEncoding
source: Guessed from content
uk: Вгадано з вмісту

# indentConvert
source: convert file
uk: конвертувати файл

# indentView
source: change view
uk: змінити вигляд

# languageDescription
source: ({0}) - Configured Language
uk: ({0}) - Налаштована мова

# languagesPicks
source: languages (identifier)
uk: мови (ідентифікатор)

# multiSelection
source: {0} selections
uk: {0} виборів

# multiSelectionRange
source: {0} selections ({1} characters selected)
uk: {0} виборів ({1} символів вибрано)

# noEditor
source: No text editor active at this time
uk: На даний момент жоден текстовий редактор не активний

# noFileEditor
source: No file active at this time
uk: Немає активного файлу в даний час

# noWritableCodeEditor
source: The active code editor is read-only.
uk: Активний редактор коду доступний лише для читання.

# pickAction
source: Select Action
uk: Вибрати дію

# pickEncodingForReopen
source: Select File Encoding to Reopen File
uk: Виберіть кодування файлу для повторного відкриття файлу

# pickEncodingForSave
source: Select File Encoding to Save with
uk: Виберіть кодування файлу для збереження

# pickEndOfLine
source: Select End of Line Sequence
uk: Виберіть послідовність кінця рядка

# pickLanguage
source: Select Language Mode
uk: Виберіть мовний режим

# pickLanguageToConfigure
source: Select Language Mode to Associate with '{0}'
uk: Виберіть мовний режим для асоціації з '{0}'

# reopen
source: Discard Changes and Reopen
uk: Скасувати зміни та повторно відкрити

source: Reopen with Encoding
uk: Відкрити з кодуванням

# reopenWithEncodingDetail
source: This will discard any unsaved changes.
uk: Це скасує всі незбережені зміни.

# reopenWithEncodingWarning
source: Do you want to revert the active text editor and reopen with a different encoding?
uk: Ви хочете скасувати активний текстовий редактор і відкрити його з іншим кодуванням?

source: Save with Encoding
uk: Зберегти з кодуванням

# selectEOL
source: Select End of Line Sequence
uk: Виберіть послідовність кінця рядка

source: Select Encoding
uk: Вибрати кодування

source: Select Indentation
uk: Виберіть відступ

source: Select Language Mode
uk: Вибрати мовний режим

# showLanguageExtensions
source: Search Marketplace Extensions for '{0}'...
uk: Шукати розширення ринку для '{0}'...

# singleSelectionRange
source: Ln {0}, Col {1} ({2} selected)
uk: Ln {0}, Col {1} ({2} вибрано)

# spacesAndTabsSize
source: Spaces: {0} (Tab Size: {1})
uk: Пробіли: {0} (Розмір табуляції: {1})

# spacesSize
source: Spaces: {0}
uk: Відступи: {0}

# status.editor.columnSelectionMode
source: Column Selection Mode
uk: Режим вибору стовпців

# status.editor.enableInsertMode
source: Enable Insert Mode
uk: Увімкнути режим вставки

# status.editor.encoding
source: Editor Encoding
uk: Кодування редактора

# status.editor.eol
source: Editor End of Line
uk: Редактор Кінець рядка

# status.editor.indentation
source: Editor Indentation
uk: Відступ редактора

# status.editor.info
source: File Information
uk: Інформація про файл

# status.editor.mode
source: Editor Language
uk: Мова редактора

# status.editor.selection
source: Editor Selection
uk: Вибір редактора

# status.editor.tabFocusMode
source: Accessibility Mode
uk: Режим доступності

# tabFocusModeEnabled
source: Tab Moves Focus
uk: Переміщення фокусу за допомогою Tab

# tabSize
source: Tab Size: {0}
uk: Розмір табуляції: {0}

# ariaLabelEditorActions
source: Editor actions
uk: Дії редактора

# ariaLabelTabActions
source: Tab actions
uk: Дії вкладки

# fileTooLargeForHeapErrorWithSize
source: At least one file is not displayed in the text compare editor because it is very large ({0}).
uk: Принаймні один файл не відображається в редакторі порівняння тексту, оскільки він дуже великий ({0}).

# fileTooLargeForHeapErrorWithoutSize
source: At least one file is not displayed in the text compare editor because it is very large.
uk: Принаймні один файл не відображається в редакторі порівняння тексту, оскільки він дуже великий.

source: Editor
uk: Редактор

source: Accounts
uk: Облікові записи

# accountsViewBarIcon
source: Accounts icon in the view bar.
uk: Іконка облікових записів у панелі перегляду.

# authProviderUnavailable
source: {0} is currently unavailable
uk: {0} наразі недоступний

source: Hide Accounts
uk: Сховати облікові записи

source: Loading...
uk: Завантаження...

source: Manage
uk: Керувати

# manage profile
source: Manage {0} (Profile)
uk: Керувати {0} (Профіль)

# manageDynamicAuthProviders
source: Manage Dynamic Authentication Providers...
uk: Керувати Динамічними Провайдерами Аутентифікації...

source: Manage Trusted Extensions
uk: Керувати надійними розширеннями

source: Manage Trusted MCP Servers
uk: Керувати надійними серверами MCP

source: Sign Out
uk: Вийти

source: Clear Notification
uk: Очистити сповіщення

# notification.accessibleViewSrc
source: {0} Source: {1}
uk: {0} Джерело: {1}

# clearAllIcon
source: Icon for the clear all action in notifications.
uk: Іконка для дії очищення всіх сповіщень.

# clearIcon
source: Icon for the clear action in notifications.
uk: Іконка для дії очищення в сповіщеннях.

# clearNotifications
source: Clear All Notifications
uk: Очистити всі сповіщення

# collapseIcon
source: Icon for the collapse action in notifications.
uk: Іконка для дії згортання в сповіщеннях.

source: Collapse Notification
uk: Сповіщення про згортання

# configureDoNotDisturbMode
source: Configure Do Not Disturb...
uk: Налаштувати режим Не турбувати...

# configureIcon
source: Icon for the configure action in notifications.
uk: Іконка для дії налаштування в сповіщеннях.

# configureNotification
source: More Actions...
uk: Більше дій...

# copyNotification
source: Copy Text
uk: Копіювати текст

# doNotDisturbIcon
source: Icon for the mute all action in notifications.
uk: Іконка для дії вимкнення всіх сповіщень.

# expandIcon
source: Icon for the expand action in notifications.
uk: Іконка для дії розгортання в сповіщеннях.

source: Expand Notification
uk: Розгорнути сповіщення

# hideIcon
source: Icon for the hide action in notifications.
uk: Іконка для дії приховування в сповіщеннях.

# hideNotificationsCenter
source: Hide Notifications
uk: Сховати сповіщення

source: Toggle Do Not Disturb Mode
uk: Перемкнути режим Не турбувати

source: Toggle Do Not Disturb Mode By Source...
uk: Перемикати режим 'Не турбувати' за джерелом...

# alertErrorMessage
source: Error: {0}
uk: Помилка: {0}

# alertInfoMessage
source: Info: {0}
uk: Інформація: {0}

# alertWarningMessage
source: Warning: {0}
uk: Попередження: {0}

# moreSources
source: More…
uk: Більше…

source: Notifications
uk: Сповіщення

# notificationsCenterWidgetAriaLabel
source: Notifications Center
uk: Центр сповіщень

# notificationsEmpty
source: No new notifications
uk: Немає нових сповіщень

# notificationsToolbar
source: Notification Center Actions
uk: Дії Центру сповіщень

# turnOffNotifications
source: Disable Do Not Disturb Mode
uk: Вимкнути режим Не турбувати

# turnOnNotifications
source: Enable Do Not Disturb Mode
uk: Увімкнути режим Не турбувати

source: Accept Notification Primary Action
uk: Прийняти основну дію сповіщення

source: Clear All Notifications
uk: Очистити всі сповіщення

# focusNotificationToasts
source: Focus Notification Toast
uk: Сповіщення про фокус

source: Hide Notifications
uk: Сховати сповіщення

# selectSources
source: Select sources to enable all notifications from
uk: Виберіть джерела, щоб увімкнути всі сповіщення від

source: Show Notifications
uk: Показати сповіщення

# notificationAccessibleViewHint
source: Inspect the response in the accessible view with {0}
uk: Перегляньте відповідь в доступному вигляді з {0}

# notificationAccessibleViewHintNoKb
source: Inspect the response in the accessible view via the command Open Accessible View which is currently not triggerable via keybinding
uk: Перегляньте відповідь у доступному вигляді за допомогою команди Відкрити доступний вигляд, яка наразі не може бути активована за допомогою комбінації клавіш.

# notificationAriaLabel
source: {0}, notification
uk: {0}, сповіщення

# notificationAriaLabelHint
source: {0}, notification, {1}
uk: {0}, сповіщення, {1}

# notificationWithSourceAriaLabel
source: {0}, source: {1}, notification
uk: {0}, джерело: {1}, сповіщення

# notificationWithSourceAriaLabelHint
source: {0}, source: {1}, notification, {2}
uk: {0}, джерело: {1}, сповіщення, {2}

source: Notifications List
uk: Список сповіщень

# noNotifications
source: No New Notifications
uk: Немає нових сповіщень

# noNotificationsWithProgress
source: No New Notifications ({0} in progress)
uk: Немає нових сповіщень ({0} в процесі)

# notifications
source: {0} New Notifications
uk: Сповіщення

# notificationsWithProgress
source: {0} New Notifications ({1} in progress)
uk: {0} Нових сповіщень ({1} в процесі)

# oneNotification
source: 1 New Notification
uk: 1 Нове сповіщення

# oneNotificationWithProgress
source: 1 New Notification ({0} in progress)
uk: 1 Нове сповіщення ({0} в процесі)

# status.doNotDisturb
source: Do Not Disturb
uk: Не турбувати

# status.doNotDisturbTooltip
source: Do Not Disturb Mode is Enabled
uk: Режим Не турбувати увімкнено

source: Status Message
uk: Повідомлення статусу

# status.notifications
source: Notifications
uk: Сповіщення

# zeroNotifications
source: No Notifications
uk: Немає сповіщень

# executeCommand
source: Click to execute command '{0}'
uk: Натисніть, щоб виконати команду '{0}'

source: Notification Actions
uk: Дії сповіщення

# notificationSource
source: Source: {0}
uk: Джерело: {0}

# turnOffNotifications
source: Turn Off Info and Warning Notifications from '{0}'
uk: Вимкнути режим Не турбувати

# turnOnNotifications
source: Turn On All Notifications from '{0}'
uk: Увімкнути режим Не турбувати

# auxiliarybar
source: Secondary Side Bar
uk: Бічна панель вторинного рівня

# moveToMenu
source: Move To
uk: Перемістити до

source: Reset Location
uk: Скинути місцезнаходження

# sidebar
source: Primary Side Bar
uk: Бічна панель

source: More Actions...
uk: Більше дій...

# pane.emptyMessage
source: Drag a view here to display.
uk: Перетягніть вигляд сюди для відображення.

source: Align Panel
uk: Вирівняти панель

# alignPanelCenter
source: Set Panel Alignment to Center
uk: Встановити вирівнювання панелі по центру

# alignPanelCenterShort
source: Center
uk: Центр

# alignPanelJustify
source: Set Panel Alignment to Justify
uk: Встановити вирівнювання панелі на виправлення

# alignPanelJustifyShort
source: Justify
uk: Вирівняти

# alignPanelLeft
source: Set Panel Alignment to Left
uk: Встановити вирівнювання панелі вліво

# alignPanelLeftShort
source: Left
uk: Зліва

# alignPanelRight
source: Set Panel Alignment to Right
uk: Встановити вирівнювання панелі праворуч

# alignPanelRightShort
source: Right
uk: Правильно

# closeIcon
source: Icon to close a panel.
uk: Іконка для закриття вторинної бокової панелі.

# closePanel
source: Hide Panel
uk: Сховати панель

# focusPanel
source: Focus into Panel
uk: Фокус на панель

# maximizeIcon
source: Icon to maximize a panel.
uk: Іконка для розгортання вторинної бокової панелі.

# maximizePanel
source: Maximize Panel Size
uk: Максимізувати розмір панелі

# miTogglePanelMnemonic
source: &&Panel
uk: &&Панель

# minimizePanel
source: Restore Panel Size
uk: Відновити розмір панелі

# movePanelToSecondarySideBar
source: Move Panel Views To Secondary Side Bar
uk: Перемістити панелі перегляду на вторинну бічну панель

# moveSidePanelToPanel
source: Move Secondary Side Bar Views To Panel
uk: Перемістити вигляди вторинної бічної панелі до панелі

source: Next Panel View
uk: Наступний перегляд панелі

# openAndClosePanel
source: Open/Show and Close/Hide Panel
uk: Відкрити/Показати та Закрити/Сховати Панель

# panelMaxNotSupported
source: Maximizing the panel is only supported when it is center aligned.
uk: Максимізація панелі підтримується лише тоді, коли вона вирівняна по центру.

# positionPanel
source: Panel Position
uk: Позиція панелі

# positionPanelBottom
source: Move Panel To Bottom
uk: Перемістити панель вниз

# positionPanelBottomShort
source: Bottom
uk: Низ

# positionPanelLeft
source: Move Panel Left
uk: Перемістити панель вліво

# positionPanelLeftShort
source: Left
uk: Лівий

# positionPanelRight
source: Move Panel Right
uk: Перемістити панель вправо

# positionPanelRightShort
source: Right
uk: Правильно

# positionPanelTop
source: Move Panel To Top
uk: Перемістити панель угору

# positionPanelTopShort
source: Top
uk: Верх

source: Previous Panel View
uk: Попередній вигляд панелі

source: Toggle Maximized Panel
uk: Переключити максимізовану панель

source: Toggle Panel
uk: Перемикання панелі

# togglePanelOffIcon
source: Icon to toggle the panel off when it is on.
uk: Іконка для вимкнення панелі, коли вона увімкнена.

# togglePanelOnIcon
source: Icon to toggle the panel on when it is off.
uk: Іконка для увімкнення панелі, коли вона вимкнена.

source: Toggle Panel Visibility
uk: Переключити видимість панелі

source: Align Panel
uk: Вирівняти панель

source: Hide Panel
uk: Сховати панель

source: Panel Position
uk: Позиція панелі

# closeSidebar
source: Close Primary Side Bar
uk: Закрити бічну панель первинного боку

# focusSideBar
source: Focus into Primary Side Bar
uk: Фокус на основну бічну панель

# toggleActivityBar
source: Toggle Activity Bar Visibility
uk: Перемикання видимості панелі активності

source: Focus Status Bar
uk: Панель стану фокусу

source: Hide Status Bar
uk: Сховати панель стану

# label.dfl
source: Search
uk: Пошук

# title
source: Search {0} ({1}) — {2}
uk: Навігація за хлібними крихтами

# title2
source: Search {0} — {1}
uk: Пошук {0} — {1}

# title3
source: Command Center
uk: Центр управління

source: Downloading Update...
uk: Завантаження оновлення...

source: Check for &&Updates...
uk: Перевірити наявність &&оновлень...

source: Checking for Updates...
uk: Перевірка оновлень...

# download now
source: D&&ownload Update
uk: З&&авантажити оновлення

# focusMenu
source: Focus Application Menu
uk: Меню застосунку Фокус

# goToSetting
source: Open Settings
uk: Відкрити Налаштування

source: Install &&Update...
uk: Встановити &&оновлення...

source: Installing Update...
uk: Встановлення оновлення...

# mEdit
source: &&Edit
uk: &&Редагувати

# mFile
source: &&File
uk: &&Файл

# mGoto
source: &&Go
uk: &&Перейти

# mHelp
source: &&Help
uk: &&Допомога

# mPreferences
source: Preferences
uk: Налаштування

# mSelection
source: &&Selection
uk: &&Вибір

# mTerminal
source: &&Terminal
uk: &&Термінал

# mView
source: &&View
uk: &&Перегляд

# menubar.customTitlebarAccessibilityNotification
source: Accessibility support is enabled for you. For the most accessible experience, we recommend the custom menu style.
uk: Підтримка доступності увімкнена для вас. Для найзручнішого досвіду ми рекомендуємо користувальницький стиль меню.

source: Restart to &&Update
uk: Перезапустити для &&оновлення

source: Hide Custom Title Bar
uk: Сховати користувацьку заголовну панель

source: Hide Custom Title Bar In Full Screen
uk: Сховати користувацьку заголовну панель у повноекранному режимі

source: Show Custom Title Bar
uk: Показати користувацьку панель заголовка
