Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_remote.xlf
Languages: uk

# connectionError
source: An unexpected error occurred that requires a reload of this page.
uk: Сталася несподівана помилка, яка вимагає перезавантаження цієї сторінки.

# connectionErrorDetail
source: The workbench failed to connect to the server (Error: {0})
uk: Стіл для роботи не зміг підключитися до сервера (Помилка: {0})

source: &&Reload
uk: &&Перезавантажити

# RemoteHelpInformationExtPoint
source: Contributes help information for Remote
uk: Сприяє інформації про допомогу для Remote

# RemoteHelpInformationExtPoint.documentation
source: The url, or a command that returns the url, to your project's documentation page
uk: URL або команда, яка повертає URL, до сторінки документації вашого проєкту

# RemoteHelpInformationExtPoint.feedback
source: The url, or a command that returns the url, to your project's feedback reporter
uk: URL або команда, яка повертає URL, до репортера зворотного зв'язку вашого проєкту

# RemoteHelpInformationExtPoint.feedback.deprecated
source: Use {0} instead
uk: Використовуйте {0} замість цього

# RemoteHelpInformationExtPoint.getStarted
source: The url, or a command that returns the url, to your project's Getting Started page, or a walkthrough ID contributed by your project's extension
uk: URL, або команда, яка повертає URL, до сторінки "Початок роботи" вашого проєкту, або ID посібника, наданий розширенням вашого проєкту.

# RemoteHelpInformationExtPoint.issues
source: The url, or a command that returns the url, to your project's issues list
uk: URL або команда, яка повертає URL, до списку проблем вашого проєкту

# RemoteHelpInformationExtPoint.reportIssue
source: The url, or a command that returns the url, to your project's issue reporter
uk: URL, або команда, яка повертає URL, до репортера проблем вашого проєкту

# getStartedWalkthrough.id
source: The ID of a Get Started walkthrough to open.
uk: ID посібника "Почати роботу", який потрібно відкрити.

# remote.localPortMismatch.single
source: Local port {0} could not be used for forwarding to remote port {1}. This usually happens when there is already another process using local port {0}. Port number {2} has been used instead.
uk: Локальний порт {0} не може бути використаний для пересилання на віддалений порт {1}. Це зазвичай трапляється, коли вже є інший процес, що використовує локальний порт {0}. Замість цього був використаний порт номер {2}.

# tunnel.forwardedPortsViewEnabled
source: Whether the Ports view is enabled.
uk: Чи увімкнено вигляд Портів.

# tunnel.source.auto
source: Auto Forwarded
uk: Авто переслано

# tunnel.source.user
source: User Forwarded
uk: Користувач переслав

# tunnel.staticallyForwarded
source: Statically Forwarded
uk: Статично переслано

# connectionError
source: Failed to connect to the remote extension host server (Error: {0})
uk: Сталася несподівана помилка, яка вимагає перезавантаження цієї сторінки.

# devTools
source: Open Developer Tools
uk: Відкрити інструменти розробника

# directUrl
source: Open in browser
uk: Відкрити в браузері
