Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_codeEditor.xlf
Languages: uk

# toggleScreenReaderMode
source: Toggle Screen Reader Accessibility Mode
uk: Перемикання режиму доступності для екранного читача

# toggleScreenReaderModeDescription
source: Toggles an optimized mode for usage with screen readers, braille devices, and other assistive technologies.
uk: Перемикає оптимізований режим для використання з екранними читачами, брайлівськими пристроями та іншими допоміжними технологіями.

# startDictation
source: Start Dictation in Editor
uk: Почати диктування в редакторі

# stopDictation
source: Stop Dictation in Editor
uk: Зупинити диктування в редакторі

# stopDictationShort1
source: Stop Dictation ({0})
uk: Зупинити диктування ({0})

# stopDictationShort2
source: Stop Dictation
uk: Зупинити диктування

# voiceCategory
source: Voice
uk: Голос

# msg1
source: You are in a diff editor.
uk: Ви в редакторі відмінностей.

# msg2
source: View the next{0} or previous{1} diff in diff review mode, which is optimized for screen readers.
uk: Перегляньте наступний{0} або попередній{1} диф у режимі перегляду дифів, який оптимізовано для програм читання з екрану.

# msg3
source: Run the command Diff Editor: Switch Side{0} to toggle between the original and modified editors.
uk: Виконайте команду Diff Editor: Switch Side{0}, щоб перемикатися між оригінальним і зміненим редакторами.

# msg4
source: To control which accessibility signals should be played, the following settings can be configured: {0}.
uk: Щоб контролювати, які сигнали доступності повинні відтворюватися, можна налаштувати такі параметри: {0}.

# msg5
source: The setting, accessibility.verbosity.diffEditorActive, controls if a diff editor announcement is made when it becomes the active editor.
uk: Налаштування, accessibility.verbosity.diffEditorActive, контролює, чи робиться оголошення про редактор порівняння, коли він стає активним редактором.

# hintTimeout
source: The diff algorithm was stopped early (after {0} ms.)
uk: Алгоритм порівняння був зупинений раніше (після {0} мс.)

# hintWhitespace
source: Show Whitespace Differences
uk: Показати різниці у пробілах

# removeTimeout
source: Remove Limit
uk: Видалити обмеження

# defaultHintAriaLabelWithInlineChat
source: Execute {0} to ask a question, execute {1} to select a language and get started. Start typing to dismiss.
uk: Виконайте {0}, щоб задати питання, виконайте {1}, щоб вибрати мову та почати. Почніть вводити, щоб закрити.

# defaultHintAriaLabelWithoutInlineChat
source: Execute {0} to select a language and get started. Start typing to dismiss.
uk: Виконайте {0}, щоб вибрати мову та розпочати. Почніть вводити, щоб закрити.

# disableEditorEmptyHint
source: Disable Empty Editor Hint
uk: Вимкнути підказку порожнього редактора

# disableHint
source: Toggle {0} in settings to disable this hint.
uk: Увімкніть {0} у налаштуваннях, щоб вимкнути це підказку.

# emptyTextEditorHintWithInlineChat
source: [[Generate code]] ({0}), or [[select a language]] ({1}). Start typing to dismiss or [[don't show]] this again.
uk: [[Згенерувати код]] ({0}), або [[вибрати мову]] ({1}). Почніть вводити, щоб закрити, або [[не показувати]] це знову.

# emptyTextEditorHintWithoutInlineChat
source: [[Select a language]] ({0}) to get started. Start typing to dismiss or [[don't show]] this again.
uk: [[Виберіть мову]] ({0}), щоб почати. Почніть вводити, щоб закрити або [[не показувати]] це знову.

# ariaSearchNoInput
source: Enter search input
uk: Введіть пошуковий запит

# ariaSearchNoResult
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# ariaSearchNoResultEmpty
source: {0} found
uk: {0} знайдено

# ariaSearchNoResultWithLineNumNoCurrentMatch
source: {0} found for '{1}'
uk: {0} знайдено для '{1}'

# label.closeButton
source: Close
uk: Закрити

# label.find
source: Find
uk: Знайти

# label.nextMatchButton
source: Next Match
uk: Наступний матч

# label.previousMatchButton
source: Previous Match
uk: Попередній матч

# placeholder.find
source: Find
uk: Знайти

# simpleFindWidget.sashBorder
source: Border color of the sash border.
uk: Колір межі поясу.

# inspectEditorTokens
source: Developer: Inspect Editor Tokens and Scopes
uk: Розробник: Інспектувати токени та області редактора

# inspectTMScopesWidget.loading
source: Loading...
uk: Завантаження...

# workbench.action.inspectKeyMap
source: Inspect Key Mappings
uk: Перевірити ключові відображення

# workbench.action.inspectKeyMapJSON
source: Inspect Key Mappings (JSON)
uk: Перевірити ключові відображення (JSON)

# largeFile
source: {0}: tokenization, wrapping, folding, codelens, word highlighting and sticky scroll have been turned off for this large file in order to reduce memory usage and avoid freezing or crashing.
uk: {0}: токенізація, обгортання, складання, codelens, підсвічування слів та закріплений скролінг були вимкнені для цього великого файлу, щоб зменшити використання пам'яті та уникнути зависання або аварійного завершення роботи.

# removeOptimizations
source: Forcefully Enable Features
uk: Примусово увімкнути функції

# reopenFilePrompt
source: Please reopen file in order for this setting to take effect.
uk: Будь ласка, знову відкрийте файл, щоб ці налаштування набрали чинності.

# document
source: Document Symbols
uk: Символи документа

# 1.problem
source: 1 problem in this element
uk: 1 проблема в цьому елементі

# N.problem
source: {0} problems in this element
uk: {0} проблем у цьому елементі

# deep.problem
source: Contains elements with problems
uk: Містить елементи з проблемами

# gotoLine
source: Go to Line/Column...
uk: Перейти до рядка/стовпця...

# gotoLineQuickAccess
source: Go to Line/Column
uk: Перейти до рядка/стовпця

# gotoLineQuickAccessPlaceholder
source: Type the line number and optional column to go to (e.g. 42:5 for line 42 and column 5).
uk: Введіть номер рядка та необов'язкову колонку, щоб перейти до (наприклад, 42:5 для рядка 42 та колонки 5).

# empty
source: No matching entries
uk: Не знайдено відповідних записів

# gotoSymbol
source: Go to Symbol in Editor...
uk: Перейти до символу в редакторі...

# gotoSymbolByCategoryQuickAccess
source: Go to Symbol in Editor by Category
uk: Перейти до символу в редакторі за категорією

# gotoSymbolQuickAccess
source: Go to Symbol in Editor
uk: Перейти до символу в редакторі

# gotoSymbolQuickAccessPlaceholder
source: Type the name of a symbol to go to.
uk: Введіть назву символу, щоб перейти до нього.

# miGotoSymbolInEditor
source: Go to &&Symbol in Editor...
uk: Перейти до &&символу в редакторі...

# codeAction.apply
source: Applying code action '{0}'.
uk: Застосування дії коду '{0}'.

# codeaction
source: Quick Fixes
uk: Швидкі виправлення

# codeaction.get2
source: Getting code actions from {0} ([configure]({1})).
uk: Отримання дій коду з {0} ([налаштувати]({1})).

# formatting2
source: Running '{0}' Formatter ([configure]({1})).
uk: Виконання '{0}' Форматувача ([configure]({1})).

# miColumnSelection
source: Column &&Selection Mode
uk: Стовпець &&режим вибору

# toggleColumnSelection
source: Toggle Column Selection Mode
uk: Перемикання режиму вибору стовпців

# miMinimap
source: &&Minimap
uk: &&Мінікарта

source: Toggle Minimap
uk: Перемикання міні-карти

# miMultiCursorAlt
source: Switch to Alt+Click for Multi-Cursor
uk: Переключитися на Alt+Click для багатокурсора

# miMultiCursorCmd
source: Switch to Cmd+Click for Multi-Cursor
uk: Переключитися на Cmd+Click для багатокурсора

# miMultiCursorCtrl
source: Switch to Ctrl+Click for Multi-Cursor
uk: Переключитися на Ctrl+Click для багатокурсора

# toggleLocation
source: Toggle Multi-Cursor Modifier
uk: Перемикання модифікатора багатокурсора

# mitoggleOvertypeInsertMode
source: &&Toggle Overtype/Insert Mode
uk: &&Перемикання режиму надпису/вставки

source: Toggle Overtype/Insert Mode
uk: Перемикання режиму надписування/вставки

# toggleOvertypeMode.description
source: Toggle between overtype and insert mode
uk: Перемикатися між режимом перезапису та режимом вставки

# miToggleRenderControlCharacters
source: Render &&Control Characters
uk: Відобразити &&керуючі символи

# toggleRenderControlCharacters
source: Toggle Control Characters
uk: Перемикання контрольних символів

# miToggleRenderWhitespace
source: &&Render Whitespace
uk: &&Відобразити пробіли

source: Toggle Render Whitespace
uk: Перемикання відображення пробілів

# editorWordWrap
source: Whether the editor is currently using word wrapping.
uk: Чи використовує редактор в даний момент обгортання слів.

# miToggleWordWrap
source: &&Word Wrap
uk: &&Перенос слів

# toggle.wordwrap
source: View: Toggle Word Wrap
uk: Перегляд: Перемкнути обгортання слів

# unwrapMinified
source: Disable wrapping for this file
uk: Вимкнути обгортання для цього файлу

# wrapMinified
source: Enable wrapping for this file
uk: Увімкнути обгортання для цього файлу

# formatError
source: {0}: Invalid format, JSON object expected.
uk: {0}: Невірний формат, очікується об'єкт JSON.

# parseErrors
source: Errors parsing {0}: {1}
uk: Помилки при розборі {0}: {1}

# schema.autoCloseBefore
source: Defines what characters must be after the cursor in order for bracket or quote autoclosing to occur when using the 'languageDefined' autoclosing setting. This is typically the set of characters which can not start an expression.
uk: Визначає, які символи повинні бути після курсора, щоб відбулося автоматичне закриття дужок або лапок при використанні налаштування автоматичного закриття 'languageDefined'. Це зазвичай набір символів, які не можуть починати вираз.

# schema.autoClosingPairs
source: Defines the bracket pairs. When a opening bracket is entered, the closing bracket is inserted automatically.
uk: Визначає пари дужок. Коли вводиться відкрита дужка, закрита дужка вставляється автоматично.

# schema.autoClosingPairs.notIn
source: Defines a list of scopes where the auto pairs are disabled.
uk: Визначає список областей, де автоматичні пари вимкнені.

# schema.blockComment.begin
source: The character sequence that starts a block comment.
uk: Послідовність символів, яка починає блочний коментар.

# schema.blockComment.end
source: The character sequence that ends a block comment.
uk: Послідовність символів, що завершує блочний коментар.

# schema.blockComments
source: Defines how block comments are marked.
uk: Визначає, як позначаються блочні коментарі.

# schema.brackets
source: Defines the bracket symbols that increase or decrease the indentation. When bracket pair colorization is enabled and {0} is not defined, this also defines the bracket pairs that are colorized by their nesting level.
uk: Визначає символи дужок, які збільшують або зменшують відступ. Коли кольоризація пар дужок увімкнена і {0} не визначено, це також визначає пари дужок, які кольоризуються за їх рівнем вкладеності.

# schema.closeBracket
source: The closing bracket character or string sequence.
uk: Закриваючий символ дужки або рядкова послідовність.

# schema.colorizedBracketPairs
source: Defines the bracket pairs that are colorized by their nesting level if bracket pair colorization is enabled. Any brackets included here that are not included in {0} will be automatically included in {0}.
uk: Визначає пари дужок, які кольорові за їх рівнем вкладеності, якщо кольоризація пар дужок увімкнена. Будь-які дужки, включені сюди, які не включені в {0}, будуть автоматично включені в {0}.

# schema.comments
source: Defines the comment symbols
uk: Визначає символи коментарів

# schema.folding
source: The language's folding settings.
uk: Налаштування складання мови.

# schema.folding.markers
source: Language specific folding markers such as '#region' and '#endregion'. The start and end regexes will be tested against the contents of all lines and must be designed efficiently
uk: Специфічні для мови маркери згортання, такі як '#region' та '#endregion'. Регулярні вирази для початку та кінця будуть перевірятися на вміст усіх рядків і повинні бути спроектовані ефективно.

# schema.folding.markers.end
source: The RegExp pattern for the end marker. The regexp must start with '^'.
uk: Шаблон RegExp для маркера кінця. Regexp повинен починатися з '^'.

# schema.folding.markers.start
source: The RegExp pattern for the start marker. The regexp must start with '^'.
uk: Шаблон RegExp для маркера початку. Regexp повинен починатися з '^'.

# schema.folding.offSide
source: A language adheres to the off-side rule if blocks in that language are expressed by their indentation. If set, empty lines belong to the subsequent block.
uk: Мова дотримується правила офсайду, якщо блоки в цій мові виражені їх відступом. Якщо встановлено, порожні рядки належать до наступного блоку.

# schema.indentationRules
source: The language's indentation settings.
uk: Налаштування відступів мови.

# schema.indentationRules.decreaseIndentPattern
source: If a line matches this pattern, then all the lines after it should be unindented once (until another rule matches).
uk: Якщо рядок відповідає цьому шаблону, тоді всі рядки після нього повинні бути зменшені на один відступ (поки не спрацює інше правило).

# schema.indentationRules.decreaseIndentPattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.decreaseIndentPattern.flags
source: The RegExp flags for decreaseIndentPattern.
uk: Флаги RegExp для decreaseIndentPattern.

# schema.indentationRules.decreaseIndentPattern.pattern
source: The RegExp pattern for decreaseIndentPattern.
uk: Шаблон RegExp для decreaseIndentPattern.

# schema.indentationRules.increaseIndentPattern
source: If a line matches this pattern, then all the lines after it should be indented once (until another rule matches).
uk: Якщо рядок відповідає цьому шаблону, то всі наступні рядки повинні бути відступлені один раз (поки не спрацює інше правило).

# schema.indentationRules.increaseIndentPattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.increaseIndentPattern.flags
source: The RegExp flags for increaseIndentPattern.
uk: Флаги RegExp для increaseIndentPattern.

# schema.indentationRules.increaseIndentPattern.pattern
source: The RegExp pattern for increaseIndentPattern.
uk: Шаблон RegExp для increaseIndentPattern.

# schema.indentationRules.indentNextLinePattern
source: If a line matches this pattern, then **only the next line** after it should be indented once.
uk: Якщо рядок відповідає цьому шаблону, тоді **тільки наступний рядок** після нього повинен бути відступлений один раз.

# schema.indentationRules.indentNextLinePattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.indentNextLinePattern.flags
source: The RegExp flags for indentNextLinePattern.
uk: Флаги RegExp для indentNextLinePattern.

# schema.indentationRules.indentNextLinePattern.pattern
source: The RegExp pattern for indentNextLinePattern.
uk: Шаблон RegExp для indentNextLinePattern.

# schema.indentationRules.unIndentedLinePattern
source: If a line matches this pattern, then its indentation should not be changed and it should not be evaluated against the other rules.
uk: Якщо рядок відповідає цьому шаблону, то його відступ не повинен змінюватися, і його не слід оцінювати за іншими правилами.

# schema.indentationRules.unIndentedLinePattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.unIndentedLinePattern.flags
source: The RegExp flags for unIndentedLinePattern.
uk: Флаги RegExp для unIndentedLinePattern.

# schema.indentationRules.unIndentedLinePattern.pattern
source: The RegExp pattern for unIndentedLinePattern.
uk: Шаблон RegExp для unIndentedLinePattern.

# schema.lineComment.comment
source: The character sequence that starts a line comment.
uk: Послідовність символів, яка починає коментар рядка.

# schema.lineComment.noIndent
source: Whether the comment token should not be indented and placed at the first column. Defaults to false.
uk: Чи повинен токен коментаря бути без відступу і розміщений у першій колонці. За замовчуванням - false.

# schema.lineComment.object
source: Configuration for line comments.
uk: Конфігурація для рядкових коментарів.

# schema.onEnterRules
source: The language's rules to be evaluated when pressing Enter.
uk: Правила мови, які потрібно оцінити при натисканні Enter.

# schema.onEnterRules.action
source: The action to execute.
uk: Дія для виконання.

# schema.onEnterRules.action.appendText
source: Describes text to be appended after the new line and after the indentation.
uk: Описує текст, який буде додано після нового рядка та після відступу.

# schema.onEnterRules.action.indent
source: Describe what to do with the indentation
uk: Опишіть, що робити з відступом

# schema.onEnterRules.action.indent.indent
source: Insert new line and indent once (relative to the previous line's indentation).
uk: Вставте новий рядок і відступіть один раз (відносно відступу попереднього рядка).

# schema.onEnterRules.action.indent.indentOutdent
source: Insert two new lines: - the first one indented which will hold the cursor - the second one at the same indentation level
uk: Вставте два нові рядки: - перший з відступом, в якому буде розташований курсор - другий на тому ж рівні відступу

# schema.onEnterRules.action.indent.none
source: Insert new line and copy the previous line's indentation.
uk: Вставте новий рядок і скопіюйте відступ попереднього рядка.

# schema.onEnterRules.action.indent.outdent
source: Insert new line and outdent once (relative to the previous line's indentation).
uk: Вставити новий рядок і зменшити відступ один раз (відносно відступу попереднього рядка).

# schema.onEnterRules.action.removeText
source: Describes the number of characters to remove from the new line's indentation.
uk: Описує кількість символів, які потрібно видалити з відступу нового рядка.

# schema.onEnterRules.afterText
source: This rule will only execute if the text after the cursor matches this regular expression.
uk: Це правило буде виконуватись лише в тому випадку, якщо текст після курсора відповідає цьому регулярному виразу.

# schema.onEnterRules.afterText.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.onEnterRules.afterText.flags
source: The RegExp flags for afterText.
uk: Прапори RegExp для afterText.

# schema.onEnterRules.afterText.pattern
source: The RegExp pattern for afterText.
uk: Шаблон RegExp для afterText.

# schema.onEnterRules.beforeText
source: This rule will only execute if the text before the cursor matches this regular expression.
uk: Це правило буде виконано лише в тому випадку, якщо текст перед курсором відповідає цьому регулярному виразу.

# schema.onEnterRules.beforeText.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.onEnterRules.beforeText.flags
source: The RegExp flags for beforeText.
uk: Прапори RegExp для beforeText.

# schema.onEnterRules.beforeText.pattern
source: The RegExp pattern for beforeText.
uk: Шаблон RegExp для beforeText.

# schema.onEnterRules.previousLineText
source: This rule will only execute if the text above the line matches this regular expression.
uk: Це правило буде виконуватись лише в тому випадку, якщо текст над рядком відповідає цьому регулярному виразу.

# schema.onEnterRules.previousLineText.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.onEnterRules.previousLineText.flags
source: The RegExp flags for previousLineText.
uk: Прапори RegExp для попереднього рядка тексту.

# schema.onEnterRules.previousLineText.pattern
source: The RegExp pattern for previousLineText.
uk: Шаблон RegExp для previousLineText.

# schema.openBracket
source: The opening bracket character or string sequence.
uk: Символ відкриваючої дужки або рядкова послідовність.

# schema.surroundingPairs
source: Defines the bracket pairs that can be used to surround a selected string.
uk: Визначає пари дужок, які можна використовувати для оточення вибраного рядка.

# schema.wordPattern
source: Defines what is considered to be a word in the programming language.
uk: Визначає, що вважається словом у мові програмування.

# schema.wordPattern.flags
source: The RegExp flags used to match words.
uk: Флаги RegExp, що використовуються для збігу слів.

# schema.wordPattern.flags.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Повинен відповідати шаблону `/^([gimuy]+)$/`.

# schema.wordPattern.pattern
source: The RegExp pattern used to match words.
uk: Шаблон RegExp, що використовується для збігу слів.

# actions.pasteSelectionClipboard
source: Paste Selection Clipboard
uk: Вставити вибране з буфера обміну

# startDebugTextMate
source: Start TextMate Syntax Grammar Logging
uk: Почати ведення журналу синтаксичної граматики TextMate
