Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminal.xlf
Languages: uk

# terminal.findMatchBackground
source: Color of the current search match in the terminal. The color must not be opaque so as not to hide underlying terminal content.
uk: Колір поточного збігу пошуку в терміналі. Колір не повинен бути непрозорим, щоб не приховувати підлеглий вміст терміналу.

# terminal.findMatchBorder
source: Border color of the current search match in the terminal.
uk: Колір рамки поточного збігу пошуку в терміналі.

# terminal.findMatchHighlightBackground
source: Color of the other search matches in the terminal. The color must not be opaque so as not to hide underlying terminal content.
uk: Колір інших результатів пошуку в терміналі. Колір не повинен бути непрозорим, щоб не приховувати вміст терміналу, що знаходиться під ним.

# terminal.findMatchHighlightBorder
source: Border color of the other search matches in the terminal.
uk: Колір рамки інших збігів пошуку в терміналі.

# terminal.foreground
source: The foreground color of the terminal.
uk: Колір переднього плану терміналу.

# terminal.inactiveSelectionBackground
source: The selection background color of the terminal when it does not have focus.
uk: Колір фону вибору терміналу, коли він не має фокусу.

# terminal.selectionBackground
source: The selection background color of the terminal.
uk: Фоновий колір вибору терміналу.

# terminal.selectionForeground
source: The selection foreground color of the terminal. When this is null the selection foreground will be retained and have the minimum contrast ratio feature applied.
uk: Вибраний колір тексту терміналу. Коли це null, колір тексту вибору буде збережено і до нього буде застосовано функцію мінімального контрасту.

# terminal.tab.activeBorder
source: Border on the side of the terminal tab in the panel. This defaults to tab.activeBorder.
uk: Межа з боку вкладки терміналу в панелі. За замовчуванням це tab.activeBorder.

# terminalCommandDecoration.defaultBackground
source: The default terminal command decoration background color.
uk: Колір фону оформлення команди терміналу за замовчуванням.

# terminalCommandDecoration.errorBackground
source: The terminal command decoration background color for error commands.
uk: Фоновий колір оформлення терміналу для команд помилки.

# terminalCommandDecoration.successBackground
source: The terminal command decoration background color for successful commands.
uk: Фоновий колір оформлення термінальної команди для успішних команд.

# terminalCursor.background
source: The background color of the terminal cursor. Allows customizing the color of a character overlapped by a block cursor.
uk: Колір фону курсора терміналу. Дозволяє налаштовувати колір символу, який перекривається блочним курсором.

# terminalCursor.foreground
source: The foreground color of the terminal cursor.
uk: Колір переднього плану курсора терміналу.

# terminalInitialHintForeground
source: Foreground color of the terminal initial hint.
uk: Колір переднього плану початкової підказки терміналу.

# terminalOverviewRuler.border
source: The overview ruler left-side border color.
uk: Колір лівої межі панелі огляду.

# terminalOverviewRuler.cursorForeground
source: The overview ruler cursor color.
uk: Колір курсора лінійки огляду.

# terminalOverviewRuler.findMatchHighlightForeground
source: Overview ruler marker color for find matches in the terminal.
uk: Огляд кольору маркера лінійки для пошуку збігів у терміналі.

# cwd
source: the terminal's current working directory.
uk: поточний робочий каталог термінала.

# cwdFolder
source: the terminal's current working directory, displayed for multi-root workspaces or in a single root workspace when the value differs from the initial working directory. On Windows, this will only be displayed when shell integration is enabled.
uk: поточний робочий каталог терміналу, відображений для багатокореневих робочих просторів або в одному кореневому робочому просторі, коли значення відрізняється від початкового робочого каталогу. У Windows це буде відображено лише тоді, коли інтеграція оболонки увімкнена.

# enableFileLinks.notRemote
source: Enable only when not in a remote workspace.
uk: Увімкнути лише коли не в віддаленому робочому просторі.

# enableFileLinks.off
source: Always off.
uk: Завжди вимкнено.

# enableFileLinks.on
source: Always on.
uk: Завжди увімкнено.

# hideOnStartup.always
source: Always hide the terminal, even when there are persistent sessions restored.
uk: Завжди приховуйте термінал, навіть коли відновлені постійні сесії.

# hideOnStartup.never
source: Never hide the terminal view on startup.
uk: Ніколи не ховати вигляд терміналу при запуску.

# hideOnStartup.whenEmpty
source: Only hide the terminal when there are no persistent sessions restored.
uk: Сховати термінал лише тоді, коли немає відновлених постійних сеансів.

# local
source: indicates a local terminal in a remote workspace.
uk: вказує на локальний термінал у віддаленому робочому просторі.

# openDefaultSettingsJson
source: open the default settings JSON
uk: відкрити JSON файлу налаштувань за замовчуванням

# openDefaultSettingsJson.capitalized
source: Open Default Settings (JSON)
uk: Відкрити стандартні налаштування (JSON)

# process
source: the name of the terminal process.
uk: назва термінального процесу.

# progress
source: the progress state as reported by the `OSC 9;4` sequence.
uk: стан прогресу, як повідомляється послідовністю `OSC 9;4`.

# separator
source: a conditional separator {0} that only shows when it's surrounded by variables with values or static text.
uk: умовний роздільник {0}, який відображається лише тоді, коли його оточують змінні з значеннями або статичний текст.

# sequence
source: the name provided to the terminal by the process.
uk: ім'я, надане терміналу процесом.

# shellCommand
source: the command being executed according to shell integration. This also requires high confidence in the detected command line, which may not work in some prompt frameworks.
uk: команда, що виконується відповідно до інтеграції оболонки. Це також вимагає високої впевненості в виявленій командній стрічці, що може не працювати в деяких фреймворках підказок.

# shellPromptInput
source: the shell's full prompt input according to shell integration.
uk: повний запит вводу оболонки відповідно до інтеграції оболонки.

# shellType
source: the detected shell type.
uk: виявлений тип оболонки.

# task
source: indicates this terminal is associated with a task.
uk: вказує, що цей термінал пов'язаний із завданням.

# terminal.integrated.allowChords
source: Whether or not to allow chord keybindings in the terminal. Note that when this is true and the keystroke results in a chord it will bypass {0}, setting this to false is particularly useful when you want ctrl+k to go to your shell (not VS Code).
uk: Чи дозволяти прив'язки клавіш акордів у терміналі. Зверніть увагу, що коли це істинно і натискання клавіші призводить до акорду, воно обійде {0}, встановлення цього значення на хибне особливо корисне, коли ви хочете, щоб ctrl+k переходив до вашої оболонки (а не до VS Code).

# terminal.integrated.allowMnemonics
source: Whether to allow menubar mnemonics (for example Alt+F) to trigger the open of the menubar. Note that this will cause all alt keystrokes to skip the shell when true. This does nothing on macOS.
uk: Чи дозволити мнемоніки меню (наприклад, Alt+F) для відкриття меню. Зверніть увагу, що це призведе до того, що всі комбінації клавіш Alt пропустять оболонку, якщо буде встановлено значення true. Це нічого не робить на macOS.

# terminal.integrated.allowedLinkSchemes
source: An array of strings containing the URI schemes that the terminal is allowed to open links for. By default, only a small subset of possible schemes are allowed for security reasons.
uk: Масив рядків, що містить URI-схеми, для яких термінал має право відкривати посилання. За замовчуванням, лише невеликий підмножина можливих схем дозволена з міркувань безпеки.

# terminal.integrated.altClickMovesCursor
source: If enabled, alt/option + click will reposition the prompt cursor to underneath the mouse when {0} is set to {1} (the default value). This may not work reliably depending on your shell.
uk: Якщо увімкнено, alt/option + клік перемістить курсор підказки під мишу, коли {0} встановлено на {1} (значення за замовчуванням). Це може працювати ненадійно в залежності від вашої оболонки.

# terminal.integrated.bellDuration
source: The number of milliseconds to show the bell within a terminal tab when triggered.
uk: Кількість мілісекунд для відображення дзвінка в межах вкладки терміналу, коли він спрацьовує.

# terminal.integrated.commandsToSkipShell
source: A set of command IDs whose keybindings will not be sent to the shell but instead always be handled by VS Code. This allows keybindings that would normally be consumed by the shell to act instead the same as when the terminal is not focused, for example `Ctrl+P` to launch Quick Open. &nbsp; Many commands are skipped by default. To override a default and pass that command's keybinding to the shell instead, add the command prefixed with the `-` character. For example add `-workbench.action.quickOpen` to allow `Ctrl+P` to reach the shell. &nbsp; The following list of default skipped commands is truncated when viewed in Settings Editor. To see the full list, {1} and search for the first command from the list below. &nbsp; Default Skipped Commands: {0}
uk: Набір ідентифікаторів команд, ключові комбінації яких не будуть надіслані до оболонки, а натомість завжди оброблятимуться VS Code. Це дозволяє ключовим комбінаціям, які зазвичай споживаються оболонкою, діяти так само, як коли термінал не сфокусований, наприклад, `Ctrl+P` для запуску Quick Open. &nbsp; Багато команд пропускаються за замовчуванням. Щоб переопределити значення за замовчуванням і передати ключову комбінацію цієї команди до оболонки, додайте команду з префіксом `-`. Наприклад, додайте `-workbench.action.quickOpen`, щоб дозволити `Ctrl+P` досягти оболонки. &nbsp; Наступний список команд, які пропускаються за замовчуванням, скорочується при перегляді в редакторі налаштувань. Щоб побачити повний список, {1} і знайдіть першу команду зі списку нижче. &nbsp; Команди, які пропускаються за замовчуванням: {0}

# terminal.integrated.confirmOnExit
source: Controls whether to confirm when the window closes if there are active terminal sessions. Background terminals like those launched by some extensions will not trigger the confirmation.
uk: Контролює, чи потрібно підтверджувати закриття вікна, якщо є активні термінальні сесії. Фонові термінали, такі як ті, що запускаються деякими розширеннями, не викликатимуть підтвердження.

# terminal.integrated.confirmOnExit.always
source: Always confirm if there are terminals.
uk: Завжди підтверджуйте, чи є термінали.

# terminal.integrated.confirmOnExit.hasChildProcesses
source: Confirm if there are any terminals that have child processes.
uk: Підтвердіть, чи є термінали, які мають дочірні процеси.

# terminal.integrated.confirmOnExit.never
source: Never confirm.
uk: Ніколи не підтверджуйте.

# terminal.integrated.confirmOnKill
source: Controls whether to confirm killing terminals when they have child processes. When set to editor, terminals in the editor area will be marked as changed when they have child processes. Note that child process detection may not work well for shells like Git Bash which don't run their processes as child processes of the shell. Background terminals like those launched by some extensions will not trigger the confirmation.
uk: Контролює, чи потрібно підтверджувати закриття терміналів, коли у них є дочірні процеси. Коли встановлено на editor, термінали в області редактора будуть позначені як змінені, коли у них є дочірні процеси. Зверніть увагу, що виявлення дочірніх процесів може не працювати добре для оболонок, таких як Git Bash, які не запускають свої процеси як дочірні процеси оболонки. Фонові термінали, такі як ті, що запускаються деякими розширеннями, не викликатимуть підтвердження.

# terminal.integrated.confirmOnKill.always
source: Confirm if the terminal is either in the editor or panel.
uk: Підтвердіть, чи термінал знаходиться в редакторі або панелі.

# terminal.integrated.confirmOnKill.editor
source: Confirm if the terminal is in the editor.
uk: Підтвердіть, чи термінал знаходиться в редакторі.

# terminal.integrated.confirmOnKill.never
source: Never confirm.
uk: Ніколи не підтверджуйте.

# terminal.integrated.confirmOnKill.panel
source: Confirm if the terminal is in the panel.
uk: Підтвердіть, чи термінал знаходиться в панелі.

# terminal.integrated.copyOnSelection
source: Controls whether text selected in the terminal will be copied to the clipboard.
uk: Контролює, чи текст, вибраний у терміналі, буде скопійовано в буфер обміну.

# terminal.integrated.cursorBlinking
source: Controls whether the terminal cursor blinks.
uk: Контролює, чи блимає курсор терміналу.

# terminal.integrated.cursorStyle
source: Controls the style of terminal cursor when the terminal is focused.
uk: Контролює стиль курсора терміналу, коли термінал має фокус.

# terminal.integrated.cursorStyleInactive
source: Controls the style of terminal cursor when the terminal is not focused.
uk: Контролює стиль курсора терміналу, коли термінал не має фокусу.

# terminal.integrated.cursorWidth
source: Controls the width of the cursor when {0} is set to {1}.
uk: Контролює ширину курсора, коли {0} встановлено на {1}.

# terminal.integrated.customGlyphs
source: Whether to draw custom glyphs for block element and box drawing characters instead of using the font, which typically yields better rendering with continuous lines. Note that this doesn't work when {0} is disabled.
uk: Чи потрібно малювати власні гліфи для блокових елементів і символів малювання рамок замість використання шрифту, що зазвичай забезпечує кращу візуалізацію з безперервними лініями. Зверніть увагу, що це не працює, коли {0} вимкнено.

# terminal.integrated.cwd
source: An explicit start path where the terminal will be launched, this is used as the current working directory (cwd) for the shell process. This may be particularly useful in workspace settings if the root directory is not a convenient cwd.
uk: Явний шлях старту, де буде запущено термінал, використовується як поточний робочий каталог (cwd) для процесу оболонки. Це може бути особливо корисно в налаштуваннях робочого простору, якщо кореневий каталог не є зручним cwd.

# terminal.integrated.defaultLocation
source: Controls where newly created terminals will appear.
uk: Контролює, де з'являться новостворені термінали.

# terminal.integrated.defaultLocation.editor
source: Create terminals in the editor
uk: Створіть термінали в редакторі

# terminal.integrated.defaultLocation.view
source: Create terminals in the terminal view
uk: Створіть термінали у вигляді термінала

# terminal.integrated.detectLocale
source: Controls whether to detect and set the `$LANG` environment variable to a UTF-8 compliant option since VS Code's terminal only supports UTF-8 encoded data coming from the shell.
uk: Контролює, чи виявляти та встановлювати змінну середовища `$LANG` на опцію, що відповідає UTF-8, оскільки термінал VS Code підтримує лише дані, закодовані в UTF-8, які надходять з оболонки.

# terminal.integrated.detectLocale.auto
source: Set the `$LANG` environment variable if the existing variable does not exist or it does not end in `'.UTF-8'`.
uk: Встановіть змінну середовища `$LANG`, якщо існуюча змінна не існує або не закінчується на `'.UTF-8'`.

# terminal.integrated.detectLocale.off
source: Do not set the `$LANG` environment variable.
uk: Не встановлюйте змінну середовища `$LANG`.

# terminal.integrated.detectLocale.on
source: Always set the `$LANG` environment variable.
uk: Завжди встановлюйте змінну середовища `$LANG`.

# terminal.integrated.drawBoldTextInBrightColors
source: Controls whether bold text in the terminal will always use the "bright" ANSI color variant.
uk: Контролює, чи буде жирний текст у терміналі завжди використовувати "яскравий" варіант кольору ANSI.

# terminal.integrated.enableBell
source: This is now deprecated. Instead use the `terminal.integrated.enableVisualBell` and `accessibility.signals.terminalBell` settings.
uk: Це тепер застаріло. Натомість використовуйте налаштування `terminal.integrated.enableVisualBell` та `accessibility.signals.terminalBell`.

# terminal.integrated.enableFileLinks
source: Whether to enable file links in terminals. Links can be slow when working on a network drive in particular because each file link is verified against the file system. Changing this will take effect only in new terminals.
uk: Чи дозволити посилання на файли в терміналах. Посилання можуть бути повільними, особливо при роботі з мережевим диском, оскільки кожне посилання на файл перевіряється відповідно до файлової системи. Зміни набудуть чинності лише в нових терміналах.

# terminal.integrated.enableImages
source: Enables image support in the terminal, this will only work when {0} is enabled. Both sixel and iTerm's inline image protocol are supported on Linux and macOS. This will only work on Windows for versions of ConPTY >= v2 which is shipped with Windows itself, see also {1}. Images will currently not be restored between window reloads/reconnects.
uk: Увімкнення підтримки зображень у терміналі, це буде працювати лише коли {0} увімкнено. Підтримуються як sixel, так і вбудований протокол зображень iTerm на Linux і macOS. Це буде працювати на Windows лише для версій ConPTY >= v2, які постачаються разом із Windows, див. також {1}. Зображення наразі не відновлюватимуться між перезавантаженнями вікна/перепідключеннями.

# terminal.integrated.enableMultiLinePasteWarning
source: Controls whether to show a warning dialog when pasting multiple lines into the terminal.
uk: Контролює, чи показувати діалогове вікно попередження при вставці кількох рядків у термінал.

# terminal.integrated.enableMultiLinePasteWarning.always
source: Always show the warning if the text contains a new line.
uk: Завжди показувати попередження, якщо текст містить новий рядок.

# terminal.integrated.enableMultiLinePasteWarning.auto
source: Enable the warning but do not show it when: - Bracketed paste mode is enabled (the shell supports multi-line paste natively) - The paste is handled by the shell's readline (in the case of pwsh)
uk: Увімкніть попередження, але не показуйте його, коли: - Увімкнено режим вставки з дужками (оболонка нативно підтримує вставку з кількох рядків) - Вставка обробляється readline оболонки (в випадку pwsh)

# terminal.integrated.enableMultiLinePasteWarning.never
source: Never show the warning.
uk: Ніколи не показувати попередження.

# terminal.integrated.enablePersistentSessions
source: Persist terminal sessions/history for the workspace across window reloads.
uk: Зберігайте термінальні сесії/історію для робочого простору під час перезавантаження вікна.

# terminal.integrated.enableVisualBell
source: Controls whether the visual terminal bell is enabled. This shows up next to the terminal's name.
uk: Контролює, чи увімкнено візуальний звуковий сигнал терміналу. Це відображається поруч з ім'ям терміналу.

# terminal.integrated.env.linux
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on Linux. Set to `null` to delete the environment variable.
uk: Об'єкт з змінними середовища, які будуть додані до процесу VS Code для використання терміналом на Linux. Встановіть значення `null`, щоб видалити змінну середовища.

# terminal.integrated.env.osx
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on macOS. Set to `null` to delete the environment variable.
uk: Об'єкт з змінними середовища, які будуть додані до процесу VS Code для використання терміналом на macOS. Встановіть значення `null`, щоб видалити змінну середовища.

# terminal.integrated.env.windows
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on Windows. Set to `null` to delete the environment variable.
uk: Об'єкт з змінними середовища, які будуть додані до процесу VS Code для використання терміналом на Windows. Встановіть значення `null`, щоб видалити змінну середовища.

# terminal.integrated.environmentChangesIndicator
source: Whether to display the environment changes indicator on each terminal which explains whether extensions have made, or want to make changes to the terminal's environment.
uk: Чи відображати індикатор змін середовища на кожному терміналі, який пояснює, чи розширення внесли, або хочуть внести зміни до середовища терміналу.

# terminal.integrated.environmentChangesIndicator.off
source: Disable the indicator.
uk: Вимкніть індикатор.

# terminal.integrated.environmentChangesIndicator.on
source: Enable the indicator.
uk: Увімкніть індикатор.

# terminal.integrated.environmentChangesIndicator.warnonly
source: Only show the warning indicator when a terminal's environment is 'stale', not the information indicator that shows a terminal has had its environment modified by an extension.
uk: Показуйте індикатор попередження лише тоді, коли середовище терміналу є 'застарілим', а не індикатор інформації, який показує, що середовище терміналу було змінено розширенням.

# terminal.integrated.environmentChangesRelaunch
source: Whether to relaunch terminals automatically if extensions want to contribute to their environment and have not been interacted with yet.
uk: Чи потрібно автоматично перезапускати термінали, якщо розширення хочуть внести свій внесок у своє середовище і ще не взаємодіяли з ними.

# terminal.integrated.fastScrollSensitivity
source: Scrolling speed multiplier when pressing `Alt`.
uk: Множник швидкості прокрутки при натисканні `Alt`.

# terminal.integrated.focusAfterRun
source: Controls whether the terminal, accessible buffer, or neither will be focused after `Terminal: Run Selected Text In Active Terminal` has been run.
uk: Контролює, чи буде термінал, доступний буфер або жоден з них сфокусований після виконання `Terminal: Run Selected Text In Active Terminal`.

# terminal.integrated.focusAfterRun.accessible-buffer
source: Always focus the accessible buffer.
uk: Завжди зосереджуйтеся на доступному буфері.

# terminal.integrated.focusAfterRun.none
source: Do nothing.
uk: Не робіть нічого.

# terminal.integrated.focusAfterRun.terminal
source: Always focus the terminal.
uk: Завжди фокусуйте термінал.

# terminal.integrated.fontFamily
source: Controls the font family of the terminal. Defaults to {0}'s value.
uk: Контролює сімейство шрифтів терміналу. За замовчуванням використовується значення {0}.

# terminal.integrated.fontLigatures.enabled
source: Controls whether font ligatures are enabled in the terminal. Ligatures will only work if the configured {0} supports them.
uk: Контролює, чи увімкнені лігатури шрифтів у терміналі. Лігатури працюватимуть лише якщо налаштований {0} підтримує їх.

# terminal.integrated.fontLigatures.fallbackLigatures
source: When {0} is enabled and the particular {1} cannot be parsed, this is the set of character sequences that will always be drawn together. This allows the use of a fixed set of ligatures even when the font isn't supported.
uk: Коли {0} увімкнено, а конкретний {1} не може бути розібраний, це набір послідовностей символів, які завжди будуть малюватися разом. Це дозволяє використовувати фіксований набір лігатур, навіть коли шрифт не підтримується.
