Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_debug.xlf
Languages: uk

# multiSessionRepl
source: True when there is more than 1 debug console.
uk: Істина, коли є більше ніж 1 консоль налагодження.

# restartFrameSupported
source: True when the focused session supports 'restartFrame' requests.
uk: Істинно, коли фокусована сесія підтримує запити 'restartFrame'.

# stackFrameSupportsRestart
source: True when the focused stack frame supports 'restartFrame'.
uk: Істинно, коли зосереджений стековий фрейм підтримує 'restartFrame'.

# stepBackSupported
source: True when the focused session supports 'stepBack' requests.
uk: Істина, коли зосереджена сесія підтримує запити 'stepBack'.

# stepIntoTargetsSupported
source: True when the focused session supports 'stepIntoTargets' request.
uk: Істинно, коли зосереджена сесія підтримує запит 'stepIntoTargets'.

# suspendDebuggeeSupported
source: True when the focused session supports the suspend debuggee capability.
uk: Істина, коли зосереджена сесія підтримує можливість призупинення налагоджуваного процесу.

# terminateDebuggeeSupported
source: True when the focused session supports the terminate debuggee capability.
uk: Істинно, коли зосереджена сесія підтримує можливість завершення налагоджуваної програми.

# variableEvaluateNamePresent
source: True when the focused variable has an 'evalauteName' field set.
uk: Правда, коли зосереджена змінна має поле 'evalauteName', встановлене.

# variableExtensionId
source: Extension ID of the variable source, present for debug visualization clauses.
uk: Ідентифікатор розширення змінної джерела, присутній для клаузів візуалізації налагодження.

# variableInterfaces
source: Any interfaces or contracts that the variable satisfies, present for debug visualization clauses.
uk: Будь-які інтерфейси або контракти, яким задовольняє змінна, присутні для візуалізації відладки.

# variableIsReadonly
source: True when the focused variable is read-only.
uk: Істина, коли фокусована змінна є тільки для читання.

# variableLanguage
source: Language of the variable source, present for debug visualization clauses.
uk: Мова змінної джерела, присутня для клаузів візуалізації налагодження.

# variableName
source: Name of the variable, present for debug visualization clauses.
uk: Назва змінної, присутня для візуалізації відлагодження.

# variableType
source: Type of the variable, present for debug visualization clauses.
uk: Тип змінної, присутній для візуалізації відладки.

# variableValue
source: Value of the variable, present for debug visualization clauses.
uk: Значення змінної, присутнє для візуалізації відладки.

# variablesFocused
source: True when the VARIABLES views is focused, false otherwise
uk: Істина, коли фокус на ЗМІННИХ views, хибність в іншому випадку

# watchExpressionsExist
source: True when at least one watch expression exists, false otherwise.
uk: Істинно, коли існує принаймні один вираз спостереження, хибно в іншому випадку.

# watchExpressionsFocused
source: True when the WATCH view is focused, false otherwise.
uk: Істина, коли фокус на перегляді WATCH, хибно в іншому випадку.

# watchItemType
source: Represents the item type of the focused element in the WATCH view. For example: 'expression', 'variable'
uk: Представляє тип елемента зосередження в перегляді WATCH. Наприклад: 'вираз', 'змінна'

# canNotResolveSource
source: Could not load source '{0}'.
uk: Не вдалося завантажити джерело '{0}'.

# canNotResolveSourceWithError
source: Could not load source '{0}': {1}.
uk: Не вдалося завантажити джерело '{0}': {1}.

# unable
source: Unable to resolve the resource without a debug session
uk: Неможливо вирішити ресурс без сеансу налагодження

# debug.debugSessionCloseConfirmationPlural
source: There are active debug sessions, are you sure you want to stop them?
uk: Є активні сесії налагодження, ви впевнені, що хочете їх зупинити?

# debug.debugSessionCloseConfirmationSingular
source: There is an active debug session, are you sure you want to stop it?
uk: Існує активна сесія налагодження, ви впевнені, що хочете її зупинити?

# debug.stop
source: &&Stop Debugging
uk: &&Зупинити налагодження

# breakpointDirtydHover
source: Unverified breakpoint. File is modified, please restart debug session.
uk: Непідтверджена точка зупинки. Файл змінено, будь ласка, перезапустіть сесію налагодження.

source: Invalid variable attributes
uk: Недійсні атрибути змінної

source: not available
uk: недоступно

# app.launch.json.compound.folder
source: Name of folder in which the compound is located.
uk: Назва папки, в якій знаходиться сполука.

# app.launch.json.compound.name
source: Name of compound. Appears in the launch configuration drop down menu.
uk: Назва сполуки. З'являється в спадному меню конфігурації запуску.

# app.launch.json.compound.stopAll
source: Controls whether manually terminating one session will stop all of the compound sessions.
uk: Контролює, чи призупинення однієї сесії вручну зупинить усі складені сесії.

# app.launch.json.compounds
source: List of compounds. Each compound references multiple configurations which will get launched together.
uk: Список сполук. Кожна сполука посилається на кілька конфігурацій, які будуть запущені разом.

# app.launch.json.compounds.configurations
source: Names of configurations that will be started as part of this compound.
uk: Назви конфігурацій, які будуть запущені в рамках цього сполуки.

# app.launch.json.configurations
source: List of configurations. Add new configurations or edit existing ones by using IntelliSense.
uk: Список конфігурацій. Додайте нові конфігурації або редагуйте існуючі, використовуючи IntelliSense.

# app.launch.json.title
source: Launch
uk: Запустити

# app.launch.json.version
source: Version of this file format.
uk: Версія цього формату файлу.

# compoundPrelaunchTask
source: Task to run before any of the compound configurations start.
uk: Завдання, яке потрібно виконати перед початком будь-якої з композитних конфігурацій.

# debugger name
source: Name
uk: Ім'я

# debugger type
source: Type
uk: Тип

source: Debuggers
uk: Дебагери

# presentation
source: Presentation options on how to show this configuration in the debug configuration dropdown and the command palette.
uk: Опції презентації щодо того, як показати цю конфігурацію у випадаючому списку конфігурацій налагодження та в командній палітрі.

# presentation.group
source: Group that this configuration belongs to. Used for grouping and sorting in the configuration dropdown and the command palette.
uk: Група, до якої належить ця конфігурація. Використовується для групування та сортування у випадаючому списку конфігурацій та палітрі команд.

# presentation.hidden
source: Controls if this configuration should be shown in the configuration dropdown and the command palette.
uk: Контролює, чи ця конфігурація повинна відображатися в випадаючому меню конфігурації та командній палітрі.

# presentation.order
source: Order of this configuration within a group. Used for grouping and sorting in the configuration dropdown and the command palette.
uk: Порядок цієї конфігурації в групі. Використовується для групування та сортування в випадаючому списку конфігурації та палітрі команд.

# useUniqueNames
source: Please use unique configuration names.
uk: Будь ласка, використовуйте унікальні імена конфігурацій.

# vscode.extension.contributes.breakpoints
source: Contributes breakpoints.
uk: Сприяє точкам зупинки.

# vscode.extension.contributes.breakpoints.language
source: Allow breakpoints for this language.
uk: Дозволити точки зупинки для цієї мови.

# vscode.extension.contributes.breakpoints.when
source: Condition which must be true to enable breakpoints in this language. Consider matching this to the debugger when clause as appropriate.
uk: Умова, яка повинна бути істинною, щоб увімкнути точки зупинки в цій мові. Розгляньте можливість співвіднесення цього з умовою when відладчика, якщо це доречно.

# vscode.extension.contributes.debuggers
source: Contributes debug adapters.
uk: Сприяє адаптерам налагодження.

# vscode.extension.contributes.debuggers.args
source: Optional arguments to pass to the adapter.
uk: Додаткові аргументи для передачі адаптеру.

# vscode.extension.contributes.debuggers.configurationAttributes
source: JSON schema configurations for validating 'launch.json'.
uk: Конфігурації схеми JSON для валідації 'launch.json'.

# vscode.extension.contributes.debuggers.configurationSnippets
source: Snippets for adding new configurations in 'launch.json'.
uk: Фрагменти для додавання нових конфігурацій у 'launch.json'.

# vscode.extension.contributes.debuggers.deprecated
source: Optional message to mark this debug type as being deprecated.
uk: Додаткове повідомлення, щоб позначити цей тип налагодження як застарілий.

# vscode.extension.contributes.debuggers.hiddenWhen
source: When this condition is true, this debugger type is hidden from the debugger list, but is still enabled.
uk: Коли ця умова є істинною, цей тип налагоджувача прихований зі списку налагоджувачів, але все ще активний.

# vscode.extension.contributes.debuggers.initialConfigurations
source: Configurations for generating the initial 'launch.json'.
uk: Конфігурації для генерації початкового 'launch.json'.

# vscode.extension.contributes.debuggers.label
source: Display name for this debug adapter.
uk: Ім'я для відображення цього адаптера налагодження.

# vscode.extension.contributes.debuggers.languages
source: List of languages for which the debug extension could be considered the "default debugger".
uk: Список мов, для яких розширення налагодження можна вважати «дефолтним налагоджувачем».

# vscode.extension.contributes.debuggers.linux
source: Linux specific settings.
uk: Налаштування, специфічні для Linux.

# vscode.extension.contributes.debuggers.linux.runtime
source: Runtime used for Linux.
uk: Час виконання, що використовується для Linux.

# vscode.extension.contributes.debuggers.osx
source: macOS specific settings.
uk: налаштування, специфічні для macOS.

# vscode.extension.contributes.debuggers.osx.runtime
source: Runtime used for macOS.
uk: Час виконання, використаний для macOS.

# vscode.extension.contributes.debuggers.program
source: Path to the debug adapter program. Path is either absolute or relative to the extension folder.
uk: Шлях до програми адаптера налагодження. Шлях може бути абсолютним або відносним до папки розширення.

# vscode.extension.contributes.debuggers.runtime
source: Optional runtime in case the program attribute is not an executable but requires a runtime.
uk: Необов'язковий час виконання у випадку, якщо атрибут програми не є виконуваним, але потребує часу виконання.

# vscode.extension.contributes.debuggers.runtimeArgs
source: Optional runtime arguments.
uk: Необов'язкові аргументи під час виконання.

# vscode.extension.contributes.debuggers.strings
source: UI strings contributed by this debug adapter.
uk: Рядки інтерфейсу користувача, надані цим адаптером налагодження.

# vscode.extension.contributes.debuggers.strings.unverifiedBreakpoints
source: When there are unverified breakpoints in a language supported by this debug adapter, this message will appear on the breakpoint hover and in the breakpoints view. Markdown and command links are supported.
uk: Коли в мові, що підтримується цим адаптером налагодження, є непідтверджені точки зупинки, це повідомлення з'явиться при наведенні на точку зупинки та в перегляді точок зупинки. Підтримуються Markdown і командні посилання.

# vscode.extension.contributes.debuggers.type
source: Unique identifier for this debug adapter.
uk: Унікальний ідентифікатор для цього адаптера налагодження.

# vscode.extension.contributes.debuggers.variables
source: Mapping from interactive variables (e.g. ${action.pickProcess}) in `launch.json` to a command.
uk: Відображення інтерактивних змінних (наприклад, ${action.pickProcess}) у `launch.json` на команду.

# vscode.extension.contributes.debuggers.when
source: Condition which must be true to enable this type of debugger. Consider using 'shellExecutionSupported', 'virtualWorkspace', 'resourceScheme' or an extension-defined context key as appropriate for this.
uk: Умова, яка повинна бути істинною, щоб увімкнути цей тип налагоджувача. Розгляньте можливість використання 'shellExecutionSupported', 'virtualWorkspace', 'resourceScheme' або ключа контексту, визначеного розширенням, відповідно до цього.

# vscode.extension.contributes.debuggers.windows
source: Windows specific settings.
uk: Налаштування, специфічні для Windows.

# vscode.extension.contributes.debuggers.windows.runtime
source: Runtime used for Windows.
uk: Час виконання, що використовується для Windows.

source: Unknown Source
uk: Невідоме джерело

# cannot.find.da
source: Cannot find debug adapter for type '{0}'.
uk: Не вдалося знайти адаптер налагодження для типу '{0}'.

# debugLinuxConfiguration
source: Linux specific launch configuration attributes.
uk: Специфічні для Linux атрибути конфігурації запуску.

# debugOSXConfiguration
source: OS X specific launch configuration attributes.
uk: Специфічні атрибути конфігурації запуску для OS X.

# debugRequest
source: Request type of configuration. Can be "launch" or "attach".
uk: Тип запиту конфігурації. Може бути "запуск" або "підключення".

# debugType
source: Type of configuration.
uk: Тип налагодження активної сесії налагодження. Наприклад 'python'.

# debugTypeNotRecognised
source: The debug type is not recognized. Make sure that you have a corresponding debug extension installed and that it is enabled.
uk: Тип налагодження не розпізнано. Переконайтеся, що у вас встановлено відповідне розширення для налагодження та що воно активоване.

# debugWindowsConfiguration
source: Windows specific launch configuration attributes.
uk: Атрибути конфігурації запуску, специфічні для Windows.

# launch.config.comment1
source: Use IntelliSense to learn about possible attributes.
uk: Використовуйте IntelliSense, щоб дізнатися про можливі атрибути.

# launch.config.comment2
source: Hover to view descriptions of existing attributes.
uk: Наведіть курсор, щоб переглянути описи існуючих атрибутів.

# launch.config.comment3
source: For more information, visit: {0}
uk: Для отримання додаткової інформації відвідайте: {0}

# node2NotSupported
source: "node2" is no longer supported, use "node" instead and set the "protocol" attribute to "inspector".
uk: "node2" більше не підтримується, використовуйте "node" замість цього та встановіть атрибут "protocol" на "inspector".

# disassemblyEditorLabelIcon
source: Icon of the disassembly editor label.
uk: Іконка мітки редактора розбирання.

# disassemblyInputName
source: Disassembly
uk: Розбирання

# moveFocusedView.selectView
source: Search loaded scripts by name
uk: Шукати сеанси налагодження за назвою

# consoleCleared
source: Console was cleared
uk: Консоль була очищена

# debugAdapterBinNotFound
source: Debug adapter executable '{0}' does not exist.
uk: Виконуваний файл адаптера налагодження '{0}' не існує.

# debugAdapterCannotDetermineExecutable
source: Cannot determine executable for debug adapter '{0}'.
uk: Не вдалося визначити виконуваний файл для адаптера налагодження '{0}'.

# unableToLaunchDebugAdapter
source: Unable to launch debug adapter from '{0}'.
uk: Неможливо запустити адаптер налагодження з '{0}'.

# unableToLaunchDebugAdapterNoArgs
source: Unable to launch debug adapter.
uk: Неможливо запустити адаптер налагодження.
