Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_language.xlf
Languages: uk

source: File Extensions
uk: Розширення файлів

source: Grammar
uk: Граматика

# invalid
source: Invalid `contributes.{0}`. Expected an array.
uk: Невірний `contributes.{0}`. Очікувався масив.

# invalid.empty
source: Empty value for `contributes.{0}`
uk: Порожнє значення для `contributes.{0}`

# language name
source: Name
uk: Ім'я

# languages
source: Programming Languages
uk: Мови програмування

# opt.aliases
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string[]`

# opt.configuration
source: property `{0}` can be omitted and must be of type `string`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string`

# opt.extensions
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string[]`

# opt.filenames
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string[]`

# opt.firstLine
source: property `{0}` can be omitted and must be of type `string`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string`

# opt.icon
source: property `{0}` can be omitted and must be of type `object` with properties `{1}` and `{2}` of type `string`
uk: властивість `{0}` може бути пропущена і повинна бути типу `object` з властивостями `{1}` та `{2}` типу `string`

# opt.mimetypes
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість `{0}` може бути пропущена і повинна бути типу `string[]`

# require.id
source: property `{0}` is mandatory and must be of type `string`
uk: властивість `{0}` є обов'язковою і повинна бути типу `string`

source: Snippets
uk: Фрагменти

# vscode.extension.contributes.languages
source: Contributes language declarations.
uk: Вносить декларації мов.

# vscode.extension.contributes.languages.aliases
source: Name aliases for the language.
uk: Ім'я псевдонімів для мови.

# vscode.extension.contributes.languages.configuration
source: A relative path to a file containing configuration options for the language.
uk: Відносний шлях до файлу, що містить параметри конфігурації для мови.

# vscode.extension.contributes.languages.extensions
source: File extensions associated to the language.
uk: Розширення файлів, пов'язані з мовою.

# vscode.extension.contributes.languages.filenamePatterns
source: File name glob patterns associated to the language.
uk: Шаблони глоб для імен файлів, пов'язані з мовою.

# vscode.extension.contributes.languages.filenames
source: File names associated to the language.
uk: Імена файлів, пов'язані з мовою.

# vscode.extension.contributes.languages.firstLine
source: A regular expression matching the first line of a file of the language.
uk: Регулярний вираз, що відповідає першому рядку файлу мови.

# vscode.extension.contributes.languages.icon
source: A icon to use as file icon, if no icon theme provides one for the language.
uk: Іконка для використання як іконка файлу, якщо жодна тема іконок не надає її для мови.

# vscode.extension.contributes.languages.icon.dark
source: Icon path when a dark theme is used
uk: Шлях до іконки, коли використовується темна тема

# vscode.extension.contributes.languages.icon.light
source: Icon path when a light theme is used
uk: Шлях до іконки, коли використовується світла тема

# vscode.extension.contributes.languages.id
source: ID of the language.
uk: ID мови.

# vscode.extension.contributes.languages.mimetypes
source: Mime types associated to the language.
uk: Типи MIME, пов'язані з мовою.
