Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_comments.xlf
Languages: uk

# commentReplyInputBackground
source: Background color for comment reply input box.
uk: Колір фону для поля введення відповіді на коментар.

# commentThreadActiveRangeBackground
source: Color of background for currently selected or hovered comment range.
uk: Колір фону для наразі вибраного або наведенного діапазону коментарів.

# commentThreadRangeBackground
source: Color of background for comment ranges.
uk: Колір фону для діапазонів коментарів.

# resolvedCommentBorder
source: Color of borders and arrow for resolved comments.
uk: Колір меж і стрілки для вирішених коментарів.

# resolvedCommentIcon
source: Icon color for resolved comments.
uk: Колір значка для вирішених коментарів.

# unresolvedCommentBorder
source: Color of borders and arrow for unresolved comments.
uk: Колір меж і стрілки для нерозв'язаних коментарів.

# unresolvedCommentIcon
source: Icon color for unresolved comments.
uk: Колір іконки для невирішених коментарів.

# editorGutterCommentGlyphForeground
source: Editor gutter decoration color for commenting glyphs.
uk: Колір декорації краю редактора для гліфів коментування.

# editorGutterCommentRangeForeground
source: Editor gutter decoration color for commenting ranges. This color should be opaque.
uk: Колір декорації краю редактора для коментування діапазонів. Цей колір має бути непрозорим.

# editorGutterCommentUnresolvedGlyphForeground
source: Editor gutter decoration color for commenting glyphs for unresolved comment threads.
uk: Колір декорації поля редактора для гліфів коментування для невирішених коментарів.

# editorOverviewRuler.commentForeground
source: Editor overview ruler decoration color for resolved comments. This color should be opaque.
uk: Колір декорації лінійки огляду редактора для вирішених коментарів. Цей колір має бути непрозорим.

# editorOverviewRuler.commentUnresolvedForeground
source: Editor overview ruler decoration color for unresolved comments. This color should be opaque.
uk: Колір декорації лінійки огляду редактора для невирішених коментарів. Цей колір має бути непрозорим.

# commentAddReactionDefaultError
source: Deleting the comment reaction failed
uk: Не вдалося видалити реакцію на коментар

# commentAddReactionError
source: Deleting the comment reaction failed: {0}.
uk: Не вдалося видалити реакцію на коментар: {0}.

# commentDeleteReactionDefaultError
source: Deleting the comment reaction failed
uk: Не вдалося видалити реакцію на коментар

# commentDeleteReactionError
source: Deleting the comment reaction failed: {0}.
uk: Не вдалося видалити реакцію на коментар: {0}.

# commentToggleReaction
source: Toggle Reaction
uk: Перемкнути реакцію

# commentToggleReactionDefaultError
source: Toggling the comment reaction failed
uk: Перемикання реакції на коментар не вдалося

# commentToggleReactionError
source: Toggling the comment reaction failed: {0}.
uk: Перемикання реакції на коментар не вдалося: {0}.

# newComment
source: Type a new comment
uk: Введіть новий коментар

source: Reply...
uk: Відповісти...

# commentThreadAria
source: Comment thread with {0} comments. {1}.
uk: Тема коментарів з {0} коментарями. {1}.

# commentThreadAria.document
source: Comment thread with {0} comments on the entire document. {1}.
uk: Тема коментарів з {0} коментарями на весь документ. {1}.

# commentThreadAria.withRange
source: Comment thread with {0} comments on lines {1} through {2}. {3}.
uk: Тема коментарів з {0} коментарями на рядках {1} до {2}. {3}.

# collapseIcon
source: Icon to collapse a review comment.
uk: Іконка для згортання коментаря до огляду.

# label.collapse
source: Collapse
uk: Сховати

# startThread
source: Start discussion
uk: Почати обговорення

# commentLabel
source: Comment
uk: Коментар

# commentLabelWithKeybinding
source: {0}, use ({1}) for accessibility help
uk: {0}, використовуйте ({1}) для допомоги з доступністю

# commentLabelWithKeybindingNoKeybinding
source: {0}, run the command Open Accessibility Help which is currently not triggerable via keybinding.
uk: {0}, виконайте команду Відкрити довідку з доступності, яка наразі не може бути викликана за допомогою комбінації клавіш.

# confirmCollapse
source: Collapsing this comment thread will discard unsubmitted comments. Are you sure you want to discard these comments?
uk: Згортання цього коментарного потоку призведе до скасування не надісланих коментарів. Ви впевнені, що хочете скасувати ці коментарі?

source: Discard
uk: Видалити

# neverAskAgain
source: Never ask me again
uk: Ніколи більше не питай мене

source: Collapse All
uk: Згорнути все

# collapseOnResolve
source: Controls whether the comment thread should collapse when the thread is resolved.
uk: Контролює, чи слід згортати потік коментарів, коли потік вирішено.

# comments.maxHeight
source: Controls whether the comments widget scrolls or expands.
uk: Контролює, чи прокручується віджет коментарів, чи розширюється.

# comments.openPanel.deprecated
source: This setting is deprecated in favor of `comments.openView`.
uk: Це налаштування застаріло на користь `comments.openView`.

# comments.openView
source: Controls when the comments view should open.
uk: Контролює, коли має відкриватися перегляд коментарів.

# comments.openView.file
source: The comments view will open when a file with comments is active.
uk: Перегляд коментарів відкриється, коли активний файл з коментарями.

# comments.openView.firstFile
source: If the comments view has not been opened yet during this session it will open the first time during a session that a file with comments is active.
uk: Якщо перегляд коментарів ще не було відкрито під час цієї сесії, він відкриється вперше під час сесії, коли активний файл з коментарями.

# comments.openView.firstFileUnresolved
source: If the comments view has not been opened yet during this session and the comment is not resolved, it will open the first time during a session that a file with comments is active.
uk: Якщо перегляд коментарів ще не було відкрито під час цієї сесії і коментар не вирішено, він відкриється вперше під час сесії, коли активний файл з коментарями.

# comments.openView.never
source: The comments view will never be opened.
uk: Перегляд коментарів ніколи не буде відкрито.

# comments.visible
source: Controls the visibility of the comments bar and comment threads in editors that have commenting ranges and comments. Comments are still accessible via the Comments view and will cause commenting to be toggled on in the same way running the command "Comments: Toggle Editor Commenting" toggles comments.
uk: Контролює видимість панелі коментарів та потоків коментарів у редакторах, які мають діапазони коментування та коментарі. Коментарі все ще доступні через перегляд коментарів і призведуть до перемикання коментування так само, як виконання команди "Comments: Toggle Editor Commenting" перемикає коментарі.

# commentsConfigurationTitle
source: Comments
uk: Коментарі

# confirmOnCollapse
source: Controls whether a confirmation dialog is shown when collapsing a comment thread.
uk: Контролює, чи відображається діалог підтвердження при згортанні потоку коментарів.

# confirmOnCollapse.never
source: Never show a confirmation dialog when collapsing a comment thread.
uk: Ніколи не показувати діалог підтвердження при згортанні потоку коментарів.

# confirmOnCollapse.whenHasUnsubmittedComments
source: Show a confirmation dialog when collapsing a comment thread with unsubmitted comments.
uk: Показати діалог підтвердження при згортанні потоку коментарів з непідтвердженими коментарями.

source: Expand All
uk: Розгорнути все

# openComments
source: Controls when the comments panel should open.
uk: Контролює, коли панель коментарів повинна відкриватися.

source: Reply
uk: Відповісти...

# totalUnresolvedComments
source: {0} Unresolved Comments
uk: {0} Невирішені коментарі

# useRelativeTime
source: Determines if relative time will be used in comment timestamps (ex. '1 day ago').
uk: Визначає, чи буде використовуватися відносний час у мітках часу коментарів (наприклад, '1 день тому').

# addCommentNoKb
source: - Add Comment on Current Selection{0}.
uk: - Додати коментар до поточного вибору{0}.

# commentCommands
source: Some useful comment commands include:
uk: Деякі корисні команди коментарів включають:

# escape
source: - Dismiss Comment (Escape)
uk: - Відхилити коментар (Escape)

# intro
source: The editor contains commentable range(s). Some useful commands include:
uk: Редактор містить діапазон(и), які можна коментувати. Деякі корисні команди включають:

# introWidget
source: This widget contains a text area, for composition of new comments, and actions, that can be tabbed to once tab moves focus mode has been enabled with the command Toggle Tab Key Moves Focus{0}.
uk: Цей віджет містить текстову область для складання нових коментарів та дії, до яких можна перейти за допомогою вкладок, коли режим переміщення фокусу за допомогою клавіші Tab було активовано командою Toggle Tab Key Moves Focus{0}.

# next
source: - Go to Next Commenting Range{0}.
uk: - Перейти до наступного діапазону коментування{0}.

# nextCommentThreadKb
source: - Go to Next Comment Thread{0}.
uk: - Перейти до наступного коментаря{0}.

# nextCommentedRangeKb
source: - Go to Next Commented Range{0}.
uk: - Перейти до наступного коментованого діапазону{0}.

# previous
source: - Go to Previous Commenting Range{0}.
uk: - Перейти до попереднього діапазону коментування{0}.

# previousCommentThreadKb
source: - Go to Previous Comment Thread{0}.
uk: - Перейти до попереднього потоку коментарів{0}.

# previousCommentedRangeKb
source: - Go to Previous Commented Range{0}.
uk: - Перейти до попереднього коментованого діапазону{0}.

# submitComment
source: - Submit Comment{0}.
uk: - Надіслати коментар{0}.

# commentRange
source: Line {0}
uk: Рядок {0}

# commentRangeStart
source: Lines {0} to {1}
uk: Рядки {0} до {1}

# comments.addCommand.error
source: The cursor must be within a commenting range to add a comment.
uk: Курсор повинен бути в межах діапазону коментування, щоб додати коментар.

# comments.addFileCommentCommand.error
source: File comments are not allowed on this file.
uk: Коментарі до файлу не дозволені для цього файлу.

# hasCommentRanges
source: Editor has commenting ranges.
uk: Редактор має діапазони коментування.

# hasCommentRangesKb
source: Editor has commenting ranges, run the command Open Accessibility Help ({0}), for more information.
uk: Редактор має діапазони коментування, виконайте команду Відкрити довідку з доступності ({0}), для отримання додаткової інформації.

# hasCommentRangesNoKb
source: Editor has commenting ranges, run the command Open Accessibility Help, which is currently not triggerable via keybinding, for more information.
uk: Редактор має діапазони коментування, виконайте команду Відкрити допомогу з доступності, яка наразі не може бути викликана за допомогою комбінації клавіш, для отримання додаткової інформації.

# pickCommentService
source: Select Comment Provider
uk: Виберіть постачальника коментарів

# comments.NextCommentedRange
source: Go to Next Commented Range
uk: Перейти до наступного коментованого діапазону

# comments.addCommand
source: Add Comment on Current Selection
uk: Додати коментар до поточного вибору

# comments.collapseAll
source: Collapse All Comments
uk: Згорнути всі коментарі

# comments.expandAll
source: Expand All Comments
uk: Розгорнути всі коментарі

# comments.expandUnresolved
source: Expand Unresolved Comments
uk: Розгорнути невирішені коментарі

# comments.focusCommand.error
source: The cursor must be on a line with a comment to focus the comment
uk: Курсор повинен бути на рядку з коментарем, щоб зосередитися на коментарі

# comments.focusCommentOnCurrentLine
source: Focus Comment on Current Line
uk: Зосередити коментар на поточному рядку

# comments.nextCommentingRange
source: Go to Next Commenting Range
uk: Перейти до наступного діапазону коментування

# comments.previousCommentedRange
source: Go to Previous Commented Range
uk: Перейти до попередньої коментованої області

# comments.previousCommentingRange
source: Go to Previous Commenting Range
uk: Перейти до попереднього діапазону коментування

# comments.toggleCommenting
source: Toggle Editor Commenting
uk: Перемикання коментування редактора

# commentsCategory
source: Comments
uk: Коментарі

# noComments
source: There are no comments in this workspace yet.
uk: У цьому робочому просторі ще немає коментарів.

# commentCount
source: 1 comment
uk: 1 коментар

# commentRange
source: [Ln {0}-{1}]
uk: Рядок {0}

# comments.view.title
source: Comments
uk: Коментарі

# commentsCountReplies
source: {0} replies
uk: {0} відповіді

# commentsCountReply
source: 1 reply
uk: 1 відповідь

source: Image
uk: Зображення

# imageWithLabel
source: Image: {0}
uk: Зображення: {0}

# lastReplyFrom
source: Last reply from {0}
uk: Остання відповідь від {0}

source: Outdated
uk: Застарілий

# accessibleViewHint
source: Inspect this in the accessible view ({0}).
uk: Перегляньте це в доступному режимі ({0}).

# acessibleViewHintNoKbOpen
source: Inspect this in the accessible view via the command Open Accessible View which is currently not triggerable via keybinding.
uk: Перегляньте це в доступному режимі за допомогою команди Відкрити доступний режим, яка наразі не може бути активована за допомогою комбінації клавіш.

# comments.filter.ariaLabel
source: Filter comments
uk: Фільтрувати коментарі

# comments.filter.placeholder
source: Filter (e.g. text, author)
uk: Фільтр (наприклад, текст, автор)

# fileCommentLabel
source: in {0}
uk: в {0}

# multiLineCommentLabel
source: from line {0} to line {1} in {2}
uk: з рядка {0} до рядка {1} у {2}

# oneLineCommentLabel
source: at line {0} column {1} in {2}
uk: на рядку {0} стовпці {1} у {2}

# replyCount
source: {0} replies,
uk: {0} відповіді,

# resourceWithCommentLabelOutdated
source: Outdated from {0}: {1} {2} {3} {4}
uk: Застаріле з {0}: {1} {2} {3} {4}

# resourceWithCommentThreadsLabel
source: Comments in {0}, full path {1}
uk: Коментарі в {0}, повний шлях {1}

# rootCommentsLabel
source: Comments for current workspace
uk: Коментарі для поточного робочого простору

# showing filtered results
source: Showing {0} of {1}
uk: Показано {0} з {1}

# comment sorts
source: Sort By
uk: Сортувати за

source: Comments
uk: Коментарі

# commentsClearFilterText
source: Clear filter text
uk: Очистити текст фільтра

source: Focus comments filter
uk: Фільтр коментарів за фокусом

# focusCommentsList
source: Focus Comments view
uk: Перегляд коментарів з фокусом

# resolved
source: Show Resolved
uk: Показати вирішені

# sorting by position in file
source: Position in File
uk: Позиція в файлі

# sorting by updated at
source: Updated Time
uk: Оновлений час

# toggle resolved
source: Show Resolved
uk: Показати вирішені

# toggle sorting by resource
source: Position in File
uk: Позиція у файлі

# toggle sorting by updated at
source: Updated Time
uk: Оновлений час

# toggle unresolved
source: Show Unresolved
uk: Показати невирішені

# unresolved
source: Show Unresolved
uk: Показати невирішені

# comment.reactionLabelMany
source: {0}{1} reactions with {2}
uk: {0}{1} реакцій з {2}

# comment.reactionLabelNone
source: {0}{1} reaction
uk: {0}{1} реакція

# comment.reactionLabelOne
source: {0}1 reaction with {1}
uk: {0}1 реакція з {1}

# comment.reactionLessThanTen
source: {0}{1} reacted with {2}
uk: {0}{1} відреагував(ла) емодзі {2}

# comment.reactionMoreThanTen
source: {0}{1} and {2} more reacted with {3}
uk: {0}{1} та {2} ще відреагували на {3}

# comment.toggleableReaction
source: Toggle reaction,
uk: Перемкнути реакцію,

source: Pick Reactions...
uk: Виберіть реакції...

# comment
source: The context value of the comment
uk: Контекстне значення коментаря

# commentController
source: The comment controller id associated with a comment thread
uk: Ідентифікатор контролера коментарів, пов'язаний з потоком коментарів

# commentFocused
source: Set when the comment is focused
uk: Встановити, коли коментар має фокус

# commentIsEmpty
source: Set when the comment has no input
uk: Встановити, коли коментар не має вводу

# commentThread
source: The context value of the comment thread
uk: Контекстне значення потоку коментарів

# commentThreadIsEmpty
source: Set when the comment thread has no comments
uk: Встановіть, коли в потоці коментарів немає коментарів

# commentingEnabled
source: Whether commenting functionality is enabled
uk: Чи увімкнена функціональність коментування

# editorHasCommentingRange
source: Whether the active editor has a commenting range
uk: Чи має активний редактор діапазон коментування

# hasComment
source: Whether the position at the active cursor has a comment
uk: Чи має позиція на активному курсорі коментар

# hasCommentingProvider
source: Whether the open workspace has either comments or commenting ranges.
uk: Чи має відкрите робоче середовище коментарі або діапазони коментування.

# hasCommentingRange
source: Whether the position at the active cursor has a commenting range
uk: Чи має позиція на активному курсорі діапазон коментування
