Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_extensions.xlf
Languages: uk

# exampleExtension
source: Example
uk: Приклад

# auto install missing deps
source: Install Missing Dependencies
uk: Встановити відсутні залежності

# finished installing missing deps
source: Finished installing missing dependencies. Please reload the window now.
uk: Встановлення відсутніх залежностей завершено. Будь ласка, перезавантажте вікно зараз.

# no missing deps
source: There are no missing dependencies to install.
uk: Відсутні відсутні залежності для встановлення.

# reload
source: Reload Window
uk: Перезавантажити вікно

# activationtimeIcon
source: Icon shown with a activation time message in the extension editor.
uk: Іконка, що відображається з повідомленням про час активації в редакторі розширень.

# clearSearchResultsIcon
source: Icon for the 'Clear Search Result' action in the extensions view.
uk: Іконка для дії 'Очистити результати пошуку' у перегляді розширень.

# configureRecommendedIcon
source: Icon for the 'Configure Recommended Extensions' action in the extensions view.
uk: Іконка для дії 'Налаштувати рекомендовані розширення' у вигляді розширень.

# errorIcon
source: Icon shown with a error message in the extensions editor.
uk: Іконка, що відображається з повідомленням про помилку в редакторі розширень.

# extensionsViewIcon
source: View icon of the extensions view.
uk: Переглянути значок перегляду розширень.

# filterIcon
source: Icon for the 'Filter' action in the extensions view.
uk: Іконка для дії 'Фільтр' у вигляді розширень.

# infoIcon
source: Icon shown with an info message in the extensions editor.
uk: Іконка, що відображається з інформаційним повідомленням у редакторі розширень.

# installCountIcon
source: Icon shown along with the install count in the extensions view and editor.
uk: Іконка, що відображається разом з кількістю встановлень у перегляді розширень та редакторі.

# installLocalInRemoteIcon
source: Icon for the 'Install Local Extension in Remote' action in the extensions view.
uk: Іконка для дії 'Встановити локальне розширення віддалено' у перегляді розширень.

# installWorkspaceRecommendedIcon
source: Icon for the 'Install Workspace Recommended Extensions' action in the extensions view.
uk: Іконка для дії 'Встановити рекомендовані розширення робочого простору' у перегляді розширень.

# manageExtensionIcon
source: Icon for the 'Manage' action in the extensions view.
uk: Іконка для дії 'Керувати' у вигляді розширень.

# preReleaseIcon
source: Icon shown for extensions having pre-release versions in extensions view and editor.
uk: Іконка, що відображається для розширень, які мають попередні версії, у перегляді розширень та редакторі.

# ratingIcon
source: Icon shown along with the rating in the extensions view and editor.
uk: Іконка, що відображається разом з рейтингом у перегляді розширень та редакторі.

# refreshIcon
source: Icon for the 'Refresh' action in the extensions view.
uk: Іконка для дії 'Оновити' у вигляді розширень.

# remoteIcon
source: Icon to indicate that an extension is remote in the extensions view and editor.
uk: Іконка, що вказує на те, що розширення є віддаленим у перегляді та редакторі розширень.

# sponsorIcon
source: Icon used for sponsoring extensions in the extensions view and editor.
uk: Іконка, що використовується для спонсорування розширень у перегляді розширень та редакторі.

# starEmptyIcon
source: Empty star icon used for the rating in the extensions editor.
uk: Порожня зірка-іконка, що використовується для оцінки в редакторі розширень.

# starFullIcon
source: Full star icon used for the rating in the extensions editor.
uk: Повна зірка, що використовується для оцінки в редакторі розширень.

# starHalfIcon
source: Half star icon used for the rating in the extensions editor.
uk: Іконка півзірки, що використовується для оцінки в редакторі розширень.

# syncEnabledIcon
source: Icon to indicate that an extension is synced.
uk: Іконка, що вказує на те, що розширення синхронізовано.

# syncIgnoredIcon
source: Icon to indicate that an extension is ignored when syncing.
uk: Іконка, що вказує на те, що розширення ігнорується під час синхронізації.

# trustIcon
source: Icon shown with a workspace trust message in the extension editor.
uk: Іконка, що відображається з повідомленням про довіру до робочого простору в редакторі розширень.

# warningIcon
source: Icon shown with a warning message in the extensions editor.
uk: Іконка, що відображається з попереджувальним повідомленням у редакторі розширень.

# install
source: Press Enter to install extension '{0}'.
uk: Встановити

# manage
source: Press Enter to manage your extensions.
uk: Керувати

# searchFor
source: Press Enter to search for extension '{0}'.
uk: Натисніть Enter, щоб знайти розширення '{0}'.

# type
source: Type an extension name to install or search.
uk: Введіть назву розширення для встановлення або пошуку.

source: Unknown Extension:
uk: Невідоме розширення:

source: Error
uk: Помилка

source: Available Updates
uk: Доступні оновлення

# builtInThemesExtensions
source: Themes
uk: Теми

source: Builtin
uk: Вбудований

# builtinFeatureExtensions
source: Features
uk: Особливості

# builtinProgrammingLanguageExtensions
source: Programming Languages
uk: Мови програмування

# click show
source: Click to Show
uk: Натисніть, щоб показати

source: Deprecated
uk: Застарілий

# disabledExtensions
source: Disabled
uk: Вимкнено

source: Dismiss
uk: Відхилити

# enabledExtensions
source: Enabled
uk: Увімкнено

# extensionFound
source: 1 extension found.
uk: Знайдено 1 розширення.

# extensionFoundInSection
source: 1 extension found in the {0} section.
uk: Знайдено 1 розширення в розділі {0}.

# extensionToReload
source: {0} requires restart
uk: {0} вимагає перезавантаження

# extensionToUpdate
source: {0} requires update
uk: {0} потребує оновлення

# extensionsFound
source: {0} extensions found.
uk: {0} розширень знайдено.

# extensionsFoundInSection
source: {0} extensions found in the {1} section.
uk: {0} розширень знайдено в розділі {1}.

# extensionsToReload
source: {0} require restart
uk: {0} вимагає перезавантаження

# extensionsToUpdate
source: {0} require update
uk: {0} вимагає оновлення

# install remote in local
source: Install Remote Extensions Locally...
uk: Встановити віддалені розширення локально...

# malicious warning
source: The following extensions were found to be problematic and have been uninstalled: {0}
uk: Виявлено, що наступні розширення є проблемними і були видалені: {0}

source: Marketplace
uk: Ринок

source: Open User Settings
uk: Відкрити налаштування користувача

# otherRecommendedExtensions
source: Other Recommendations
uk: Інші рекомендації

# popularExtensions
source: Popular
uk: Популярний

source: Recently Updated
uk: Нещодавно оновлено

# recommendedExtensions
source: Recommended
uk: Рекомендовано

source: Reload Now
uk: Перезавантажити зараз

source: Remote
uk: Віддалений

# restartNow
source: Restart Extensions
uk: Перезапустити розширення

# searchExtensions
source: Search Extensions in Marketplace
uk: Шукати розширення на ринку

source: Show
uk: Показати

# suggestProxyError
source: Marketplace returned 'ECONNREFUSED'. Please check the 'http.proxy' setting.
uk: Маркетплейс повернув 'ECONNREFUSED'. Будь ласка, перевірте налаштування 'http.proxy'.

# untrustedPartiallySupportedExtensions
source: Limited in Restricted Mode
uk: Обмежено в обмеженому режимі

# untrustedUnsupportedExtensions
source: Disabled in Restricted Mode
uk: Вимкнено в обмеженому режимі

# virtualPartiallySupportedExtensions
source: Limited in Virtual Workspaces
uk: Обмежено у віртуальних робочих просторах

# virtualUnsupportedExtensions
source: Disabled in Virtual Workspaces
uk: Вимкнено у віртуальних робочих просторах

# workspaceRecommendedExtensions
source: Workspace Recommendations
uk: Рекомендації щодо робочого простору

source: Workspace Unsupported
uk: Непідтримуване робоче середовище

# error
source: Error while fetching extensions. {0}
uk: Помилка

# extension.arialabel.deprecated
source: Deprecated
uk: Застарілий

# extension.arialabel.publisher
source: Publisher {0}
uk: Видавець {0}

# extension.arialabel.rating
source: Rated {0} out of 5 stars by {1} users
uk: Оцінено {0} з 5 зірок користувачами {1}

# extension.arialabel.verifiedPublisher
source: Verified Publisher {0}
uk: Перевірений видавець {0}

source: No extensions found.
uk: Розширень не знайдено.

# offline error
source: Unable to search the Marketplace when offline, please check your network connection.
uk: Неможливо здійснити пошук на Marketplace в режимі офлайн, будь ласка, перевірте ваше мережеве з'єднання.

# showingExtensionsForFeature
source: Extensions using {0} in the last 30 days
uk: Розширення, що використовують {0} за останні 30 днів

# Show prerelease version
source: Pre-Release version
uk: Версія перед випуском

# activation
source: Activation time
uk: Активація

# extensionIcon.sponsorForeground
source: The icon color for extension sponsor.
uk: Колір іконки для спонсора розширення.

# extensionIconStarForeground
source: The icon color for extension ratings.
uk: Колір іконки для рейтингів розширень.

# extensionPreReleaseForeground
source: The icon color for pre-release extension.
uk: Колір іконки для розширення до релізу.

# feature access label
source: {0} reqs
uk: {0} запитів

# feature usage label
source: {0} usage
uk: {0} використання

# has prerelease
source: This extension has a {0} available
uk: Ця розширення має {0} доступне

# message
source: 1 message
uk: 1 повідомлення

# messages
source: {0} messages
uk: {0} повідомлень

# publisher verified tooltip
source: This publisher has verified ownership of {0}
uk: Цей видавець підтвердив право власності на {0}

# ratedLabel
source: Average rating: {0} out of 5
uk: Середня оцінка: {0} з 5

# recommendationHasBeenIgnored
source: You have chosen not to receive recommendations for this extension.
uk: Ви обрали не отримувати рекомендації для цього розширення.

# remote extension title
source: Extension in {0}
uk: Розширення в {0}

source: Sponsor
uk: Спонсор

source: Startup
uk: Стартап

# syncingore.label
source: This extension is ignored during sync.
uk: Цей розширення ігнорується під час синхронізації.

# total
source: {0} {1} requests in last 30 days
uk: {0} {1} запитів за останні 30 днів

# uncaught error
source: 1 uncaught error
uk: 1 невловлена помилка

# uncaught errors
source: {0} uncaught errors
uk: Неперехоплені помилки ({0})

# updateRequired
source: Latest version:
uk: Остання версія:

source: Manifest is not found
uk: Маніфест не знайдено

source: All Platforms
uk: Усі платформи

# cannot be installed
source: Cannot install the '{0}' extension because it is not available in this setup.
uk: Розширення '{0}' недоступне в {1}. Натисніть 'Додаткова інформація', щоб дізнатися більше.

# confirmDisableAutoUpdate
source: Do you want to disable auto update for all extensions?
uk: Ви хочете вимкнути автоматичне оновлення для всіх розширень?

# confirmEnableAutoUpdate
source: Do you want to enable auto update for all extensions?
uk: Ви хочете увімкнути автоматичне оновлення для всіх розширень?

# confirmEnableDisableAutoUpdate
source: Auto Update Extensions
uk: Автоматичне оновлення розширень

# confirmEnableDisableAutoUpdateDetail
source: This will reset any auto update settings you have set for individual extensions.
uk: Це скине будь-які налаштування автоматичного оновлення, які ви встановили для окремих розширень.

# consentRequiredToUpdate
source: The update for {0} extension introduces executable code, which is not present in the currently installed version.
uk: Оновлення для {0} розширення вводить виконуваний код, який відсутній у наразі встановленій версії.

# deprecated extensions
source: Deprecated extensions detected. Review them and migrate to alternatives.
uk: Виявлено застарілі розширення. Перегляньте їх і мігруйте на альтернативи.

source: Disable All
uk: Вимкнути все

# disableDependents
source: Disable Extension with Dependents
uk: Вимкнути розширення з залежностями

# disallowed
source: This extension is disallowed to be installed.
uk: Цю розширення заборонено встановлювати.

# disallowed extensions
source: Some extensions are disabled because they are configured not to be allowed.
uk: Деякі розширення вимкнені, оскільки вони налаштовані на заборону.

# disallowed extensions by policy
source: Some extensions are disabled because they are not allowed by your system administrator.
uk: Деякі розширення вимкнені, оскільки їх не дозволено вашим системним адміністратором.

source: Download
uk: Спробуйте завантажити вручну...

# download title
source: Select folder to download the VSIX
uk: Виберіть папку для завантаження VSIX

# download.completed
source: Successfully downloaded the VSIX
uk: Успішно завантажено VSIX

# downloading...
source: Downloading VSIX...
uk: Завантаження VSIX...

# enable locally
source: Please {0} to enable this extension locally.
uk: Будь ласка, {0}, щоб увімкнути це розширення локально.

# enable remote
source: Please {0} to enable this extension in {1}.
uk: Будь ласка, {0}, щоб увімкнути це розширення в {1}.

# enableButtonLabel
source: &&Enable Extension
uk: &&Увімкнути розширення

# enableButtonLabelWithAction
source: &&Enable Extension and {0}
uk: &&Увімкнути розширення та {0}

# enableExtensionMessage
source: Would you like to enable '{0}' extension?
uk: Чи хочете ви увімкнути розширення '{0}'?

# enableExtensionTitle
source: Enable Extension
uk: Увімкнути розширення

# extension not found
source: Extension '{0}' not found.
uk: Розширення '{0}' не знайдено.

# extensionsAutoRestart
source: Extensions were auto restarted to enable updates.
uk: Розширення були автоматично перезапущені для активації оновлень.

# incompatible
source: Can't install '{0}' extension because it is not compatible.
uk: Не вдається встановити розширення '{0}', оскільки воно не сумісне.

# incompatibleExtensions
source: Some extensions are disabled due to version incompatibility. Review and update them.
uk: Деякі розширення вимкнені через несумісність версій. Перегляньте та оновіть їх.

# installButtonLabel
source: &&Install Extension
uk: &&Встановити розширення

# installButtonLabelWithAction
source: &&Install Extension and {0}
uk: &&Встановити розширення та {0}

# installExtensionMessage
source: Would you like to install '{0}' extension from '{1}'?
uk: Ви хочете встановити розширення '{0}' з '{1}'?

# installExtensionTitle
source: Install Extension
uk: Встановити розширення

# installVSIXMessage
source: Would you like to install the extension?
uk: Ви хочете встановити розширення?

source: Installing extension....
uk: Встановлення розширення....

# installing named extension
source: Installing '{0}' extension....
uk: Встановлення розширення '{0}'....

# invalidExtensions
source: Invalid extensions detected. Review them.
uk: Виявлено недійсні розширення. Перегляньте їх.

# malicious
source: This extension is reported to be problematic.
uk: Ця розширення повідомляється як проблемне.

# multipleDependentsError
source: Cannot disable '{0}' extension alone. '{1}', '{2}' and other extensions depend on this. Do you want to disable all these extensions?
uk: Не можна відключити розширення '{0}' окремо. '{1}', '{2}' та інші розширення залежать від цього. Ви хочете відключити всі ці розширення?

# multipleDependentsUninstallError
source: Cannot uninstall '{0}' extension alone. '{1}', '{2}' and other extensions depend on this. Do you want to uninstall all these extensions?
uk: Не можна видалити розширення '{0}' окремо. '{1}', '{2}' та інші розширення залежать від цього. Ви хочете видалити всі ці розширення?

# not an extension
source: The provided object is not an extension.
uk: Наданий об'єкт не є розширенням.

# not found
source: Unable to install extension '{0}' because it is not found.
uk: Неможливо встановити розширення '{0}', оскільки воно не знайдено.

# not found version
source: Unable to install extension '{0}' because the requested version '{1}' is not found.
uk: Неможливо встановити розширення '{0}', оскільки запитувана версія '{1}' не знайдена.

# not signed
source: This extension is not signed.
uk: '{0}' є розширенням з невідомого джерела. Ви впевнені, що хочете встановити?

# open
source: Open Extension
uk: Відкрити розширення

# platform placeholder
source: Please select the platform for which you want to download the VSIX
uk: Будь ласка, виберіть платформу, для якої ви хочете завантажити VSIX

# postDisableTooltip
source: Please {0} to disable this extension.
uk: Будь ласка, {0}, щоб вимкнути це розширення.

# postEnableTooltip
source: Please {0} to enable this extension.
uk: Будь ласка, {0} щоб увімкнути це розширення.

# postUninstallTooltip
source: Please {0} to complete the uninstallation of this extension.
uk: Будь ласка, {0} для завершення видалення цього розширення.

# postUpdateDownloadTooltip
source: Please update {0} to enable the updated extension.
uk: Будь ласка, оновіть {0}, щоб активувати оновлене розширення.

# postUpdateRestartTooltip
source: Please restart {0} to enable the updated extension.
uk: Будь ласка, перезапустіть {0}, щоб увімкнути оновлене розширення.

# postUpdateTooltip
source: Please {0} to enable the updated extension.
uk: Будь ласка, {0} щоб увімкнути оновлене розширення.

# postUpdateUpdateTooltip
source: Please update {0} to enable the updated extension.
uk: Будь ласка, оновіть {0}, щоб активувати оновлене розширення.

# reload
source: reload window
uk: Перезавантажити вікно

# restart
source: Changing extension enablement
uk: Зміна активації розширення

source: restart extensions
uk: Перезапустити розширення

# singleDependentError
source: Cannot disable '{0}' extension alone. '{1}' extension depends on this. Do you want to disable all these extensions?
uk: Не можна вимкнути розширення '{0}' окремо. Розширення '{1}' залежить від цього. Ви хочете вимкнути всі ці розширення?

# singleDependentUninstallError
source: Cannot uninstall '{0}' extension alone. '{1}' extension depends on this. Do you want to uninstall all these extensions?
uk: Не можна видалити розширення '{0}' окремо. Розширення '{1}' залежить від цього. Ви хочете видалити всі ці розширення?

# sync extension
source: Sync this extension
uk: Синхронізувати це розширення

# twoDependentsError
source: Cannot disable '{0}' extension alone. '{1}' and '{2}' extensions depend on this. Do you want to disable all these extensions?
uk: Не можна відключити розширення '{0}' окремо. Розширення '{1}' та '{2}' залежать від цього. Ви хочете відключити всі ці розширення?

# twoDependentsUninstallError
source: Cannot uninstall '{0}' extension alone. '{1}' and '{2}' extensions depend on this. Do you want to uninstall all these extensions?
uk: Не можна видалити розширення '{0}' окремо. Розширення '{1}' та '{2}' залежать від цього. Ви хочете видалити всі ці розширення?

source: Uninstall All
uk: Видалити все

# uninstallDependents
source: Uninstall Extension with Dependents
uk: Видалити розширення з залежностями

source: Uninstalling extension....
uk: Видалення розширення....

# unknown
source: Unable to install extension
uk: Неможливо встановити розширення

# updatingExtensions
source: Updating Extensions Auto Update State
uk: Оновлення стану автоматичного оновлення розширень

# fileBasedRecommendation
source: This extension is recommended based on the files you recently opened.
uk: Цю розширення рекомендовано на основі файлів, які ви нещодавно відкривали.

# languageName
source: the {0} language
uk: мова {0}

# reason
source: This extension is recommended for {0} for the Web
uk: Ця розширення рекомендовано для {0} для Веб

# workspaceRecommendation
source: This extension is recommended by users of the current workspace.
uk: Цю розширення рекомендують користувачі поточного робочого простору.

# app.extension.identifier.errorMessage
source: Expected format '${publisher}.${name}'. Example: 'vscode.csharp'.
uk: Очікуваний формат '${publisher}.${name}'. Приклад: 'vscode.csharp'.

# app.extensions.json.recommendations
source: List of extensions which should be recommended for users of this workspace. The identifier of an extension is always '${publisher}.${name}'. For example: 'vscode.csharp'.
uk: Список розширень, які слід рекомендувати користувачам цього робочого простору. Ідентифікатор розширення завжди має вигляд '${publisher}.${name}'. Наприклад: 'vscode.csharp'.

# app.extensions.json.title
source: Extensions
uk: Розширення

# app.extensions.json.unwantedRecommendations
source: List of extensions recommended by VS Code that should not be recommended for users of this workspace. The identifier of an extension is always '${publisher}.${name}'. For example: 'vscode.csharp'.
uk: Список розширень, рекомендованих VS Code, які не слід рекомендувати користувачам цього робочого простору. Ідентифікатор розширення завжди має формат '${publisher}.${name}'. Наприклад: 'vscode.csharp'.

# extensionsEditorLabelIcon
source: Icon of the extensions editor label.
uk: Іконка мітки редактора розширень.

# extensionsInputName
source: Extension: {0}
uk: Розширення: {0}

# disableOtherKeymapsConfirmation
source: Disable other keymaps ({0}) to avoid conflicts between keybindings?
uk: Вимкнути інші клавіатурні макети ({0}), щоб уникнути конфліктів між прив'язками клавіш?

source: Yes
uk: Так

# reportExtensionIssue
source: Report Issue
uk: Повідомити про проблему

# extensionsInputName
source: Running Extensions
uk: Розширення: {0}

# runtimeExtensionEditorLabelIcon
source: Icon of the runtime extensions editor label.
uk: Іконка мітки редактора розширень часу виконання.

# debugExtensionHost
source: Start Debugging Extension Host In New Window
uk: Почати налагодження розширення хоста в новому вікні

# debugExtensionHost.launch.name
source: Attach Extension Host
uk: Прикріпити хост розширення

# debugExtensionHost.progress
source: Attaching Debugger To Extension Host
uk: Приєднання налагоджувача до хоста розширення

# restart1
source: Debug Extensions
uk: Налагодження розширень

# restart2
source: In order to debug extensions a restart is required. Do you want to restart '{0}' now?
uk: Для налагодження розширень потрібен перезапуск. Ви хочете перезапустити '{0}' зараз?

# restart3
source: &&Restart
uk: &&Перезапустити

source: Profiling Extension Host
uk: Розширення профілювання хоста

# profilingExtensionHostTime
source: Profiling Extension Host ({0} sec)
uk: Профілювання розширення хоста ({0} сек)

# restart1
source: Profile Extensions
uk: Налагодження розширень

# restart2
source: In order to profile extensions a restart is required. Do you want to restart '{0}' now?
uk: Для налагодження розширень потрібен перезапуск. Ви хочете перезапустити '{0}' зараз?

# selectAndStartDebug
source: Click to stop profiling.
uk: Натисніть, щоб зупинити профілювання.

# status.profiler
source: Extension Profiler
uk: Профайлер розширень

source: Cleanup Extensions Folder
uk: Очистити папку розширень

source: Open Extensions Folder
uk: Відкрити папку розширень

# show
source: Show Extensions
uk: Показати

# unresponsive-exthost
source: The extension '{0}' took a very long time to complete its last operation and it has prevented other extensions from running.
uk: Розширення '{0}' зайняло дуже багато часу для завершення останньої операції, і це завадило виконанню інших розширень.

# attach.msg
source: This is a reminder to make sure that you have not forgotten to attach '{0}' to the issue you have just created.
uk: Це нагадування, щоб переконатися, що ви не забули прикріпити '{0}' до проблеми, яку ви щойно створили.

# attach.msg2
source: This is a reminder to make sure that you have not forgotten to attach '{0}' to an existing performance issue.
uk: Це нагадування, щоб переконатися, що ви не забули прикріпити '{0}' до існуючої проблеми з продуктивністю.

# attach.title
source: Did you attach the CPU-Profile?
uk: Ви прикріпили CPU-Profile?

# cmd.report
source: Report Issue
uk: Повідомити про проблему
