Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_tasks.xlf
Languages: uk

# ConfigureTaskRunnerAction.label
source: Configure Task
uk: Налаштувати задачу

# TaskServer.folderIgnored
source: The folder {0} is ignored since it uses task version 0.1.0
uk: Папка {0} ігнорується, оскільки використовує версію завдання 0.1.0.

# TaskServer.noTask
source: Task to execute is undefined
uk: Завдання для виконання не визначене.

# TaskService.associate
source: associate
uk: асоційований

# TaskService.attachProblemMatcher.continueWithout
source: Continue without scanning the task output
uk: Продовжити без сканування виходу завдання

# TaskService.attachProblemMatcher.learnMoreAbout
source: Learn more about scanning the task output
uk: Дізнайтеся більше про сканування виходу завдання

# TaskService.attachProblemMatcher.never
source: Never scan the task output for this task
uk: Ніколи не перевіряйте вихідні дані завдання для цього завдання.

# TaskService.attachProblemMatcher.neverType
source: Never scan the task output for {0} tasks
uk: Ніколи не перевіряйте вихідні дані завдання для {0} завдань

# TaskService.createJsonFile
source: Create tasks.json file from template
uk: Створіть файл tasks.json з шаблону

# TaskService.defaultBuildTaskExists
source: {0} is already marked as the default build task
uk: {0} вже позначено як завдання збірки за замовчуванням

# TaskService.defaultTestTaskExists
source: {0} is already marked as the default test task.
uk: {0} вже позначено як завдання для тестування за замовчуванням.

# TaskService.fetchingBuildTasks
source: Fetching build tasks...
uk: Отримання завдань збірки...

# TaskService.fetchingTestTasks
source: Fetching test tasks...
uk: Отримання тестових завдань...

# TaskService.ignoredFolder
source: The following workspace folders are ignored since they use task version 0.1.0: {0}
uk: Наступні папки робочого простору ігноруються, оскільки вони використовують версію завдання 0.1.0: {0}

# TaskService.noBuildTask
source: No build task to run found. Configure Build Task...
uk: Не знайдено завдання для виконання. Налаштуйте завдання збірки...

# TaskService.noBuildTask1
source: No build task defined. Mark a task with 'isBuildCommand' in the tasks.json file.
uk: Не визначено жодного завдання для збірки. Позначте завдання як 'isBuildCommand' у файлі tasks.json.

# TaskService.noBuildTask2
source: No build task defined. Mark a task with as a 'build' group in the tasks.json file.
uk: Не визначено жодного завдання для збірки. Позначте завдання як групу 'build' у файлі tasks.json.

# TaskService.noConfiguration
source: Error: The {0} task detection didn't contribute a task for the following configuration: {1} The task will be ignored.
uk: Помилка: Виявлення завдання {0} не внесло завдання для наступної конфігурації: {1} Завдання буде проігноровано.

# TaskService.noEntryToRun
source: Configure a Task
uk: Налаштувати задачу

# TaskService.noTaskIsRunning
source: No task is running
uk: Немає запущених завдань

# TaskService.noTaskRunning
source: No task is currently running
uk: Наразі жодне завдання не виконується.

# TaskService.noTaskToRestart
source: No task to restart
uk: Немає завдання для перезапуску

# TaskService.noTasks
source: No persistent tasks to reconnect.
uk: Немає постійних завдань для повторного підключення.

# TaskService.noTestTask1
source: No test task defined. Mark a task with 'isTestCommand' in the tasks.json file.
uk: Не визначено тестове завдання. Позначте завдання як 'isTestCommand' у файлі tasks.json.

# TaskService.noTestTask2
source: No test task defined. Mark a task with as a 'test' group in the tasks.json file.
uk: Не визначено тестове завдання. Позначте завдання як 'тест' у файлі tasks.json.

# TaskService.noTestTaskTerminal
source: No test task to run found. Configure Tasks...
uk: Не знайдено жодного тестового завдання для виконання. Налаштуйте завдання...

# TaskService.notAgain
source: Don't Show Again
uk: Не показувати знову

# TaskService.notConnecting
source: Setting tasks connected configured value {0}, tasks were already reconnected {1}
uk: Налаштування завдань, пов'язаних з конфігурованим значенням {0}, завдання вже були перепідключені {1}

# TaskService.openJsonFile
source: Open tasks.json file
uk: Відкрийте файл tasks.json

# TaskService.pickBuildTask
source: Select the build task to run
uk: Виберіть задачу збірки для виконання

# TaskService.pickBuildTaskForLabel
source: Select the build task (there is no default build task defined)
uk: Виберіть задачу збірки (жодна задача збірки не визначена за замовчуванням)

# TaskService.pickDefaultBuildTask
source: Select the task to be used as the default build task
uk: Виберіть задачу, яка буде використовуватися як задача збірки за замовчуванням.

# TaskService.pickDefaultTestTask
source: Select the task to be used as the default test task
uk: Виберіть задачу, яка буде використовуватися як задача за замовчуванням для тестування.

# TaskService.pickRunTask
source: Select the task to run
uk: Виберіть задачу для виконання

# TaskService.pickShowTask
source: Select the task to show its output
uk: Виберіть задачу, щоб показати її вихідні дані.

# TaskService.pickTask
source: Select a task to configure
uk: Виберіть завдання для налаштування

# TaskService.pickTestTask
source: Select the test task to run
uk: Виберіть тестове завдання для виконання

# TaskService.providerUnavailable
source: Warning: {0} tasks are unavailable in the current environment.
uk: Увага: {0} завдань недоступні в поточному середовищі.

# TaskService.reconnected
source: Reconnected to running tasks.
uk: Перепідключено до виконуваних завдань.

# TaskService.reconnecting
source: Reconnecting to running tasks...
uk: Відновлення з'єднання з виконуваними завданнями...

# TaskService.reconnectingTasks
source: Reconnecting to {0} tasks...
uk: Відновлення з'єднання з {0} завданнями...

# TaskService.requestTrust
source: Listing and running tasks requires that some of the files in this workspace be executed as code.
uk: Перелік та виконання завдань вимагає, щоб деякі файли в цьому робочому просторі виконувалися як код.

# TaskService.skippingReconnection
source: Startup kind not window reload, setting connected and removing persistent tasks
uk: Тип стартапу не перезавантажує вікно, налаштування підключено та видалення постійних завдань

# TaskService.taskToRestart
source: Select the task to restart
uk: Виберіть завдання для перезапуску

# TaskService.taskToTerminate
source: Select a task to terminate
uk: Виберіть задачу для завершення

# TaskService.template
source: Select a Task Template
uk: Виберіть шаблон завдання

# TaskService.terminateAllRunningTasks
source: All Running Tasks
uk: Усі запущені завдання

# TaskSystem.active
source: There is already a task running. Terminate it first before executing another task.
uk: Вже виконується завдання. Спочатку заверште його, перш ніж виконувати інше завдання.

# TaskSystem.activeSame.noBackground
source: The task '{0}' is already active.
uk: Завдання '{0}' вже активне.

# TaskSystem.configurationErrors
source: Error: the provided task configuration has validation errors and can't not be used. Please correct the errors first.
uk: Помилка: надана конфігурація завдання має помилки валідації і не може бути використана. Будь ласка, спочатку виправте помилки.

# TaskSystem.invalidTaskJson
source: Error: The content of the tasks.json file has syntax errors. Please correct them before executing a task.
uk: Помилка: Вміст файлу tasks.json має синтаксичні помилки. Будь ласка, виправте їх перед виконанням завдання.

# TaskSystem.invalidTaskJsonOther
source: Error: The content of the tasks json in {0} has syntax errors. Please correct them before executing a task.
uk: Помилка: Вміст json завдань у {0} містить синтаксичні помилки. Будь ласка, виправте їх перед виконанням завдання.

# TaskSystem.restartFailed
source: Failed to terminate and restart task {0}
uk: Не вдалося завершити та перезапустити задачу {0}

# TaskSystem.saveBeforeRun.prompt.title
source: Save all editors?
uk: Зберегти всіх редакторів?

# TaskSystem.unknownError
source: An error has occurred while running a task. See task log for details.
uk: Виникла помилка під час виконання завдання. Дивіться журнал завдань для деталей.

# TaskSystem.versionSettings
source: Only tasks version 2.0.0 permitted in user settings.
uk: Тільки завдання версії 2.0.0 дозволені в налаштуваннях користувача.

# TaskSystem.versionWorkspaceFile
source: Only tasks version 2.0.0 permitted in workspace configuration files.
uk: Тільки завдання версії 2.0.0 дозволені в конфігураційних файлах робочого простору.

# TasksSystem.locationUserConfig
source: user settings
uk: налаштування користувача

# TasksSystem.locationWorkspaceConfig
source: workspace file
uk: файл робочого простору

# TerminateAction.failed
source: Failed to terminate running task
uk: Не вдалося завершити виконання завдання

# TerminateAction.label
source: Terminate Task
uk: Завершити завдання

# TerminateAction.noProcess
source: The launched process doesn't exist anymore. If the task spawned background tasks exiting VS Code might result in orphaned processes.
uk: Запущений процес більше не існує. Якщо завдання створювало фонові завдання, вихід з VS Code може призвести до сирітських процесів.

source: Configure Task
uk: Налаштувати завдання

# configured
source: configured tasks
uk: налаштовані завдання

# customizeParseErrors
source: The current task configuration has errors. Please fix the errors first before customizing a task.
uk: Поточна конфігурація завдання має помилки. Будь ласка, спочатку виправте помилки, перш ніж налаштовувати завдання.

# detail
source: Do you want to save all editors before running the task?
uk: Ви хочете зберегти всіх редакторів перед виконанням завдання?

# detected
source: detected tasks
uk: виявлені завдання

# moreThanOneBuildTask
source: There are many build tasks defined in the tasks.json. Executing the first one.
uk: У файлі tasks.json визначено багато завдань для збірки. Виконується перше з них.

# recentlyUsed
source: recently used tasks
uk: недавно використані завдання

source: Restart Task
uk: Перезапустити задачу

# runTask.arg
source: Filters the tasks shown in the quickpick
uk: Фільтрує завдання, що відображаються у швидкому виборі

# runTask.label
source: The task's label or a term to filter by
uk: Мітка завдання або термін для фільтрації

# runTask.task
source: The task's label or a term to filter by
uk: Мітка завдання або термін для фільтрації

# runTask.type
source: The contributed task type
uk: Тип завдання, що був внесений

# saveBeforeRun.dontSave
source: Do&&n't Save
uk: Не&& зберігати

# saveBeforeRun.save
source: &&Save
uk: &&Зберегти

# savePersistentTask
source: Saving persistent tasks: {0}
uk: Збереження постійних завдань: {0}

# selectProblemMatcher
source: Select for which kind of errors and warnings to scan the task output
uk: Виберіть, для яких видів помилок і попереджень сканувати вихідні дані завдання.

source: Show output
uk: Показати вихідні дані

# taskEvent
source: Task Event kind: {0}
uk: Тип події завдання: {0}

# taskQuickPick.userSettings
source: User
uk: Користувач

# taskService.getSavedTasks
source: Fetching tasks from task storage.
uk: Отримання завдань з сховища завдань.

# taskService.getSavedTasks.error
source: Fetching a task from task storage failed: {0}.
uk: Отримання завдання з сховища завдань не вдалося: {0}.

# taskService.getSavedTasks.reading
source: Reading tasks from task storage, {0}, {1}, {2}
uk: Читання завдань з сховища завдань, {0}, {1}, {2}

# taskService.getSavedTasks.resolved
source: Resolved task {0}
uk: Вирішене завдання {0}

# taskService.getSavedTasks.unresolved
source: Unable to resolve task {0}
uk: Неможливо вирішити задачу {0}

# taskService.gettingCachedTasks
source: Returning cached tasks {0}
uk: Повернення кешованих завдань {0}

# taskService.ignoringFolder
source: Ignoring task configurations for workspace folder {0}. Multi folder workspace task support requires that all folders use task version 2.0.0
uk: Ігнорування конфігурацій завдань для папки робочого простору {0}. Підтримка завдань для багатопапкових робочих просторів вимагає, щоб усі папки використовували версію завдання 2.0.0.

# taskService.openDiff
source: Open diff
uk: Відкрити різницю

# taskService.openDiffs
source: Open diffs
uk: Відкрити різниці

# taskService.removePersistentTask
source: Removing persistent task {0}
uk: Видалення постійного завдання {0}

# taskService.setPersistentTask
source: Setting persistent task {0}
uk: Встановлення постійного завдання {0}

# taskService.upgradeVersion
source: The deprecated tasks version 0.1.0 has been removed. Your tasks have been upgraded to version 2.0.0. Open the diff to review the upgrade.
uk: Застаріла версія завдань 0.1.0 була видалена. Ваші завдання були оновлені до версії 2.0.0. Відкрийте порівняння, щоб переглянути оновлення.

# taskService.upgradeVersionPlural
source: The deprecated tasks version 0.1.0 has been removed. Your tasks have been upgraded to version 2.0.0. Open the diffs to review the upgrade.
uk: Застаріла версія завдань 0.1.0 була видалена. Ваші завдання були оновлені до версії 2.0.0. Відкрийте відмінності, щоб переглянути оновлення.

# taskServiceOutputPrompt
source: There are task errors. See the output for details.
uk: Є помилки завдань. Дивіться вивід для деталей.

source: Tasks
uk: Завдання

# tasksJsonComment
source: // See https://go.microsoft.com/fwlink/?LinkId=733558 // for the documentation about the tasks.json format
uk: // Дивіться https://go.microsoft.com/fwlink/?LinkId=733558 // для документації про формат tasks.json

source: Terminate Task
uk: Припинити завдання

# unexpectedTaskType
source: The task provider for "{0}" tasks unexpectedly provided a task of type "{1}".
uk: Постачальник завдань для "{0}" завдань несподівано надав завдання типу "{1}".

# workbench.action.tasks.allowAutomaticTasks
source: Allow Automatic Tasks
uk: Дозволити автоматичні завдання

# workbench.action.tasks.disallowAutomaticTasks
source: Disallow Automatic Tasks
uk: Заборонити автоматичні завдання

# workbench.action.tasks.manageAutomaticRunning
source: Manage Automatic Tasks
uk: Керувати автоматичними завданнями

# BuildAction.label
source: Run Build Task
uk: Запустити задачу збірки

# ConfigureDefaultBuildTask.label
source: Configure Default Build Task
uk: Налаштувати завдання збірки за замовчуванням

# ConfigureDefaultTestTask.label
source: Configure Default Test Task
uk: Налаштувати завдання тестування за замовчуванням

# ReRunTaskAction.label
source: Rerun Last Task
uk: Повторити останнє завдання

# RestartTaskAction.label
source: Restart Running Task
uk: Перезапустити виконуване завдання

# RunTaskAction.label
source: Run Task
uk: Запустити завдання

# ShowLogAction.label
source: Show Task Log
uk: Показати журнал завдань

# ShowTasksAction.label
source: Show Running Tasks
uk: Показати активні завдання

# TestAction.label
source: Run Test Task
uk: Запустити тестове завдання

source: Building...
uk: Будується...

# miBuildTask
source: Run &&Build Task...
uk: Запустити &&завдання збірки...

# miConfigureBuildTask
source: Configure De&&fault Build Task...
uk: Нала&&штувати завдання збірки за замовчуванням...

# miConfigureTask
source: &&Configure Tasks...
uk: &&Налаштувати завдання...

# miRestartTask
source: R&&estart Running Task...
uk: &&Перезапустити запущене завдання...

# miRunTask
source: &&Run Task...
uk: &&Запустити завдання...

# miRunningTask
source: Show Runnin&&g Tasks...
uk: Показати виконувані завдання...

# miTerminateTask
source: &&Terminate Task...
uk: &&Завершити завдання...

# numberOfRunningTasks
source: {0} running tasks
uk: {0} виконує завдання

# rerunTaskIcon
source: View icon of the rerun task.
uk: Переглянути іконку повторного запуску завдання.

# runningTasks
source: Show Running Tasks
uk: Показати активні завдання

# status.runningTasks
source: Running Tasks
uk: Виконання завдань

# task.SaveBeforeRun.prompt
source: Prompts whether to save editors before running.
uk: Запитує, чи зберегти редактори перед виконанням.

# task.allowAutomaticTasks
source: Enable automatic tasks - note that tasks won't run in an untrusted workspace.
uk: Увімкніть автоматичні завдання - зверніть увагу, що завдання не виконуватимуться в ненадійному робочому просторі.

# task.allowAutomaticTasks.off
source: Never
uk: Ніколи

# task.allowAutomaticTasks.on
source: Always
uk: Завжди

# task.autoDetect
source: Controls enablement of `provideTasks` for all task provider extension. If the Tasks: Run Task command is slow, disabling auto detect for task providers may help. Individual extensions may also provide settings that disable auto detection.
uk: Контролює увімкнення `provideTasks` для всіх розширень постачальників завдань. Якщо команда Завдання: Виконати завдання працює повільно, вимкнення автоматичного виявлення для постачальників завдань може допомогти. Окремі розширення також можуть надавати налаштування, які вимикають автоматичне виявлення.

# task.problemMatchers.neverPrompt
source: Configures whether to show the problem matcher prompt when running a task. Set to `true` to never prompt, or use a dictionary of task types to turn off prompting only for specific task types.
uk: Налаштовує, чи показувати запит на відповідність проблеми під час виконання завдання. Встановіть на `true`, щоб ніколи не запитувати, або використовуйте словник типів завдань, щоб вимкнути запит лише для конкретних типів завдань.

# task.problemMatchers.neverPrompt.array
source: An object containing task type-boolean pairs to never prompt for problem matchers on.
uk: Об'єкт, що містить пари типу завдання-логічне значення, щоб ніколи не запитувати про відповідники проблем.

# task.problemMatchers.neverPrompt.boolean
source: Sets problem matcher prompting behavior for all tasks.
uk: Встановлює поведінку запиту для всіх завдань.

# task.quickOpen.detail
source: Controls whether to show the task detail for tasks that have a detail in task quick picks, such as Run Task.
uk: Контролює, чи показувати деталі завдання для завдань, які мають деталі в швидкому виборі завдань, такі як Запустити завдання.

# task.quickOpen.history
source: Controls the number of recent items tracked in task quick open dialog.
uk: Контролює кількість нещодавніх елементів, відстежуваних у діалоговому вікні швидкого відкриття завдань.

# task.quickOpen.showAll
source: Causes the Tasks: Run Task command to use the slower "show all" behavior instead of the faster two level picker where tasks are grouped by provider.
uk: Викликає команду Завдання: Запустити завдання, щоб використовувати повільнішу поведінку "показати всі" замість швидшого вибору з двома рівнями, де завдання згруповані за постачальником.

# task.quickOpen.skip
source: Controls whether the task quick pick is skipped when there is only one task to pick from.
uk: Контролює, чи пропускається швидкий вибір завдання, коли є лише одне завдання для вибору.

# task.reconnection
source: On window reload, reconnect to tasks that have problem matchers.
uk: При перезавантаженні вікна повторно підключіться до завдань, які мають співпадіння проблем.

# task.saveBeforeRun
source: Save all dirty editors before running a task.
uk: Збережіть усі брудні редактори перед виконанням завдання.

# task.saveBeforeRun.always
source: Always saves all editors before running.
uk: Завжди зберігає всі редактори перед виконанням.

# task.saveBeforeRun.never
source: Never saves editors before running.
uk: Ніколи не зберігає редактори перед виконанням.

# task.slowProviderWarning
source: Configures whether a warning is shown when a provider is slow
uk: Налаштовує, чи відображати попередження, коли постачальник працює повільно

# task.slowProviderWarning.array
source: An array of task types to never show the slow provider warning.
uk: Масив типів завдань, для яких ніколи не показувати попередження про повільного постачальника.

# task.slowProviderWarning.boolean
source: Sets the slow provider warning for all tasks.
uk: Встановлює попередження про повільного постачальника для всіх завдань.

# task.verboseLogging
source: Enable verbose logging for tasks.
uk: Увімкніть детальне ведення журналу для завдань.

# tasksConfigurationTitle
source: Tasks
uk: Завдання

# tasksQuickAccessHelp
source: Run Task
uk: Запустити завдання

# tasksQuickAccessPlaceholder
source: Type the name of a task to run.
uk: Введіть назву завдання для виконання.

# workbench.action.tasks.openUserTasks
source: Open User Tasks
uk: Відкрити завдання користувача

# workbench.action.tasks.openWorkspaceFileTasks
source: Open Workspace Tasks
uk: Відкрити завдання робочого простору

# workbench.action.tasks.rerunForActiveTerminal
source: Rerun Task
uk: Перезапустити завдання

# TaskQuickPick.changeSettingDetails
source: Task detection for {0} tasks causes files in any workspace you open to be run as code. Enabling {0} task detection is a user setting and will apply to any workspace you open. Do you want to enable {0} task detection for all workspaces?
uk: Виявлення завдань для {0} завдань призводить до того, що файли в будь-якому робочому просторі, який ви відкриваєте, виконуються як код. Увімкнення виявлення {0} завдань є налаштуванням користувача і буде застосовуватися до будь-якого робочого простору, який ви відкриваєте. Чи хочете ви увімкнути виявлення {0} завдань для всіх робочих просторів?

# TaskQuickPick.changeSettingNo
source: No
uk: Ні

# TaskQuickPick.changeSettingsOptions
source: $(gear) {0} task detection is turned off. Enable {1} task detection...
uk: $(gear) {0} виявлення завдань вимкнено. Увімкніть {1} виявлення завдань...

# TaskQuickPick.goBack
source: Go back ↩
uk: Повернутися ↩

# TaskQuickPick.noTasksForType
source: No {0} tasks found. Go back ↩
uk: Не знайдено {0} завдань. Повернутися ↩

# configureTaskIcon
source: Configuration icon in the tasks selection list.
uk: Іконка конфігурації в списку вибору завдань.

source: configured
uk: налаштовані завдання

# contributedTasks
source: contributed
uk: вніс

# noProviderForTask
source: There is no task provider registered for tasks of type "{0}".
uk: Не зареєстровано постачальника завдань для завдань типу "{0}".

source: recently used
uk: недавно використані завдання

# removeRecent
source: Remove Recently Used Task
uk: Видалити нещодавно використане завдання

# removeTaskIcon
source: Icon for remove in the tasks selection list.
uk: Іконка для видалення в списку вибору завдань.

# taskQuickPick.showAll
source: Show All Tasks...
uk: Показати всі завдання...

# taskType
source: All {0} tasks
uk: Усі {0} завдання

# taskService.processTaskSystem
source: Process task system is not support in the web.
uk: Система обробки завдань не підтримується в вебі.

# task.watchFirstError
source: Beginning of detected errors for this run
uk: Початок виявлених помилок для цього запуску

# taskTerminalStatus.active
source: Task is running
uk: Завдання виконується

# taskTerminalStatus.errors
source: Task has errors
uk: Завдання містить помилки

# taskTerminalStatus.errorsInactive
source: Task has errors and is waiting...
uk: Завдання має помилки і чекає...

# taskTerminalStatus.infos
source: Task has infos
uk: Завдання має інформацію

# taskTerminalStatus.infosInactive
source: Task has infos and is waiting...
uk: Завдання має інформацію і чекає...

# taskTerminalStatus.succeeded
source: Task succeeded
uk: Завдання виконано

# taskTerminalStatus.succeededInactive
source: Task succeeded and waiting...
uk: Завдання виконано і чекає...

# taskTerminalStatus.warnings
source: Task has warnings
uk: Завдання має попередження

# taskTerminalStatus.warningsInactive
source: Task has warnings and is waiting...
uk: Завдання має попередження і чекає...

# noTaskResults
source: No matching tasks
uk: Немає відповідних завдань

# TerminalTaskSystem
source: Can't execute a shell command on an UNC drive using cmd.exe.
uk: Не вдається виконати команду оболонки на UNC-диску, використовуючи cmd.exe.
