Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_customEditor.xlf
Languages: uk

# editorCannotMove
source: Unable to move '{0}': The editor contains changes that can only be saved in its current window.
uk: Неможливо перемістити '{0}': Редактор містить зміни, які можна зберегти лише у його поточному вікні.

# editorUnsupportedInWindow
source: Unable to open the editor in this window, it contains modifications that can only be saved in the original window.
uk: Неможливо відкрити редактор у цьому вікні, воно містить зміни, які можна зберегти лише в оригінальному вікні.

# reopenInOriginalWindow
source: Open in Original Window
uk: Відкрити в оригінальному вікні

# builtinProviderDisplayName
source: Built-in
uk: Вбудований

# context.customEditor
source: The viewType of the currently active custom editor.
uk: Тип перегляду активного користувацького редактора.

# vetoExtHostRestart
source: An extension provided text editor for '{0}' is still open that would close otherwise.
uk: Відкрито редактор тексту, наданий розширенням для '{0}', який інакше закрився б.

# contributes.customEditors
source: Contributed custom editors.
uk: Внесені користувацькі редактори.

# contributes.displayName
source: Human readable name of the custom editor. This is displayed to users when selecting which editor to use.
uk: Людсько зрозуміла назва користувацького редактора. Вона відображається користувачам під час вибору, який редактор використовувати.

# contributes.priority
source: Controls if the custom editor is enabled automatically when the user opens a file. This may be overridden by users using the `workbench.editorAssociations` setting.
uk: Контролює, чи увімкнено користувацький редактор автоматично, коли користувач відкриває файл. Це може бути переоприділено користувачами за допомогою налаштування `workbench.editorAssociations`.

# contributes.priority.default
source: The editor is automatically used when the user opens a resource, provided that no other default custom editors are registered for that resource.
uk: Редактор автоматично використовується, коли користувач відкриває ресурс, за умови, що для цього ресурсу не зареєстровано жодних інших стандартних користувацьких редакторів.

# contributes.priority.option
source: The editor is not automatically used when the user opens a resource, but a user can switch to the editor using the `Reopen With` command.
uk: Редактор не використовується автоматично, коли користувач відкриває ресурс, але користувач може перемкнутися на редактор, використовуючи команду `Перезапустити з`.

# contributes.selector
source: Set of globs that the custom editor is enabled for.
uk: Набір глобусів, для яких увімкнено користувацький редактор.

# contributes.selector.filenamePattern
source: Glob that the custom editor is enabled for.
uk: Глоб, для якого увімкнено користувацький редактор.

# contributes.viewType
source: Identifier for the custom editor. This must be unique across all custom editors, so we recommend including your extension id as part of `viewType`. The `viewType` is used when registering custom editors with `vscode.registerCustomEditorProvider` and in the `onCustomEditor:${id}` [activation event](https://code.visualstudio.com/api/references/activation-events).
uk: Ідентифікатор для користувацького редактора. Він повинен бути унікальним серед усіх користувацьких редакторів, тому ми рекомендуємо включити ідентифікатор вашого розширення як частину `viewType`. `viewType` використовується під час реєстрації користувацьких редакторів за допомогою `vscode.registerCustomEditorProvider` та в події активації `onCustomEditor:${id}` [активаційна подія](https://code.visualstudio.com/api/references/activation-events).

source: Custom Editors
uk: Користувацькі редактори

# customEditors filenamePattern
source: Filename Pattern
uk: Шаблон імені файлу

# customEditors priority
source: Priority
uk: Пріоритет

# customEditors view type
source: View Type
uk: Тип перегляду
