Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# vscode.extension.contributs.view.size
source: The initial size of the view. The size will behave like the css 'flex' property, and will set the initial size when the view is first shown. In the side bar, this is the height of the view. This value is only respected when the same extension owns both the view and the view container.
uk: Початковий розмір перегляду. Розмір буде поводитися як властивість css 'flex' і встановить початковий розмір, коли перегляд вперше відображається. У бічній панелі це висота перегляду. Це значення враховується лише тоді, коли одна й та ж розширення володіє як переглядом, так і контейнером перегляду.

# config.property.defaultConfiguration.warning
source: Cannot register configuration defaults for '{0}'. Only defaults for machine-overridable, window, resource and language overridable scoped settings are supported.
uk: Не вдалося зареєструвати значення за замовчуванням конфігурації для '{0}'. Підтримуються лише значення за замовчуванням для налаштувань, які можна перекривати на рівні машини, вікна, ресурсу та мови.

# config.property.duplicate
source: Cannot register '{0}'. This property is already registered.
uk: Не вдається зареєструвати '{0}'. Ця властивість вже зареєстрована.

# config.property.preventDefaultConfiguration.warning
source: Cannot register configuration defaults for '{0}'. This setting does not allow contributing configuration defaults.
uk: Не вдається зареєструвати значення за замовчуванням конфігурації для '{0}'. Цей параметр не дозволяє вносити значення за замовчуванням конфігурації.

source: Default
uk: За замовчуванням

source: Description
uk: Опис

# invalid.allOf
source: 'configuration.allOf' is deprecated and should no longer be used. Instead, pass multiple configuration sections as an array to the 'configuration' contribution point.
uk: 'configuration.allOf' застаріло і більше не повинно використовуватися. Замість цього передайте кілька секцій конфігурації як масив до точки внеску 'configuration'.

# invalid.properties
source: 'configuration.properties' must be an object
uk: 'configuration.properties' має бути об'єктом

# invalid.property
source: configuration.properties property '{0}' must be an object
uk: властивість configuration.properties '{0}' повинна бути об'єктом

# invalid.title
source: 'configuration.title' must be a string
uk: 'configuration.title' має бути рядком

# scope.application.description
source: Configuration that can be configured only in the user settings.
uk: Конфігурація, яку можна налаштувати лише в налаштуваннях користувача.

# scope.deprecationMessage
source: If set, the property is marked as deprecated and the given message is shown as an explanation.
uk: Якщо встановлено, властивість позначається як застаріла, і вказане повідомлення відображається як пояснення.

# scope.description
source: Scope in which the configuration is applicable. Available scopes are `application`, `machine`, `window`, `resource`, and `machine-overridable`.
uk: Область, в якій конфігурація є застосовною. Доступні області: `application`, `machine`, `window`, `resource` та `machine-overridable`.

# scope.editPresentation
source: When specified, controls the presentation format of the string setting.
uk: Коли вказано, контролює формат подання налаштування рядка.

# scope.enumDescriptions
source: Descriptions for enum values
uk: Опис для значень enum

# scope.enumItemLabels
source: Labels for enum values to be displayed in the Settings editor. When specified, the {0} values still show after the labels, but less prominently.
uk: Мітки для значень enum, які будуть відображатися в редакторі Налаштувань. Коли вказано, значення {0} все ще показуються після міток, але менш помітно.

# scope.ignoreSync
source: When enabled, Settings Sync will not sync the user value of this configuration by default.
uk: Коли увімкнено, синхронізація налаштувань за замовчуванням не буде синхронізувати значення користувача цієї конфігурації.

# scope.language-overridable.description
source: Resource configuration that can be configured in language specific settings.
uk: Конфігурація ресурсів, яка може бути налаштована в мовних специфічних налаштуваннях.

# scope.machine-overridable.description
source: Machine configuration that can be configured also in workspace or folder settings.
uk: Конфігурація машини, яку можна налаштувати також у налаштуваннях робочого простору або папки.

# scope.machine.description
source: Configuration that can be configured only in the user settings or only in the remote settings.
uk: Налаштування, які можна налаштувати лише в налаштуваннях користувача або лише в віддалених налаштуваннях.

# scope.markdownDeprecationMessage
source: If set, the property is marked as deprecated and the given message is shown as an explanation in the markdown format.
uk: Якщо встановлено, властивість позначається як застаріла, і вказане повідомлення відображається як пояснення у форматі markdown.

# scope.markdownDescription
source: The description in the markdown format.
uk: Опис у форматі markdown.

# scope.markdownEnumDescriptions
source: Descriptions for enum values in the markdown format.
uk: Опис значень enum у форматі markdown.

# scope.multilineText.description
source: The value will be shown in a textarea.
uk: Значення буде показано в текстовій області.

# scope.order
source: When specified, gives the order of this setting relative to other settings within the same category. Settings with an order property will be placed before settings without this property set.
uk: Коли вказано, задає порядок цього налаштування відносно інших налаштувань у тій же категорії. Налаштування з властивістю порядку будуть розміщені перед налаштуваннями без встановленої цієї властивості.

# scope.resource.description
source: Configuration that can be configured in the user, remote, workspace or folder settings.
uk: Конфігурація, яку можна налаштувати в налаштуваннях користувача, віддалених, робочого простору або папки.

# scope.singlelineText.description
source: The value will be shown in an inputbox.
uk: Значення буде показано в полі введення.

# scope.tags
source: A list of categories under which to place the setting. The category can then be searched up in the Settings editor. For example, specifying the `experimental` tag allows one to find the setting by searching `@tag:experimental`.
uk: Список категорій, під які можна помістити налаштування. Категорію можна буде знайти в редакторі налаштувань. Наприклад, вказавши тег `experimental`, можна знайти налаштування, шукаючи `@tag:experimental`.

# scope.window.description
source: Configuration that can be configured in the user, remote or workspace settings.
uk: Конфігурація, яку можна налаштувати в налаштуваннях користувача, віддалених або робочого простору.

source: Settings
uk: Налаштування

# unknownWorkspaceProperty
source: Unknown workspace configuration property
uk: Невідома властивість конфігурації робочого простору

# vscode.extension.contributes.configuration
source: Contributes configuration settings.
uk: Сприяє налаштуванню параметрів.

# vscode.extension.contributes.configuration.order
source: When specified, gives the order of this category of settings relative to other categories.
uk: Коли вказано, задає порядок цієї категорії налаштувань відносно інших категорій.

# vscode.extension.contributes.configuration.properties
source: Description of the configuration properties.
uk: Опис властивостей конфігурації.

# vscode.extension.contributes.configuration.properties.schema
source: Schema of the configuration property.
uk: Схема властивості конфігурації.

# vscode.extension.contributes.configuration.property.empty
source: Property should not be empty.
uk: Властивість не повинна бути порожньою.

# vscode.extension.contributes.configuration.title
source: A title for the current category of settings. This label will be rendered in the Settings editor as a subheading. If the title is the same as the extension display name, then the category will be grouped under the main extension heading.
uk: Назва для поточної категорії налаштувань. Цей ярлик буде відображатися в редакторі налаштувань як підзаголовок. Якщо назва така ж, як і назва відображення розширення, то категорія буде згрупована під основним заголовком розширення.

# workspaceConfig.extensions.description
source: Workspace extensions
uk: Розширення робочого простору

# workspaceConfig.folders.description
source: List of folders to be loaded in the workspace.
uk: Список папок, які потрібно завантажити в робоче середовище.

# workspaceConfig.launch.description
source: Workspace launch configurations
uk: Конфігурації запуску робочого простору

# workspaceConfig.mcp.description
source: Model Context Protocol server configurations
uk: Конфігурації сервера протоколу контексту моделі

# workspaceConfig.name.description
source: An optional name for the folder.
uk: Додаткова назва для папки.

# workspaceConfig.path.description
source: A file path. e.g. `/root/folderA` or `./folderA` for a relative path that will be resolved against the location of the workspace file.
uk: Шлях до файлу. Наприклад, `/root/folderA` або `./folderA` для відносного шляху, який буде вирішено відносно місця розташування файлу робочого простору.

# workspaceConfig.remoteAuthority
source: The remote server where the workspace is located.
uk: Віддалений сервер, на якому розташоване робоче місце.

# workspaceConfig.settings.description
source: Workspace settings
uk: Налаштування робочого простору

# workspaceConfig.tasks.description
source: Workspace task configurations
uk: Конфігурації завдань робочого простору

# workspaceConfig.transient
source: A transient workspace will disappear when restarting or reloading.
uk: Тимчасове робоче місце зникне при перезавантаженні або оновленні.

# workspaceConfig.uri.description
source: URI of the folder
uk: URI папки

# authenticatingTo
source: Authenticating to '{0}'
uk: Аутентифікація до '{0}'

# completeAuth
source: Complete the authentication in the browser window that has opened.
uk: Завершіть аутентифікацію у вікні браузера, яке відкрилося.

# continueWith
source: You have not yet finished authenticating to '{0}'. Would you like to try a different way? ({1})
uk: Ви ще не завершили аутентифікацію до '{0}'. Чи хочете спробувати інший спосіб? ({1})

source: URL Handler
uk: URL обробник

# userCanceledContinue
source: Having trouble authenticating to '{0}'? Would you like to try a different way? ({1})
uk: Виникли проблеми з аутентифікацією до '{0}'? Хотіли б ви спробувати інший спосіб? ({1})

# limitHit
source: Not showing {0} further errors and warnings.
uk: Не показано {0} подальших помилок і попереджень.

# extensionTestError
source: Path {0} does not point to a valid extension test runner.
uk: Шлях {0} не вказує на дійсний тестовий запускник розширення.

# extensionTestError1
source: Cannot load test runner.
uk: Не вдалося завантажити тестовий запуск.

# defaultDropLabel
source: Drop using '{0}' extension
uk: Перетягніть, використовуючи розширення '{0}'

# defaultPasteLabel
source: Paste using '{0}' extension
uk: Вставити за допомогою розширення '{0}'

# chatAccessWithJustification
source: Justification: {1}
uk: Обґрунтування: {1}

# local
source: Extension Host
uk: Хост розширення

# remote
source: Extension Host (Remote)
uk: Хост розширення (віддалений)

# worker
source: Extension Host (Worker)
uk: Хост розширення (робочий процес)

# err.readonly
source: Unable to modify read-only file '{0}'
uk: Неможливо змінити файл тільки для читання '{0}'

# fileModifiedError
source: File Modified Since
uk: Файл змінено з

# extensionLabel
source: {0} (Extension)
uk: {0} (Розширення)

# status.extensionMessage
source: Extension Status
uk: Статус розширення

# extensionTelemetryLog
source: Extension Telemetry{0}
uk: Телеметрія розширення{0}

# launchFail.idMissingOnExtHost
source: Could not find the terminal with id {0} on the extension host
uk: Не вдалося знайти термінал з ідентифікатором {0} на хості розширення

# treeView.duplicateElement
source: Element with id {0} is already registered
uk: Елемент з ідентифікатором {0} вже зареєстровано

# tunnelPrivacy.private
source: Private
uk: Приватний

# tunnelPrivacy.public
source: Public
uk: Громадський

# updateerror
source: Extension '{0}' failed to update workspace folders: {1}
uk: Розширення '{0}' не вдалося оновити папки робочого простору: {1}

# contributes.jsonValidation
source: Contributes json schema configuration.
uk: Сприяє конфігурації схеми json.

# contributes.jsonValidation.fileMatch
source: The file pattern (or an array of patterns) to match, for example "package.json" or "*.launch". Exclusion patterns start with '!'
uk: Шаблон файлу (або масив шаблонів) для збігу, наприклад "package.json" або "*.launch". Шаблони виключення починаються з '!'

# contributes.jsonValidation.url
source: A schema URL ('http:', 'https:') or relative path to the extension folder ('./').
uk: URL схеми ('http:', 'https:') або відносний шлях до папки розширення ('./').

source: File Match
uk: Відповідність файлів

# invalid.fileMatch
source: 'configuration.jsonValidation.fileMatch' must be defined as a string or an array of strings.
uk: 'configuration.jsonValidation.fileMatch' повинен бути визначений як рядок або масив рядків.

# invalid.jsonValidation
source: 'configuration.jsonValidation' must be a array
uk: 'configuration.jsonValidation' має бути масивом

# invalid.path.1
source: Expected `contributes.{0}.url` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікувалося, що `contributes.{0}.url` ({1}) буде включено до папки розширення ({2}). Це може зробити розширення непортативним.

# invalid.url
source: 'configuration.jsonValidation.url' must be a URL or relative path
uk: 'configuration.jsonValidation.url' повинен бути URL або відносним шляхом

# invalid.url.fileschema
source: 'configuration.jsonValidation.url' is an invalid relative URL: {0}
uk: 'configuration.jsonValidation.url' є недійсною відносною URL-адресою: {0}

# invalid.url.schema
source: 'configuration.jsonValidation.url' must be an absolute URL or start with './' to reference schemas located in the extension.
uk: 'configuration.jsonValidation.url' повинен бути абсолютним URL або починатися з './', щоб посилатися на схеми, розташовані в розширенні.

source: JSON Validation
uk: Валідація JSON

source: Schema
uk: Схема

source: Device Code
uk: Код пристрою

# loopback
source: Loopback Server
uk: Сервер Loopback

# waitingForAuth
source: Open [{0}]({0}) in a new tab and paste your one-time code: {1}
uk: Відкрийте [{0}]({0}) у новій вкладці та вставте свій одноразовий код: {1}

# debug.terminal.title
source: Debug Process
uk: Процес налагодження

source: Test View 1
uk: Тестовий перегляд 1

source: test
uk: тест

source: Global
uk: Глобальний

source: Inspect Context Keys
uk: Перевірити ключі контексту

# largeStorageItemDetail
source: Scope: {0}, Target: {1}
uk: Обсяг: {0}, Мета: {1}

# logStorage
source: Log Storage Database Contents
uk: Записати вміст бази даних сховища

source: Log Working Copies
uk: Журнал робочих копій

source: Machine
uk: Машина

source: Profile
uk: Профіль

source: Remove Large Storage Database Entries...
uk: Видалити великі записи бази даних зберігання...

# removeLargeStorageEntriesButtonLabel
source: &&Remove
uk: &&Видалити

# removeLargeStorageEntriesConfirmRemove
source: Do you want to remove the selected storage entries from the database?
uk: Ви хочете видалити вибрані записи зберігання з бази даних?

# removeLargeStorageEntriesConfirmRemoveDetail
source: {0} This action is irreversible and may result in data loss!
uk: {0} Ця дія є незворотною і може призвести до втрати даних!

# removeLargeStorageEntriesPickerButton
source: Remove
uk: Видалити

# removeLargeStorageEntriesPickerDescriptionNoEntries
source: There are no large storage entries to remove.
uk: Немає великих записів сховища для видалення.

# removeLargeStorageEntriesPickerPlaceholder
source: Select large entries to remove from storage
uk: Виберіть великі записи для видалення з пам'яті

# screencastMode.fontSize
source: Controls the font size (in pixels) of the screencast mode keyboard.
uk: Контролює розмір шрифту (в пікселях) клавіатури в режимі запису екрану.

# screencastMode.keyboardOptions.description
source: Options for customizing the keyboard overlay in screencast mode.
uk: Опції для налаштування накладки клавіатури в режимі запису екрану.

# screencastMode.keyboardOptions.showCommandGroups
source: Show command group names, when commands are also shown.
uk: Показувати назви груп команд, коли також показуються команди.

# screencastMode.keyboardOptions.showCommands
source: Show command names.
uk: Показати назви команд.

# screencastMode.keyboardOptions.showKeybindings
source: Show keyboard shortcuts.
uk: Показати комбінації клавіш.

# screencastMode.keyboardOptions.showKeys
source: Show raw keys.
uk: Показати сирі ключі.

# screencastMode.keyboardOptions.showSingleEditorCursorMoves
source: Show single editor cursor move commands.
uk: Показати команди переміщення курсора одного редактора.

# screencastMode.keyboardOverlayTimeout
source: Controls how long (in milliseconds) the keyboard overlay is shown in screencast mode.
uk: Контролює, як довго (в мілісекундах) клавіатурний оверлей відображається в режимі запису екрану.

# screencastMode.location.verticalPosition
source: Controls the vertical offset of the screencast mode overlay from the bottom as a percentage of the workbench height.
uk: Контролює вертикальний зсув накладки режиму запису екрану від нижньої частини як відсоток висоти робочої поверхні.

# screencastMode.mouseIndicatorColor
source: Controls the color in hex (#RGB, #RGBA, #RRGGBB or #RRGGBBAA) of the mouse indicator in screencast mode.
uk: Контролює колір у шістнадцятковому форматі (#RGB, #RGBA, #RRGGBB або #RRGGBBAA) індикатора миші в режимі запису екрану.

# screencastMode.mouseIndicatorSize
source: Controls the size (in pixels) of the mouse indicator in screencast mode.
uk: Контролює розмір (в пікселях) індикатора миші в режимі запису екрану.

# screencastModeConfigurationTitle
source: Screencast Mode
uk: Режим запису екрану

source: Snapshot Tracked Disposables
uk: Сnapshot Tracked Disposables

# startTrackDisposables
source: Start Tracking Disposables
uk: Почати відстеження витратних матеріалів

# stopTrackDisposables
source: Stop Tracking Disposables
uk: Припинити відстеження витратних матеріалів

# storageLogDialogDetails
source: Open developer tools from the menu and select the Console tab.
uk: Відкрийте інструменти розробника з меню та виберіть вкладку Консоль.

# storageLogDialogMessage
source: The storage database contents have been logged to the developer tools.
uk: Вміст бази даних зберігання було зафіксовано в інструментах розробника.

source: Toggle Screencast Mode
uk: Переключити режим запису екрану

source: User
uk: Користувач

source: Workspace
uk: Робоча область

source: Ask @vscode
uk: Запитайте @vscode

source: Get Started with Accessibility Features
uk: Розпочніть роботу з функціями доступності

# keybindingsReference
source: Keyboard Shortcuts Reference
uk: Посилання на гарячі клавіші

# miDocumentation
source: &&Documentation
uk: &&Документація

# miKeyboardShortcuts
source: &&Keyboard Shortcuts Reference
uk: &&Посилання на клавіатурні скорочення

# miLicense
source: View &&License
uk: Переглянути &&ліцензію

# miPrivacyStatement
source: Privac&&y Statement
uk: Заява про пр&&иватність

# miTipsAndTricks
source: Tips and Tri&&cks
uk: Поради та підка&&зки

# miUserVoice
source: &&Search Feature Requests
uk: &&Пошук запитів на функції

# miVideoTutorials
source: &&Video Tutorials
uk: &&Відеоуроки

# miYouTube
source: &&Join Us on YouTube
uk: &&Приєднуйтесь до нас на YouTube

# newsletterSignup
source: Signup for the VS Code Newsletter
uk: Підпишіться на розсилку новин VS Code

# openDocumentationUrl
source: Documentation
uk: Документація

# openLicenseUrl
source: View License
uk: Переглянути ліцензію

# openPrivacyStatement
source: Privacy Statement
uk: Заява про конфіденційність

# openTipsAndTricksUrl
source: Tips and Tricks
uk: Поради та хитрощі

# openUserVoiceUrl
source: Search Feature Requests
uk: Пошук запитів на функції

# openVideoTutorialsUrl
source: Video Tutorials
uk: Відеоуроки

# openYouTubeUrl
source: Join Us on YouTube
uk: Приєднуйтесь до нас на YouTube

source: Active
uk: Активний

source: Activity Bar
uk: Панель активності

# activityBarLeft
source: Represents the activity bar in the left position
uk: Представляє панель активності у лівій позиції

# activityBarRight
source: Represents the activity bar in the right position
uk: Представляє панель активності у правій позиції

source: Align Quick Input Center
uk: Вирівняти Центр Швидкого Введення

source: Align Quick Input Top
uk: Вирівняти верхній швидкий ввід

source: Center
uk: Центр

# centerLayoutIcon
source: Represents centered layout mode
uk: Представляє режим вирівнювання по центру

# centerPanel
source: Center
uk: Центр

source: Centered Layout
uk: Центрований макет

source: Close
uk: Закрити

# cofigureLayoutIcon
source: Icon represents workbench layout configuration.
uk: Іконка представляє конфігурацію макету робочого столу.

# compositePart.hideSideBarLabel
source: Hide Primary Side Bar
uk: Сховати основну бічну панель

source: Configure Editors
uk: Налаштувати редактори

source: Configure Layout
uk: Налаштувати макет

source: Configure Tabs
uk: Налаштувати вкладки

source: Customize Layout...
uk: Налаштувати макет...

# customizeLayoutQuickPickTitle
source: Customize Layout
uk: Налаштувати макет

source: Decrease Editor Height
uk: Зменшити висоту редактора

source: Decrease Editor Width
uk: Зменшити ширину редактора

# decreaseViewSize
source: Decrease Current View Size
uk: Зменшити розмір поточного перегляду

source: Editor Actions Position
uk: Позиція дій редактора

# fullScreenIcon
source: Represents full screen
uk: Представляє повний екран

source: Full Screen
uk: На весь екран

# hideEditorActons
source: Hide Editor Actions
uk: Сховати дії редактора

# hideEditorActonsDescription
source: Hide Editor Actions in the tab and title bar
uk: Сховати дії редактора на вкладці та у заголовку

source: Hide Editor Tabs
uk: Сховати вкладки редактора

# hideEditorTabsDescription
source: Hide Tab Bar
uk: Сховати панель вкладок

# hideEditorTabsZenMode
source: Hide Editor Tabs in Zen Mode
uk: Сховати вкладки редактора в режимі Zen

# hideEditorTabsZenModeDescription
source: Hide Tab Bar in Zen Mode
uk: Сховати панель вкладок у режимі Zen

source: Increase Editor Height
uk: Збільшити висоту редактора

source: Increase Editor Width
uk: Збільшити ширину редактора

# increaseViewSize
source: Increase Current View Size
uk: Збільшити розмір поточного вигляду

# justifyPanel
source: Justify
uk: Вирівняти

# layoutModes
source: Modes
uk: Режими

# leftPanel
source: Left
uk: Зліва

# leftSideBar
source: Left
uk: Зліва

source: Menu Bar
uk: Панель меню

# menuBarIcon
source: Represents the menu bar
uk: Представляє панель меню

# miAppearance
source: &&Appearance
uk: &&Зовнішній вигляд

# miMenuBar
source: Menu &&Bar
uk: Рядок &&меню

# miMenuBarNoMnemonic
source: Menu Bar
uk: Панель меню

# miMoveSidebarLeft
source: &&Move Primary Side Bar Left
uk: &&Перемістити основну бічну панель вліво

# miMoveSidebarRight
source: &&Move Primary Side Bar Right
uk: &&Перемістити основну бокову панель вправо

# miShowEditorArea
source: Show &&Editor Area
uk: Показати &&область редактора

# miStatusbar
source: S&&tatus Bar
uk: &&Рядок статусу

# miToggleCenteredLayout
source: &&Centered Layout
uk: &&Центрований макет

# miToggleZenMode
source: Zen Mode
uk: Режим Зен

# move second sidebar left
source: Move Secondary Side Bar Left
uk: Перемістити бокову панель праворуч

# move second sidebar right
source: Move Secondary Side Bar Right
uk: Перемістити бічну панель праворуч
