Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminal.xlf
Languages: uk

# terminalDescription
source: Controls the terminal description, which appears to the right of the title. Variables are substituted based on the context:
uk: Контролює опис терміналу, який з'являється праворуч від заголовка. Змінні підставляються на основі контексту:

# terminalIntegratedConfigurationTitle
source: Integrated Terminal
uk: Інтегрований термінал

# terminalTitle
source: Controls the terminal title. Variables are substituted based on the context:
uk: Контролює заголовок терміналу. Змінні підставляються на основі контексту:

# workspaceFolder
source: the workspace in which the terminal was launched.
uk: робоче середовище, в якому був запущений термінал.

# workspaceFolderName
source: the `name` of the workspace in which the terminal was launched.
uk: `name` робочого простору, в якому було запущено термінал.

# inTerminalRunCommandPickerContextKey
source: Whether the terminal run command picker is currently open.
uk: Чи відкритий наразі вибір команди терміналу.

# isSplitTerminalContextKey
source: Whether the focused tab's terminal is a split terminal.
uk: Чи є термінал фокусованої вкладки розділеним терміналом.

# terminalAltBufferActive
source: Whether the terminal's alt buffer is active.
uk: Чи активний альтернативний буфер термінала.

# terminalCountContextKey
source: The current number of terminals.
uk: Поточна кількість терміналів.

# terminalEditorFocusContextKey
source: Whether a terminal in the editor area is focused.
uk: Чи зосереджено термінал у області редактора.

# terminalFocusContextKey
source: Whether the terminal is focused.
uk: Чи сфокусований термінал.

# terminalFocusInAnyContextKey
source: Whether any terminal is focused, including detached terminals used in other UI.
uk: Чи зосереджено будь-який термінал, включаючи відокремлені термінали, що використовуються в іншому інтерфейсі користувача.

# terminalProcessSupportedContextKey
source: Whether terminal processes can be launched in the current workspace.
uk: Чи можуть термінальні процеси бути запущені в поточному робочому просторі.

# terminalShellIntegrationEnabled
source: Whether shell integration is enabled in the active terminal
uk: Чи увімкнено інтеграцію оболонки в активному терміналі

# terminalShellTypeContextKey
source: The shell type of the active terminal, this is set if the type can be detected.
uk: Тип оболонки активного терміналу, це встановлюється, якщо тип можна виявити.

# terminalSuggestWidgetVisible
source: Whether the terminal's suggest widget is visible.
uk: Чи видимий віджет пропозицій терміналу.

# terminalTabsFocusContextKey
source: Whether the terminal tabs widget is focused.
uk: Чи зосереджено віджет вкладок термінала.

# terminalTabsSingularSelectedContextKey
source: Whether one terminal is selected in the terminal tabs list.
uk: Чи вибрано один термінал у списку вкладок терміналів.

# terminalTextSelectedContextKey
source: Whether text is selected in the active terminal.
uk: Чи текст вибрано в активному терміналі.

# terminalTextSelectedInFocusedContextKey
source: Whether text is selected in a focused terminal.
uk: Чи текст вибрано у фокусованому терміналі.

# terminalViewShowing
source: Whether the terminal view is showing
uk: Чи відображає термінальний вигляд

# currentSessionCategory
source: current session
uk: поточна сесія

source: Do Not Show Again
uk: Не показувати знову

source: Kill Terminal
uk: Вбити термінал

# killTerminal.short
source: Kill
uk: Вбити

source: Local
uk: вказує на локальний термінал у віддаленому робочому просторі.

# moveIntoNewWindow
source: Move Terminal into New Window
uk: Перемістити термінал у нове вікно

# moveToEditor
source: Move Terminal into Editor Area
uk: Перемістити термінал у область редактора

# previousSessionCategory
source: previous session
uk: попередня сесія

# splitTerminal.short
source: Split
uk: Розділити

source: Task
uk: вказує, що цей термінал пов'язаний із завданням.

# terminal.new
source: New Terminal
uk: Новий термінал

# terminalCategory
source: Terminal
uk: Термінал

source: Unsplit Terminal
uk: Нескладений термінал

# workbench.action.terminal.focus
source: Focus Terminal
uk: Фокус Терминал

# workbench.action.terminal.focusAndHideAccessibleBuffer
source: Focus Terminal and Hide Accessible Buffer
uk: Сфокусувати термінал і приховати доступний буфер

# workbench.action.terminal.focusHover
source: Focus Hover
uk: Фокус Наведення

# workbench.action.terminal.moveToTerminalPanel
source: Move Terminal into Panel
uk: Перемістити термінал у панель

# workbench.action.terminal.newWithCwd
source: Create New Terminal Starting in a Custom Working Directory
uk: Створити новий термінал, починаючи з користувацького робочого каталогу

# workbench.action.terminal.rename
source: Rename...
uk: Перейменувати...

# workbench.action.terminal.renameWithArg
source: Rename the Currently Active Terminal
uk: Перейменувати активний термінал

# workbench.action.terminal.scrollToNextCommand
source: Scroll To Next Command
uk: Прокрутити до наступної команди

# workbench.action.terminal.scrollToPreviousCommand
source: Scroll To Previous Command
uk: Прокрутити до попередньої команди

# workbench.action.terminal.sendSequence
source: Send Custom Sequence To Terminal
uk: Відправити користувацьку послідовність до терміналу

# workbench.action.terminal.sizeToContentWidthInstance
source: Toggle Size to Content Width
uk: Перемкнути розмір на ширину вмісту

# workbench.action.terminal.newLocal
source: Create New Integrated Terminal (Local)
uk: Створити новий інтегрований термінал (локальний)
