Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

# instruction.file.reason.allFiles
source: Automatically attached as pattern is **
uk: Автоматично прикріплено, оскільки шаблон є **

# instruction.file.reason.copilot
source: Automatically attached as setting {0} is enabled
uk: Автоматично прикріплено, оскільки налаштування {0} увімкнено.

# instruction.file.reason.referenced
source: Referenced by {0}
uk: Посилання на {0}

# instruction.file.reason.specificFile
source: Automatically attached as pattern {0} matches {1}
uk: Автоматично прикріплено, оскільки шаблон {0} відповідає {1}

# chat.prompt.frontMatter.background.description
source: Background color of a Front Matter header block.
uk: Колір фону блоку заголовка Front Matter.

# chat.prompt.frontMatter.inactiveBackground.description
source: Background color of an inactive Front Matter header block.
uk: Колір фону неактивного блоку заголовка Front Matter.

# promptHeaderDiagnosticsProvider.modeNotFound
source: Unknown mode '{0}'. Available modes: {1}
uk: Невідомий режим '{0}'. Доступні режими: {1}

# promptHeaderDiagnosticsProvider.modelNotFound
source: Unknown model '{0}'
uk: Невідома модель '{0}'

# promptHeaderDiagnosticsProvider.modelNotSuited
source: Model '{0}' is not suited for agent mode
uk: Модель '{0}' не підходить для режиму агента.

# promptHeaderDiagnosticsProvider.toolNotFound
source: Unknown tool '{0}'
uk: Невідомий інструмент '{0}'

# modelFamily
source: - Family: {0}
uk: - Сім'я: {0}

# modelName
source: - Name: {0}
uk: - Ім'я: {0}

# modelVendor
source: - Vendor: {0}
uk: - Постачальник: {0}

# promptHeader.instructions.applyToRange
source: One or more glob pattern (separated by comma) that describe for which files the instructions apply to. Based on these patterns, the file is automatically included in the prompt, when the context contains a file that matches one or more of these patterns. Use `**` when you want this file to always be added. Example: **/*.ts, **/*.js, client/**
uk: Один або кілька шаблонів glob (розділених комою), які описують, до яких файлів застосовуються інструкції. На основі цих шаблонів файл автоматично включається в підказку, коли контекст містить файл, що відповідає одному або кільком з цих шаблонів. Використовуйте `**`, коли ви хочете, щоб цей файл завжди додавався. Приклад: **/*.ts, **/*.js, client/**

# promptHeader.instructions.description
source: The description of the instruction file. It can be used to provide additional context or information about the instructions and is passed to the language model as part of the prompt.
uk: Опис файлу інструкцій. Його можна використовувати для надання додаткового контексту або інформації про інструкції, і він передається мовній моделі як частина запиту.

# promptHeader.mode.description
source: The description of the mode file. It can be used to provide additional context or information about the mode to the mode author.
uk: Опис файлу режиму. Його можна використовувати для надання додаткового контексту або інформації про режим автору режиму.

# promptHeader.mode.model
source: The model to use in this mode.
uk: Модель, яку слід використовувати в цьому режимі.

# promptHeader.mode.tools
source: The tools to use in this mode.
uk: Інструменти, які слід використовувати в цьому режимі.

# promptHeader.prompt.description
source: The description of the prompt file. It can be used to provide additional context or information about the prompt to the prompt author.
uk: Опис файлу запиту. Його можна використовувати для надання додаткового контексту або інформації про запит автору запиту.

# promptHeader.prompt.mode
source: The mode to use in this prompt.
uk: Режим, який слід використовувати в цьому запиті.

# promptHeader.prompt.mode.builtInDesc
source: Built-in chat mode
uk: Вбудований режим чату

# promptHeader.prompt.mode.builtin
source: **Built-in modes:**
uk: **Вбудовані режими:**

# promptHeader.prompt.mode.custom
source: **Custom modes:**
uk: **Користувацькі режими:**

# promptHeader.prompt.mode.customDesc
source: Custom chat mode
uk: Користувацький режим чату

# promptHeader.prompt.mode.description
source: The chat mode to use when running this prompt.
uk: Режим чату, який слід використовувати при виконанні цього запиту.

# promptHeader.prompt.model
source: The model to use in this prompt.
uk: Модель, яку слід використовувати в цьому запиті.

# promptHeader.prompt.tools
source: The tools to use in this prompt.
uk: Інструменти, які слід використовувати в цьому запиті.

source: File not found.
uk: Файл не знайдено.

# prompt.header.diagnostics.parsing-error
source: Failed to parse prompt header: {0}
uk: Не вдалося розібрати заголовок запиту: {0}

# prompt.header.diagnostics.unexpected-token
source: Unexpected token '{0}'.
uk: Несподіваний токен '{0}'.

# prompt.header.metadata.diagnostics.duplicate-record
source: Duplicate property '{0}' will be ignored.
uk: Дублікована властивість '{0}' буде проігнорована.

# prompt.header.metadata.diagnostics.unknown-record
source: Unknown property '{0}' will be ignored.
uk: Невідома властивість '{0}' буде проігнорована.

# prompt.header.metadata.applyTo.diagnostics.non-valid-glob
source: Invalid glob pattern '{0}'.
uk: Недійсний шаблон глобуса '{0}'.

# prompt.header.metadata.string.diagnostics.invalid-language
source: The '{0}' header property is only valid in instruction files.
uk: Властивість заголовка '{0}' дійсна лише у файлах інструкцій.

# prompt.header.metadata.enum.diagnostics.invalid-value
source: The property '{0}' must be one of {1}, got '{2}'.
uk: Властивість '{0}' повинна бути однією з {1}, отримано '{2}'.

# prompt.header.metadata.string.diagnostics.invalid-value-type
source: The property '{0}' must be of type '{1}', got '{2}'.
uk: Властивість '{0}' повинна бути типу '{1}', отримано '{2}'.

# prompt.header.metadata.tools.diagnostics.duplicate-tool-name
source: Duplicate tool name '{0}'.
uk: Дублювати назву інструмента '{0}'.

# prompt.header.metadata.tools.diagnostics.empty-tool-name
source: Tool name cannot be empty.
uk: Назва інструмента не може бути порожньою.

# prompt.header.metadata.tools.diagnostics.invalid-tool-name-type
source: Unexpected tool name '{0}', expected a string literal.
uk: Несподіване ім'я інструмента '{0}', очікувався рядковий літерал.

# prompt.header.metadata.tools.diagnostics.invalid-value-type
source: Must be an array of tool names, got '{0}'.
uk: Повинен бути масив назв інструментів, отримано '{0}'.

# prompt.header.metadata.mode.diagnostics.incompatible-with-tools
source: Tools can not be used in '{0}' mode and will be ignored.
uk: Інструменти не можуть бути використані в режимі '{0}' і будуть ігноруватися.

source: broken
uk: зламаний

source: recursive
uk: рекурсивний

# workbench.reusable-prompts.top-error.cannot-read
source: Cannot read '{0}'.{1}
uk: Не вдається прочитати '{0}'.{1}

# workbench.reusable-prompts.top-error.child.direct
source: Contains
uk: Містить

# workbench.reusable-prompts.top-error.child.final-message
source: {0} a {1} link to '{2}' that will be ignored.{3}
uk: {0} a {1} посилання на '{2}', яке буде проігноровано.{3}

# workbench.reusable-prompts.top-error.child.indirect
source: Indirectly referenced prompt '{0}' contains
uk: Непрямо згаданий запит '{0}' містить

# workbench.reusable-prompts.top-error.more-issues-label
source: (+{0} more issues)
uk: (+{0} інших проблем)

# workbench.reusable-prompts.top-error.open-failed
source: Cannot open '{0}'.{1}
uk: Не вдалося відкрити '{0}'.{1}

# workbench.reusable-prompts.top-error.recursive-reference
source: Recursion to itself.
uk: Рекурсія до самої себе.

# prompt.file.detail
source: Prompt file: {0}
uk: Файл запиту: {0}

# promptParser.notCompleted
source: Prompt parser for {0} did not complete.
uk: Парсер запиту для {0} не завершився.

# canBeReferencedInPrompt
source: If true, this tool shows up as an attachment that the user can add manually to their request. Chat participants will receive the tool in {0}.
uk: Якщо це правда, цей інструмент з'являється як вкладення, яке користувач може додати вручну до свого запиту. Учасники чату отримають інструмент у {0}.

# condition
source: Condition which must be true for this tool to be enabled. Note that a tool may still be invoked by another extension even when its `when` condition is false.
uk: Умова, яка повинна бути істинною для активації цього інструменту. Зверніть увагу, що інструмент все ще може бути викликаний іншою розширенням, навіть коли його умова `when` є хибною.

# descriptions
source: Description
uk: Опис

# icon
source: An icon that represents this tool. Either a file path, an object with file paths for dark and light themes, or a theme icon reference, like `\$(zap)`
uk: Іконка, яка представляє цей інструмент. Це може бути або шлях до файлу, об'єкт з шляхами до файлів для темної та світлої тем, або посилання на іконку теми, наприклад, `\$(zap)`

# icon.dark
source: Icon path when a dark theme is used
uk: Шлях до значка, коли використовується темна тема

# icon.light
source: Icon path when a light theme is used
uk: Шлях до іконки, коли використовується світла тема

# langModelToolSets
source: Language Model Tool Sets
uk: Набори інструментів мовних моделей

# langModelTools
source: Language Model Tools
uk: Інструменти мовної моделі

source: Name
uk: Ім'я

# parametersSchema
source: A JSON schema for the input this tool accepts. The input must be an object at the top level. A particular language model may not support all JSON schema features. See the documentation for the language model family you are using for more information.
uk: Схема JSON для вхідних даних, які приймає цей інструмент. Вхідні дані повинні бути об'єктом на верхньому рівні. Конкретна мовна модель може не підтримувати всі функції схеми JSON. Дивіться документацію для сім'ї мовних моделей, яку ви використовуєте, для отримання додаткової інформації.

# reference
source: Reference Name
uk: Ім'я посилання

# toolDisplayName
source: A human-readable name for this tool that may be used to describe it in the UI.
uk: Людинозрозуміла назва для цього інструменту, яка може бути використана для його опису в інтерфейсі.

# toolModelDescription
source: A description of this tool that may be used by a language model to select it.
uk: Опис цього інструменту, який може бути використаний мовною моделлю для його вибору.

# toolName
source: A unique name for this tool. This name must be a globally unique identifier, and is also used as a name when presenting this tool to a language model.
uk: Унікальна назва для цього інструменту. Ця назва повинна бути глобально унікальним ідентифікатором і також використовується як назва при представленні цього інструменту мовній моделі.

# toolName2
source: If {0} is enabled for this tool, the user may use '#' with this name to invoke the tool in a query. Otherwise, the name is not required. Name must not contain whitespace.
uk: Якщо {0} увімкнено для цього інструмента, користувач може використовувати '#' з цим ім'ям, щоб викликати інструмент у запиті. В іншому випадку ім'я не є обов'язковим. Ім'я не повинно містити пробілів.

# toolSetDescription
source: A description of this tool set.
uk: Опис цього набору інструментів.

# toolSetIcon
source: An icon that represents this tool set, like `$(zap)`
uk: Іконка, яка представляє цей набір інструментів, як `$(zap)`

# toolSetName
source: A name for this tool set. Used as reference and should not contain whitespace.
uk: ToolSet: {0}

# toolSetTools
source: A list of tools or tool sets to include in this tool set. Cannot be empty and must reference tools by their `toolReferenceName`.
uk: Список інструментів або наборів інструментів, які потрібно включити в цей набір інструментів. Не може бути порожнім і повинен посилатися на інструменти за їхнім `toolReferenceName`.

# toolTableDescription
source: Description
uk: Опис

# toolTableDisplayName
source: Display Name
uk: Ім'я для відображення

# toolTableName
source: Name
uk: Ім'я

# toolTags
source: A set of tags that roughly describe the tool's capabilities. A tool user may use these to filter the set of tools to just ones that are relevant for the task at hand, or they may want to pick a tag that can be used to identify just the tools contributed by this extension.
uk: Набір тегів, які приблизно описують можливості інструмента. Користувач інструмента може використовувати їх для фільтрації набору інструментів, залишаючи лише ті, що є релевантними для поточного завдання, або ж він може вибрати тег, який можна використовувати для ідентифікації лише тих інструментів, що були додані цим розширенням.

# toolUserDescription
source: A description of this tool that may be shown to the user.
uk: Опис цього інструменту, який може бути показаний користувачу.

source: Tools
uk: Інструменти

# vscode.extension.contributes.toolSets
source: Contributes a set of language model tools that can be used together.
uk: Вносить набір інструментів мовної моделі, які можна використовувати разом.

# vscode.extension.contributes.tools
source: Contributes a tool that can be invoked by a language model in a chat session, or from a standalone command. Registered tools can be used by all extensions.
uk: Вносить інструмент, який може бути викликаний мовною моделлю в чат-сесії або з окремої команди. Зареєстровані інструменти можуть використовуватися всіма розширеннями.

# voiceChatInProgress
source: A speech-to-text session is in progress for chat.
uk: Триває сеанс перетворення мови в текст для чату.

# workbench.action.chat.openStorageFolder.label
source: Open Chat Storage Folder
uk: Відкрити папку збереження чату

# keywordActivation.status.active
source: Listening to 'Hey Code'...
uk: Слухаю 'Hey Code'...

# keywordActivation.status.inactive
source: Waiting for voice chat to end...
uk: Очікування закінчення голосового чату...

# keywordActivation.status.name
source: Voice Keyword Activation
uk: Активація голосових ключових слів

# listening
source: I'm listening
uk: Я слухаю

# scopedChatSynthesisInProgress
source: Defined as a location where voice recording from microphone is in progress for voice chat. This key is only defined scoped, per chat context.
uk: Визначено як місце, де триває запис голосу з мікрофона для голосового чату. Цей ключ визначений лише в межах контексту чату.

# scopedVoiceChatGettingReady
source: True when getting ready for receiving voice input from the microphone for voice chat. This key is only defined scoped, per chat context.
uk: Істинно, коли готується до отримання голосового вводу з мікрофона для голосового чату. Цей ключ визначений лише в межах, відповідно до контексту чату.

# scopedVoiceChatInProgress
source: Defined as a location where voice recording from microphone is in progress for voice chat. This key is only defined scoped, per chat context.
uk: Визначено як місце, де триває запис голосу з мікрофона для голосового чату. Цей ключ визначено лише в контексті чату.

# voice.keywordActivation
source: Controls whether the keyword phrase 'Hey Code' is recognized to start a voice chat session. Enabling this will start recording from the microphone but the audio is processed locally and never sent to a server.
uk: Контролює, чи розпізнається ключова фраза 'Hey Code' для початку сеансу голосового чату. Увімкнення цього параметра розпочне запис з мікрофона, але аудіо обробляється локально і ніколи не надсилається на сервер.

# voice.keywordActivation.chatInContext
source: Keyword activation is enabled and listening for 'Hey Code' to start a voice chat session in the active editor or view depending on keyboard focus.
uk: Активація ключового слова увімкнена і слухає 'Привіт Код', щоб розпочати сеанс голосового чату в активному редакторі або перегляді в залежності від фокусу клавіатури.

# voice.keywordActivation.chatInView
source: Keyword activation is enabled and listening for 'Hey Code' to start a voice chat session in the chat view.
uk: Активація ключового слова увімкнена і слухає 'Привіт Код', щоб розпочати голосову бесіду в режимі чату.

# voice.keywordActivation.inlineChat
source: Keyword activation is enabled and listening for 'Hey Code' to start a voice chat session in the active editor if possible.
uk: Активація ключового слова увімкнена, і система слухає 'Hey Code', щоб розпочати сеанс голосового чату в активному редакторі, якщо це можливо.

# voice.keywordActivation.off
source: Keyword activation is disabled.
uk: Активація ключового слова вимкнена.

# voice.keywordActivation.quickChat
source: Keyword activation is enabled and listening for 'Hey Code' to start a voice chat session in the quick chat.
uk: Активація ключового слова увімкнена і слухає 'Привіт Код', щоб розпочати сеанс голосового чату в швидкому чаті.

# workbench.action.chat.holdToVoiceChatInChatView.label
source: Hold to Voice Chat in Chat View
uk: Утримуйте для голосового чату в режимі чату

# workbench.action.chat.inlineVoiceChat
source: Inline Voice Chat
uk: Вбудований голосовий чат

# workbench.action.chat.quickVoiceChat.label
source: Quick Voice Chat
uk: Швидкий голосовий чат

# workbench.action.chat.readChatResponseAloud
source: Read Aloud
uk: Читати вголос

# workbench.action.chat.startVoiceChat.label
source: Start Voice Chat
uk: Почати голосовий чат

# workbench.action.chat.stopListening.label
source: Stop Listening
uk: Припинити прослуховування

# workbench.action.chat.stopListeningAndSubmit.label
source: Stop Listening and Submit
uk: Припинити слухати та надіслати

# workbench.action.chat.stopReadChatItemAloud
source: Stop Reading Aloud
uk: Припиніть читати вголос

# workbench.action.chat.voiceChatInView.label
source: Voice Chat in Chat View
uk: Голосовий чат у вигляді чату

# workbench.action.speech.stopReadAloud
source: Stop Reading Aloud
uk: Припиніть читати вголос

# changeWorkspace.detail
source: The chat request will stop if you change the workspace.
uk: Запит на чат зупиниться, якщо ви зміните робочий простір.

# changeWorkspace.message
source: A chat request is in progress. Are you sure you want to change the workspace?
uk: Запит на чат виконується. Ви впевнені, що хочете змінити робочий простір?

# chatRequestInProgress
source: A chat request is in progress.
uk: Запит на чат обробляється.

# closeTheWindow.detail
source: The chat request will stop if you close the window.
uk: Запит на чат зупиниться, якщо ви закриєте вікно.

# closeTheWindow.message
source: A chat request is in progress. Are you sure you want to close the window?
uk: Запит на чат у процесі. Ви впевнені, що хочете закрити вікно?

# exit.detail
source: The chat request will stop if you exit.
uk: Запит на чат зупиниться, якщо ви вийдете.

# exit.message
source: A chat request is in progress. Are you sure you want to exit?
uk: Запит на чат виконується. Ви впевнені, що хочете вийти?

# quit.detail
source: The chat request will stop if you quit.
uk: Запит на чат зупиниться, якщо ви вийдете.

# quit.message
source: A chat request is in progress. Are you sure you want to quit?
uk: Запит на чат у процесі. Ви впевнені, що хочете вийти?

# reloadTheWindow.detail
source: The chat request will stop if you reload the window.
uk: Запит на чат зупиниться, якщо ви перезавантажите вікно.

# reloadTheWindow.message
source: A chat request is in progress. Are you sure you want to reload the window?
uk: Запит на чат у процесі. Ви впевнені, що хочете перезавантажити вікно?

# fetchWebPage.binaryNotSupported
source: Binary files are not supported at the moment.
uk: Бінарні файли наразі не підтримуються.

# fetchWebPage.confirmationMessage.plural
source: Web content may contain malicious code or attempt prompt injection attacks.
uk: Веб-контент може містити шкідливий код або намагатися здійснити атаки з використанням ін'єкцій запитів.

# fetchWebPage.confirmationTitle.plural
source: Fetch web pages?
uk: Отримати веб-сторінки?

# fetchWebPage.confirmationTitle.singular
source: Fetch web page?
uk: Отримати веб-сторінку?

# fetchWebPage.invalidUrl
source: Invalid URL
uk: Недійсний URL

# fetchWebPage.invocationMessage.plural
source: Fetching {0} resources
uk: Отримання {0} ресурсів

# fetchWebPage.invocationMessage.singular
source: Fetching {0}
uk: Отримання {0}

# fetchWebPage.invocationMessage.singularAsLink
source: Fetching [resource]({0})
uk: Отримання [ресурсу]({0})

# fetchWebPage.modelDescription
source: Fetches the main content from a web page. This tool is useful for summarizing or analyzing the content of a webpage.
uk: Отримує основний контент з веб-сторінки. Цей інструмент корисний для підсумовування або аналізу вмісту веб-сторінки.

# fetchWebPage.noValidUrls
source: No valid URLs provided.
uk: Не надано дійсних URL-адрес.

# fetchWebPage.pastTenseMessage.plural
source: Fetched {0} resources, but the following were invalid URLs: {1}
uk: Отримано {0} ресурсів, але наступні були недійсними URL-адресами: {1}

# fetchWebPage.pastTenseMessage.singular
source: Fetched resource, but the following was an invalid URL: {0}
uk: Отримано ресурс, але наступний URL є недійсним: {0}

# fetchWebPage.pastTenseMessageResult.plural
source: Fetched {0} resources
uk: Отримано {0} ресурсів

# fetchWebPage.pastTenseMessageResult.singular
source: Fetched {0}
uk: Отримано {0}

# fetchWebPage.pastTenseMessageResult.singularAsLink
source: Fetched [resource]({0})
uk: Отримано [ресурс]({0})

# fetchWebPage.urlsDescription
source: An array of URLs to fetch content from.
uk: Масив URL-адрес для отримання контенту.
