Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench.xlf
Languages: uk

# toggle.commandCenter
source: Command Center
uk: Центр управління

# toggle.commandCenterDescription
source: Toggle visibility of the Command Center in title bar
uk: Перемикання видимості Центру управління в рядку заголовка

# toggle.customTitleBar
source: Custom Title Bar
uk: Користувацька панель заголовка

# toggle.editorActions
source: Editor Actions
uk: Дії редактора

# toggle.hideCustomTitleBar
source: Hide Custom Title Bar
uk: Сховати користувацьку заголовну панель

# toggle.hideCustomTitleBarInFullScreen
source: Hide Custom Title Bar In Full Screen
uk: Сховати користувацьку заголовну панель у повноекранному режимі

# toggle.layout
source: Layout Controls
uk: Елементи управління макетом

# toggle.layoutDescription
source: Toggle visibility of the Layout Controls in title bar
uk: Перемикання видимості елементів керування макетом у заголовку

# toggle.navigation
source: Navigation Controls
uk: Елементи керування навігацією

# toggle.navigationDescription
source: Toggle visibility of the Navigation Controls in title bar
uk: Перемикати видимість елементів керування навігацією в заголовку

# ariaLabelTitleActions
source: Title actions
uk: Дії заголовка

source: Focus Title Bar
uk: Заголовок фокусу

# devExtensionWindowTitlePrefix
source: [Extension Development Host]
uk: [Хост для розробки розширень]

# userIsAdmin
source: [Administrator]
uk: [Адміністратор]

# userIsSudo
source: [Superuser]
uk: [Суперкористувач]

source: Checked
uk: Перевірено

source: Unchecked
uk: Неперевірено

source: Collapse All
uk: Сховати все

# command-error
source: Error running command {1}: {0}. This is likely caused by the extension that contributes {1}.
uk: Помилка виконання команди {1}: {0}. Це, ймовірно, викликано розширенням, яке додає {1}.

# no-dataprovider
source: There is no data provider registered that can provide view data.
uk: Не зареєстровано жодного постачальника даних, який може надати дані перегляду.

source: Refresh
uk: Оновити

# treeView.enableCollapseAll
source: Whether the tree view with id {0} enables collapse all.
uk: Чи дозволяє дерево з ідентифікатором {0} згортати все.

# treeView.enableRefresh
source: Whether the tree view with id {0} enables refresh.
uk: Чи дозволяє дерево з ідентифікатором {0} оновлення.

# treeView.toggleCollapseAll
source: Whether collapse all is toggled for the tree view with id {0}.
uk: Чи згорнути все, якщо для дерева з ідентифікатором {0} увімкнено.

source: More Filters...
uk: Більше фільтрів...

# viewAccessibilityHelp
source: Use Alt+F1 for accessibility help {0}
uk: Використовуйте Alt+F1 для допомоги з доступністю {0}

# viewPaneContainerCollapsedIcon
source: Icon for a collapsed view pane container.
uk: Іконка для контейнера згорнутого вікна перегляду.

# viewPaneContainerExpandedIcon
source: Icon for an expanded view pane container.
uk: Іконка для контейнера розширеного перегляду.

# viewToolbarAriaLabel
source: {0} actions
uk: {0} дій

# viewMoveDown
source: Move View Down
uk: Перемістити перегляд вниз

# viewMoveLeft
source: Move View Left
uk: Перемістити вигляд вліво

# viewMoveRight
source: Move View Right
uk: Перемістити вид вправо

# viewMoveUp
source: Move View Up
uk: Перемістити перегляд вгору

# viewsMove
source: Move Views
uk: Перемістити перегляди

# inQuickOpen
source: Whether keyboard focus is inside the quick open control
uk: Чи знаходиться фокус клавіатури всередині елемента швидкого відкриття

# reset
source: Reset User Data
uk: Скинути дані користувача

# reset user data message
source: Would you like to reset your data (settings, keybindings, extensions, snippets and UI State) and reload?
uk: Ви хочете скинути свої дані (налаштування, прив'язки клавіш, розширення, фрагменти та стан інтерфейсу) і перезавантажити?

# closeWindowButtonLabel
source: &&Close Window
uk: &&Закрити вікно

# closeWindowMessage
source: Are you sure you want to close the window?
uk: Ви впевнені, що хочете закрити вікно?

# doNotAskAgain
source: Do not ask me again
uk: Не питай мене знову

# exitButtonLabel
source: &&Exit
uk: &&Вихід

# openExternalDialogButtonInstall.v3
source: &&Install
uk: &&Встановити

# openExternalDialogButtonRetry.v2
source: &&Try Again
uk: &&Спробуйте ще раз

# openExternalDialogDetail.v2
source: We launched {0} on your computer. If {1} did not launch, try again or install it below.
uk: Ми запустили {0} на вашому комп'ютері. Якщо {1} не запустився, спробуйте ще раз або встановіть його нижче.

# openExternalDialogDetailNoInstall
source: We launched {0} on your computer. If {1} did not launch, try again below.
uk: Ми запустили {0} на вашому комп'ютері. Якщо {1} не запустився, спробуйте ще раз нижче.

# openExternalDialogTitle
source: All done. You can close this tab now.
uk: Все готово. Тепер ви можете закрити цю вкладку.

# quitButtonLabel
source: &&Quit
uk: &&Вихід

# quitMessage
source: Are you sure you want to exit?
uk: Ви впевнені, що хочете вийти?

# quitMessageMac
source: Are you sure you want to quit?
uk: Ви впевнені, що хочете вийти?

source: &&Reload
uk: Перезавантажити вікно

source: &&Retry
uk: Спробуйте ще раз

# shutdownError
source: An unexpected error occurred that requires a reload of this page.
uk: Сталася несподівана помилка, яка вимагає перезавантаження цієї сторінки.

# shutdownErrorDetail
source: The workbench was unexpectedly disposed while running.
uk: Робочий стіл був несподівано видалений під час виконання.

# unableToOpenExternal
source: The browser blocked opening a new tab or window. Press 'Retry' to try again.
uk: Браузер заблокував відкриття нової вкладки або вікна. Натисніть 'Спробувати знову', щоб спробувати ще раз.

# unableToOpenWindowDetail
source: Please allow pop-ups for this website in your [browser settings]({0}).
uk: Будь ласка, дозвольте спливаючі вікна для цього веб-сайту у ваших [налаштуваннях браузера]({0}).

# activeEditorLong
source: `${activeEditorLong}`: the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt).
uk: `${activeEditorLong}`: повний шлях до файлу (наприклад, /Users/Development/myFolder/myFileFolder/myFile.txt).

# activeEditorMedium
source: `${activeEditorMedium}`: the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt).
uk: `${activeEditorMedium}`: шлях до файлу відносно папки робочого простору (наприклад, myFolder/myFileFolder/myFile.txt).

# activeEditorShort
source: `${activeEditorShort}`: the file name (e.g. myFile.txt).
uk: `${activeEditorShort}`: ім'я файлу (наприклад, myFile.txt).

# activeEditorState
source: `${activeEditorState}`: provides information about the state of the active editor (e.g. modified). This will be appended by default when in screen reader mode with {0} enabled.
uk: `${activeEditorState}`: надає інформацію про стан активного редактора (наприклад, змінено). Це буде додано за замовчуванням, коли режим читача екрану увімкнено з {0}.

# activeFolderLong
source: `${activeFolderLong}`: the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder).
uk: `${activeFolderLong}`: повний шлях до папки, в якій міститься файл (наприклад, /Users/Development/myFolder/myFileFolder).

# activeFolderMedium
source: `${activeFolderMedium}`: the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder).
uk: `${activeFolderMedium}`: шлях до папки, в якій міститься файл, відносно папки робочого простору (наприклад, myFolder/myFileFolder).

# activeFolderShort
source: `${activeFolderShort}`: the name of the folder the file is contained in (e.g. myFileFolder).
uk: `${activeFolderShort}`: назва папки, в якій міститься файл (наприклад, myFileFolder).

# activeRepositoryBranchName
source: `${activeRepositoryBranchName}`: the name of the active branch in the active repository (e.g. main).
uk: `${activeRepositoryBranchName}`: назва активної гілки в активному репозиторії (наприклад, main).

# activeRepositoryName
source: `${activeRepositoryName}`: the name of the active repository (e.g. vscode).
uk: `${activeRepositoryName}`: назва активного репозиторію (наприклад, vscode).

# activityBarIconClickBehavior
source: Controls the behavior of clicking an Activity Bar icon in the workbench. This value is ignored when {0} is not set to {1}.
uk: Контролює поведінку при натисканні на значок Activity Bar у робочій області. Це значення ігнорується, коли {0} не встановлено на {1}.

# activityBarLocation
source: Controls the location of the Activity Bar relative to the Primary and Secondary Side Bars.
uk: Контролює розташування Панелі активностей відносно Основної та Вторинної бічних панелей.

# alwaysShowEditorActions
source: Controls whether to always show the editor actions, even when the editor group is not active.
uk: Контролює, чи завжди показувати дії редактора, навіть коли група редактора неактивна.

# appName
source: `${appName}`: e.g. VS Code.
uk: `${appName}`: наприклад, VS Code.

# askChatLocation
source: Controls where the command palette should ask chat questions.
uk: Контролює, де панель команд повинна ставити питання чату.

# askChatLocation.chatView
source: Ask chat questions in the Chat view.
uk: Задавайте запитання чату у вигляді чату.

# askChatLocation.quickChat
source: Ask chat questions in Quick Chat.
uk: Запитуйте питання в чаті в Quick Chat.

# browser
source: Configure the browser to use for opening http or https links externally. This can either be the name of the browser (`edge`, `chrome`, `firefox`) or an absolute path to the browser's executable. Will use the system default if not set.
uk: Налаштуйте браузер для використання при відкритті http або https посилань зовні. Це може бути або назва браузера (`edge`, `chrome`, `firefox`), або абсолютний шлях до виконуваного файлу браузера. Якщо не встановлено, буде використовуватись системний за замовчуванням.

# centeredLayoutAutoResize
source: Controls if the centered layout should automatically resize to maximum width when more than one group is open. Once only one group is open it will resize back to the original centered width.
uk: Контролює, чи має центроване розташування автоматично змінювати розмір до максимальної ширини, коли відкрито більше ніж одну групу. Коли відкрита лише одна група, воно знову змінить розмір на початкову центровану ширину.

# centeredLayoutDynamicWidth
source: Controls whether the centered layout tries to maintain constant width when the window is resized.
uk: Контролює, чи намагається центроване макетування підтримувати постійну ширину, коли вікно змінює розмір.

# closeEmptyGroups
source: Controls the behavior of empty editor groups when the last tab in the group is closed. When enabled, empty groups will automatically close. When disabled, empty groups will remain part of the grid.
uk: Контролює поведінку порожніх груп редактора, коли остання вкладка в групі закрита. Коли увімкнено, порожні групи автоматично закриються. Коли вимкнено, порожні групи залишаться частиною сітки.

# closeOnFileDelete
source: Controls whether editors showing a file that was opened during the session should close automatically when getting deleted or renamed by some other process. Disabling this will keep the editor open on such an event. Note that deleting from within the application will always close the editor and that editors with unsaved changes will never close to preserve your data.
uk: Контролює, чи редактори, що показують файл, який був відкритий під час сеансу, повинні автоматично закриватися, коли його видаляють або перейменовують інший процес. Вимкнення цієї опції дозволить редактору залишатися відкритим у такому випадку. Зверніть увагу, що видалення зсередини програми завжди закриє редактор, а редактори з незбереженими змінами ніколи не закриються, щоб зберегти ваші дані.

# closeOnFocusLost
source: Controls whether Quick Open should close automatically once it loses focus.
uk: Контролює, чи має Quick Open закриватися автоматично, коли втрачає фокус.

# commandHistory
source: Controls the number of recently used commands to keep in history for the command palette. Set to 0 to disable command history.
uk: Контролює кількість нещодавно використаних команд, які слід зберігати в історії для палітри команд. Встановіть 0, щоб вимкнути історію команд.

# confirmBeforeClose
source: Controls whether to show a confirmation dialog before closing a window or quitting the application.
uk: Контролює, чи показувати діалог підтвердження перед закриттям вікна або виходом з програми.

# confirmBeforeCloseWeb
source: Controls whether to show a confirmation dialog before closing the browser tab or window. Note that even if enabled, browsers may still decide to close a tab or window without confirmation and that this setting is only a hint that may not work in all cases.
uk: Контролює, чи показувати діалог підтвердження перед закриттям вкладки або вікна браузера. Зверніть увагу, що навіть якщо ця опція увімкнена, браузери можуть все ще вирішити закрити вкладку або вікно без підтвердження, і що ця налаштування є лише підказкою, яка може не працювати в усіх випадках.

# customEditorLabelDescriptionExample
source: Example: `"**/static/**/*.html": "${filename} - ${dirname} (${extname})"` will render a file `WORKSPACE_FOLDER/static/folder/file.html` as `file - folder (html)`.
uk: Приклад: `"**/static/**/*.html": "${filename} - ${dirname} (${extname})"` відобразить файл `WORKSPACE_FOLDER/static/folder/file.html` як `file - folder (html)`.

# customMenuBarAltFocus
source: Controls whether the menu bar will be focused by pressing the Alt-key. This setting has no effect on toggling the menu bar with the Alt-key.
uk: Контролює, чи буде панель меню активована при натисканні клавіші Alt. Ця настройка не впливає на перемикання панелі меню за допомогою клавіші Alt.

# decorations.badges
source: Controls whether editor file decorations should use badges.
uk: Контролює, чи повинні елементи оформлення файлів редактора використовувати значки.

# decorations.colors
source: Controls whether editor file decorations should use colors.
uk: Контролює, чи повинні прикраси файлів редактора використовувати кольори.

# dirty
source: `${dirty}`: an indicator for when the active editor has unsaved changes.
uk: `${dirty}`: індикатор, коли активний редактор має незбережені зміни.

# doubleClickTabToToggleEditorGroupSizes
source: Controls how the editor group is resized when double clicking on a tab. This value is ignored when {0} is not set to {1}.
uk: Контролює, як група редакторів змінює розмір при двократному натисканні на вкладку. Це значення ігнорується, коли {0} не встановлено на {1}.

# dragToOpenWindow
source: Controls if editors can be dragged out of the window to open them in a new window. Press and hold the `Alt` key while dragging to toggle this dynamically.
uk: Контролює, чи можуть редактори бути перетягнуті за межі вікна для відкриття їх у новому вікні. Утримуйте клавішу `Alt`, перетягуючи, щоб динамічно перемикати це.

# editorActionsLocation
source: Controls where the editor actions are shown.
uk: Контролює, де відображаються дії редактора.

# editorOpenPositioning
source: Controls where editors open. Select {0} or {1} to open editors to the left or right of the currently active one. Select {2} or {3} to open editors independently from the currently active one.
uk: Контролює, де відкриваються редактори. Виберіть {0} або {1}, щоб відкрити редактори зліва або справа від активного. Виберіть {2} або {3}, щоб відкривати редактори незалежно від активного.

# enableMenuBarMnemonics
source: Controls whether the main menus can be opened via Alt-key shortcuts. Disabling mnemonics allows to bind these Alt-key shortcuts to editor commands instead.
uk: Контролює, чи можуть основні меню відкриватися за допомогою комбінацій клавіш з клавішею Alt. Вимкнення мнемонік дозволяє прив'язати ці комбінації клавіш з клавішею Alt до команд редактора.

# enableNaturalLanguageSearch
source: Controls whether the command palette should include similar commands. You must have an extension installed that provides Natural Language support.
uk: Контролює, чи повинна палітра команд включати подібні команди. Ви повинні мати встановлене розширення, яке забезпечує підтримку природної мови.

# enablePreview
source: Controls whether preview mode is used when editors open. There is a maximum of one preview mode editor per editor group. This editor displays its filename in italics on its tab or title label and in the Open Editors view. Its contents will be replaced by the next editor opened in preview mode. Making a change in a preview mode editor will persist it, as will a double-click on its label, or the 'Keep Open' option in its label context menu. Opening a file from Explorer with a double-click persists its editor immediately.
uk: Контролює, чи використовується режим попереднього перегляду, коли відкриваються редактори. Максимум один редактор у режимі попереднього перегляду на групу редакторів. Цей редактор відображає своє ім'я файлу курсивом на своїй вкладці або заголовку та в перегляді Відкриті редактори. Його вміст буде замінено наступним редактором, відкритим у режимі попереднього перегляду. Зміна в редакторі режиму попереднього перегляду зберігається, як і подвійний клік на його заголовку або опція 'Залишити відкритим' у контекстному меню заголовка. Відкриття файлу з Провідника подвійним кліком одразу зберігає його редактор.

# enablePreviewFromCodeNavigation
source: Controls whether editors remain in preview when a code navigation is started from them. Preview editors do not stay open, and are reused until explicitly set to be kept open (via double-click or editing). This value is ignored when {0} is not set to {1}.
uk: Контролює, чи залишаються редактори в попередньому перегляді, коли навігація по коду починається з них. Редактори попереднього перегляду не залишаються відкритими і повторно використовуються, поки явно не буде встановлено, що їх потрібно залишити відкритими (через подвійний клік або редагування). Це значення ігнорується, коли {0} не встановлено на {1}.

# enablePreviewFromQuickOpen
source: Controls whether editors opened from Quick Open show as preview editors. Preview editors do not stay open, and are reused until explicitly set to be kept open (via double-click or editing). When enabled, hold Ctrl before selection to open an editor as a non-preview. This value is ignored when {0} is not set to {1}.
uk: Керує тим, чи редактори, відкриті з Швидкого відкриття, відображаються як попередні редактори. Попередні редактори не залишаються відкритими і повторно використовуються, поки їх явно не встановлено для збереження відкритими (через подвійний клік або редагування). Коли це увімкнено, утримуйте Ctrl перед вибором, щоб відкрити редактор як не-попередній. Це значення ігнорується, коли {0} не встановлено на {1}.

# exclude
source: Configure paths or [glob patterns](https://aka.ms/vscode-glob-patterns) for excluding files from the local file history. Glob patterns are always evaluated relative to the path of the workspace folder unless they are absolute paths. Changing this setting has no effect on existing local file history entries.
uk: Налаштуйте шляхи або [глобальні шаблони](https://aka.ms/vscode-glob-patterns) для виключення файлів з локальної історії файлів. Глобальні шаблони завжди оцінюються відносно шляху папки робочого простору, якщо це не абсолютні шляхи. Зміна цього налаштування не вплине на існуючі записи локальної історії файлів.

# focusRecentEditorAfterClose
source: Controls whether editors are closed in most recently used order or from left to right.
uk: Контролює, чи редактори закриваються в порядку останнього використання, чи зліва направо.

# focusedView
source: `${focusedView}`: the name of the view that is currently focused.
uk: `${focusedView}`: назва виду, який наразі має фокус.

# folderName
source: `${folderName}`: name of the workspace folder the file is contained in (e.g. myFolder).
uk: `${folderName}`: назва папки робочого простору, в якій міститься файл (наприклад, myFolder).

# folderPath
source: `${folderPath}`: file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder).
uk: `${folderPath}`: шлях до файлу папки робочого простору, в якій міститься файл (наприклад, /Users/Development/myFolder).

# fontAliasing
source: Controls font aliasing method in the workbench.
uk: Контролює метод альясування шрифтів у робочій області.

# highlightModifiedTabs
source: Controls whether a top border is drawn on tabs for editors that have unsaved changes. This value is ignored when {0} is not set to {1}.
uk: Контролює, чи малюється верхня межа на вкладках для редакторів, які мають незбережені зміни. Це значення ігнорується, коли {0} не встановлено на {1}.

# layoutControlEnabled
source: Controls whether the layout control is shown in the custom title bar. This setting only has an effect when {0} is not set to {1}.
uk: Контролює, чи відображається елемент макета в користувацькій заголовній панелі. Цей параметр має ефект лише тоді, коли {0} не встановлено на {1}.

# layoutControlEnabledWeb
source: Controls whether the layout control in the title bar is shown.
uk: Контролює, чи відображається елемент управління макетом у заголовку.

# layoutControlType
source: Controls whether the layout control in the custom title bar is displayed as a single menu button or with multiple UI toggles.
uk: Контролює, чи елемент управління макетом у користувацькому заголовку відображається як одна кнопка меню або з кількома перемикачами інтерфейсу.

# layoutcontrol.type.both
source: Shows both the dropdown and toggle buttons.
uk: Показує як випадаюче меню, так і кнопки перемикання.

# layoutcontrol.type.menu
source: Shows a single button with a dropdown of layout options.
uk: Показує одну кнопку з випадаючим списком варіантів макета.

# layoutcontrol.type.toggles
source: Shows several buttons for toggling the visibility of the panels and side bar.
uk: Показує кілька кнопок для перемикання видимості панелей і бокової панелі.

# limitEditorsEnablement
source: Controls if the number of opened editors should be limited or not. When enabled, less recently used editors will close to make space for newly opening editors.
uk: Контролює, чи слід обмежувати кількість відкритих редакторів. Коли увімкнено, менш нещодавно використані редактори закриються, щоб звільнити місце для нових редакторів.

# limitEditorsExcludeDirty
source: Controls if the maximum number of opened editors should exclude dirty editors for counting towards the configured limit.
uk: Контролює, чи максимальна кількість відкритих редакторів повинна виключати брудні редактори при підрахунку до налаштованого ліміту.

# limitEditorsMaximum
source: Controls the maximum number of opened editors. Use the {0} setting to control this limit per editor group or across all groups.
uk: Контролює максимальну кількість відкритих редакторів. Використовуйте налаштування {0}, щоб контролювати цей ліміт для кожної групи редакторів або для всіх груп.

# localHistoryEnabled
source: Controls whether local file history is enabled. When enabled, the file contents of an editor that is saved will be stored to a backup location to be able to restore or review the contents later. Changing this setting has no effect on existing local file history entries.
uk: Контролює, чи увімкнено історію локальних файлів. Коли увімкнено, вміст файлу редактора, який збережено, буде збережено в резервному місці, щоб мати можливість відновити або переглянути вміст пізніше. Зміна цього налаштування не вплине на існуючі записи історії локальних файлів.
