Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_debug.xlf
Languages: uk

source: &&Debug Anyway
uk: Ігноруйте помилки завдань і почніть налагодження.

# debugAnywayNoMemo
source: Debug Anyway
uk: Виправити все одно

# invalidTaskReference
source: Task '{0}' can not be referenced from a launch configuration that is in a different workspace folder.
uk: Завдання '{0}' не може бути використане з конфігурацією запуску, яка знаходиться в іншій папці робочого простору.

# preLaunchTaskError
source: Error exists after running preLaunchTask '{0}'.
uk: Помилка виникає після виконання preLaunchTask '{0}'.

# preLaunchTaskErrors
source: Errors exist after running preLaunchTask '{0}'.
uk: Помилки існують після виконання preLaunchTask '{0}'.

# preLaunchTaskExitCode
source: The preLaunchTask '{0}' terminated with exit code {1}.
uk: Передзапускове завдання '{0}' завершилося з кодом виходу {1}.

# preLaunchTaskTerminated
source: The preLaunchTask '{0}' terminated.
uk: Попереднє завдання '{0}' завершилося.

# remember
source: Remember my choice in user settings
uk: Запам'ятати мій вибір у налаштуваннях користувача

# rememberTask
source: Remember my choice for this task
uk: Запам'ятай мій вибір для цього завдання

# runningTask
source: Waiting for preLaunchTask '{0}'...
uk: Очікування preLaunchTask '{0}'...

source: &&Show Errors
uk: Показати перегляд Проблем і не починати налагодження.

# taskNotTracked
source: The task '{0}' has not exited and doesn't have a 'problemMatcher' defined. Make sure to define a problem matcher for watch tasks.
uk: Завдання '{0}' не завершилося і не має визначеного 'problemMatcher'. Переконайтеся, що ви визначили problem matcher для завдань спостереження.

# notebook.moreRunActionsLabel
source: More...
uk: Більше...

# reverseContinue
source: Reverse
uk: Зворотний

# stepBackDebug
source: Step Back
uk: Крок назад

# miOpenConfigurations
source: Open &&Configurations
uk: Відкрити &&конфігурації

# openLaunchConfigDescription
source: Opens the file used to configure how your program is debugged
uk: Відкриває файл, що використовується для налаштування способу налагодження вашої програми

# selectWorkspaceFolder
source: Select a workspace folder to create a launch.json file in or add it to the workspace config file
uk: Виберіть папку робочого простору для створення файлу launch.json або додайте його до файлу конфігурації робочого простору

source: Start Additional Session
uk: Почати додаткову сесію

# disassemblyTableColumnLabel
source: instructions
uk: інструкції

source: Disassembly View
uk: Перегляд розбирання

# editorOpenedFromDisassemblyDescription
source: from disassembly
uk: з розбирання

# instructionAddress
source: Address
uk: Адреса

# instructionBytes
source: Bytes
uk: Байти

# instructionNotAvailable
source: Disassembly not available.
uk: Розбирання недоступне.

# instructionText
source: Instruction
uk: Інструкція

source: Close
uk: Закрити

# debugExceptionWidgetBackground
source: Exception widget background color.
uk: Колір фону віджета виключення.

# debugExceptionWidgetBorder
source: Exception widget border color.
uk: Колір межі віджета винятку.

# exceptionThrown
source: Exception has occurred.
uk: Виникла помилка.

# exceptionThrownWithId
source: Exception has occurred: {0}
uk: Виникла помилка: {0}

# fileLink
source: Ctrl + click to {0}
uk: Ctrl + клікнути, щоб {0}

# fileLinkMac
source: Cmd + click to {0}
uk: Cmd + клікнути, щоб {0}

# fileLinkWithPath
source: Ctrl + click to {0} {1}
uk: Ctrl + клік, щоб {0} {1}

# fileLinkWithPathMac
source: Cmd + click to {0} {1}
uk: Cmd + клікнути, щоб {0} {1}

# followForwardedLink
source: follow link using forwarded port
uk: перейдіть за посиланням, використовуючи переадресований порт

source: follow link
uk: перейти за посиланням

# loadedScriptsAriaLabel
source: Debug Loaded Scripts
uk: Виправлення завантажених скриптів

# loadedScriptsFolderAriaLabel
source: Folder {0}, loaded script, debug
uk: Папка {0}, завантажений скрипт, налагодження

# loadedScriptsRootFolderAriaLabel
source: Workspace folder {0}, loaded script, debug
uk: Папка робочого простору {0}, завантажений скрипт, налагодження

# loadedScriptsSession
source: Debug Session
uk: Сесія налагодження

# loadedScriptsSessionAriaLabel
source: Session {0}, loaded script, debug
uk: Сесія {0}, завантажений скрипт, налагодження

# loadedScriptsSourceAriaLabel
source: {0}, loaded script, debug
uk: {0}, завантажений скрипт, налагодження

# canNotStart
source: The debugger needs to open a new tab or window for the debuggee but the browser prevented this. You must give permission to continue.
uk: Дебаггеру потрібно відкрити нову вкладку або вікно для дебагованого, але браузер це заборонив. Ви повинні надати дозвіл для продовження.

source: &&Continue
uk: &&Продовжити

source: More Info
uk: Більше інформації

# noDebugAdapter
source: No debugger available found. Can not send '{0}'.
uk: Дебаггер недоступний, не можна надіслати '{0}'

# noDebugAdapterStart
source: No debug adapter, can not start debug session.
uk: Немає адаптера налагодження, не можна розпочати сесію налагодження.

# actions.repl.acceptInput
source: Debug Console: Accept Input
uk: Консоль налагодження: Прийняти введення

# actions.repl.copyAll
source: Debug: Console Copy All
uk: Налагодження: Копіювати все в консолі

# clearRepl
source: Clear Console
uk: Очистити консоль

# clearRepl.descriotion
source: Clears all program output from your debug REPL
uk: Очищає весь вивід програми з вашого debug REPL

source: Copy
uk: Копіювати

source: Copy All
uk: Скопіювати все

source: Debug Console
uk: Іконка для дії відкриття консолі налагодження.

# debugFocusConsole
source: Focus on Debug Console View
uk: Зосередьтеся на перегляді консолі налагодження

source: Paste
uk: Вставити

# repl.action.filter
source: Debug Console: Focus Filter
uk: Консоль налагодження: Фільтр фокусу

# repl.action.find
source: Debug Console: Focus Find
uk: Консоль налагодження: Знайти фокус

# selectRepl
source: Select Debug Console
uk: Вибрати Консоль налагодження

# showing filtered repl lines
source: Showing {0} of {1}
uk: Показано {0} з {1}

# startDebugFirst
source: Please start a debug session to evaluate expressions
uk: Будь ласка, розпочніть сесію налагодження для оцінки виразів

# workbench.debug.filter.placeholder
source: Filter (e.g. text, !exclude, \escape)
uk: Фільтр (e.g. text, !exclude, \escape)

# repl.accessibleView
source: The Open Accessible View command{0} will allow character by character navigation of the console output.
uk: Команда Open Accessible View{0} дозволить навігацію по консолі виходу символ за символом.

# repl.clear
source: The Debug: Clear Console command{0} will clear the console output.
uk: Команда Debug: Clear Console {0} очистить вивід консолі.

# repl.help
source: The debug console is a Read-Eval-Print-Loop that allows you to evaluate expressions and run commands and can be focused with{0}.
uk: Консоль налагодження - це цикл Read-Eval-Print-Loop, який дозволяє оцінювати вирази та виконувати команди, і може бути сфокусований за допомогою {0}.

# repl.history
source: The debug console output history can be navigated with the up and down arrow keys.
uk: Історію виводу консолі налагодження можна переглядати за допомогою клавіш зі стрілками вгору та вниз.

# repl.input
source: The debug console input can be navigated to from the output with the Focus Next Widget command{0}.
uk: Вхід консолі налагодження можна перейти з виходу за допомогою команди Focus Next Widget{0}.

# repl.lazyVariables
source: The setting `debug.expandLazyVariables` controls whether variables are evaluated automatically. This is enabled by default when using a screen reader.
uk: Налаштування `debug.expandLazyVariables` контролює, чи змінні оцінюються автоматично. Це увімкнено за замовчуванням при використанні екранного читача.

# repl.output
source: The debug console output can be navigated to from the input field with the Focus Previous Widget command{0}.
uk: Вивід консолі налагодження можна відкрити з поля введення за допомогою команди Focus Previous Widget{0}.

# repl.showRunAndDebug
source: The Show Run and Debug view command{0} will open the Run and Debug view and provides more information about debugging.
uk: Команда Show Run and Debug view{0} відкриє вигляд Run and Debug та надасть більше інформації про налагодження.

# occurred
source: , occurred {0} times
uk: , сталося {0} разів

# replGroup
source: Debug console group {0}
uk: Консоль налагодження групи {0}

# replRawObjectAriaLabel
source: Debug console variable {0}, value {1}
uk: Консоль налагодження змінна {0}, значення {1}

# replVariableAriaLabel
source: Variable {0}, value {1}
uk: Змінна {0}, значення {1}

# debug.continue
source: - Debug: Continue command{0} will continue execution until the next breakpoint.
uk: - Налагодження: Команда продовження {0} продовжить виконання до наступної точки зупинки.

# debug.focusBreakpoints
source: - Debug: Focus Breakpoints View command{0} will focus the breakpoints view.
uk: - Налагодження: Команда Перегляд Точок Перерви {0} зосередить увагу на перегляді точок перерви.

# debug.focusCallStack
source: - Debug: Focus Call Stack View command{0} will focus the call stack view.
uk: - Налагодження: команда Focus Call Stack View {0} зосередить увагу на перегляді стеку викликів.

# debug.focusVariables
source: - Debug: Focus Variables View command{0} will focus the variables view.
uk: - Налагодження: команда Перегляд змінних{0} зосередить перегляд змінних.

# debug.focusWatch
source: - Debug: Focus Watch View command{0} will focus the watch view.
uk: - Налагодження: Команда Перегляд Спостереження {0} зосередить перегляд спостереження.

# debug.help
source: Access debug output and evaluate expressions in the debug console, which can be focused with{0}.
uk: Отримайте доступ до виводу налагодження та оцініть вирази в консолі налагодження, яку можна зосередити за допомогою {0}.

# debug.restartDebugging
source: - Debug: Restart Debugging command{0} will restart the current debug session.
uk: - Налагодження: Команда перезапуску налагодження {0} перезапустить поточну сесію налагодження.

# debug.showRunAndDebug
source: The Show Run and Debug view command{0} will open the current view.
uk: Команда Запустити та налагодити перегляд {0} відкриє поточний перегляд.

# debug.startDebugging
source: The Debug: Start Debugging command{0} will start a debug session.
uk: Команда Debug: Почати налагодження{0} розпочне сесію налагодження.

# debug.stepInto
source: - Debug: Step Into command{0} will step into the next function call.
uk: - Налагодження: команда Step Into{0} перейде до наступного виклику функції.

# debug.stepOut
source: - Debug: Step Out command{0} will step out of the current function call.
uk: - Налагодження: команда Step Out{0} вийде з поточного виклику функції.

# debug.stepOver
source: - Debug: Step Over command{0} will step over the current function call.
uk: - Налагодження: команда Step Over{0} пропустить виклик поточної функції.

# debug.stopDebugging
source: - Debug: Stop Debugging command{0} will stop the current debugging session.
uk: - Налагодження: команда Зупинити налагодження {0} зупинить поточну сесію налагодження.

# debug.views
source: The debug viewlet is comprised of several views that can be focused with the following commands or navigated to via tab then arrow keys:
uk: Вікно налагодження складається з кількох видів, які можна вибрати за допомогою наступних команд або перейти до них за допомогою клавіші табуляції, а потім стрілок:

# debug.watchSetting
source: The setting {0} controls whether watch variable changes are announced.
uk: Налаштування {0} контролює, чи оголошуються зміни змінної спостереження.

# onceDebugging
source: Once debugging, the following commands will be available:
uk: Після налагодження будуть доступні такі команди:

# commandCenter-activeBackground
source: Command center background color when a program is being debugged
uk: Колір фону командного центру, коли програма налагоджується

# statusBarDebuggingBackground
source: Status bar background color when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір фону рядка стану, коли програма налагоджується. Рядок стану відображається внизу вікна.

# statusBarDebuggingBorder
source: Status bar border color separating to the sidebar and editor when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір рамки рядка стану, що відокремлює бокову панель і редактор під час налагодження програми. Рядок стану відображається внизу вікна.

# statusBarDebuggingForeground
source: Status bar foreground color when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір переднього плану панелі стану, коли програма відлагоджується. Панель стану відображається внизу вікна.

source: Remove Visualizer
uk: Видалити візуалізатор

# useVisualizer
source: Visualize Variable...
uk: Візуалізувати змінну...

# variableAriaLabel
source: {0}, value {1}
uk: {0}, значення {1}, змінні, налагодження

# variableScopeAriaLabel
source: Scope {0}
uk: Обсяг {0}

# variableValueAriaLabel
source: Type new variable value
uk: Введіть нове значення змінної

# variablesAriaTreeLabel
source: Debug Variables
uk: Налагодження змінних

# viewMemory.prompt
source: Inspecting binary data requires this extension.
uk: Для перевірки бінарних даних потрібне це розширення.

# addWatchExpression
source: Add Expression
uk: Додати вираз

# copyWatchExpression
source: Copy Expression
uk: Копіювати вираз

# removeAllWatchExpressions
source: Remove All Expressions
uk: Видалити всі вирази

source: Type new value
uk: Введіть нове значення

# watchAriaTreeLabel
source: Debug Watch Expressions
uk: Відлагодження виразів спостереження

# watchExpressionAriaLabel
source: {0}, value {1}
uk: {0}, значення {1}

# watchExpressionInputAriaLabel
source: Type watch expression
uk: Введіть вираз для перегляду

# watchExpressionPlaceholder
source: Expression to watch
uk: Вираз для спостереження

# watchVariableAriaLabel
source: {0}, value {1}
uk: {0}, значення {1}

# allDebuggersDisabled
source: All debug extensions are disabled. Enable a debug extension or install a new one from the Marketplace.
uk: Усі розширення для налагодження вимкнені. Увімкніть розширення для налагодження або встановіть нове з Marketplace.

# customizeRunAndDebug
source: To customize Run and Debug [create a launch.json file](command:{0}).
uk: Щоб налаштувати Запуск і Налагодження [створіть файл launch.json](command:{0}).

# customizeRunAndDebugOpenFolder
source: To customize Run and Debug, [open a folder](command:{0}) and create a launch.json file.
uk: Щоб налаштувати виконання та налагодження, [відкрийте папку](command:{0}) та створіть файл launch.json.

# openAFileWhichCanBeDebugged
source: [Open a file](command:{0}) which can be debugged or run.
uk: [Відкрити файл](command:{0}), який можна налагоджувати або виконувати.

source: Run
uk: Запустити або налагодити...

# runAndDebugAction
source: Run and Debug
uk: Запустити та налагодити

# timeout
source: Timeout after {0} ms for '{1}'
uk: Тайм-аут після {0} мс для '{1}'

# breakWhenValueChangesSupported
source: True when the focused session supports to break when value changes.
uk: Істинно, коли фокусована сесія підтримує переривання при зміні значення.

# breakWhenValueIsAccessedSupported
source: True when the focused breakpoint supports to break when value is accessed.
uk: Істинно, коли зосереджений брейкпоінт підтримує зупинку під час доступу до значення.

# breakWhenValueIsReadSupported
source: True when the focused breakpoint supports to break when value is read.
uk: Істинно, коли зосереджена точка зупинки підтримує переривання при читанні значення.

# breakpointHasModes
source: Whether the breakpoint has multiple modes it can switch to.
uk: Чи має точка зупинки кілька режимів, до яких вона може перемикатися.

# breakpointInputFocused
source: True when the input box has focus in the BREAKPOINTS view.
uk: Істина, коли поле введення має фокус у вигляді BREAKPOINTS.

# breakpointItemIsDataBytes
source: Whether the breakpoint item is a data breakpoint on a byte range.
uk: Чи є елемент точки зупинки точкою зупинки даних у діапазоні байтів.

# breakpointItemType
source: Represents the item type of the focused element in the BREAKPOINTS view. For example: 'breakpoint', 'exceptionBreakppint', 'functionBreakpoint', 'dataBreakpoint'
uk: Представляє тип елемента зосередження в режимі BREAKPOINTS. Наприклад: 'breakpoint', 'exceptionBreakpoint', 'functionBreakpoint', 'dataBreakpoint'

# breakpointSupportsCondition
source: True when the focused breakpoint supports conditions.
uk: Істина, коли зосереджений брейкпоінт підтримує умови.

# breakpointWidgetVisibile
source: True when breakpoint editor zone widget is visible, false otherwise.
uk: Істина, коли віджет зони редактора точок зупинки видимий, інакше - хибність.

# breakpointsExist
source: True when at least one breakpoint exists.
uk: Істина, коли існує принаймні одна точка зупинки.

# breakpointsFocused
source: True when the BREAKPOINTS view is focused, false otherwise.
uk: Істина, коли фокус на вигляді BREAKPOINTS, хибність в іншому випадку.

# callStackFocused
source: True when the CALLSTACK view is focused, false otherwise.
uk: Істина, коли фокус на вигляді CALLSTACK, хибність в іншому випадку.

# callStackItemStopped
source: True when the focused item in the CALL STACK is stopped. Used internaly for inline menus in the CALL STACK view.
uk: Істина, коли вибраний елемент у CALL STACK зупинений. Використовується внутрішньо для вбудованих меню у вигляді CALL STACK.

# callStackItemType
source: Represents the item type of the focused element in the CALL STACK view. For example: 'session', 'thread', 'stackFrame'
uk: Представляє тип елемента зосередженого елемента у вигляді CALL STACK. Наприклад: 'session', 'thread', 'stackFrame'

# callStackSessionHasOneThread
source: True when the focused session in the CALL STACK view has exactly one thread. Used internally for inline menus in the CALL STACK view.
uk: Істина, коли фокусована сесія у вигляді CALL STACK має точно один потік. Використовується внутрішньо для вбудованих меню у вигляді CALL STACK.

# callStackSessionIsAttach
source: True when the session in the CALL STACK view is attach, false otherwise. Used internally for inline menus in the CALL STACK view.
uk: Істинно, коли сесія в режимі CALL STACK приєднана, хибно в іншому випадку. Використовується внутрішньо для вбудованих меню в режимі CALL STACK.

# canViewMemory
source: Indicates whether the item in the view has an associated memory refrence.
uk: Вказує, чи має елемент у вигляді асоційовану пам'ятеву посилання.

# debugConfigurationType
source: Debug type of the selected launch configuration. For example 'python'.
uk: Тип налагодження вибраної конфігурації запуску. Наприклад, 'python'.

# debugExtensionsAvailable
source: True when there is at least one debug extension installed and enabled.
uk: Істина, коли встановлено та активовано принаймні одне розширення для налагодження.

# debugProtocolVariableMenuContext
source: Represents the context the debug adapter sets on the focused variable in the VARIABLES view.
uk: Представляє контекст, який адаптер налагодження встановлює на виділену змінну у вигляді ЗМІННИХ.

# debugSetDataBreakpointAddressSupported
source: True when the focused session supports 'getBreakpointInfo' request on an address.
uk: Істинно, коли зосереджена сесія підтримує запит 'getBreakpointInfo' на адресі.

# debugSetExpressionSupported
source: True when the focused session supports 'setExpression' request.
uk: Істинно, коли сфокусована сесія підтримує запит 'setExpression'.

# debugSetVariableSupported
source: True when the focused session supports 'setVariable' request.
uk: Істинно, коли зосереджена сесія підтримує запит 'setVariable'.

# debugState
source: State that the focused debug session is in. One of the following: 'inactive', 'initializing', 'stopped' or 'running'.
uk: Вкажіть, в якому стані знаходиться сесія налагодження. Одне з наступних: 'неактивна', 'ініціалізація', 'зупинена' або 'виконується'.

# debugType
source: Debug type of the active debug session. For example 'python'.
uk: Тип налагодження активної сесії налагодження. Наприклад 'python'.

# debugUX
source: Debug UX state. When there are no debug configurations it is 'simple', otherwise 'default'. Used to decide when to show welcome views in the debug viewlet.
uk: Відлагодження стану UX. Коли немає конфігурацій відлагодження, він є 'простим', в іншому випадку - 'за замовчуванням'. Використовується для визначення, коли показувати вітальні перегляди у відлагоджувальному вьюлеті.

# debuggerDisabled
source: Configured debug type '{0}' is installed but not supported in this environment.
uk: Конфігурований тип налагодження '{0}' встановлено, але він не підтримується в цьому середовищі.

# debuggersAvailable
source: True when there is at least one debug extensions active.
uk: Істина, коли активна принаймні одна розширення для налагодження.

# disassembleRequestSupported
source: True when the focused sessions supports disassemble request.
uk: Істинно, коли зосереджені сесії підтримують запит на розбирання.

# disassemblyViewFocus
source: True when the Disassembly View is focused.
uk: Істина, коли фокус на вигляді розбирання.

# exceptionWidgetVisible
source: True when the exception widget is visible.
uk: Істина, коли віджет виключення видимий.

# expressionSelected
source: True when an expression input box is open in either the WATCH or the VARIABLES view, false otherwise.
uk: Істина, коли поле введення виразу відкрите в режимі WATCH або VARIABLES, хибність в іншому випадку.

# focusedSessionIsAttach
source: True when the focused session is 'attach'.
uk: Істинно, коли зосереджена сесія є 'attach'.

# focusedSessionIsNoDebug
source: True when the focused session is run without debugging.
uk: Істина, коли фокусована сесія виконується без налагодження.

# focusedStackFrameHasInstructionReference
source: True when the focused stack frame has instruction pointer reference.
uk: Істинно, коли фокусований стековий кадр має посилання на вказівник інструкцій.

# hasDebugged
source: True when a debug session has been started at least once, false otherwise.
uk: Істина, коли сеанс налагодження був розпочатий принаймні один раз, інакше - хибно.

# inBreakpointWidget
source: True when focus is in the breakpoint editor zone widget, false otherwise.
uk: Істинно, коли фокус знаходиться в віджеті зони редактора точок зупинки, хибно в іншому випадку.

# inDebugMode
source: True when debugging, false otherwise.
uk: Істина під час налагодження, хибність в інших випадках.

# inDebugRepl
source: True when focus is in the debug console, false otherwise.
uk: Істина, коли фокус знаходиться в консолі налагодження, хибність в іншому випадку.

# internalConsoleOptions
source: Controls when the internal Debug Console should open.
uk: Контролює, коли має відкритися внутрішня Консоль відладки.

# jumpToCursorSupported
source: True when the focused session supports 'jumpToCursor' request.
uk: Істина, коли фокусована сесія підтримує запит 'jumpToCursor'.

# languageSupportsDisassembleRequest
source: True when the language in the current editor supports disassemble request.
uk: Істинно, коли мова в поточному редакторі підтримує запит на дизасемблювання.

# loadedScriptsItemType
source: Represents the item type of the focused element in the LOADED SCRIPTS view.
uk: Представляє тип елемента зосередженого елемента в перегляді ЗАВАНТАЖЕНИХ СКРИПТІВ.

# loadedScriptsSupported
source: True when the focused sessions supports the LOADED SCRIPTS view
uk: Істина, коли зосереджені сесії підтримують вигляд LOADED SCRIPTS

# multiSessionDebug
source: True when there is more than 1 active debug session.
uk: Істина, коли є більше ніж 1 активна сесія налагодження.
