Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_localization.xlf
Languages: uk

# clearDisplayLanguageDetail
source: Press the reload button to refresh the page and use your browser's language.
uk: Натисніть кнопку перезавантаження, щоб оновити сторінку, і використовуйте мову вашого браузера.

# clearDisplayLanguageMessage
source: To change the display language, {0} needs to reload
uk: Щоб змінити мову відображення, {0} потрібно перезавантажити.

# relaunchDisplayLanguageDetail
source: Press the reload button to refresh the page and set the display language to {0}.
uk: Натисніть кнопку перезавантаження, щоб оновити сторінку та встановити мову відображення на {0}.

# relaunchDisplayLanguageMessage
source: To change the display language, {0} needs to reload
uk: Щоб змінити мову відображення, {0} потрібно перезавантажити.

source: &&Reload
uk: &&Перезавантажити

# argvInvalid
source: Unable to write display language. Please open the runtime settings, correct errors/warnings in it and try again.
uk: Неможливо записати мову відображення. Будь ласка, відкрийте налаштування виконання, виправте помилки/попередження в них і спробуйте ще раз.

# installing
source: Installing {0} language support...
uk: Встановлення підтримки мови {0}...

# openArgv
source: Open Runtime Settings
uk: Відкрити налаштування виконання

source: &&Restart
uk: &&Перезапустити

# restartDisplayLanguageDetail1
source: To change the display language to {0}, {1} needs to restart.
uk: Щоб змінити мову відображення на {0}, {1} потрібно перезапустити.

# restartDisplayLanguageMessage1
source: Restart {0} to switch to {1}?
uk: Перезапустити {0}, щоб перейти до {1}?
