Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_scm.xlf
Languages: uk

# repositorySortByPath
source: Sort by Path
uk: Сортувати за шляхом

# scm
source: Source Control Management
uk: Репозиторії контролю версій

# scmInput
source: Source Control Input
uk: Вхідні дані контролю версій

# scmInput.accessibilityHelp
source: {0}, Use {1} to open Source Control Accessibility Help.
uk: {0}, використовуйте {1}, щоб відкрити довідку з доступності системи контролю версій.

# scmInput.accessibilityHelpNoKb
source: {0}, Run the Open Accessibility Help command for more information.
uk: {0}, виконайте команду Open Accessibility Help для отримання додаткової інформації.

# scmInputCancelAction
source: Cancel
uk: Скасувати

# scmInputMoreActions
source: More Actions...
uk: Більше дій...

# scmInputRow.accessibilityHelp
source: Source Control Input, Use {0} to open Source Control Accessibility Help.
uk: Вхід контролю версій, використайте {0} для відкриття довідки з доступності контролю версій.

# scmInputRow.accessibilityHelpNoKb
source: Source Control Input, Run the Open Accessibility Help command for more information.
uk: Вхід контролю версій, виконайте команду Відкрити довідку з доступності для отримання додаткової інформації.

# setListViewMode
source: View as List
uk: Переглянути як список

# setTreeViewMode
source: View as Tree
uk: Переглянути як Дерево

# sortAction
source: View & Sort
uk: Переглянути та відсортувати

source: Sort Changes by Name
uk: Сортувати зміни за назвою

source: Sort Changes by Path
uk: Сортувати зміни за шляхом

source: Sort Changes by Status
uk: Сортувати зміни за статусом

# editorGutterAddedBackground
source: Editor gutter background color for lines that are added.
uk: Колір фону канавки редактора для рядків, які додаються.

# editorGutterDeletedBackground
source: Editor gutter background color for lines that are deleted.
uk: Колір фону краю редактора для рядків, які були видалені.

# editorGutterModifiedBackground
source: Editor gutter background color for lines that are modified.
uk: Колір фону бічної панелі редактора для рядків, які були змінені.

# minimapGutterAddedBackground
source: Minimap gutter background color for lines that are added.
uk: Колір фону жолоба міні-карти для рядків, які додаються.

# minimapGutterDeletedBackground
source: Minimap gutter background color for lines that are deleted.
uk: Колір фону бордюра міні-карти для рядків, які були видалені.

# minimapGutterModifiedBackground
source: Minimap gutter background color for lines that are modified.
uk: Колір фону канавки міні-карти для змінених рядків.

# overviewRulerAddedForeground
source: Overview ruler marker color for added content.
uk: Огляд кольору маркера лінійки для доданого контенту.

# overviewRulerDeletedForeground
source: Overview ruler marker color for deleted content.
uk: Огляд кольору маркера лінійки для видаленого контенту.

# overviewRulerModifiedForeground
source: Overview ruler marker color for modified content.
uk: Огляд кольору маркера лінійки для зміненого вмісту.
