Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_testing.xlf
Languages: uk

# testing.iconPassed.retired
source: Retired color for the 'passed' icon in the test explorer.
uk: Відкликаний колір для іконки 'пройдено' у тестовому досліднику.

# testing.iconQueued
source: Color for the 'Queued' icon in the test explorer.
uk: Колір для іконки 'Queued' у тестовому оглядачі.

# testing.iconQueued.retired
source: Retired color for the 'Queued' icon in the test explorer.
uk: Відкликаний колір для іконки 'Queued' у тестовому експлорері.

# testing.iconSkipped
source: Color for the 'Skipped' icon in the test explorer.
uk: Колір для іконки 'Пропущено' в оглядачі тестів.

# testing.iconSkipped.retired
source: Retired color for the 'Skipped' icon in the test explorer.
uk: Відкликаний колір для іконки 'Пропущено' в тестовому оглядачі.

# testing.iconUnset
source: Color for the 'Unset' icon in the test explorer.
uk: Колір для іконки 'Unset' у тестовому оглядачі.

# testing.iconUnset.retired
source: Retired color for the 'Unset' icon in the test explorer.
uk: Відпрацьований колір для іконки 'Unset' у тестовому експлорері.

# testing.message.error.badgeBackground
source: Background color of test error messages shown inline in the editor.
uk: Колір фону повідомлень про помилки тестів, які відображаються в редакторі.

# testing.message.error.badgeBorder
source: Border color of test error messages shown inline in the editor.
uk: Колір рамки повідомлень про помилки тестування, що відображаються в редакторі.

# testing.message.error.badgeForeground
source: Text color of test error messages shown inline in the editor.
uk: Колір тексту повідомлень про помилки тестування, які відображаються в редакторі.

# testing.message.error.marginBackground
source: Margin color beside error messages shown inline in the editor.
uk: Колір поля поряд з повідомленнями про помилки, що відображаються в редакторі.

# testing.message.info.decorationForeground
source: Text color of test info messages shown inline in the editor.
uk: Колір тексту інформаційних повідомлень тесту, які відображаються в редакторі.

# testing.message.info.marginBackground
source: Margin color beside info messages shown inline in the editor.
uk: Колір поля поряд з інформаційними повідомленнями, що відображаються в редакторі.

# testing.messagePeekBorder
source: Color of the peek view borders and arrow when peeking a logged message.
uk: Колір меж попереднього перегляду та стрілки під час перегляду зафіксованого повідомлення.

# testing.messagePeekHeaderBackground
source: Color of the peek view borders and arrow when peeking a logged message.
uk: Колір меж попереднього перегляду та стрілки під час перегляду зафіксованого повідомлення.

# testing.peekBorder
source: Color of the peek view borders and arrow.
uk: Колір меж та стрілки попереднього перегляду.

# testing.runAction
source: Color for 'run' icons in the editor.
uk: Колір для іконок 'run' в редакторі.

# testing.uncoveredBackground
source: Background color of text that was not covered.
uk: Колір фону тексту, який не був закритий.

# testing.uncoveredBorder
source: Border color of text that was not covered.
uk: Колір межі тексту, який не був закритий.

# testing.uncoveredBranchBackground
source: Background of the widget shown for an uncovered branch.
uk: Фон віджета, показаний для непокритої гілки.

# testing.uncoveredGutterBackground
source: Gutter color of regions where code not covered.
uk: Колір жолоба регіонів, де код не покритий.

# testConfigurationTitle
source: Testing
uk: Тестування

# testing.ShowCoverageInExplorer
source: Whether test coverage should be down in the File Explorer view.
uk: Чи повинно бути зменшено покриття тестування у вигляді Провідника файлів.

# testing.alwaysRevealTestOnStateChange
source: Always reveal the executed test when {0} is on. If this setting is turned off, only failed tests will be revealed.
uk: Завжди показуйте виконаний тест, коли {0} увімкнено. Якщо ця настройка вимкнена, будуть показані лише невдалі тести.

# testing.automaticallyOpenPeekView
source: Configures when the error Peek view is automatically opened.
uk: Налаштовує, коли перегляд помилки Peek автоматично відкривається.

# testing.automaticallyOpenPeekView.failureAnywhere
source: Open automatically no matter where the failure is.
uk: Відкривайте автоматично, незалежно від того, де сталася помилка.

# testing.automaticallyOpenPeekView.failureInVisibleDocument
source: Open automatically when a test fails in a visible document.
uk: Відкривати автоматично, коли тест не проходить у видимому документі.

# testing.automaticallyOpenPeekView.never
source: Never automatically open.
uk: Ніколи не відкривати автоматично.

# testing.automaticallyOpenPeekViewDuringContinuousRun
source: Controls whether to automatically open the Peek view during continuous run mode.
uk: Контролює, чи автоматично відкривати перегляд Peek під час безперервного режиму виконання.

# testing.countBadge
source: Controls the count badge on the Testing icon on the Activity Bar.
uk: Контролює значок лічильника на іконці Тестування на панелі активності.

# testing.countBadge.failed
source: Show the number of failed tests
uk: Показати кількість невдалих тестів

# testing.countBadge.off
source: Disable the testing count badge
uk: Вимкнути значок лічильника тестування

# testing.countBadge.passed
source: Show the number of passed tests
uk: Показати кількість пройдених тестів

# testing.countBadge.skipped
source: Show the number of skipped tests
uk: Показати кількість пропущених тестів

# testing.coverageBarThresholds
source: Configures the colors used for percentages in test coverage bars.
uk: Налаштовує кольори, що використовуються для відсотків у графіках покриття тестами.

# testing.coverageToolbarEnabled
source: Controls whether the coverage toolbar is shown in the editor.
uk: Контролює, чи відображається панель інструментів покриття в редакторі.

# testing.defaultGutterClickAction
source: Controls the action to take when left-clicking on a test decoration in the gutter.
uk: Контролює дію, яка виконується при лівому кліку на тестове оформлення в лівій панелі.

# testing.defaultGutterClickAction.contextMenu
source: Open the context menu for more options.
uk: Відкрийте контекстне меню для отримання додаткових опцій.

# testing.defaultGutterClickAction.coverage
source: Run the test with coverage.
uk: Запустіть тест з покриттям.

# testing.defaultGutterClickAction.debug
source: Debug the test.
uk: Виправте тест.

# testing.defaultGutterClickAction.run
source: Run the test.
uk: Запустіть тест.

# testing.displayedCoveragePercent
source: Configures what percentage is displayed by default for test coverage.
uk: Налаштовує, який відсоток за замовчуванням відображається для покриття тестами.

# testing.displayedCoveragePercent.minimum
source: The minimum of statement, function, and branch coverage.
uk: Мінімум покриття операторів, функцій та гілок.

# testing.displayedCoveragePercent.statement
source: The statement coverage.
uk: Покриття операторів.

# testing.displayedCoveragePercent.totalCoverage
source: A calculation of the combined statement, function, and branch coverage.
uk: Розрахунок комбінованого звіту, функціонального та покриття гілок.

# testing.followRunningTest
source: Controls whether the running test should be followed in the Test Explorer view.
uk: Контролює, чи слід слідкувати за виконуваним тестом у вигляді Test Explorer.

# testing.gutterEnabled
source: Controls whether test decorations are shown in the editor gutter.
uk: Контролює, чи відображаються декорації тестів у бічній панелі редактора.

# testing.openTesting
source: Controls when the testing view should open.
uk: Контролює, коли має відкриватися режим тестування.

# testing.openTesting.neverOpen
source: Never automatically open the testing views
uk: Ніколи автоматично не відкривати перегляди тестування

# testing.openTesting.openExplorerOnTestStart
source: Open the test explorer when tests start
uk: Відкрийте дослідник тестів, коли починаються тести.

# testing.openTesting.openOnTestFailure
source: Open the test result view on any test failure
uk: Відкрийте перегляд результатів тесту при будь-якому збою тесту.

# testing.openTesting.openOnTestStart
source: Open the test results view when tests start
uk: Відкрийте перегляд результатів тестів, коли тести починаються

# testing.resultsView.layout
source: Controls the layout of the Test Results view.
uk: Контролює макет вигляду Результатів тестування.

# testing.resultsView.layout.treeLeft
source: Show the test run tree on the left side with details on the right.
uk: Показати дерево тестових запусків зліва з деталями справа.

# testing.resultsView.layout.treeRight
source: Show the test run tree on the right side with details on the left.
uk: Показати дерево тестового прогону з правого боку з деталями з лівого.

# testing.saveBeforeTest
source: Control whether save all dirty editors before running a test.
uk: Контролюйте, чи зберігати всі незбережені редактори перед виконанням тесту.

# testing.showAllMessages
source: Controls whether to show messages from all test runs.
uk: Контролює, чи показувати повідомлення з усіх тестових запусків.

# testGroup.coverage
source: Coverage
uk: Покриття

# testGroup.debug
source: Debug
uk: Відладка

# testGroup.run
source: Run
uk: Запустити

# testState.errored
source: Errored
uk: Помилка

# testState.failed
source: Failed
uk: Не вдалося

# testState.passed
source: Passed
uk: Пройдено

# testState.queued
source: Queued
uk: У черзі

# testState.running
source: Running
uk: Запуск

# testState.skipped
source: Skipped
uk: Пропущено

# testState.unset
source: Not yet run
uk: Ще не виконано

# runFinished
source: Test run at {0}
uk: Тестовий запуск о {0}

# testUnnamedTask
source: Unnamed Task
uk: Безіменне завдання

# testError
source: An error occurred attempting to run tests: {0}
uk: Сталася помилка під час спроби виконати тести: {0}

# testTrust
source: Running tests may execute code in your workspace.
uk: Запуск тестів може виконувати код у вашому робочому просторі.

# testing.runProfileBitset.coverage
source: Coverage
uk: Покриття

# testing.runProfileBitset.debug
source: Debug
uk: Відладка

# testing.runProfileBitset.run
source: Run
uk: Запустити

# runTestTool.confirm.all
source: The model wants to run all tests.
uk: Модель хоче виконати всі тести.

# runTestTool.confirm.invocation
source: Running tests...
uk: Виконання тестів...

# runTestTool.confirm.message
source: The model wants to run tests in {0}.
uk: Модель хоче провести тести в {0}.

# runTestTool.confirm.title
source: Allow test run?
uk: Дозволити запуск тесту?

# runTestTool.invoke.cancelled
source: Test run was cancelled.
uk: Запуск тесту був скасований.

# runTestTool.invoke.filesProgress
source: Discovering tests...
uk: Відкриття тестів...

# runTestTool.invoke.filterProgress
source: Filtering tests...
uk: Фільтрація тестів...

# runTestTool.invoke.progress
source: Starting test run...
uk: Початок тестового запуску...

# runTestTool.noRunStarted
source: No test run was started. This may be an issue with your test runner or extension.
uk: Не було розпочато жодного тестового запуску. Це може бути проблемою з вашим тестовим запуском або розширенням.

# runTestTool.noTests
source: No tests found in the files
uk: Не знайдено тестів у файлах

# runTestTool.userDescription
source: Runs unit tests (optionally with coverage)
uk: Запускає модульні тести (опційно з покриттям)

# runNoOutout
source: The test run did not record any output.
uk: Тестовий запуск не зафіксував жодного виходу.

# testing.activeEditorHasTests
source: Indicates whether any tests are present in the current editor
uk: Вказує, чи є які-небудь тести в поточному редакторі

# testing.canGoToRelatedCode
source: Whether a controller implements a capability to find code related to a test
uk: Чи реалізує контролер можливість знаходити код, пов'язаний з тестом

# testing.canGoToRelatedTest
source: Whether a controller implements a capability to find tests related to code
uk: Чи контролер реалізує можливість знаходити тести, пов'язані з кодом

# testing.canRefresh
source: Indicates whether any test controller has an attached refresh handler.
uk: Вказує, чи має будь-який контролер тестів прикріплений обробник оновлення.

# testing.controllerId
source: Controller ID of the current test item
uk: Ідентифікатор контролера поточного тестового елемента

# testing.coverageToolbarEnabled
source: Indicates whether the coverage toolbar is enabled
uk: Контролює, чи відображається панель інструментів покриття в редакторі.

# testing.cursorInsideTestRange
source: Whether the cursor is currently inside a test range
uk: Чи знаходиться курсор наразі всередині тестового діапазону

# testing.hasConfigurableConfig
source: Indicates whether any test configuration can be configured
uk: Вказує, чи можна налаштувати будь-яку конфігурацію тесту.

# testing.hasCoverableTests
source: Indicates whether any test controller has registered a coverage configuration
uk: Вказує, чи зареєстрував будь-який контролер тестування конфігурацію покриття

# testing.hasCoverageInFile
source: Indicates coverage has been reported in the curent editor.
uk: Вказує, що покриття було зафіксовано в поточному редакторі.

# testing.hasDebuggableTests
source: Indicates whether any test controller has registered a debug configuration
uk: Вказує, чи зареєстрував будь-який контролер тестування конфігурацію налагодження.

# testing.hasInlineCoverageDetails
source: Indicates whether detailed per-line coverage is available for inline display
uk: Вказує, чи доступне детальне покриття по рядках для вбудованого відображення

# testing.hasNonDefaultConfig
source: Indicates whether any test controller has registered a non-default configuration
uk: Вказує, чи зареєстрував будь-який контролер тестування нестандартну конфігурацію

# testing.hasPerTestCoverage
source: Indicates whether per-test coverage is available
uk: Вказує, чи доступне покриття для кожного тесту

# testing.hasRunnableTests
source: Indicates whether any test controller has registered a run configuration
uk: Вказує, чи зареєстрував будь-який контролер тестів конфігурацію запуску.

# testing.inlineCoverageEnabled
source: Indicates whether inline coverage is shown
uk: Вказує, чи відображається вбудоване покриття

# testing.isContinuousModeOn
source: Indicates whether continuous test mode is on.
uk: Вказує, чи увімкнено безперервний режим тестування.

# testing.isCoverageFilteredToTest
source: Indicates whether coverage has been filterd to a single test
uk: Вказує, чи було покриття відфільтровано до одного тесту.

# testing.isParentRunningContinuously
source: Indicates whether the parent of a test is continuously running, set in the menu context of test items
uk: Вказує, чи батьківський елемент тесту постійно виконується, встановлено в контекстному меню тестових елементів.

# testing.isRefreshing
source: Indicates whether any test controller is currently refreshing tests.
uk: Вказує, чи будь-який контролер тестів наразі оновлює тести.

# testing.isTestCoverageOpen
source: Indicates whether a test coverage report is open
uk: Вказує, чи відкритий звіт про покриття тестів

# testing.peekHasStack
source: Whether the message shown in a peek view has a stack trace
uk: Чи має повідомлення, що відображається у попередньому перегляді, трасування стека

# testing.peekItemType
source: Type of the item in the output peek view. Either a "test", "message", "task", or "result".
uk: Тип елемента у вихідному попередньому перегляді. Може бути "тест", "повідомлення", "завдання" або "результат".

# testing.profile.context.group
source: Type of menu where the configure testing profile submenu exists. Either "run", "debug", or "coverage"
uk: Тип меню, в якому існує підменю налаштування профілю тестування. Або "run", "debug" або "coverage"

# testing.supportsContinuousRun
source: Indicates whether continous test running is supported
uk: Вказує, чи підтримується безперервне виконання тестів.

# testing.testId
source: ID of the current test item, set when creating or opening menus on test items
uk: ID поточного тестового елемента, встановлюється під час створення або відкриття меню на тестових елементах

# testing.testItemHasUri
source: Boolean indicating whether the test item has a URI defined
uk: Булева змінна, що вказує, чи має тестовий елемент визначений URI.

# testing.testItemIsHidden
source: Boolean indicating whether the test item is hidden
uk: Булеве значення, що вказує, чи прихований тестовий елемент

# testing.testMessage
source: Value set in `testMessage.contextValue`, available in editor/content and testing/message/context
uk: Значення, встановлене в `testMessage.contextValue`, доступне в editor/content та testing/message/context

# testing.testResultOutdated
source: Value available in editor/content and testing/message/context when the result is outdated
uk: Значення доступне в editor/content та testing/message/context, коли результат застарілий

# testing.testResultState
source: Value available testing/item/result indicating the state of the item.
uk: Значення доступного тестування/предмета/результату, що вказує на стан предмета.

# testProgress.completed
source: {0}/{1} tests passed ({2}%)
uk: {0}/{1} тестів пройдено ({2}%)

# testProgress.running
source: Running tests, {0}/{1} passed ({2}%)
uk: Виконуються тести, {0}/{1} пройдено ({2}%)

# testProgress.runningInitial
source: Running tests...
uk: Виконання тестів...

# testProgressWithSkip.completed
source: {0}/{1} tests passed ({2}%, {3} skipped)
uk: {0}/{1} тестів пройдено ({2}%, {3} пропущено)

# testProgressWithSkip.running
source: Running tests, {0}/{1} tests passed ({2}%, {3} skipped)
uk: Виконуються тести, {0}/{1} тестів пройшли ({2}%, {3} пропущено)
