Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_welcomeGettingStarted.xlf
Languages: uk

# gettingStarted.goToSymbol.description.interpolated
source: The Go to Symbol command is useful for navigating between important landmarks in a document. {0}
uk: Команда Перейти до символу корисна для навігації між важливими орієнтирами в документі. {0}

# gettingStarted.goToSymbol.title
source: Navigate to symbols in a file
uk: Перейдіть до символів у файлі

# gettingStarted.hover.description.interpolated
source: While focus is in the editor on a variable or symbol, a hover can be can be focused with the Show or Open Hover command. {0}
uk: Поки фокус знаходиться в редакторі на змінній або символі, на підказку можна навести фокус за допомогою команди Показати або Відкрити підказку. {0}

# gettingStarted.hover.title
source: Access the hover in the editor to get more information on a variable or symbol
uk: Отримайте доступ до наведення в редакторі, щоб отримати більше інформації про змінну або символ.

# gettingStarted.installGit.description.interpolated
source: Install Git to track changes in your projects. {0} {1}Reload window{2} after installation to complete Git setup.
uk: Встановіть Git, щоб відстежувати зміни у ваших проектах. {0} {1}Перезавантажте вікно{2} після встановлення, щоб завершити налаштування Git.

# gettingStarted.installGit.title
source: Install Git
uk: Встановіть Git

# gettingStarted.intellisense.description.interpolated
source: Intellisense suggestions can be opened with the Trigger Intellisense command. {0} Inline intellisense suggestions can be triggered with Trigger Inline Suggestion {1} Useful settings include editor.inlineCompletionsAccessibilityVerbose and editor.screenReaderAnnounceInlineSuggestion.
uk: Пропозиції Intellisense можна відкрити за допомогою команди Trigger Intellisense. {0} Пропозиції інтерактивного Intellisense можна викликати за допомогою Trigger Inline Suggestion {1} Корисні налаштування включають editor.inlineCompletionsAccessibilityVerbose та editor.screenReaderAnnounceInlineSuggestion.

# gettingStarted.intellisense.title
source: Use Intellisense to improve coding efficiency
uk: Використовуйте Intellisense для підвищення ефективності кодування

# gettingStarted.keyboardShortcuts.description.interpolated
source: Once you have discovered your favorite commands, create custom keyboard shortcuts for instant access. {0}
uk: Як тільки ви знайдете свої улюблені команди, створіть власні комбінації клавіш для миттєвого доступу. {0}

# gettingStarted.keyboardShortcuts.title
source: Customize your keyboard shortcuts
uk: Налаштуйте свої клавіші швидкого доступу

# gettingStarted.menuBar.description.interpolated
source: The full menu bar is available in the dropdown menu to make room for your code. Toggle its appearance for faster access. {0}
uk: Повний рядок меню доступний у випадаючому меню, щоб звільнити місце для вашого коду. Перемикайте його вигляд для швидшого доступу. {0}

# gettingStarted.menuBar.title
source: Just the right amount of UI
uk: Саме така кількість UI, яка потрібна

# gettingStarted.newFile.description
source: Open a new untitled text file, notebook, or custom editor.
uk: Відкрийте новий неназваний текстовий файл, блокнот або користувацький редактор.

# gettingStarted.newFile.title
source: New File...
uk: Новий файл...

# gettingStarted.notebook.title
source: Customize Notebooks
uk: Налаштувати блокноти

# gettingStarted.notebook.walkthroughPageTitle
source: Notebooks
uk: Блокноти

# gettingStarted.notebookProfile.description
source: Get notebooks to feel just the way you prefer
uk: Отримайте блокноти, щоб відчувати так, як вам подобається.

# gettingStarted.notebookProfile.title
source: Select the layout for your notebooks
uk: Виберіть макет для ваших блокнотів

# gettingStarted.openFile.description
source: Open a file to start working
uk: Відкрийте файл, щоб почати працювати.

# gettingStarted.openFile.title
source: Open File...
uk: Відкрити файл...

# gettingStarted.openFolder.description
source: Open a folder to start working
uk: Відкрийте папку, щоб почати працювати.

# gettingStarted.openFolder.title
source: Open Folder...
uk: Відкрити папку...

# gettingStarted.openMac.description
source: Open a file or folder to start working
uk: Відкрийте файл або папку, щоб почати працювати

# gettingStarted.openMac.title
source: Open...
uk: Відкрити...

# gettingStarted.pickColor.description.interpolated
source: The right theme helps you focus on your code, is easy on your eyes, and is simply more fun to use. {0}
uk: Правильна тема допомагає вам зосередитися на вашому коді, є приємною для очей і просто більш цікавою у використанні. {0}

# gettingStarted.pickColor.title
source: Choose your theme
uk: Виберіть свою тему

# gettingStarted.quickOpen.description.interpolated
source: Navigate between files in an instant with one keystroke. Tip: Open multiple files by pressing the right arrow key. {0}
uk: Перемикайтеся між файлами миттєво за допомогою одного натискання клавіші. Порада: Відкривайте кілька файлів, натискаючи клавішу правої стрілки. {0}

# gettingStarted.quickOpen.title
source: Quickly navigate between your files
uk: Швидко перемикайтеся між вашими файлами

# gettingStarted.scm.description.interpolated
source: No more looking up Git commands! Git and GitHub workflows are seamlessly integrated. {0}
uk: Більше не потрібно шукати команди Git! Робочі процеси Git і GitHub безперешкодно інтегровані. {0}

# gettingStarted.scm.title
source: Track your code with Git
uk: Відстежуйте свій код за допомогою Git

# gettingStarted.scmClone.description.interpolated
source: Set up the built-in version control for your project to track your changes and collaborate with others. {0}
uk: Налаштуйте вбудовану систему контролю версій для вашого проєкту, щоб відстежувати зміни та співпрацювати з іншими. {0}

# gettingStarted.scmSetup.description.interpolated
source: Set up the built-in version control for your project to track your changes and collaborate with others. {0}
uk: Налаштуйте вбудовану систему контролю версій для вашого проєкту, щоб відстежувати зміни та співпрацювати з іншими. {0}

# gettingStarted.settings.title
source: Tune your settings
uk: Налаштуйте свої параметри

# gettingStarted.settingsAndSync.description.interpolated
source: Customize every aspect of VS Code and your extensions to your liking. [Back up and sync](command:workbench.userDataSync.actions.turnOn) your essential customizations across all your devices. {0}
uk: Налаштуйте кожен аспект VS Code та своїх розширень на свій смак. [Резервне копіювання та синхронізація](command:workbench.userDataSync.actions.turnOn) ваших основних налаштувань на всіх ваших пристроях. {0}

# gettingStarted.settingsSync.description.interpolated
source: Keep your essential customizations backed up and updated across all your devices. {0}
uk: Зберігайте свої основні налаштування в резервній копії та оновленими на всіх ваших пристроях. {0}

# gettingStarted.settingsSync.title
source: Sync settings across devices
uk: Синхронізувати налаштування між пристроями

# gettingStarted.setup.OpenFolder.title
source: Open up your code
uk: Відкрийте свій код

# gettingStarted.setup.OpenFolderWeb.description.interpolated
source: You're all set to start coding. You can open a local project or a remote repository to get your files into VS Code. {0} {1}
uk: Ви готові почати кодувати. Ви можете відкрити локальний проект або віддалений репозиторій, щоб імпортувати свої файли у VS Code. {0} {1}

# gettingStarted.setup.description
source: Customize your editor, learn the basics, and start coding
uk: Налаштуйте свій редактор, вивчіть основи та почніть кодувати.

# gettingStarted.setup.title
source: Get Started with VS Code
uk: Почніть працювати з VS Code

# gettingStarted.setup.walkthroughPageTitle
source: Setup VS Code
uk: Налаштування VS Code

# gettingStarted.setupAccessibility.description
source: Learn the tools and shortcuts that make VS Code accessible. Note that some actions are not actionable from within the context of the walkthrough.
uk: Досліджуйте інструменти та ярлики, які роблять VS Code доступним. Зверніть увагу, що деякі дії не можуть бути виконані в контексті цього посібника.

# gettingStarted.setupAccessibility.title
source: Get Started with Accessibility Features
uk: Почніть з функцій доступності

# gettingStarted.setupAccessibility.walkthroughPageTitle
source: Setup VS Code Accessibility
uk: Налаштування доступності VS Code

# gettingStarted.setupWeb.description
source: Customize your editor, learn the basics, and start coding
uk: Налаштуйте свій редактор, вивчіть основи та почніть кодувати.

# gettingStarted.setupWeb.title
source: Get Started with VS Code for the Web
uk: Почніть працювати з VS Code для вебу

# gettingStarted.setupWeb.walkthroughPageTitle
source: Setup VS Code Web
uk: Налаштування VS Code Web

# gettingStarted.shortcuts.description.interpolated
source: Once you have discovered your favorite commands, create custom keyboard shortcuts for instant access. {0}
uk: Як тільки ви знайдете свої улюблені команди, створіть власні комбінації клавіш для миттєвого доступу. {0}

# gettingStarted.shortcuts.title
source: Customize your shortcuts
uk: Налаштуйте свої ярлики

# gettingStarted.tasks.description.interpolated
source: Create tasks for your common workflows and enjoy the integrated experience of running scripts and automatically checking results. {0}
uk: Створюйте завдання для своїх загальних робочих процесів і насолоджуйтеся інтегрованим досвідом виконання скриптів та автоматичної перевірки результатів. {0}

# gettingStarted.tasks.title
source: Automate your project tasks
uk: Автоматизуйте свої проектні завдання

# gettingStarted.terminal.description.interpolated
source: Quickly run shell commands and monitor build output, right next to your code. {0}
uk: Швидко виконуйте команди оболонки та контролюйте вихідні дані збірки, прямо поруч із вашим кодом. {0}

# gettingStarted.terminal.title
source: Built-in terminal
uk: Вбудований термінал

# gettingStarted.topLevelGitClone.description
source: Clone a remote repository to a local folder
uk: Клонувати віддалений репозиторій у локальну папку

# gettingStarted.topLevelGitClone.title
source: Clone Git Repository...
uk: Клонувати Git репозиторій...

# gettingStarted.topLevelGitOpen.description
source: Connect to a remote repository or pull request to browse, search, edit, and commit
uk: Підключіться до віддаленого репозиторію або запиту на злиття, щоб переглядати, шукати, редагувати та комітити.

# gettingStarted.topLevelGitOpen.title
source: Open Repository...
uk: Відкрити репозиторій...

# gettingStarted.topLevelOpenTunnel.description
source: Connect to a remote machine through a Tunnel
uk: Підключитися до віддаленого комп'ютера через тунель

# gettingStarted.topLevelOpenTunnel.title
source: Open Tunnel...
uk: Відкрити тунель...

# gettingStarted.topLevelRemoteOpen.description
source: Connect to remote development workspaces.
uk: Підключіться до віддалених робочих просторів для розробки.

# gettingStarted.topLevelRemoteOpen.title
source: Connect to...
uk: Підключитися до...

# gettingStarted.topLevelShowWalkthroughs.description
source: View a walkthrough on the editor or an extension
uk: Перегляньте посібник з редактором або розширенням

# gettingStarted.topLevelShowWalkthroughs.title
source: Open a Walkthrough...
uk: Відкрити посібник...

# gettingStarted.verbositySettings.description.interpolated
source: Screen reader verbosity settings exist for features around the workbench so that once a user is familiar with a feature, they can avoid hearing hints about how to operate it. For example, features for which an accessibility help dialog exists will indicate how to open the dialog until the verbosity setting for that feature has been disabled. These and other accessibility settings can be configured by running the Open Accessibility Settings command. {0}
uk: Налаштування вербозності для екранних читалок існують для функцій навколо робочої області, щоб після того, як користувач ознайомиться з функцією, він міг уникати почути підказки про те, як її використовувати. Наприклад, функції, для яких існує діалог допомоги з доступності, вкажуть, як відкрити діалог, поки налаштування вербозності для цієї функції не буде вимкнено. Ці та інші налаштування доступності можна налаштувати, виконавши команду Відкрити налаштування доступності. {0}

# gettingStarted.verbositySettings.title
source: Control the verbosity of aria labels
uk: Контролюйте verbosity aria-міток

# gettingStarted.videoTutorial.description.interpolated
source: Watch the first in a series of short & practical video tutorials for VS Code's key features. {0}
uk: Дивіться перший у серії коротких та практичних відеоуроків про ключові функції VS Code. {0}

# gettingStarted.videoTutorial.title
source: Watch video tutorials
uk: Дивіться відеоуроки

# gettingStarted.workspaceTrust.description.interpolated
source: {0} lets you decide whether your project folders should **allow or restrict** automatic code execution __(required for extensions, debugging, etc)__. Opening a file/folder will prompt to grant trust. You can always {1} later.
uk: {0} дозволяє вам вирішити, чи повинні ваші папки проекту **дозволяти або обмежувати** автоматичне виконання коду __(необхідно для розширень, налагодження тощо)__. Відкриття файлу/папки запропонує надати довіру. Ви завжди можете {1} пізніше.

# gettingStarted.workspaceTrust.title
source: Safely browse and edit code
uk: Безпечно переглядайте та редагуйте код

# initRepo
source: Initialize Git Repository
uk: Ініціалізувати репозиторій Git

source: Install Git
uk: Встановити Git

source: Keyboard Shortcuts
uk: Комбінації клавіш

source: List Signal Announcements
uk: Список сигналів оголошень

source: List Signal Sounds
uk: Список звуків сигналів

source: Open Accessibility Help
uk: Відкрити допомогу з доступності

source: Open Accessibility Settings
uk: Відкрити налаштування доступності

source: Open Accessible View
uk: Відкрити доступний перегляд

source: Open Folder
uk: відкрити папку

# openGoToSymbol
source: Go to Symbol
uk: Перейти до символу

source: Open Repository
uk: Відкрити репозиторій

# openSCM
source: Open Source Control
uk: Відкрите джерело управління

# openVerbositySettings
source: Open Accessibility Settings
uk: Відкрити налаштування доступності

# quickOpen
source: Quick Open a File
uk: Швидке відкриття файлу

# runProject
source: Run your Project
uk: Запустіть ваш проект

# runTasks
source: Run Auto-detected Tasks
uk: Запустити автоматично виявлені завдання

# setupCopilotButton.chatWithCopilot
source: Chat with Copilot
uk: Чат з Copilot

# setupCopilotButton.setup
source: Set Up Copilot for Free
uk: Налаштуйте Copilot безкоштовно

# setupCopilotButton.signIn
source: Set Up Copilot for Free
uk: Налаштуйте Copilot безкоштовно

source: Show or Focus Hover
uk: Показати або Зосередити Наведення

# showTerminal
source: Open Terminal
uk: Відкрити термінал

# titleID
source: Browse Color Themes
uk: Перегляд кольорових тем

source: Toggle Fold
uk: Перекладіть цей рядок з англійської на українську мову: Переключити складання

source: Toggle Fold Recursively
uk: Перемикати складання рекурсивно

source: Toggle Menu Bar
uk: Перемикати панель меню

source: Trigger Inline Suggestion
uk: Запустити вбудовану пропозицію

source: Trigger Intellisense
uk: Запустити Intellisense

# tweakSettings
source: Open Settings
uk: Відкрити Налаштування

# watch
source: Watch Tutorial
uk: Переглянути навчальний посібник

source: Workspace Trust
uk: Довіра до робочого простору

source: Default
uk: За замовчуванням

# HighContrast
source: Dark High Contrast
uk: Темний високий контраст

# HighContrastLight
source: Light High Contrast
uk: Світлий високий контраст

# dark
source: Dark Modern
uk: Темний сучасний

# light
source: Light Modern
uk: Світлий сучасний

# seeMore
source: See More Themes...
uk: Дивитися більше тем...
