Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_welcomeViews.xlf
Languages: uk

source: Built-In
uk: Вбудований

source: Create
uk: Створити

# change keybinding
source: Configure Keybinding
uk: Налаштувати клавішу прив'язки

source: File
uk: Файл

# miNewFile2
source: Text File
uk: Текстовий файл

# miNewFileWithName
source: Create New File ({0})
uk: Створити новий файл ({0})

# newFilePlaceholder
source: Select File Type or Enter File Name...
uk: Виберіть тип файлу або введіть ім'я файлу...

# newFileTitle
source: New File...
uk: Новий файл...

source: Notebook
uk: Ноутбук

# welcome.newFile
source: New File...
uk: Новий файл...

# ViewsWelcomeExtensionPoint.proposedAPI
source: The viewsWelcome contribution in '{0}' requires 'enabledApiProposals: ["contribViewsWelcome"]' in order to use the 'group' proposed property.
uk: Вклад ViewsWelcome у '{0}' вимагає 'enabledApiProposals: ["contribViewsWelcome"]' для використання запропонованої властивості 'group'.

# contributes.viewsWelcome
source: Contributed views welcome content. Welcome content will be rendered in tree based views whenever they have no meaningful content to display, ie. the File Explorer when no folder is open. Such content is useful as in-product documentation to drive users to use certain features before they are available. A good example would be a `Clone Repository` button in the File Explorer welcome view.
uk: Вкладені перегляди вітають контент. Вітаючий контент буде відображатися в деревоподібних переглядах, коли у них немає змістовного контенту для відображення, тобто в Провіднику файлів, коли жодна папка не відкрита. Такий контент корисний як документація в продукті, щоб спонукати користувачів використовувати певні функції до того, як вони стануть доступними. Гарним прикладом буде кнопка `Клонувати репозиторій` у вітальному перегляді Провідника файлів.

# contributes.viewsWelcome.view
source: Contributed welcome content for a specific view.
uk: Додано вітальне контент для конкретного вигляду.

# contributes.viewsWelcome.view.contents
source: Welcome content to be displayed. The format of the contents is a subset of Markdown, with support for links only.
uk: Ласкаво просимо, вміст для відображення. Формат вмісту є підмножиною Markdown, з підтримкою лише посилань.

# contributes.viewsWelcome.view.enablement
source: Condition when the welcome content buttons and command links should be enabled.
uk: Умова, коли кнопки вітального контенту та командні посилання повинні бути активовані.

# contributes.viewsWelcome.view.group
source: Group to which this welcome content belongs. Proposed API.
uk: Група, до якої належить цей вітальний контент. Запропоноване API.

# contributes.viewsWelcome.view.view
source: Target view identifier for this welcome content. Only tree based views are supported.
uk: Ідентифікатор перегляду цілі для цього вітального контенту. Підтримуються лише перегляди на основі дерева.

# contributes.viewsWelcome.view.when
source: Condition when the welcome content should be displayed.
uk: Умова, коли має бути відображено вітальне вміст.
