Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_externalTerminal.xlf
Languages: uk

# scopedConsoleAction.Integrated
source: Open in Integrated Terminal
uk: Відкрити в інтегрованому терміналі

# scopedConsoleAction.external
source: Open in External Terminal
uk: Відкрити в зовнішньому терміналі

# scopedConsoleAction.wt
source: Open in Windows Terminal
uk: Відкрити в Windows Terminal

# explorer.openInTerminalKind
source: When opening a file from the Explorer in a terminal, determines what kind of terminal will be launched
uk: При відкритті файлу з Провідника в терміналі визначається, який тип терміналу буде запущено

# globalConsoleAction
source: Open New External Terminal
uk: Відкрити новий зовнішній термінал

# sourceControlRepositories.openInTerminalKind
source: When opening a repository from the Source Control Repositories view in a terminal, determines what kind of terminal will be launched
uk: При відкритті репозиторію з вигляду Репозиторії контролю версій у терміналі визначає, який тип терміналу буде запущено

# terminal.external.linuxExec
source: Customizes which terminal to run on Linux.
uk: Налаштовує, який термінал запускати на Linux.

# terminal.external.osxExec
source: Customizes which terminal application to run on macOS.
uk: Налаштовує, який термінальний додаток запускати на macOS.

# terminal.external.windowsExec
source: Customizes which terminal to run on Windows.
uk: Налаштовує, який термінал запускати на Windows.

# terminal.kind.both
source: Show both integrated and external terminal actions.
uk: Показати як інтегровані, так і зовнішні дії терміналу.

# terminal.kind.external
source: Show the external terminal action.
uk: Показати дію зовнішнього терміналу.

# terminal.kind.integrated
source: Show the integrated terminal action.
uk: Показати дію інтегрованого термінала.

# terminalConfigurationTitle
source: External Terminal
uk: Зовнішній термінал
