Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_markers.xlf
Languages: uk

source: Clear filters text
uk: Очистити текст фільтрів

source: Collapse All
uk: Згорнути все

# copyMarker
source: Copy
uk: Копіювати

source: Copy Message
uk: Копіювати повідомлення

source: Focus problems filter
uk: Фільтр проблем з фокусом

# focusProblemsList
source: Focus problems view
uk: Перегляд проблем з фокусом

# markersViewIcon
source: View icon of the markers view.
uk: Переглянути іконку перегляду маркерів.

# miMarker
source: &&Problems
uk: &&Проблеми

source: No Problems
uk: Немає проблем

source: Problems
uk: Проблеми

# show active file
source: Show Active File Only
uk: Показати лише активний файл

source: Show Errors
uk: Показати помилки

source: Show Excluded Files
uk: Показати виключені файли

source: Show Infos
uk: Показати інформацію

# show multiline
source: Show message in multiple lines
uk: Показати повідомлення в кількох рядках

# show singleline
source: Show message in single line
uk: Показати повідомлення в один рядок

source: Show Warnings
uk: Показати попередження

# status.problems
source: Problems
uk: Проблеми

# status.problemsVisibility
source: Problems Visibility
uk: Видимість проблем

# status.problemsVisibilityOff
source: Problems are turned off. Click to open settings.
uk: Проблеми вимкнені. Натисніть, щоб відкрити налаштування.

# toggleActiveFileDescription
source: Show or hide problems (errors, warnings, info) only from the active file in the problems view.
uk: Показати або приховати проблеми (помилки, попередження, інформацію) лише з активного файлу у вигляді проблем.

# toggleErrorsDescription
source: Show or hide errors in the problems view.
uk: Показати або приховати помилки у вигляді проблем.

# toggleExcludedFilesDescription
source: Show or hide excluded files in the problems view.
uk: Показати або приховати виключені файли у вигляді проблем.

# toggleInfosDescription
source: Show or hide infos in the problems view.
uk: Показати або приховати інформацію в перегляді проблем.

# toggleWarningsDescription
source: Show or hide warnings in the problems view.
uk: Показати або приховати попередження в перегляді проблем.

# totalErrors
source: Errors: {0}
uk: Помилки: {0}

# totalInfos
source: Infos: {0}
uk: Інформація: {0}

# totalProblems
source: Total {0} Problems
uk: Всього {0} проблем

# totalWarnings
source: Warnings: {0}
uk: Попередження: {0}

source: View as Table
uk: Переглянути як таблицю

# viewAsTableDescription
source: Show the problems view as a table.
uk: Показати перегляд проблем у вигляді таблиці.

source: View as Tree
uk: Переглянути як Дерево

# viewAsTreeDescription
source: Show the problems view as a tree.
uk: Показати перегляд проблем у вигляді дерева.

# chatContext.diagnstic
source: Problems...
uk: Проблеми...

# chatContext.diagnstic.placeholder
source: Select a problem to attach
uk: Виберіть проблему для прикріплення

# markers.panel.allErrors
source: All Problems
uk: Всі проблеми

# label
source: Problems
uk: Проблеми

# markers.showOnFile
source: Show Errors & Warnings on files and folder. Overwritten by {0} when it is off.
uk: Показувати помилки та попередження у файлах і папках. Перезаписується {0}, коли вимкнено.

# tooltip.1
source: 1 problem in this file
uk: 1 проблема в цьому файлі

# tooltip.N
source: {0} problems in this file
uk: {0} проблем у цьому файлі

# codeColumnLabel
source: Code
uk: Код

# fileColumnLabel
source: File
uk: Файл

# messageColumnLabel
source: Message
uk: Повідомлення

# sourceColumnLabel
source: Source
uk: Джерело

# collapsedIcon
source: Icon indicating that multiple lines are collapsed in the markers view.
uk: Іконка, що вказує на те, що кілька рядків згорнуті у вигляді маркерів.

# expandedIcon
source: Icon indicating that multiple lines are shown in the markers view.
uk: Іконка, що вказує на те, що в режимі маркерів показано кілька рядків.

# multi line
source: Show message in multiple lines
uk: Показати повідомлення в кількох рядках

source: Problems View
uk: Перегляд проблем

# single line
source: Show message in single line
uk: Показати повідомлення в одному рядку

# No problems filtered
source: Showing {0} problems
uk: Показано {0} проблем

# clearFilter
source: Clear Filters
uk: Очистити фільтри

# problems filtered
source: Showing {0} of {1} problems
uk: Показано {0} з {1} проблем

# showing filtered problems
source: Showing {0} of {1}
uk: Показано {0} з {1}

# errors.warnings.show.label
source: Show Errors and Warnings
uk: Показати помилки та попередження

# markers.panel.action.filter
source: Filter Problems
uk: Фільтрувати проблеми

# markers.panel.action.moreFilters
source: More Filters...
uk: Більше фільтрів...

# markers.panel.action.quickfix
source: Show fixes
uk: Показати виправлення

# markers.panel.filter.activeFile
source: Show Active File Only
uk: Показати тільки активний файл

# markers.panel.filter.ariaLabel
source: Filter Problems
uk: Фільтрувати проблеми

# markers.panel.filter.errors
source: errors
uk: помилки

# markers.panel.filter.infos
source: infos
uk: інформація

# markers.panel.filter.placeholder
source: Filter (e.g. text, **/*.ts, !**/node_modules/**)
uk: Фільтр (наприклад, текст, **/*.ts, !**/node_modules/**)

# markers.panel.filter.showErrors
source: Show Errors
uk: Показати помилки

# markers.panel.filter.showInfos
source: Show Infos
uk: Показати інформацію

# markers.panel.filter.showWarnings
source: Show Warnings
uk: Показати попередження

# markers.panel.filter.useFilesExclude
source: Hide Excluded Files
uk: Сховати виключені файли

# markers.panel.filter.warnings
source: warnings
uk: попередження

# markers.panel.multiple.errors.label
source: {0} Errors
uk: {0} Помилок

# markers.panel.multiple.infos.label
source: {0} Infos
uk: {0} Інформація

# markers.panel.multiple.unknowns.label
source: {0} Unknowns
uk: {0} Невідомі

# markers.panel.multiple.warnings.label
source: {0} Warnings
uk: {0} Попереджень

# markers.panel.no.problems.activeFile.build
source: No problems have been detected in the current file.
uk: У поточному файлі не виявлено жодних проблем.

# markers.panel.no.problems.build
source: No problems have been detected in the workspace.
uk: У робочому просторі не виявлено жодних проблем.

# markers.panel.no.problems.filters
source: No results found with provided filter criteria.
uk: Не знайдено жодних результатів з наданими критеріями фільтрації.

# markers.panel.single.error.label
source: 1 Error
uk: 1 Помилка

# markers.panel.single.info.label
source: 1 Info
uk: 1 Інформація

# markers.panel.single.unknown.label
source: 1 Unknown
uk: 1 Невідомий

# markers.panel.single.warning.label
source: 1 Warning
uk: 1 Попередження

# markers.panel.title.problems
source: Problems
uk: Проблеми

# problems.panel.configuration.autoreveal
source: Controls whether Problems view should automatically reveal files when opening them.
uk: Контролює, чи має перегляд Проблем автоматично відкривати файли при їх відкритті.

# problems.panel.configuration.compareOrder
source: Controls the order in which problems are navigated.
uk: Контролює порядок, у якому проблеми обробляються.

# problems.panel.configuration.compareOrder.position
source: Navigate problems ordered by position
uk: Переглянути проблеми, впорядковані за позицією

# problems.panel.configuration.compareOrder.severity
source: Navigate problems ordered by severity
uk: Переглядати проблеми, впорядковані за ступенем серйозності

# problems.panel.configuration.showCurrentInStatus
source: When enabled shows the current problem in the status bar.
uk: Коли увімкнено, показує поточну проблему в рядку стану.

# problems.panel.configuration.title
source: Problems View
uk: Перегляд проблем

# problems.panel.configuration.viewMode
source: Controls the default view mode of the Problems view.
uk: Контролює режим відображення за замовчуванням у вигляді Проблем.

# problems.tree.aria.label.error.marker
source: Error: {0} at line {1} and character {2}.{3} generated by {4}
uk: Помилка: {0} на рядку {1} та символі {2}.{3}, згенерована {4}

# problems.tree.aria.label.error.marker.nosource
source: Error: {0} at line {1} and character {2}.{3}
uk: Помилка: {0} на рядку {1} та символі {2}.{3}

# problems.tree.aria.label.info.marker
source: Info: {0} at line {1} and character {2}.{3} generated by {4}
uk: Інформація: {0} на рядку {1} та символі {2}.{3} згенеровано {4}

# problems.tree.aria.label.info.marker.nosource
source: Info: {0} at line {1} and character {2}.{3}
uk: Інформація: {0} на рядку {1} та символі {2}.{3}

# problems.tree.aria.label.marker
source: Problem: {0} at line {1} and character {2}.{3} generated by {4}
uk: Проблема: {0} на рядку {1} та символі {2}.{3}, згенерована {4}

# problems.tree.aria.label.marker.nosource
source: Problem: {0} at line {1} and character {2}.{3}
uk: Проблема: {0} на рядку {1} та символі {2}.{3}

# problems.tree.aria.label.marker.relatedInformation
source: This problem has references to {0} locations.
uk: Ця проблема має посилання на {0} місць.

# problems.tree.aria.label.relatedinfo.message
source: {0} at line {1} and character {2} in {3}
uk: {0} на рядку {1} та символі {2} у {3}

# problems.tree.aria.label.resource
source: {0} problems in file {1} of folder {2}
uk: {0} проблем у файлі {1} папки {2}

# problems.tree.aria.label.warning.marker
source: Warning: {0} at line {1} and character {2}.{3} generated by {4}
uk: Попередження: {0} на рядку {1} та символі {2}.{3}, згенеровано {4}

# problems.tree.aria.label.warning.marker.nosource
source: Warning: {0} at line {1} and character {2}.{3}
uk: Попередження: {0} на рядку {1} та символі {2}.{3}

# problems.view.focus.label
source: Focus Problems (Errors, Warnings, Infos)
uk: Проблеми фокусування (Помилки, Попередження, Інформація)

# problems.view.toggle.label
source: Toggle Problems (Errors, Warnings, Infos)
uk: Перемикання проблем (Помилки, Попередження, Інформація)
