Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_extensions.xlf
Languages: uk

# cmd.reportOrShow
source: Performance Issue
uk: Проблема з продуктивністю

# cmd.show
source: Show Issues
uk: Показати проблеми

# extensionHostProfileStart
source: Start Extension Host Profile
uk: Почати профіль розширення хоста

source: Open Extension Host Profile
uk: Відкрити профіль хоста розширення

source: Save Extension Host Profile
uk: Зберегти профіль хоста розширення

# saveprofile.dialogTitle
source: Save Extension Host Profile
uk: Зберегти профіль хоста розширення

# stopExtensionHostProfileStart
source: Stop Extension Host Profile
uk: Зупинити профіль хосту розширення
