Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_configurationResolver.xlf
Languages: uk

# commandVariable.noStringType
source: Cannot substitute command variable '{0}' because command did not return a result of type string.
uk: Не можна замінити змінну команди '{0}', оскільки команда не повернула результат типу рядок.

# inputVariable.command.noStringType
source: Cannot substitute input variable '{0}' because command '{1}' did not return a result of type string.
uk: Не можна замінити вхідну змінну '{0}', оскільки команда '{1}' не повернула результат типу рядок.

# inputVariable.defaultInputValue
source: (Default)
uk: (За замовчуванням)

# inputVariable.missingAttribute
source: Input variable '{0}' is of type '{1}' and must include '{2}'.
uk: Вхідна змінна '{0}' має тип '{1}' і повинна містити '{2}'.

# inputVariable.noInputSection
source: Variable '{0}' must be defined in an '{1}' section of the debug or task configuration.
uk: Змінна '{0}' повинна бути визначена в секції '{1}' конфігурації налагодження або завдання.

# inputVariable.undefinedVariable
source: Undefined input variable '{0}' encountered. Remove or define '{0}' to continue.
uk: Зустрінуто невизначену вхідну змінну '{0}'. Видаліть або визначте '{0}', щоб продовжити.

# inputVariable.unknownType
source: Input variable '{0}' can only be of type 'promptString', 'pickString', or 'command'.
uk: Змінна вводу '{0}' може бути лише типу 'promptString', 'pickString' або 'command'.

# JsonSchema.input.command.args
source: Optional arguments passed to the command.
uk: Необов'язкові аргументи, передані команді.

# JsonSchema.input.command.command
source: The command to execute for this input variable.
uk: Команда для виконання для цієї вхідної змінної.

# JsonSchema.input.default
source: The default value for the input.
uk: Значення за замовчуванням для введення.

# JsonSchema.input.description
source: The description is shown when the user is prompted for input.
uk: Опис відображається, коли користувач запитується на введення.

# JsonSchema.input.id
source: The input's id is used to associate an input with a variable of the form ${input:id}.
uk: Ідентифікатор введення використовується для асоціації введення з змінною у формі ${input:id}.

# JsonSchema.input.options
source: An array of strings that defines the options for a quick pick.
uk: Масив рядків, який визначає варіанти для швидкого вибору.

# JsonSchema.input.password
source: Controls if a password input is shown. Password input hides the typed text.
uk: Контролює, чи відображається введення пароля. Введення пароля приховує введений текст.

# JsonSchema.input.pickString.optionLabel
source: Label for the option.
uk: Мітка для варіанту.

# JsonSchema.input.pickString.optionValue
source: Value for the option.
uk: Значення для опції.

# JsonSchema.input.type
source: The type of user input prompt to use.
uk: Тип запиту на введення користувача, який слід використовувати.

# JsonSchema.input.type.command
source: The 'command' type executes a command.
uk: Тип 'command' виконує команду.

# JsonSchema.input.type.pickString
source: The 'pickString' type shows a selection list.
uk: Тип 'pickString' показує список вибору.

# JsonSchema.input.type.promptString
source: The 'promptString' type opens an input box to ask the user for input.
uk: Тип 'promptString' відкриває вікно введення, щоб запитати у користувача введення.

# JsonSchema.inputs
source: User inputs. Used for defining user input prompts, such as free string input or a choice from several options.
uk: Введення користувача. Використовується для визначення запитів на введення користувача, таких як введення вільного рядка або вибір з кількох варіантів.

# deprecatedVariables
source: 'env.', 'config.' and 'command.' are deprecated, use 'env:', 'config:' and 'command:' instead.
uk: 'env.', 'config.' та 'command.' застаріли, використовуйте 'env:', 'config:' та 'command:' замість цього.

# canNotFindFolder
source: Variable {0} can not be resolved. No such folder '{1}'.
uk: Змінну {0} не вдалося визначити. Такої папки '{1}' не існує.

# canNotResolveColumnNumber
source: Variable {0} can not be resolved. Make sure to have a column selected in the active editor.
uk: Змінна {0} не може бути розпізнана. Переконайтеся, що у вас вибрано стовпець у активному редакторі.

# canNotResolveFile
source: Variable {0} can not be resolved. Please open an editor.
uk: Змінна {0} не може бути розпізнана. Будь ласка, відкрийте редактор.

# canNotResolveFolderForFile
source: Variable {0}: can not find workspace folder of '{1}'.
uk: Змінна {0}: не вдалося знайти папку робочого простору '{1}'.

# canNotResolveLineNumber
source: Variable {0} can not be resolved. Make sure to have a line selected in the active editor.
uk: Змінна {0} не може бути розпізнана. Переконайтеся, що в активному редакторі вибрана рядок.

# canNotResolveSelectedText
source: Variable {0} can not be resolved. Make sure to have some text selected in the active editor.
uk: Змінна {0} не може бути розпізнана. Переконайтеся, що ви вибрали текст в активному редакторі.

# canNotResolveUserHome
source: Variable {0} can not be resolved. UserHome path is not defined
uk: Змінну {0} не вдалося визначити. Шлях UserHome не визначено.

# canNotResolveWorkspaceFolder
source: Variable {0} can not be resolved. Please open a folder.
uk: Змінну {0} не вдалося розпізнати. Будь ласка, відкрийте папку.

# canNotResolveWorkspaceFolderMultiRoot
source: Variable {0} can not be resolved in a multi folder workspace. Scope this variable using ':' and a workspace folder name.
uk: Змінна {0} не може бути розпізнана в багатопапковому робочому просторі. Обмежте цю змінну, використовуючи ':' та назву папки робочого простору.

# configNoString
source: Variable {0} can not be resolved because '{1}' is a structured value.
uk: Змінну {0} не можна розпізнати, оскільки '{1}' є структурованим значенням.

# configNotFound
source: Variable {0} can not be resolved because setting '{1}' not found.
uk: Змінну {0} не вдалося розпізнати, оскільки налаштування '{1}' не знайдено.

# extensionNotInstalled
source: Variable {0} can not be resolved because the extension {1} is not installed.
uk: Змінна {0} не може бути розпізнана, оскільки розширення {1} не встановлено.

# missingConfigName
source: Variable {0} can not be resolved because no settings name is given.
uk: Змінну {0} не можна розпізнати, оскільки не вказано ім'я налаштувань.

# missingEnvVarName
source: Variable {0} can not be resolved because no environment variable name is given.
uk: Змінну {0} не можна визначити, оскільки не вказано ім'я змінної середовища.

# missingExtensionName
source: Variable {0} can not be resolved because no extension name is given.
uk: Змінну {0} не можна розпізнати, оскільки не вказано ім'я розширення.

# noValueForCommand
source: Variable {0} can not be resolved because the command has no value.
uk: Змінну {0} не можна розпізнати, оскільки команда не має значення.
