Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_files.xlf
Languages: uk

# autoRevealExclude
source: Configure paths or [glob patterns](https://aka.ms/vscode-glob-patterns) for excluding files and folders from being revealed and selected in the Explorer when they are opened. Glob patterns are always evaluated relative to the path of the workspace folder unless they are absolute paths.
uk: Налаштуйте шляхи або [глобальні шаблони](https://aka.ms/vscode-glob-patterns) для виключення файлів і папок з відображення та вибору в Провіднику, коли вони відкриті. Глобальні шаблони завжди оцінюються відносно шляху папки робочого простору, якщо це не абсолютні шляхи.

# autoSave
source: Controls [auto save](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) of editors that have unsaved changes.
uk: Контролює [автоматичне збереження](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) редакторів, які мають незбережені зміни.

# autoSaveDelay
source: Controls the delay in milliseconds after which an editor with unsaved changes is saved automatically. Only applies when `#files.autoSave#` is set to `{0}`.
uk: Контролює затримку в мілісекундах, після якої редактор з незбереженими змінами автоматично зберігається. Застосовується лише тоді, коли `#files.autoSave#` встановлено на `{0}`.

# autoSaveWhenNoErrors
source: When enabled, will limit [auto save](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) of editors to files that have no errors reported in them at the time the auto save is triggered. Only applies when {0} is enabled.
uk: Коли увімкнено, обмежить [автозбереження](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) редакторів файлами, в яких на момент активації автозбереження не виявлено помилок. Застосовується лише коли {0} увімкнено.

# autoSaveWorkspaceFilesOnly
source: When enabled, will limit [auto save](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) of editors to files that are inside the opened workspace. Only applies when {0} is enabled.
uk: Коли увімкнено, обмежить [автозбереження](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save) редакторів файлами, які знаходяться всередині відкритого робочого простору. Застосовується лише тоді, коли {0} увімкнено.

source: Binary File Editor
uk: Переглядач двійкових файлів

# candidateGuessEncodings
source: List of character set encodings that the editor should attempt to guess in the order they are listed. In case it cannot be determined, {0} is respected
uk: Список кодувань набору символів, які редактор повинен спробувати вгадати в порядку їх перерахування. У разі, якщо це не може бути визначено, {0} буде враховано.

# compressSingleChildFolders
source: Controls whether the Explorer should render folders in a compact form. In such a form, single child folders will be compressed in a combined tree element. Useful for Java package structures, for example.
uk: Контролює, чи повинен Провідник відображати папки в компактному вигляді. У такому вигляді окремі дочірні папки будуть стиснуті в комбінований елемент дерева. Корисно для структур пакетів Java, наприклад.

# confirmDelete
source: Controls whether the Explorer should ask for confirmation when deleting a file via the trash.
uk: Контролює, чи повинен Провідник запитувати підтвердження при видаленні файлу через кошик.

# confirmDragAndDrop
source: Controls whether the Explorer should ask for confirmation to move files and folders via drag and drop.
uk: Контролює, чи повинен Провідник запитувати підтвердження для переміщення файлів і папок за допомогою перетягування.

# confirmPasteNative
source: Controls whether the Explorer should ask for confirmation when pasting native files and folders.
uk: Ви впевнені, що хочете вставити '{0}'?

# confirmUndo
source: Controls whether the Explorer should ask for confirmation when undoing.
uk: Контролює, чи повинен Провідник запитувати підтвердження при скасуванні.

# copyPathSeparator
source: The path separation character used when copying file paths.
uk: Символ розділення шляхів, що використовується при копіюванні шляхів до файлів.

# copyPathSeparator.auto
source: Uses operating system specific path separation character.
uk: Використовує символ розділення шляхів, специфічний для операційної системи.

# copyPathSeparator.backslash
source: Use backslash as path separation character.
uk: Використовуйте зворотний слеш як символ розділення шляху.

# copyPathSeparator.slash
source: Use slash as path separation character.
uk: Використовуйте косу риску як символ розділення шляхів.

# copyRelativePathSeparator
source: The path separation character used when copying relative file paths.
uk: Символ розділення шляхів, що використовується при копіюванні відносних шляхів до файлів.

# copyRelativePathSeparator.auto
source: Uses operating system specific path separation character.
uk: Використовує символ розділення шляхів, специфічний для операційної системи.

# copyRelativePathSeparator.backslash
source: Use backslash as path separation character.
uk: Використовуйте зворотний слеш як символ розділення шляху.

# copyRelativePathSeparator.slash
source: Use slash as path separation character.
uk: Використовуйте косу риску як символ розділення шляху.

# defaultLanguage
source: The default language identifier that is assigned to new files. If configured to `${activeEditorLanguage}`, will use the language identifier of the currently active text editor if any.
uk: Ідентифікатор мови за замовчуванням, який призначається новим файлам. Якщо налаштовано на `${activeEditorLanguage}`, буде використовувати ідентифікатор мови поточного активного текстового редактора, якщо такий є.

# defaultPathErrorMessage
source: Default path for file dialogs must be an absolute path (e.g. C:\\myFolder or /myFolder).
uk: Шлях за замовчуванням для діалогів файлів повинен бути абсолютним шляхом (наприклад, C:\\myFolder або /myFolder).

# disabled
source: Disables incremental naming. If two files with the same name exist you will be prompted to overwrite the existing file.
uk: Вимикає інкрементальне іменування. Якщо існує два файли з однаковим ім'ям, вам буде запропоновано перезаписати існуючий файл.

# enableDragAndDrop
source: Controls whether the Explorer should allow to move files and folders via drag and drop. This setting only effects drag and drop from inside the Explorer.
uk: Контролює, чи повинен Провідник дозволяти переміщувати файли та папки за допомогою перетягування. Ця налаштування впливає лише на перетягування зсередини Провідника.

# enableUndo
source: Controls whether the Explorer should support undoing file and folder operations.
uk: Контролює, чи повинен Провідник підтримувати скасування операцій з файлами та папками.

# enableUndo.default
source: Explorer will prompt before destructive undo operations.
uk: Explorer запропонує підтвердження перед руйнівними операціями скасування.

# enableUndo.light
source: Explorer will not prompt before undo operations when focused.
uk: Explorer не буде запитувати перед операціями скасування, коли сфокусовано.

# enableUndo.verbose
source: Explorer will prompt before all undo operations.
uk: Explorer запропонує підтвердження перед усіма операціями скасування.

# encoding
source: The default character set encoding to use when reading and writing files. This setting can also be configured per language.
uk: Кодування набору символів за замовчуванням, яке використовується при читанні та запису файлів. Цю настройку також можна налаштувати для кожної мови.

# eol
source: The default end of line character.
uk: Символ кінця рядка за замовчуванням.

# eol.auto
source: Uses operating system specific end of line character.
uk: Використовує символ кінця рядка, специфічний для операційної системи.

# everything
source: Format the whole file.
uk: Отформатувати весь файл.

# exclude
source: Configure [glob patterns](https://aka.ms/vscode-glob-patterns) for excluding files and folders. For example, the File Explorer decides which files and folders to show or hide based on this setting. Refer to the `#search.exclude#` setting to define search-specific excludes. Refer to the `#explorer.excludeGitIgnore#` setting for ignoring files based on your `.gitignore`.
uk: Налаштуйте [глобальні шаблони](https://aka.ms/vscode-glob-patterns) для виключення файлів і папок. Наприклад, Провідник файлів вирішує, які файли та папки показувати або приховувати на основі цього налаштування. Зверніться до налаштування `#search.exclude#`, щоб визначити виключення, специфічні для пошуку. Зверніться до налаштування `#explorer.excludeGitIgnore#` для ігнорування файлів на основі вашого `.gitignore`.

# excludeGitignore
source: Controls whether entries in .gitignore should be parsed and excluded from the Explorer. Similar to {0}.
uk: Контролює, чи повинні записи в .gitignore бути проаналізовані та виключені з Провідника. Схоже на {0}.

# expandSingleFolderWorkspaces
source: Controls whether the Explorer should expand multi-root workspaces containing only one folder during initialization
uk: Контролює, чи повинен Провідник розширювати багатокореневі робочі області, що містять лише одну папку, під час ініціалізації

# explorer.autoRevealExclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
uk: Шаблон glob для порівняння з шляхами до файлів. Встановіть true або false, щоб увімкнути або вимкнути шаблон.

# explorer.autoRevealExclude.when
source: Additional check on the siblings of a matching file. Use $(basename) as variable for the matching file name.
uk: Додаткова перевірка на родичів відповідного файлу. Використовуйте $(basename) як змінну для імені відповідного файлу.

# explorer.decorations.badges
source: Controls whether file decorations should use badges.
uk: Контролює, чи повинні декорації файлів використовувати значки.

# explorer.decorations.colors
source: Controls whether file decorations should use colors.
uk: Контролює, чи повинні декорації файлів використовувати кольори.

# explorer.incrementalNaming
source: Controls which naming strategy to use when giving a new name to a duplicated Explorer item on paste.
uk: Контролює, яку стратегію іменування використовувати при наданні нового імені дублікату елемента Explorer під час вставки.

# explorerConfigurationTitle
source: File Explorer
uk: Провідник файлів

# falseDescription
source: Disable the pattern.
uk: Вимкнути шаблон.

# fileDialogDefaultPath
source: Default path for file dialogs, overriding user's home path. Only used in the absence of a context-specific path, such as most recently opened file or folder.
uk: Шлях за замовчуванням для діалогів файлів, який переважає домашній шлях користувача. Використовується лише за відсутності контекстно-специфічного шляху, такого як нещодавно відкритий файл або папка.

# fileNesting.description
source: Each key pattern may contain a single `*` character which will match any string.
uk: Кожен ключовий шаблон може містити один символ `*`, який відповідатиме будь-якому рядку.

# fileNestingEnabled
source: Controls whether file nesting is enabled in the Explorer. File nesting allows for related files in a directory to be visually grouped together under a single parent file.
uk: Контролює, чи увімкнене вкладення файлів у Провіднику. Вкладення файлів дозволяє візуально згрупувати пов'язані файли в каталозі під єдиним батьківським файлом.

# fileNestingExpand
source: Controls whether file nests are automatically expanded. {0} must be set for this to take effect.
uk: Контролює, чи автоматично розгортаються вкладки файлів. {0} має бути встановлено, щоб це набуло чинності.

# fileNestingPatterns
source: Controls nesting of files in the Explorer. {0} must be set for this to take effect. Each __Item__ represents a parent pattern and may contain a single `*` character that matches any string. Each __Value__ represents a comma separated list of the child patterns that should be shown nested under a given parent. Child patterns may contain several special tokens: - `${capture}`: Matches the resolved value of the `*` from the parent pattern - `${basename}`: Matches the parent file's basename, the `file` in `file.ts` - `${extname}`: Matches the parent file's extension, the `ts` in `file.ts` - `${dirname}`: Matches the parent file's directory name, the `src` in `src/file.ts` - `*`: Matches any string, may only be used once per child pattern
uk: Контролює вкладення файлів в Провіднику. {0} має бути встановлено для того, щоб це набрало чинності. Кожен __Item__ представляє батьківський шаблон і може містити один символ `*`, який відповідає будь-якому рядку. Кожен __Value__ представляє список дочірніх шаблонів, розділених комами, які повинні бути показані вкладеними під даним батьком. Дочірні шаблони можуть містити кілька спеціальних токенів: - `${capture}`: Відповідає розв'язаному значенню `*` з батьківського шаблону - `${basename}`: Відповідає базовому імені батьківського файлу, `file` в `file.ts` - `${extname}`: Відповідає розширенню батьківського файлу, `ts` в `file.ts` - `${dirname}`: Відповідає імені директорії батьківського файлу, `src` в `src/file.ts` - `*`: Відповідає будь-якому рядку, може використовуватися лише один раз для кожного дочірнього шаблону

# files.autoSave.afterDelay
source: An editor with changes is automatically saved after the configured `#files.autoSaveDelay#`.
uk: Редактор з внесеними змінами автоматично зберігається після налаштованої `#files.autoSaveDelay#`.

# files.autoSave.off
source: An editor with changes is never automatically saved.
uk: Редактор з змінами ніколи не зберігається автоматично.

# files.autoSave.onFocusChange
source: An editor with changes is automatically saved when the editor loses focus.
uk: Редактор з внесеними змінами автоматично зберігається, коли редактор втрачає фокус.

# files.autoSave.onWindowChange
source: An editor with changes is automatically saved when the window loses focus.
uk: Редактор з внесеними змінами автоматично зберігається, коли вікно втрачає фокус.

# files.exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
uk: Шаблон glob для порівняння з шляхами файлів. Встановіть true або false, щоб увімкнути або вимкнути шаблон.

# files.exclude.when
source: Additional check on the siblings of a matching file. Use \$(basename) as variable for the matching file name.
uk: Додаткова перевірка на братів і сестер відповідного файлу. Використовуйте \$(basename) як змінну для імені відповідного файлу.

# files.participants.timeout
source: Timeout in milliseconds after which file participants for create, rename, and delete are cancelled. Use `0` to disable participants.
uk: Час очікування в мілісекундах, після якого учасники файлів для створення, перейменування та видалення скасовуються. Використовуйте `0`, щоб вимкнути учасників.

# files.restoreUndoStack
source: Restore the undo stack when a file is reopened.
uk: Відновіть стек скасувань, коли файл знову відкривається.

# files.saveConflictResolution
source: A save conflict can occur when a file is saved to disk that was changed by another program in the meantime. To prevent data loss, the user is asked to compare the changes in the editor with the version on disk. This setting should only be changed if you frequently encounter save conflict errors and may result in data loss if used without caution.
uk: Конфлікт збереження може виникнути, коли файл зберігається на диску, який був змінений іншим програмним забезпеченням за цей час. Щоб запобігти втраті даних, користувачу пропонується порівняти зміни в редакторі з версією на диску. Цю настройку слід змінювати лише в тому випадку, якщо ви часто стикаєтеся з помилками конфлікту збереження, і її використання без обережності може призвести до втрати даних.

# files.simpleDialog.enable
source: Enables the simple file dialog for opening and saving files and folders. The simple file dialog replaces the system file dialog when enabled.
uk: Увімкнення простого діалогу файлів для відкриття та збереження файлів і папок. Простий діалог файлів замінює системний діалог файлів, коли він увімкнений.

# filesConfigurationTitle
source: Files
uk: Файли

# filesReadonlyExclude
source: Configure paths or [glob patterns](https://aka.ms/vscode-glob-patterns) to exclude from being marked as read-only if they match as a result of the `#files.readonlyInclude#` setting. Glob patterns are always evaluated relative to the path of the workspace folder unless they are absolute paths. Files from readonly file system providers will always be read-only independent of this setting.
uk: Налаштуйте шляхи або [глобальні шаблони](https://aka.ms/vscode-glob-patterns), які потрібно виключити з позначення як тільки для читання, якщо вони відповідають внаслідок налаштування `#files.readonlyInclude#`. Глобальні шаблони завжди оцінюються відносно шляху папки робочого простору, якщо це не абсолютні шляхи. Файли з постачальників файлової системи тільки для читання завжди будуть тільки для читання незалежно від цього налаштування.

# filesReadonlyFromPermissions
source: Marks files as read-only when their file permissions indicate as such. This can be overridden via `#files.readonlyInclude#` and `#files.readonlyExclude#` settings.
uk: Позначає файли як тільки для читання, коли їхні файлові дозволи це вказують. Це можна переоприділити за допомогою налаштувань `#files.readonlyInclude#` та `#files.readonlyExclude#`.

# filesReadonlyInclude
source: Configure paths or [glob patterns](https://aka.ms/vscode-glob-patterns) to mark as read-only. Glob patterns are always evaluated relative to the path of the workspace folder unless they are absolute paths. You can exclude matching paths via the `#files.readonlyExclude#` setting. Files from readonly file system providers will always be read-only independent of this setting.
uk: Налаштуйте шляхи або [глобальні шаблони](https://aka.ms/vscode-glob-patterns), щоб позначити їх як тільки для читання. Глобальні шаблони завжди оцінюються відносно шляху до папки робочого простору, якщо це не абсолютні шляхи. Ви можете виключити відповідні шляхи через налаштування `#files.readonlyExclude#`. Файли з постачальників файлової системи тільки для читання завжди будуть тільки для читання, незалежно від цього налаштування.

# formatOnSave
source: Format a file on save. A formatter must be available and the editor must not be shutting down. When {0} is set to `afterDelay`, the file will only be formatted when saved explicitly.
uk: Форматувати файл при збереженні. Форматувач повинен бути доступний, і редактор не повинен закриватися. Коли {0} встановлено на `afterDelay`, файл буде форматуватися лише при явному збереженні.

# formatOnSaveMode
source: Controls if format on save formats the whole file or only modifications. Only applies when `#editor.formatOnSave#` is enabled.
uk: Контролює, чи форматування при збереженні форматує весь файл або лише зміни. Застосовується лише тоді, коли увімкнено `#editor.formatOnSave#`.

# hotExit
source: [Hot Exit](https://aka.ms/vscode-hot-exit) controls whether unsaved files are remembered between sessions, allowing the save prompt when exiting the editor to be skipped.
uk: [Hot Exit](https://aka.ms/vscode-hot-exit) контролює, чи запам'ятовуються незбережені файли між сесіями, що дозволяє пропустити запит на збереження при виході з редактора.

# hotExit.off
source: Disable hot exit. A prompt will show when attempting to close a window with editors that have unsaved changes.
uk: Вимкнути гарне виходу. З'явиться запит, коли ви намагатиметеся закрити вікно з редакторами, які мають незбережені зміни.

# hotExit.onExit
source: Hot exit will be triggered when the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu). All windows without folders opened will be restored upon next launch. A list of previously opened windows with unsaved files can be accessed via `File > Open Recent > More...`
uk: Гарне завершення буде активовано, коли останнє вікно буде закрито на Windows/Linux або коли буде активовано команду `workbench.action.quit` (командна палітра, комбінація клавіш, меню). Усі вікна без відкритих папок будуть відновлені при наступному запуску. Список раніше відкритих вікон з незбереженими файлами можна отримати через `Файл > Відкрити нещодавно > Більше...`

# hotExit.onExitAndWindowClose
source: Hot exit will be triggered when the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu), and also for any window with a folder opened regardless of whether it's the last window. All windows without folders opened will be restored upon next launch. A list of previously opened windows with unsaved files can be accessed via `File > Open Recent > More...`
uk: Гарне завершення буде активовано, коли закриється останнє вікно на Windows/Linux або коли буде виконана команда `workbench.action.quit` (палета команд, клавіша, меню), а також для будь-якого вікна з відкритою папкою, незалежно від того, чи є це останнім вікном. Усі вікна без відкритих папок будуть відновлені при наступному запуску. Список раніше відкритих вікон з незбереженими файлами можна отримати через `Файл > Відкрити нещодавно > Більше...`

# hotExit.onExitAndWindowCloseBrowser
source: Hot exit will be triggered when the browser quits or the window or tab is closed.
uk: Гарне завершення буде активовано, коли браузер закриється або вікно чи вкладка буде закрита.

# insertFinalNewline
source: When enabled, insert a final new line at the end of the file when saving it.
uk: Коли увімкнено, вставте фінальний новий рядок наприкінці файлу під час його збереження.

# modification
source: Format modifications (requires source control).
uk: Модифікації формату (вимагає контролю версій).

# modificationIfAvailable
source: Will attempt to format modifications only (requires source control). If source control can't be used, then the whole file will be formatted.
uk: Спробує відформатувати лише модифікації (потрібен контроль версій). Якщо контроль версій не може бути використаний, тоді буде відформатовано весь файл.

# openEditorsSortOrder
source: Controls the sorting order of editors in the Open Editors pane.
uk: Контролює порядок сортування редакторів у панелі Відкриті редактори.

# openEditorsVisible
source: The initial maximum number of editors shown in the Open Editors pane. Exceeding this limit will show a scroll bar and allow resizing the pane to display more items.
uk: Початкова максимальна кількість редакторів, що відображається в панелі Відкриті редактори. Перевищення цього ліміту призведе до появи смуги прокрутки та дозволить змінити розмір панелі для відображення більшої кількості елементів.

# openEditorsVisibleMin
source: The minimum number of editor slots pre-allocated in the Open Editors pane. If set to 0 the Open Editors pane will dynamically resize based on the number of editors.
uk: Мінімальна кількість слотів редакторів, попередньо виділених у панелі Відкриті редактори. Якщо встановлено 0, панель Відкриті редактори буде динамічно змінювати розмір залежно від кількості редакторів.

# overwriteFileOnDisk
source: Will resolve the save conflict by overwriting the file on disk with the changes in the editor.
uk: Вирішить конфлікт збереження, перезаписавши файл на диску змінами з редактора.

# simple
source: Appends the word "copy" at the end of the duplicated name potentially followed by a number.
uk: Додає слово "copy" в кінець дубльованого імені, за яким потенційно може слідувати число.

# smart
source: Adds a number at the end of the duplicated name. If some number is already part of the name, tries to increase that number.
uk: Додає число в кінці дубльованого імені. Якщо якесь число вже є частиною імені, намагається збільшити це число.
