Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_accessibilitySignals.xlf
Languages: uk

# accessibility.announcement.help
source: Help: List Signal Announcements
uk: Допомога: Список оголошень сигналів

# accessibility.announcement.help.description
source: List all accessibility announcements, alerts, braille messages, and configure their settings
uk: Перерахуйте всі оголошення доступності, сповіщення, повідомлення шрифтом Брайля та налаштуйте їх параметри

# accessibility.sound.help.description
source: List all accessibility sounds, noises, or audio cues and configure their settings
uk: Перерахуйте всі звуки доступності, шуми або аудіосигнали та налаштуйте їх параметри

# announcement.help.placeholder
source: Select an announcement to configure
uk: Виберіть оголошення для налаштування

# announcement.help.placeholder.disabled
source: Screen reader is not active, announcements are disabled by default.
uk: Читач екрану не активний, оголошення за замовчуванням вимкнені.

# announcement.help.settings
source: Configure Announcement
uk: Налаштувати оголошення

# signals.sound.help
source: Help: List Signal Sounds
uk: Допомога: Список звукових сигналів

# sounds.help.placeholder
source: Select a sound to play and configure
uk: Виберіть звук для відтворення та налаштування

# sounds.help.settings
source: Configure Sound
uk: Налаштувати звук

# openDiffEditorAnnouncement
source: Diff editor
uk: Редактор відмінностей
