Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_extensions.xlf
Languages: uk

# confirmUrl
source: Allow '{0}' extension to open this URI?
uk: Дозволити розширенню '{0}' відкрити цей URI?

source: Extensions
uk: Розширення

# installDetail
source: This extension wants to open a URI:
uk: Ця розширення хоче відкрити URI:

# manage
source: Manage Authorized Extension URIs...
uk: Керувати авторизованими URI розширень...

# no
source: There are currently no authorized extension URIs.
uk: В даний час немає авторизованих URI розширень.

source: &&Open
uk: &&Відкрити

source: Open URI
uk: Відкрити URI

# reloadAndHandle
source: Extension '{0}' is not loaded. Would you like to reload the window to load the extension and open the URL?
uk: Розширення '{0}' не завантажено. Бажаєте перезавантажити вікно, щоб завантажити розширення та відкрити URL?

# reloadAndOpen
source: &&Reload Window and Open
uk: &&Перезавантажити вікно та відкрити

# rememberConfirmUrl
source: Do not ask me again for this extension
uk: Не запитуй мене більше про це розширення.

# activation
source: Activation Events
uk: Події активації

# disconnectRemote
source: Disconnect Remote Agent
uk: Відключити віддалений агент

# extensionService.autoRestart
source: The remote extension host terminated unexpectedly. Restarting...
uk: Віддалений хост розширення несподівано завершив роботу. Перезапуск...

# extensionService.crash
source: Remote Extension host terminated unexpectedly 3 times within the last 5 minutes.
uk: Віддалений хост розширення несподівано завершив роботу 3 рази за останні 5 хвилин.

# extensionStopVetoError
source: {0} (Error: {1})
uk: {0} (Помилка: {1})

# extensionStopVetoMessage
source: Please confirm restart of extensions.
uk: Будь ласка, підтвердіть перезапуск розширень.

# extensionTestError
source: No extension host found that can launch the test runner at {0}.
uk: Не знайдено хосту розширення, який може запустити тестовий запускатор за адресою {0}.

# looping
source: The following extensions contain dependency loops and have been disabled: {0}
uk: Наступні розширення містять цикли залежностей і були вимкнені: {0}

# proceedAnyways
source: Restart Anyway
uk: Перезапустити все одно

# restart
source: Restart Remote Extension Host
uk: Перезапустити віддалений хост розширення

# stopExtensionHosts
source: Stopping Extension Hosts
uk: Зупинка хостів розширення

# measureExtHostLatency
source: Measure Extension Host Latency
uk: Виміряти затримку хоста розширення

# enabledProposedAPIs
source: API Proposals
uk: API Пропозиції

# extensionKind
source: Define the kind of an extension. `ui` extensions are installed and run on the local machine while `workspace` extensions run on the remote.
uk: Визначте тип розширення. Розширення `ui` встановлюються та виконуються на локальному комп'ютері, тоді як розширення `workspace` виконуються на віддаленому.

# extensionKind.empty
source: Define an extension which cannot run in a remote context, neither on the local, nor on the remote machine.
uk: Визначте розширення, яке не може виконуватися в віддаленому контексті, ні на локальному, ні на віддаленому комп'ютері.

# extensionKind.ui
source: Define an extension which can run only on the local machine when connected to remote window.
uk: Визначте розширення, яке може працювати лише на локальному комп'ютері, коли підключено до віддаленого вікна.

# extensionKind.ui-workspace
source: Define an extension which can run on either side, with a preference towards running on the local machine.
uk: Визначте розширення, яке може працювати з будь-якої сторони, з перевагою у виконанні на локальному комп'ютері.

# extensionKind.workspace
source: Define an extension which can run only on the remote machine when connected remote window.
uk: Визначте розширення, яке може працювати лише на віддаленій машині під час підключення до віддаленого вікна.

# extensionKind.workspace-ui
source: Define an extension which can run on either side, with a preference towards running on the remote machine.
uk: Визначте розширення, яке може працювати з обох сторін, з перевагою на користь виконання на віддаленій машині.

# product.extensionEnabledApiProposals
source: API proposals that the respective extensions can freely use.
uk: API пропозиції, які відповідні розширення можуть вільно використовувати.

# ui
source: UI extension kind. In a remote window, such extensions are enabled only when available on the local machine.
uk: Тип розширення UI. У віддаленому вікні такі розширення активуються лише тоді, коли вони доступні на локальному комп'ютері.

# vscode.extension.activationEvents
source: Activation events for the VS Code extension.
uk: Події активації для розширення VS Code.

# vscode.extension.activationEvents.onAuthenticationRequest
source: An activation event emitted whenever sessions are requested from the specified authentication provider.
uk: Подія активації, що генерується щоразу, коли запитуються сесії від вказаного постачальника аутентифікації.

# vscode.extension.activationEvents.onChatParticipant
source: An activation event emitted when the specified chat participant is invoked.
uk: Подія активації, що виводиться, коли викликається вказаний учасник чату.

# vscode.extension.activationEvents.onCommand
source: An activation event emitted whenever the specified command gets invoked.
uk: Подія активації, що виникає щоразу, коли викликається вказана команда.

# vscode.extension.activationEvents.onCustomEditor
source: An activation event emitted whenever the specified custom editor becomes visible.
uk: Подія активації, що виникає щоразу, коли вказаний користувацький редактор стає видимим.

# vscode.extension.activationEvents.onDebug
source: An activation event emitted whenever a user is about to start debugging or about to setup debug configurations.
uk: Подія активації, що виникає щоразу, коли користувач збирається почати налагодження або налаштувати конфігурації налагодження.

# vscode.extension.activationEvents.onDebugAdapterProtocolTracker
source: An activation event emitted whenever a debug session with the specific type is about to be launched and a debug protocol tracker might be needed.
uk: Подія активації, що випускається щоразу, коли сесія налагодження з певним типом збирається бути запущена, і може знадобитися трекер протоколу налагодження.

# vscode.extension.activationEvents.onDebugDynamicConfigurations
source: An activation event emitted whenever a list of all debug configurations needs to be created (and all provideDebugConfigurations methods for the "dynamic" scope need to be called).
uk: Подія активації, що виводиться щоразу, коли потрібно створити список усіх налаштувань налагодження (і всі методи provideDebugConfigurations для "динамічної" області потрібно викликати).

# vscode.extension.activationEvents.onDebugInitialConfigurations
source: An activation event emitted whenever a "launch.json" needs to be created (and all provideDebugConfigurations methods need to be called).
uk: Подія активації, що виникає щоразу, коли потрібно створити "launch.json" (і всі методи provideDebugConfigurations потрібно викликати).

# vscode.extension.activationEvents.onDebugResolve
source: An activation event emitted whenever a debug session with the specific type is about to be launched (and a corresponding resolveDebugConfiguration method needs to be called).
uk: Подія активації, яка виводиться щоразу, коли сесія налагодження з певним типом має бути запущена (і потрібно викликати відповідний метод resolveDebugConfiguration).

# vscode.extension.activationEvents.onEditSession
source: An activation event emitted whenever an edit session is accessed with the given scheme.
uk: Подія активації, що виникає щоразу, коли сеанс редагування відкривається з використанням заданої схеми.

# vscode.extension.activationEvents.onFileSystem
source: An activation event emitted whenever a file or folder is accessed with the given scheme.
uk: Подія активації, що генерується щоразу, коли файл або папка відкривається з використанням заданої схеми.

# vscode.extension.activationEvents.onIssueReporterOpened
source: An activation event emitted when the issue reporter is opened.
uk: Подія активації, що виникає, коли відкривається репортер проблем.

# vscode.extension.activationEvents.onLanguage
source: An activation event emitted whenever a file that resolves to the specified language gets opened.
uk: Подія активації, що генерується щоразу, коли відкривається файл, який відповідає вказаній мові.

# vscode.extension.activationEvents.onLanguageModelChat
source: An activation event emitted when a chat model provider for the given vendor is requested.
uk: Подія активації, що генерується, коли запитується постачальник моделі чату для вказаного постачальника.

# vscode.extension.activationEvents.onLanguageModelTool
source: An activation event emitted when the specified language model tool is invoked.
uk: Подія активації, що генерується, коли викликається вказаний інструмент мовної моделі.

# vscode.extension.activationEvents.onMcpCollection
source: An activation event emitted whenver a tool from the MCP server is requested.
uk: Подія активації, що виникає щоразу, коли запитується інструмент з сервера MCP.

# vscode.extension.activationEvents.onNotebook
source: An activation event emitted whenever the specified notebook document is opened.
uk: Подія активації, що генерується щоразу, коли відкривається вказаний документ блокнота.

# vscode.extension.activationEvents.onOpenExternalUri
source: An activation event emitted whenever a external uri (such as an http or https link) is being opened.
uk: Подія активації, що генерується щоразу, коли відкривається зовнішній URI (такий як http або https посилання).

# vscode.extension.activationEvents.onRenderer
source: An activation event emitted whenever a notebook output renderer is used.
uk: Подія активації, що генерується щоразу, коли використовується рендерер виходу блокнота.

# vscode.extension.activationEvents.onSearch
source: An activation event emitted whenever a search is started in the folder with the given scheme.
uk: Подія активації, що генерується щоразу, коли пошук розпочинається в папці з вказаною схемою.

# vscode.extension.activationEvents.onStartupFinished
source: An activation event emitted after the start-up finished (after all `*` activated extensions have finished activating).
uk: Подія активації, що виникає після завершення запуску (після того, як всі активовані розширення `*` закінчили активацію).

# vscode.extension.activationEvents.onTaskType
source: An activation event emitted whenever tasks of a certain type need to be listed or resolved.
uk: Подія активації, що виникає щоразу, коли потрібно перерахувати або вирішити завдання певного типу.

# vscode.extension.activationEvents.onTerminal
source: An activation event emitted when a terminal of the given shell type is opened.
uk: Подія активації, що генерується, коли відкривається термінал вказаного типу оболонки.

# vscode.extension.activationEvents.onTerminalCompletionsRequested
source: An activation event emitted when terminal completions are requested.
uk: Подія активації, що генерується, коли запитуються завершення терміналу.

# vscode.extension.activationEvents.onTerminalProfile
source: An activation event emitted when a specific terminal profile is launched.
uk: Подія активації, що генерується при запуску конкретного термінального профілю.

# vscode.extension.activationEvents.onTerminalQuickFixRequest
source: An activation event emitted when a command matches the selector associated with this ID
uk: Подія активації, що виникає, коли команда відповідає селектору, пов'язаному з цим ідентифікатором.

# vscode.extension.activationEvents.onTerminalShellIntegration
source: An activation event emitted when terminal shell integration is activated for the given shell type.
uk: Подія активації, що виникає, коли інтеграція термінального шеллу активується для вказаного типу шеллу.

# vscode.extension.activationEvents.onUri
source: An activation event emitted whenever a system-wide Uri directed towards this extension is open.
uk: Подія активації, що генерується щоразу, коли відкривається системний Uri, спрямований на цей розширення.

# vscode.extension.activationEvents.onView
source: An activation event emitted whenever the specified view is expanded.
uk: Подія активації, що генерується щоразу, коли вказане подання розгортається.

# vscode.extension.activationEvents.onWalkthrough
source: An activation event emitted when a specified walkthrough is opened.
uk: Подія активації, що виникає, коли відкривається вказаний посібник.

# vscode.extension.activationEvents.onWebviewPanel
source: An activation event emmited when a webview is loaded of a certain viewType
uk: Подія активації, що виникає, коли веб-переглядач завантажується з певним viewType.

# vscode.extension.activationEvents.star
source: An activation event emitted on VS Code startup. To ensure a great end user experience, please use this activation event in your extension only when no other activation events combination works in your use-case.
uk: Подія активації, що виникає під час запуску VS Code. Щоб забезпечити відмінний досвід для кінцевого користувача, будь ласка, використовуйте цю подію активації у вашому розширенні лише тоді, коли жодна інша комбінація подій активації не працює у вашому випадку використання.

# vscode.extension.activationEvents.workspaceContains
source: An activation event emitted whenever a folder is opened that contains at least a file matching the specified glob pattern.
uk: Подія активації, що генерується щоразу, коли відкривається папка, яка містить принаймні один файл, що відповідає вказаному шаблону glob.

# vscode.extension.api
source: Describe the API provided by this extension. For more details visit: https://code.visualstudio.com/api/advanced-topics/remote-extensions#handling-dependencies-with-remote-extensions
uk: Опишіть API, наданий цим розширенням. Для отримання додаткової інформації відвідайте: https://code.visualstudio.com/api/advanced-topics/remote-extensions#handling-dependencies-with-remote-extensions

# vscode.extension.api.none
source: Give up entirely the ability to export any APIs. This allows other extensions that depend on this extension to run in a separate extension host process or in a remote machine.
uk: Повністю відмовтеся від можливості експортувати будь-які API. Це дозволяє іншим розширенням, які залежать від цього розширення, працювати в окремому процесі хоста розширення або на віддаленій машині.

# vscode.extension.badges
source: Array of badges to display in the sidebar of the Marketplace's extension page.
uk: Масив значків для відображення в бічній панелі сторінки розширення Маркетплейсу.

# vscode.extension.badges.description
source: Badge description.
uk: Опис значка.

# vscode.extension.badges.href
source: Badge link.
uk: Посилання на значок.

# vscode.extension.badges.url
source: Badge image URL.
uk: URL зображення значка.

# vscode.extension.capabilities
source: Declare the set of supported capabilities by the extension.
uk: Оголосіть набір підтримуваних можливостей розширення.

# vscode.extension.capabilities.untrustedWorkspaces
source: Declares how the extension should be handled in untrusted workspaces.
uk: Оголошує, як розширення повинно оброблятися в ненадійних робочих просторах.

# vscode.extension.capabilities.untrustedWorkspaces.description
source: A description of how workspace trust affects the extensions behavior and why it is needed. This only applies when `supported` is not `true`.
uk: Опис того, як довіра до робочого простору впливає на поведінку розширень і чому це необхідно. Це застосовується тільки тоді, коли `supported` не є `true`.

# vscode.extension.capabilities.untrustedWorkspaces.restrictedConfigurations
source: A list of configuration keys contributed by the extension that should not use workspace values in untrusted workspaces.
uk: Список ключів конфігурації, наданих розширенням, які не повинні використовувати значення робочого простору в ненадійних робочих просторах.

# vscode.extension.capabilities.untrustedWorkspaces.supported
source: Declares the level of support for untrusted workspaces by the extension.
uk: Оголошує рівень підтримки для ненадійних робочих просторів розширенням.

# vscode.extension.capabilities.untrustedWorkspaces.supported.false
source: The extension will not be enabled in untrusted workspaces.
uk: Розширення не буде активовано в ненадійних робочих просторах.

# vscode.extension.capabilities.untrustedWorkspaces.supported.limited
source: The extension will be enabled in untrusted workspaces with some functionality disabled.
uk: Розширення буде увімкнено в ненадійних робочих просторах з деякими вимкненими функціями.

# vscode.extension.capabilities.untrustedWorkspaces.supported.true
source: The extension will be enabled in untrusted workspaces with all functionality enabled.
uk: Розширення буде активовано в ненадійних робочих просторах з увімкненою всією функціональністю.

# vscode.extension.capabilities.virtualWorkspaces
source: Declares whether the extension should be enabled in virtual workspaces. A virtual workspace is a workspace which is not backed by any on-disk resources. When false, this extension will be automatically disabled in virtual workspaces. Default is true.
uk: Оголошує, чи має бути розширення увімкнено у віртуальних робочих просторах. Віртуальний робочий простір - це робочий простір, який не підтримується жодними ресурсами на диску. Коли значення false, це розширення буде автоматично вимкнено у віртуальних робочих просторах. За замовчуванням - true.

# vscode.extension.capabilities.virtualWorkspaces.description
source: A description of how virtual workspaces affects the extensions behavior and why it is needed. This only applies when `supported` is not `true`.
uk: Опис того, як віртуальні робочі простори впливають на поведінку розширень і чому це необхідно. Це застосовується лише тоді, коли `supported` не є `true`.

# vscode.extension.capabilities.virtualWorkspaces.supported
source: Declares the level of support for virtual workspaces by the extension.
uk: Оголошує рівень підтримки віртуальних робочих просторів розширенням.

# vscode.extension.capabilities.virtualWorkspaces.supported.false
source: The extension will not be enabled in virtual workspaces.
uk: Розширення не буде активовано у віртуальних робочих просторах.

# vscode.extension.capabilities.virtualWorkspaces.supported.limited
source: The extension will be enabled in virtual workspaces with some functionality disabled.
uk: Розширення буде активовано у віртуальних робочих просторах з деякими функціями, що вимкнені.

# vscode.extension.capabilities.virtualWorkspaces.supported.true
source: The extension will be enabled in virtual workspaces with all functionality enabled.
uk: Розширення буде активоване у віртуальних робочих просторах з усією активованою функціональністю.

# vscode.extension.categories
source: The categories used by the VS Code gallery to categorize the extension.
uk: Категорії, які використовуються галереєю VS Code для категоризації розширення.

# vscode.extension.category.languages.deprecated
source: Use 'Programming Languages' instead
uk: Використовуйте 'Мови програмування' замість цього.

# vscode.extension.contributes
source: All contributions of the VS Code extension represented by this package.
uk: Усі внески розширення VS Code, представленого цим пакетом.

# vscode.extension.contributes.extensionPack
source: A set of extensions that can be installed together. The identifier of an extension is always ${publisher}.${name}. For example: vscode.csharp.
uk: Набір розширень, які можна встановити разом. Ідентифікатор розширення завжди має формат ${publisher}.${name}. Наприклад: vscode.csharp.

# vscode.extension.contributes.sponsor
source: Specify the location from where users can sponsor your extension.
uk: Вкажіть місце, звідки користувачі можуть спонсорувати ваше розширення.

# vscode.extension.contributes.sponsor.url
source: URL from where users can sponsor your extension. It must be a valid URL with a HTTP or HTTPS protocol. Example value: https://github.com/sponsors/nvaccess
uk: URL, з якого користувачі можуть спонсорувати ваше розширення. Це повинен бути дійсний URL з протоколом HTTP або HTTPS. Приклад значення: https://github.com/sponsors/nvaccess

# vscode.extension.displayName
source: The display name for the extension used in the VS Code gallery.
uk: Відображуване ім'я для розширення, що використовується в галереї VS Code.

# vscode.extension.enableProposedApi.deprecated
source: Use `enabledApiProposals` instead.
uk: Використовуйте `enabledApiProposals` замість цього.

# vscode.extension.enabledApiProposals
source: Enable API proposals to try them out. Only valid **during development**. Extensions **cannot be published** with this property. For more details visit: https://code.visualstudio.com/api/advanced-topics/using-proposed-api
uk: Увімкніть пропозиції API, щоб спробувати їх. Дійсно лише **під час розробки**. Розширення **не можуть бути опубліковані** з цією властивістю. Для отримання додаткової інформації відвідайте: https://code.visualstudio.com/api/advanced-topics/using-proposed-api

# vscode.extension.engines
source: Engine compatibility.
uk: Сумісність двигуна.

# vscode.extension.engines.vscode
source: For VS Code extensions, specifies the VS Code version that the extension is compatible with. Cannot be *. For example: ^0.10.5 indicates compatibility with a minimum VS Code version of 0.10.5.
uk: Для розширень VS Code вказує версію VS Code, з якою розширення є сумісним. Не може бути *. Наприклад: ^0.10.5 вказує на сумісність з мінімальною версією VS Code 0.10.5.

# vscode.extension.extensionDependencies
source: Dependencies to other extensions. The identifier of an extension is always ${publisher}.${name}. For example: vscode.csharp.
uk: Залежності до інших розширень. Ідентифікатор розширення завжди має формат ${publisher}.${name}. Наприклад: vscode.csharp.

# vscode.extension.galleryBanner
source: Banner used in the VS Code marketplace.
uk: Банер, що використовується на ринку VS Code.

# vscode.extension.galleryBanner.color
source: The banner color on the VS Code marketplace page header.
uk: Колір банера на заголовку сторінки маркетплейсу VS Code.

# vscode.extension.galleryBanner.theme
source: The color theme for the font used in the banner.
uk: Колірна тема для шрифту, використаного в банері.

# vscode.extension.icon
source: The path to a 128x128 pixel icon.
uk: Шлях до іконки розміром 128x128 пікселів.

# vscode.extension.l10n
source: The relative path to a folder containing localization (bundle.l10n.*.json) files. Must be specified if you are using the vscode.l10n API.
uk: Відносний шлях до папки, що містить файли локалізації (bundle.l10n.*.json). Має бути вказаний, якщо ви використовуєте API vscode.l10n.

# vscode.extension.markdown
source: Controls the Markdown rendering engine used in the Marketplace. Either github (default) or standard.
uk: Контролює движок рендерингу Markdown, що використовується на Marketplace. Може бути github (за замовчуванням) або стандартний.

# vscode.extension.preview
source: Sets the extension to be flagged as a Preview in the Marketplace.
uk: Встановлює розширення, яке буде позначене як Попередній перегляд у Маркетплейсі.

# vscode.extension.pricing
source: The pricing information for the extension. Can be Free (default) or Trial. For more details visit: https://code.visualstudio.com/api/working-with-extensions/publishing-extension#extension-pricing-label
uk: Інформація про ціни для розширення. Може бути Безкоштовно (за замовчуванням) або Пробна версія. Для отримання додаткової інформації відвідайте: https://code.visualstudio.com/api/working-with-extensions/publishing-extension#extension-pricing-label

# vscode.extension.publisher
source: The publisher of the VS Code extension.
uk: Видавець розширення VS Code.
