Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_files.xlf
Languages: uk

# sortOrder
source: Controls the property-based sorting of files and folders in the Explorer. When `#explorer.fileNesting.enabled#` is enabled, also controls sorting of nested files.
uk: Контролює сортування файлів і папок на основі властивостей у Провіднику. Коли `#explorer.fileNesting.enabled#` увімкнено, також контролює сортування вкладених файлів.

# sortOrder.alphabetical
source: Editors are ordered alphabetically by tab name inside each editor group.
uk: Редактори впорядковані в алфавітному порядку за назвою вкладки всередині кожної групи редакторів.

# sortOrder.default
source: Files and folders are sorted by their names. Folders are displayed before files.
uk: Файли та папки сортуються за їхніми іменами. Папки відображаються перед файлами.

# sortOrder.editorOrder
source: Editors are ordered in the same order editor tabs are shown.
uk: Редактори впорядковані в тому ж порядку, в якому показані вкладки редакторів.

# sortOrder.filesFirst
source: Files and folders are sorted by their names. Files are displayed before folders.
uk: Файли та папки сортуються за їхніми іменами. Файли відображаються перед папками.

# sortOrder.foldersNestsFiles
source: Files and folders are sorted by their names. Folders are displayed before files. Files with nested children are displayed before other files.
uk: Файли та папки сортуються за їхніми іменами. Папки відображаються перед файлами. Файли з вкладеними дочірніми елементами відображаються перед іншими файлами.

# sortOrder.fullPath
source: Editors are ordered alphabetically by full path inside each editor group.
uk: Редактори впорядковані в алфавітному порядку за повним шляхом всередині кожної групи редакторів.

# sortOrder.mixed
source: Files and folders are sorted by their names. Files are interwoven with folders.
uk: Файли та папки відсортовані за їхніми іменами. Файли переплетені з папками.

# sortOrder.modified
source: Files and folders are sorted by last modified date in descending order. Folders are displayed before files.
uk: Файли та папки сортуються за датою останнього змінення у спадному порядку. Папки відображаються перед файлами.

# sortOrder.type
source: Files and folders are grouped by extension type then sorted by their names. Folders are displayed before files.
uk: Файли та папки групуються за типом розширення, а потім сортуються за їхніми іменами. Папки відображаються перед файлами.

# sortOrderLexicographicOptions
source: Controls the lexicographic sorting of file and folder names in the Explorer.
uk: Контролює лексикографічне сортування імен файлів та папок у Провіднику.

# sortOrderLexicographicOptions.default
source: Uppercase and lowercase names are mixed together.
uk: Великі та малі літери змішані разом.

# sortOrderLexicographicOptions.lower
source: Lowercase names are grouped together before uppercase names.
uk: Імена з малими літерами згруповані разом перед іменами з великими літерами.

# sortOrderLexicographicOptions.unicode
source: Names are sorted in Unicode order.
uk: Імена відсортовані в порядку Unicode.

# sortOrderLexicographicOptions.upper
source: Uppercase names are grouped together before lowercase names.
uk: Імена з великими літерами згруповані разом перед іменами з малими літерами.

# sortOrderReverse
source: Controls whether the file and folder sort order, should be reversed.
uk: Контролює, чи слід змінити порядок сортування файлів і папок на зворотний.

# trimFinalNewlines
source: When enabled, will trim all new lines after the final new line at the end of the file when saving it.
uk: Коли увімкнено, буде видаляти всі нові рядки після останнього нового рядка в кінці файлу при його збереженні.

# trimTrailingWhitespace
source: When enabled, will trim trailing whitespace when saving a file.
uk: Коли ввімкнено, буде видаляти пробіли в кінці рядка при збереженні файлу.

# trimTrailingWhitespaceInRegexAndStrings
source: When enabled, trailing whitespace will be removed from multiline strings and regexes will be removed on save or when executing 'editor.action.trimTrailingWhitespace'. This can cause whitespace to not be trimmed from lines when there isn't up-to-date token information.
uk: Коли увімкнено, пробіли в кінці рядка будуть видалені з багаторядкових рядків, а регулярні вирази будуть видалені під час збереження або при виконанні 'editor.action.trimTrailingWhitespace'. Це може призвести до того, що пробіли не будуть видалені з рядків, коли немає актуальної інформації про токени.

# trueDescription
source: Enable the pattern.
uk: Увімкніть шаблон.

# useTrash
source: Moves files/folders to the OS trash (recycle bin on Windows) when deleting. Disabling this will delete files/folders permanently.
uk: Переміщує файли/папки в кошик ОС (кошик на Windows) під час видалення. Вимкнення цього призведе до постійного видалення файлів/папок.

# watcherExclude
source: Configure paths or [glob patterns](https://aka.ms/vscode-glob-patterns) to exclude from file watching. Paths can either be relative to the watched folder or absolute. Glob patterns are matched relative from the watched folder. When you experience the file watcher process consuming a lot of CPU, make sure to exclude large folders that are of less interest (such as build output folders).
uk: Налаштуйте шляхи або [глобальні шаблони](https://aka.ms/vscode-glob-patterns), які потрібно виключити з моніторингу файлів. Шляхи можуть бути відносними до папки, що моніториться, або абсолютними. Глобальні шаблони співпадають відносно папки, що моніториться. Коли ви помічаєте, що процес моніторингу файлів споживає багато ЦП, переконайтеся, що ви виключили великі папки, які мають менший інтерес (наприклад, папки з вихідними даними збірки).

# watcherInclude
source: Configure extra paths to watch for changes inside the workspace. By default, all workspace folders will be watched recursively, except for folders that are symbolic links. You can explicitly add absolute or relative paths to support watching folders that are symbolic links. Relative paths will be resolved to an absolute path using the currently opened workspace.
uk: Налаштуйте додаткові шляхи для спостереження за змінами всередині робочого простору. За замовчуванням всі папки робочого простору будуть спостерігатися рекурсивно, за винятком папок, які є символічними посиланнями. Ви можете явно додати абсолютні або відносні шляхи, щоб підтримувати спостереження за папками, які є символічними посиланнями. Відносні шляхи будуть перетворені на абсолютний шлях, використовуючи наразі відкритий робочий простір.

# noWorkspace
source: No Folder Opened
uk: Не відкрита папка

# canNotResolve
source: Unable to resolve workspace folder ({0})
uk: Не вдалося вирішити папку робочого простору ({0})

# label
source: Explorer
uk: Провідник

# symbolicLlink
source: Symbolic Link
uk: Символічне посилання

# unknown
source: Unknown File Type
uk: Невідомий тип файлу

# collapseExplorerFolders
source: Collapse Folders in Explorer
uk: Згорнути папки в Провіднику

# collapseExplorerFoldersMetadata
source: Folds all folders in the Explorer.
uk: Згортає всі папки в Провіднику.

# createNewFile
source: New File...
uk: Новий файл...

# createNewFolder
source: New Folder...
uk: Нова папка...

# explorerSection
source: Explorer Section: {0}
uk: Розділ Провідника: {0}

source: Refresh Explorer
uk: Оновити Провідник

# refreshExplorerMetadata
source: Forces a refresh of the Explorer.
uk: Примушує оновлення Провідника.

# confirmMove
source: Are you sure you want to move '{0}' into '{1}'?
uk: Ви впевнені, що хочете перемістити '{0}' у '{1}'?

# confirmMultiMove
source: Are you sure you want to move the following {0} files into '{1}'?
uk: Ви впевнені, що хочете перемістити наступні {0} файли в '{1}'?

# confirmRootMove
source: Are you sure you want to change the order of root folder '{0}' in your workspace?
uk: Ви впевнені, що хочете змінити порядок кореневої папки '{0}' у вашому робочому просторі?

# confirmRootsMove
source: Are you sure you want to change the order of multiple root folders in your workspace?
uk: Ви впевнені, що хочете змінити порядок кількох кореневих папок у вашому робочому просторі?

# copy
source: Copy {0}
uk: Копіювати {0}

# copying
source: Copying {0}
uk: Копіювання {0}

# explorerHighlightFolderBadgeTitle
source: Directory contains {0} matches
uk: Каталог містить {0} збігів

# fileInputAriaLabel
source: Type file name. Press Enter to confirm or Escape to cancel.
uk: Введіть ім'я файлу. Натисніть Enter, щоб підтвердити, або Escape, щоб скасувати.

# move
source: Move {0}
uk: Перемістити {0}

# moveButtonLabel
source: &&Move
uk: &&Перемістити

# moving
source: Moving {0}
uk: Переміщення {0}

# numberOfFiles
source: {0} files
uk: {0} файлів

# numberOfFolders
source: {0} folders
uk: {0} папок

# searchMaxResultsWarning
source: The result set only contains a subset of all matches. Be more specific in your search to narrow down the results.
uk: Набір результатів містить лише підмножину всіх збігів. Будьте більш конкретними у своєму пошуку, щоб звузити результати.

# treeAriaLabel
source: Files Explorer
uk: Провідник файлів

# dirtyCounter
source: {0} unsaved
uk: {0} незбережено

# flipLayout
source: Toggle Vertical/Horizontal Editor Layout
uk: Перемикання вертикального/горизонтального макету редактора

# miToggleEditorLayout
source: Flip &&Layout
uk: Перевернути &&макет

# miToggleEditorLayoutWithoutMnemonic
source: Flip Layout
uk: Перевернути макет

source: Open Editors
uk: Відкриті редактори

# enospcError
source: Unable to watch for file changes. Please follow the instructions link to resolve this issue.
uk: Неможливо відстежувати зміни файлів. Будь ласка, дотримуйтесь інструкцій за посиланням, щоб вирішити цю проблему.

# eshutdownError
source: File changes watcher stopped unexpectedly. A reload of the window may enable the watcher again unless the workspace cannot be watched for file changes.
uk: Спостерігач змін файлів зупинився несподівано. Перезавантаження вікна може знову активувати спостерігача, якщо робочий простір можна спостерігати за змінами файлів.

# learnMore
source: Instructions
uk: Дізнатися більше

source: Reload
uk: Перезавантажити

# dirtyFile
source: 1 unsaved file
uk: 1 незбережений файл

# dirtyFiles
source: {0} unsaved files
uk: {0} незбережених файлів

# explorerFindProviderActive
source: True when the explorer tree is using the explorer find provider.
uk: Істина, коли дерево дослідника використовує провайдер пошуку дослідника.

# explorerResourceCut
source: True when an item in the EXPLORER has been cut for cut and paste.
uk: Істинно, коли елемент в EXPLORER був вирізаний для вирізання та вставки.

# explorerResourceIsFolder
source: True when the focused item in the EXPLORER is a folder.
uk: Істина, коли вибраний елемент у EXPLORER є папкою.

# explorerResourceIsRoot
source: True when the focused item in the EXPLORER is a root folder.
uk: Істинно, коли вибраний елемент у EXPLORER є кореневою папкою.

# explorerResourceMoveableToTrash
source: True when the focused item in the EXPLORER can be moved to trash.
uk: Істинно, коли вибраний елемент у EXPLORER може бути переміщений до кошика.

# explorerResourceParentReadonly
source: True when the focused item in the EXPLORER's parent is read-only.
uk: Істинно, коли зосереджений елемент у батьківському елементі EXPLORER є лише для читання.

# explorerResourceReadonly
source: True when the focused item in the EXPLORER is read-only.
uk: Істина, коли вибраний елемент у EXPLORER є лише для читання.

# explorerViewletCompressedFirstFocus
source: True when the focus is inside a compact item's first part in the EXPLORER view.
uk: Істинно, коли фокус знаходиться всередині першої частини компактного елемента в режимі EXPLORER.

# explorerViewletCompressedFocus
source: True when the focused item in the EXPLORER view is a compact item.
uk: Істинно, коли вибраний елемент у вигляді EXPLORER є компактним елементом.

# explorerViewletCompressedLastFocus
source: True when the focus is inside a compact item's last part in the EXPLORER view.
uk: Істинно, коли фокус знаходиться всередині останньої частини компактного елемента в режимі EXPLORER.

# explorerViewletFocus
source: True when the focus is inside the EXPLORER viewlet.
uk: Істинно, коли фокус знаходиться всередині вікна перегляду EXPLORER.

# explorerViewletVisible
source: True when the EXPLORER viewlet is visible.
uk: Істинно, коли виджет EXPLORER видимий.

# filesExplorerFocus
source: True when the focus is inside the EXPLORER view.
uk: Істинно, коли фокус знаходиться всередині вікна EXPLORER.

# foldersViewVisible
source: True when the FOLDERS view (the file tree within the explorer view container) is visible.
uk: Істинно, коли вид FOLDERS (дерево файлів у контейнері перегляду провідника) видимий.

# openEditorsFocus
source: True when the focus is inside the OPEN EDITORS view.
uk: Істинно, коли фокус знаходиться всередині вигляду ВІДКРИТИХ РЕДАКТОРІВ.

# viewHasSomeCollapsibleItem
source: True when a workspace in the EXPLORER view has some collapsible root child.
uk: Істинно, коли робоча область у вигляді EXPLORER має деякі згортальні кореневі дочірні елементи.

# filesCategory
source: File
uk: Файл

# miShare
source: Share
uk: Поділитися

# openContainer
source: Open Containing Folder
uk: Відкрити папку, що містить

# revealInMac
source: Reveal in Finder
uk: Показати у Finder

# revealInWindows
source: Reveal in File Explorer
uk: Відкрити в Провіднику файлів
