Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_localization.xlf
Languages: uk

source: Language ID
uk: Ідентифікатор мови

# localizations
source: Language Packs
uk: Мовні пакети

# localizations language name
source: Language Name
uk: Назва мови

# localizations localized language name
source: Language Name (Localized)
uk: Назва мови (локалізована)

# vscode.extension.contributes.localizations
source: Contributes localizations to the editor
uk: Вносить локалізації до редактора

# vscode.extension.contributes.localizations.languageId
source: Id of the language into which the display strings are translated.
uk: Ідентифікатор мови, на яку перекладені рядки відображення.

# vscode.extension.contributes.localizations.languageName
source: Name of the language in English.
uk: Назва мови англійською.

# vscode.extension.contributes.localizations.languageNameLocalized
source: Name of the language in contributed language.
uk: Назва мови в внесеній мові.

# vscode.extension.contributes.localizations.translations
source: List of translations associated to the language.
uk: Список перекладів, пов'язаних з мовою.

# vscode.extension.contributes.localizations.translations.id
source: Id of VS Code or Extension for which this translation is contributed to. Id of VS Code is always `vscode` and of extension should be in format `publisherId.extensionName`.
uk: Ідентифікатор VS Code або розширення, для якого було надано цей переклад. Ідентифікатор VS Code завжди `vscode`, а ідентифікатор розширення має бути у форматі `publisherId.extensionName`.

# vscode.extension.contributes.localizations.translations.id.pattern
source: Id should be `vscode` or in format `publisherId.extensionName` for translating VS code or an extension respectively.
uk: Id має бути `vscode` або у форматі `publisherId.extensionName` для перекладу VS Code або розширення відповідно.

# vscode.extension.contributes.localizations.translations.path
source: A relative path to a file containing translations for the language.
uk: Відносний шлях до файлу, що містить переклади для мови.

source: Available
uk: Доступно

# chooseLocale
source: Select Display Language
uk: Виберіть мову відображення

# clearDisplayLanguage
source: Clear Display Language Preference
uk: Очистити переваги мови відображення

# configureLocale
source: Configure Display Language
uk: Налаштувати мову відображення

# configureLocaleDescription
source: Changes the locale of VS Code based on installed language packs. Common languages include French, Chinese, Spanish, Japanese, German, Korean, and more.
uk: Змінює мову інтерфейсу VS Code на основі встановлених мовних пакетів. Загальні мови включають французьку, китайську, іспанську, японську, німецьку, корейську та інші.

source: Installed
uk: Встановлено

source: More Info
uk: Більше інформації

# changeAndRestart
source: Change Language and Restart
uk: Змінити мову та перезапустити

# neverAgain
source: Don't Show Again
uk: Не показувати знову

# updateLocale
source: Would you like to change {0}'s display language to {1} and restart?
uk: Ви хочете змінити мову відображення {0} на {1} та перезапустити?

source: Install and Restart
uk: Встановити та перезавантажити

# installAndRestartMessage
source: Install language pack to change the display language to {0}.
uk: Встановіть мовний пакет, щоб змінити мову відображення на {0}.

source: Search Marketplace
uk: Пошук ринку

# showLanguagePackExtensions
source: Search language packs in the Marketplace to change the display language to {0}.
uk: Шукайте мовні пакети на Marketplace, щоб змінити мову відображення на {0}.
