Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

# chat.useFileStorage
source: Enables storing chat sessions on disk instead of in the storage service. Enabling this does a one-time per-workspace migration of existing sessions to the new format.
uk: Дозволяє зберігати чат-сесії на диску замість у сервісі зберігання. Увімкнення цього виконує одноразову міграцію існуючих сесій до нового формату для кожного робочого простору.

# clear
source: Start a new chat
uk: Почати новий чат

# interactiveSession.editor.fontFamily
source: Controls the font family in chat codeblocks.
uk: Керує сім'єю шрифтів у кодових блоках чату.

# interactiveSession.editor.fontSize
source: Controls the font size in pixels in chat codeblocks.
uk: Контролює розмір шрифту в пікселях у кодових блоках чату.

# interactiveSession.editor.fontWeight
source: Controls the font weight in chat codeblocks.
uk: Контролює товщину шрифту в кодових блоках чату.

# interactiveSession.editor.lineHeight
source: Controls the line height in pixels in chat codeblocks. Use 0 to compute the line height from the font size.
uk: Контролює висоту рядка в пікселях у кодових блоках чату. Використовуйте 0, щоб обчислити висоту рядка з розміру шрифту.

# interactiveSession.editor.wordWrap
source: Controls whether lines should wrap in chat codeblocks.
uk: Контролює, чи повинні рядки обгортатися в кодових блоках чату.

# interactiveSessionConfigurationTitle
source: Chat
uk: Чат

# mcp.discovery.enabled
source: Configures discovery of Model Context Protocol servers from configuration from various other applications.
uk: Налаштовує виявлення серверів протоколу контексту моделі з конфігурації з різних інших застосунків.

# mcp.gallery.serviceUrl
source: Configure the MCP Gallery service URL to connect to
uk: Налаштуйте URL-адресу служби MCP Gallery для підключення до

# mcp.list
source: List Servers
uk: Список серверів

# save-chat-to-prompt-file
source: Save chat to a prompt file
uk: Зберегти чат у файл запиту

# multiCodeBlock
source: {0}{1}{2} code blocks: {3} {4}
uk: {0}{1}{2} кодові блоки: {3} {4}

# multiCodeBlockHint
source: {0}{1}{2}{3} code blocks: {4}{5} {6}
uk: {0}{1}{2}{3} кодові блоки: {4}{5} {6}

# multiFileTreeHint
source: {0} file trees
uk: {0} дерева файлів

# multiTableHint
source: {0} tables
uk: {0} таблиць

# singleCodeBlock
source: {0}{1}1 code block: {2} {3}
uk: {0}{1}1 кодовий блок: {2} {3}

# singleCodeBlockHint
source: {0}{1}{2}1 code block: {3} {4}{5}
uk: {0}{1}{2}1 код блок: {3} {4}{5}

# singleFileTreeHint
source: 1 file tree
uk: 1 дерево файлів

# singleTableHint
source: 1 table
uk: 1 таблиця

# toolCompletedHint
source: Tool {0} completed.
uk: Інструмент {0} завершено.

# toolInvocationsHint
source: Chat confirmation required: {0}
uk: Підтвердження чату необхідне: {0}

# toolInvocationsHintKb
source: Chat confirmation required: {0}. Press {1} to accept or {2} to cancel.
uk: Підтвердження чату необхідне: {0}. Натисніть {1}, щоб прийняти, або {2}, щоб скасувати.

# reservedName
source: This chat extension is using a reserved name.
uk: Ця розширення чату використовує зарезервоване ім'я.

# viewExtensionLabel
source: View Extension
uk: Перегляд розширення

# imageTooLarge
source: Image is too large
uk: Зображення занадто велике

# imageTooLargeMessage
source: The image {0} is too large to be attached.
uk: Зображення {0} занадто велике, щоб бути прикріпленим.

# chat.NotebookImageAttachment
source: Attached Notebook output, {0}
uk: Прикріплений вихідний файл блокнота, {0}

# chat.attachment
source: Attached context, {0}
uk: Прикріплений контекст, {0}

# chat.attachment.clearButton
source: Remove from context
uk: Видалити з контексту

# chat.clickToViewContents
source: Click to view the contents of: {0}
uk: Натисніть, щоб переглянути вміст: {0}

# chat.elementAttachment
source: Attached element, {0}
uk: Прикріплений елемент, {0}

# chat.fileAttachment
source: Attached file, {0}
uk: Прикріплено {0}, {1}

# chat.fileAttachmentHover
source: {0} does not support this file type.
uk: {0} не підтримує цей тип файлу.

# chat.fileAttachmentWithRange
source: Attached file, {0}, line {1} to line {2}
uk: Прикріплено {0}, {1}, рядок {2} до рядка {3}

# chat.imageAttachment
source: Attached image, {0}
uk: Прикріплене зображення, {0}

# chat.imageAttachmentHover
source: {0} does not support images.
uk: {0} не підтримує зображення.

# chat.imageAttachmentWarning
source: This GIF was partially omitted - current frame will be sent.
uk: Цей GIF був частково пропущений - поточний кадр буде надіслано.

# chat.instructionsAttachment
source: Instructions attachment, {0}
uk: Інструкції в додатку, {0}

# chat.omittedFileAttachment
source: Omitted this file: {0}
uk: Пропущено цей файл: {0}

# chat.omittedImageAttachment
source: Omitted this image: {0}
uk: Пропущено це зображення: {0}

# chat.omittedNotebookImageAttachment
source: Omitted this Notebook ouput: {0}
uk: Пропущено цей вихід записника: {0}

# chat.partiallyOmittedImageAttachment
source: Partially omitted this image: {0}
uk: Частково пропущено це зображення: {0}

# chat.partiallyOmittedNotebookImageAttachment
source: Partially omitted this Notebook output: {0}
uk: Частково пропущено вихідні дані цього блокнота: {0}

# chat.promptAttachment
source: Prompt file, {0}
uk: Файл запиту, {0}

source: Instructions
uk: Інструкції

# instructions.label
source: Additional Instructions
uk: Додаткові інструкції

source: Prompt
uk: Запит

# resource
source: The full value of the chat attachment resource, including scheme and path
uk: Повна вартість ресурсу вкладення чату, включаючи схему та шлях

# rerun
source: Rerun without {0}{1}
uk: Перезапустити без {0}{1}

# chat.viewFileChangesSummary
source: View All File Changes
uk: Переглянути всі зміни файлів

source: View matches
uk: Переглянути матчі

# usedReferencesCollapsed
source: {0}, collapsed
uk: {0}, згорнуто

# usedReferencesExpanded
source: {0}, expanded
uk: {0}, розширено

# commandButtonDisabled
source: Button not available in restored chat
uk: Кнопка недоступна в відновленому чаті

source: Accept
uk: Прийняти

# chat.confirmationWidget.ariaLabel
source: Chat Confirmation Dialog {0} {1}
uk: Діалог підтвердження чату {0} {1}

# defaultTitle
source: Chat: Confirmation Required
uk: Чат: Підтвердження потрібне

# notificationDetail
source: The current chat session requires your confirmation to proceed.
uk: Поточна сесія чату вимагає вашого підтвердження для продовження.

# notificationTitle
source: Chat: {0}
uk: Чат: {0}

# chat.extensions.loading
source: Loading extensions...
uk: Завантаження розширень...

# chat.codeblock.applyingPercentage
source: Applying edits ({0}%)...
uk: Застосування змін ({0}%)...

# chat.codeblock.deletions
source: {0} deletions
uk: {0} видалень

# chat.codeblock.deletions.one
source: 1 deletion
uk: 1 видалення

# chat.codeblock.generating
source: Generating edits...
uk: Генерація редагувань...

# chat.codeblock.insertions
source: {0} insertions
uk: {0} вставок

# chat.codeblock.insertions.one
source: 1 insertion
uk: 1 вставка

# summary
source: Edited {0}, {1}, {2}
uk: Відредаговано {0}, {1}, {2}

# chatMultiDiff.manyFiles
source: Changed {0} files
uk: Змінено {0} файлів

# chatMultiDiff.oneFile
source: Changed 1 file
uk: Змінено 1 файл

# chatMultiDiffList
source: File Changes
uk: Зміни файлу

# workingMessage
source: Working...
uk: Працює...

# chatPullRequest.seeMore
source: See more
uk: Дивитися більше

# clickToContinue
source: Click to retry.
uk: Натисніть, щоб спробувати ще раз.

# enableAdditionalUsage
source: Manage paid premium requests
uk: Керувати платними преміум-запитами

source: Upgrade to Copilot Pro
uk: Оновити до Copilot Pro

# waitWarning
source: Changes may take a few minutes to take effect.
uk: Зміни можуть зайняти кілька хвилин, щоб набрати чинності.

# addToChat
source: Add File to Chat
uk: Додати файл до чату

# chatCollapsibleList
source: Collapsible Chat References List
uk: Згортаємий список посилань на чат

# chatEditingSession.fileCounts
source: {0} lines added, {1} lines removed
uk: {0} рядків додано, {1} рядків видалено

source: Copy Link
uk: Скопіювати посилання

# setting.hover
source: Open setting '{0}'
uk: Відкрити налаштування '{0}'

# usedReferencesPlural
source: Used {0} references
uk: Використано {0} посилань

# usedReferencesSingular
source: Used {0} reference
uk: Використано {0} посилання

# edits0
source: Making changes was aborted.
uk: Зміни були скасовані.

# editsSummary
source: Made changes.
uk: Зроблено зміни.

# thinkingHeader
source: Thinking...
uk: Думаю...

# thinkingPlural
source: Thought for {0} seconds
uk: Думка протягом {0} секунд

# thinkingSingular
source: Thought for 1 second
uk: Думка на 1 секунду

# chat.todoList.clearButton
source: Clear all todos
uk: Очистити всі завдання

# chat.todoList.clearButton.ariaLabel
source: Clear all todos
uk: Очистити всі завдання

# chat.todoList.title
source: Todos
uk: Усі

# chat.todoList.titleWithProgress
source: Todos ({0}/{1})
uk: Усі ({0}/{1})

# chat.input
source: Input
uk: Вхід

# chat.output
source: Output
uk: Вихід

# chat.saveResources
source: Save As...
uk: Зберегти як...

# chat.saveResources.error
source: Failed to save {0}: {1}
uk: Не вдалося зберегти {0}: {1}

# chat.saveResources.progress
source: Saving resources...
uk: Збереження ресурсів...

# chat.saveResources.reveal
source: Saved resources to {0}
uk: Збережені ресурси до {0}

# chat.saveResources.title
source: Pick folder to save resources
uk: Виберіть папку для збереження ресурсів

# treeAriaLabel
source: File Tree
uk: Дерево файлів

source: Cancel
uk: Скасувати

source: Continue
uk: Продовжити

source: Install Extensions
uk: Встановити розширення

# installExtensionsConfirmation
source: Click the Install button on the extension and then press Continue when finished.
uk: Натисніть кнопку Встановити на розширенні, а потім натисніть Продовжити, коли закінчите.

# autoApprove.button.enable
source: Enable
uk: Увімкнути

# autoApprove.enable
source: Enable Auto Approve...
uk: Увімкнути автоматичне схвалення...

# autoApprove.markdown
source: This will enable a configurable subset of commands to run in the terminal autonomously. It provides *best effort protections* and assumes the agent is not acting maliciously.
uk: Це дозволить автономно виконувати конфігуровану підмножину команд у терміналі. Це забезпечує *найкращі зусилля для захисту* і припускає, що агент не діє зловмисно.

# autoApprove.title
source: Enable terminal auto approve?
uk: Увімкнути автоматичне підтвердження терміналу?

# newRule
source: Auto approve rule {0} added
uk: Правило автоматичного затвердження {0} додано

# newRule.plural
source: Auto approve rules {0} added
uk: Автоматично затверджено правила {0} додано

# ruleTooltip
source: View rule in settings
uk: Переглянути правило в налаштуваннях

# allowGloballTooltip
source: Always allow this tool to run without confirmation.
uk: Завжди дозволяти цьому інструменту працювати без підтвердження.

# allowGlobally
source: Always Allow
uk: Завжди дозволяти

# allowSession
source: Allow in this Session
uk: Дозволити в цій сесії

# allowSesssionTooltip
source: Allow this tool to run in this session without confirmation.
uk: Дозволити цьому інструменту працювати в цій сесії без підтвердження.

# allowWorkspace
source: Allow in this Workspace
uk: Дозволити в цьому Робочому просторі

# allowWorkspaceTooltip
source: Allow this tool to run in this workspace without confirmation.
uk: Дозволити цьому інструменту працювати в цьому робочому просторі без підтвердження.

source: See more
uk: Дивитися більше

source: Show More
uk: Показати більше

# chat.autoapprove.lmServicePerTool.profile
source: Auto approved for this profile
uk: Автоматично затверджено для цього профілю

# chat.autoapprove.lmServicePerTool.session
source: Auto approved for this session
uk: Автоматично затверджено для цієї сесії

# chat.autoapprove.lmServicePerTool.workspace
source: Auto approved for this workspace
uk: Автоматично затверджено для цього робочого простору

# chat.autoapprove.setting
source: Auto approved by {0}
uk: Автоматично затверджено {0}

source: Edit
uk: Редагувати

# loading
source: Rendering tool output...
uk: Виведення результатів інструмента рендерингу...

# attacAsContext
source: Attach {0} as Context
uk: Прикріпити {0} як Контекст

# dragAndDroppedImageName
source: Image from URL
uk: Зображення з URL

source: File
uk: Виберіть файл у робочій області

source: Folder
uk: Папка

source: Image
uk: Зображення

# notebookOutput
source: Output
uk: Вихід

source: Problem
uk: Проблема

# scmHistoryItem
source: Change
uk: Змінити

source: Symbol
uk: Символ

# accept
source: Keep
uk: Прийняти

# accept.file
source: Keep
uk: Зберегти

# acceptAllEdits
source: Keep All Edits
uk: Зберегти всі зміни

source: Add Files From References
uk: Додати файли з посилань

# chat.editRequests.label
source: Edit Request
uk: Редагувати запит

# chat.editing.discardAll.confirmation.manyFiles
source: This will undo changes made in {0} files. Do you want to proceed?
uk: Це скасує зміни, внесені в {0} файлах. Ви хочете продовжити?

# chat.editing.discardAll.confirmation.oneFile
source: This will undo changes made in {0}. Do you want to proceed?
uk: Це скасує зміни, внесені в {0}. Ви хочете продовжити?

# chat.editing.discardAll.confirmation.primaryButton
source: Yes
uk: Так

# chat.editing.discardAll.confirmation.title
source: Undo all edits?
uk: Скасувати всі зміни?

# chat.openFileUpdatedBySnapshot.label
source: Open File
uk: Відкрити файл

# chat.openSnapshot.label
source: Open File Snapshot
uk: Відкрити знімок файлу

# chat.restoreCheckpoint.label
source: Restore Checkpoint
uk: Відновити контрольну точку

# chat.restoreCheckpoint.tooltip
source: Restores workspace and chat to this point
uk: Відновлює робочий простір і чат до цього моменту

# chat.restoreLastCheckpoint.label
source: Restore to Last Checkpoint
uk: Відновити до останньої контрольної точки

# chat.undoEdits.label
source: Undo Requests
uk: Скасувати запити

# chatEditing.snapshot
source: {0} (Snapshot)
uk: {0} (Снімок)

# chatEditing.viewChanges
source: View All Edits
uk: - Переглянути зміни{0}.

# chatEditing.viewPreviousEdits
source: View Previous Edits
uk: - Переглянути попередні редагування{0}.

# discard
source: Undo
uk: Скасувати

# discard.file
source: Undo
uk: Скасувати

# discardAllEdits
source: Undo All Edits
uk: Скасувати всі зміни

# open.fileInDiff
source: Open Changes in Diff Editor
uk: Відкрити зміни в редакторі порівняння

# diff.agent
source: {0} (changes from {1})
uk: {0} (зміни з {1})

# diff.generic
source: {0} (changes from chat)
uk: {0} (зміни з чату)

# accept
source: Keep Chat Edits
uk: Прийняти

# accept2
source: Keep
uk: Зберігати

# accept3
source: Keep Chat Edits in this File
uk: Зберігати редагування чату в цьому файлі

# accept4
source: Keep All Edits
uk: Зберегти всі зміни

# acceptAllEdits
source: Keep All Chat Edits
uk: Зберегти всі зміни

# acceptAllEditsTooltip
source: Keep All Chat Edits in this Session
uk: Зберігайте всі редагування чату в цій сесії

# acceptHunk
source: Keep this Change
uk: Залиште цю решту

# accessibleDiff
source: Show Accessible Diff View for Chat Edits
uk: Показати доступний перегляд змін для редагувань чату

# diff
source: Toggle Diff Editor for Chat Edits
uk: Переключити редактор відмінностей для редагувань чату

# discard
source: Undo Chat Edits
uk: Скасувати

# discard2
source: Undo
uk: Скасувати

# discard3
source: Undo Chat Edits in this File
uk: Скасувати редагування чату в цьому файлі

# discard4
source: Undo All Edits
uk: Скасувати всі зміни

# label
source: Navigation Status
uk: Налаштувати інструменти...

# next
source: Go to Next Chat Edit
uk: Перейти до наступного редагування чату

# prev
source: Go to Previous Chat Edit
uk: Перейти до попереднього редагування чату

source: Review
uk: Огляд

# undo
source: Undo this Change
uk: Скасувати цю зміну

# chat.ctxEditSessionIsGlobal
source: The current editor is part of the global edit session
uk: Поточний редактор є частиною глобальної сесії редагування

# chat.ctxHasRequestInProgress
source: The current editor shows a file from an edit session which is still in progress
uk: Поточний редактор показує файл з сеансу редагування, який все ще триває

# chat.ctxReviewModeEnabled
source: Review mode for chat changes is enabled
uk: Режим перегляду змін чату увімкнено

# chat.hasEditorModifications
source: The current editor contains chat modifications
uk: Поточний редактор містить модифікації чату

# chatEdits.requestCount
source: The number of turns the editing session in this editor has
uk: Кількість ходів, які має сесія редагування в цьому редакторі

# nOfM
source: {0} of {1}
uk: {0} з {1}

# tooltip_11
source: 1 change in 1 file
uk: 1 зміна в 1 файлі

# tooltip_1n
source: 1 change in {0} files
uk: 1 зміна в {0} файлах

# tooltip_busy
source: {0} - Working...
uk: {0} - Працює...

# tooltip_n1
source: {0} changes in 1 file
uk: {0} зміни в 1 файлі

# tooltip_nm
source: {0} changes in {1} files
uk: {0} зміни в {1} файлах

source: Working...
uk: Працює...

# chatEditing1
source: Chat Edit: '{0}'
uk: Редагування чату: '{0}'

# chatEditing2
source: Chat Edit
uk: Редагувати чат

# default
source: Chat Edits
uk: Редагування чату

# editorSelectionBackground
source: Color of pending edit regions in the minimap
uk: Колір регіонів очікування редагування на міні-карті

# chatNotebookEdit2
source: Chat Edit
uk: Чат Редагувати

# chat
source: Chat Editing
uk: Чат

# chatEditing.modified
source: Pending changes from {0}
uk: Очікуючі зміни від {0}

# chatEditing.modified2
source: Pending changes from chat
uk: Очікувані зміни з чату

# join.chatEditingSession
source: Saving chat edits history
uk: Збереження історії редагування чату

# multiDiffEditorInput.name
source: Suggested Edits
uk: Запропоновані зміни

# cancelSelection
source: Click to cancel selection.
uk: Натисніть, щоб скасувати вибір.

# cancelSelectionLabel
source: Cancel
uk: Скасувати

# chat.configureElements
source: Configure Attachments Sent
uk: Налаштувати надіслані вкладення

# chat.expandOverlay
source: Expand Overlay
uk: Розширити накладку

# chat.hideOverlay
source: Collapse Overlay
uk: Сховати накладку

# chat.nextSelection
source: Select Again
uk: Вибрати знову

# connectingWebviewElement
source: Connecting to webview...
uk: Підключення до webview...

# continuousSelectionDropdown
source: Continuous Selection
uk: Безперервний вибір

# elementCancelMessage
source: Selection canceled
uk: Вибір скасовано

# elementSelectionComplete
source: Element added to chat
uk: Елемент додано до чату

# elementSelectionInProgress
source: Selecting element...
uk: Вибір елемента...

# elementSelectionMessage
source: Add element to chat
uk: Додати елемент до чату

# finishSelectionLabel
source: Done
uk: Готово

# reopenErrorWebviewElement
source: Please reopen the preview.
uk: Будь ласка, повторно відкрийте попередній перегляд.

# selectAnElement
source: Click to select an element.
uk: Натисніть, щоб вибрати елемент.

# selectElementDropdown
source: Select an Element
uk: Виберіть елемент

# startSelection
source: Start
uk: Почати

# chat.startEditing.confirmation.acceptEdits
source: Keep & Continue
uk: Зберігайте та продовжуйте

# chat.startEditing.confirmation.discardEdits
source: Undo & Continue
uk: Скасувати та продовжити

# chat.startEditing.confirmation.pending.message.2
source: Do you want to keep pending edits to {0} files?
uk: Ви хочете зберегти незавершені редагування до {0} файлів?

# chat.startEditing.confirmation.pending.message.default
source: Closing the chat editor will end your current edit session.
uk: Початок нового чату завершить вашу поточну сесію редагування.

# chat.startEditing.confirmation.pending.message.default1
source: Starting a new chat will end your current edit session.
uk: Початок нового чату завершить вашу поточну сесію редагування.

# chat.startEditing.confirmation.title
source: Start new chat?
uk: Почати новий чат?

# chatEditorConfirmTitle
source: Close Chat Editor
uk: Закрити редактор чату

# chatEditorLabelIcon
source: Icon of the chat editor label.
uk: Іконка мітки редактора чату.

# chatEditorName
source: Chat
uk: Чат

# followUpAriaLabel
source: Follow up question: {0}
uk: Запитання для уточнення: {0}

# actions.attach.label
source: Add File to Chat
uk: Додати файл до чату

# actions.copy.label
source: Copy
uk: Копіювати

# actions.goToDecl.label
source: Go to Definition
uk: Перейти до визначення

# actions.openToSide.label
source: Open to the Side
uk: Відкрити вбік

# goToImplementations.label
source: Go to Implementations
uk: Перейти до реалізацій

# goToReferences.label
source: Go to References
uk: Перейти до посилань

# goToTypeDefinitions.label
source: Go to Type Definitions
uk: Перейти до визначень типів

# miGotoDefinition
source: Go to &&Definition
uk: Перейти до &&визначення

# miGotoImplementations
source: Go to &&Implementations
uk: Перейти до &&впроваджень

# miGotoReference
source: Go to &&References
uk: Перейти до &&посилань

# miGotoTypeDefinition
source: Go to &&Type Definitions
uk: Перейти до &&визначень типів

# actions.chat.accessibiltyHelp
source: Chat Input {0} Press Enter to send out the request. Use {1} for Chat Accessibility Help.
uk: Чат Введення {0} Натисніть Enter, щоб надіслати запит. Використовуйте {1} для допомоги з доступністю чату.

# chatAttachFiles
source: Search for files and context to add to your request
uk: Шукайте файли та контекст, щоб додати до вашого запиту

# chatEditingSession.addSuggested
source: Add suggestion
uk: Додати пропозицію

# chatEditingSession.addSuggestion
source: Add suggestion {0}
uk: Додати пропозицію {0}

# chatEditingSession.ariaLabelWithCounts
source: {0}, {1} lines added, {2} lines removed
uk: {0}, {1} рядків додано, {2} рядків видалено

# chatEditingSession.manyFiles.1
source: {0} files changed
uk: {0} файлів змінено

# chatEditingSession.oneFile.1
source: 1 file changed
uk: 1 файл змінено

# chatEditingSession.toggleWorkingSet
source: Toggle changed files.
uk: Перемикання змінених файлів.

# chatInput.accessibilityHelp
source: Chat Input {0}.
uk: Чат-ввід {0}.

# chatInput.accessibilityHelpNoKb
source: Chat Input {0} Press Enter to send out the request. Use the Chat Accessibility Help command for more information.
uk: Чат Введення {0} Натисніть Enter, щоб надіслати запит. Використайте команду Допомога з доступності чату для отримання додаткової інформації.

# chatInput.mode.agent
source: (Agent Mode), edit files in your workspace.
uk: (Режим агента), редагуйте файли у вашому робочому просторі.

# chatInput.mode.ask
source: (Ask Mode), ask questions or type / for topics.
uk: (Режим запитів), ставте запитання або введіть / для тем.

# chatInput.mode.edit
source: (Edit Mode), edit files in your workspace.
uk: (Режим редагування), редагуйте файли у вашому робочому просторі.

# notebook.moreExecuteActionsLabel
source: More...
uk: Більше...

# chatConfirmationAction
source: selected "{0}"
uk: обрано "{0}"

# checkpointRestore
source: Checkpoint Restored
uk: Контрольна точка відновлена

# didNotFollowInstructions
source: Didn't follow instructions
uk: Не дотримався інструкцій

source: Incomplete code
uk: Неповний код

# incorrectCode
source: Suggested incorrect code
uk: Запропонований неправильний код

source: Missing context
uk: Відсутній контекст

source: Offensive or unsafe
uk: Образливий або небезпечний

source: Other
uk: Інше

source: Poorly written or formatted
uk: Погано написано або відформатовано

source: Refused a valid request
uk: Відмовлено у дійсному запиті

# renderFailMsg
source: Failed to render content
uk: Не вдалося відобразити вміст

# reportIssue
source: Report an issue
uk: Повідомити про проблему

# requestMarkdownPartTitle
source: Click to Edit
uk: Натисніть, щоб редагувати

# usedAgent
source: [[(rerun without)]]
uk: [[(перезапустити без)]]

# usedAgentSlashCommand
source: used {0} [[(rerun without)]]
uk: використано {0} [[(повторити без)]]
