Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_localHistory.xlf
Languages: uk

# localHistoryIcon
source: Icon for a local history entry in the timeline view.
uk: Іконка для запису місцевої історії в режимі хронології.

# localHistoryRestore
source: Icon for restoring contents of a local history entry.
uk: Іконка для відновлення вмісту запису локальної історії.

# confirmDeleteAllDetail
source: This action is irreversible!
uk: Цю дію неможливо скасувати!

# confirmDeleteAllMessage
source: Do you want to delete all entries of all files in local history?
uk: Ви хочете видалити всі записи всіх файлів у локальній історії?

# confirmDeleteDetail
source: This action is irreversible!
uk: Цю дію неможливо скасувати!

# confirmDeleteMessage
source: Do you want to delete the local history entry of '{0}' from {1}?
uk: Ви хочете видалити запис локальної історії '{0}' з {1}?

# confirmRestoreDetail
source: Restoring will discard any unsaved changes.
uk: Відновлення скине всі незбережені зміни.

# confirmRestoreMessage
source: Do you want to restore the contents of '{0}'?
uk: Ви хочете відновити вміст '{0}'?

# createLocalHistoryEntryTitle
source: Create Local History Entry
uk: Створити запис місцевої історії

# createLocalHistoryPlaceholder
source: Enter the new name of the local history entry for '{0}'
uk: Введіть нову назву запису локальної історії для '{0}'

# deleteAllButtonLabel
source: &&Delete All
uk: &&Видалити все

# deleteButtonLabel
source: &&Delete
uk: &&Видалити

# localHistory.category
source: Local History
uk: Місцева історія

# localHistory.compareWithFile
source: Compare with File
uk: Порівняти з файлом

# localHistory.compareWithPrevious
source: Compare with Previous
uk: Порівняти з попереднім

# localHistory.compareWithSelected
source: Compare with Selected
uk: Порівняти з обраним

# localHistory.create
source: Create Entry
uk: Створити запис

# localHistory.delete
source: Delete
uk: Видалити

# localHistory.deleteAll
source: Delete All
uk: Видалити все

# localHistory.open
source: Show Contents
uk: Показати вміст

# localHistory.rename
source: Rename
uk: Перейменувати

# localHistory.restore
source: Restore Contents
uk: Відновити вміст

# localHistory.restoreViaPicker
source: Find Entry to Restore
uk: Знайти запис для відновлення

# localHistory.restoreViaPickerMenu
source: Local History: Find Entry to Restore...
uk: Місцева історія: Знайти запис для відновлення...

# localHistory.selectForCompare
source: Select for Compare
uk: Вибрати для порівняння

# localHistoryRestore.source
source: File Restored
uk: Файл відновлено

# renameLocalHistoryEntryTitle
source: Rename Local History Entry
uk: Перейменувати запис локальної історії

# renameLocalHistoryPlaceholder
source: Enter the new name of the local history entry
uk: Введіть нову назву запису локальної історії

# restoreButtonLabel
source: &&Restore
uk: &&Відновити

# restoreViaPicker.entryPlaceholder
source: Select the local history entry to open
uk: Виберіть запис локальної історії для відкриття

# restoreViaPicker.filePlaceholder
source: Select the file to show local history for
uk: Виберіть файл, щоб показати локальну історію для

# unableToRestore
source: Unable to restore '{0}'.
uk: Неможливо відновити '{0}'.

source: Local History
uk: Місцева історія

# openContainer
source: Open Containing Folder
uk: Відкрити папку, що містить

# revealInMac
source: Reveal in Finder
uk: Відкрити в Finder

# revealInWindows
source: Reveal in File Explorer
uk: Показати у Провіднику файлів
