Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_workspace.xlf
Languages: uk

# addWorkspaceFolderDetail
source: You are adding files that are not currently trusted to a trusted workspace. Do you trust the authors of these new files?
uk: Ви додаєте файли, які наразі не є довіреними, до довіреного робочого простору. Чи довіряєте ви авторам цих нових файлів?

# addWorkspaceFolderMessage
source: Do you trust the authors of the files in this folder?
uk: Ви довіряєте авторам файлів у цій папці?

# cancelWorkspaceTrustButton
source: Cancel
uk: Скасувати

# checkboxString
source: Trust the authors of all files in the parent folder '{0}'
uk: Довіряйте авторам усіх файлів у батьківській папці '{0}'

source: Configure Workspace Trust Settings
uk: Налаштувати параметри довіри до робочого простору

# dontTrustFolderOptionDescription
source: Browse folder in restricted mode
uk: Перегляд папки в обмеженому режимі

# dontTrustOption
source: &&No, I don't trust the authors
uk: &&Ні, я не довіряю авторам

# dontTrustWorkspaceOptionDescription
source: Browse workspace in restricted mode
uk: Перегляд робочого простору в обмеженому режимі

# folderStartupTrustDetails
source: {0} provides features that may automatically execute files in this folder.
uk: {0} надає функції, які можуть автоматично виконувати файли в цій папці.

# folderTrust
source: Do you trust the authors of the files in this folder?
uk: Чи довіряєте ви авторам файлів у цій папці?

# grantFolderTrustButton
source: &&Trust Folder & Continue
uk: &&Довіряти каталогу та продовжити

# grantWorkspaceTrustButton
source: &&Trust Workspace & Continue
uk: &&Довіряти робочому середовищу та продовжити

# immediateTrustRequestLearnMore
source: If you don't trust the authors of these files, we do not recommend continuing as the files may be malicious. See [our docs](https://aka.ms/vscode-workspace-trust) to learn more.
uk: Якщо ви не довіряєте авторам цих файлів, ми не рекомендуємо продовжувати, оскільки файли можуть бути шкідливими. Дивіться [наші документи](https://aka.ms/vscode-workspace-trust), щоб дізнатися більше.

# immediateTrustRequestMessage
source: A feature you are trying to use may be a security risk if you do not trust the source of the files or folders you currently have open.
uk: Функція, яку ви намагаєтеся використовувати, може бути ризиком для безпеки, якщо ви не довіряєте джерелу файлів або папок, які ви наразі відкриті.

source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# manageWorkspaceTrustButton
source: &&Manage
uk: &&Керувати

# newWindow
source: Open in &&Restricted Mode
uk: Відкрити в &&обмеженому режимі

source: No
uk: Ні

source: &&Open
uk: &&Відкрити

# openLooseFileLearnMore
source: If you don't want to open untrusted files, we recommend to open them in Restricted Mode in a new window as the files may be malicious. See [our docs](https://aka.ms/vscode-workspace-trust) to learn more.
uk: Якщо ви не хочете відкривати ненадійні файли, ми рекомендуємо відкривати їх у Обмеженому режимі в новому вікні, оскільки файли можуть бути шкідливими. Дивіться [наші документи](https://aka.ms/vscode-workspace-trust), щоб дізнатися більше.

# openLooseFileWindowDetails
source: You are trying to open untrusted files in a window which is trusted.
uk: Ви намагаєтеся відкрити неперевірені файли у вікні, яке є довіреним.

# openLooseFileWindowMesssage
source: Do you want to allow untrusted files in this window?
uk: Ви хочете дозволити ненадійні файли в цьому вікні?

# openLooseFileWorkspaceCheckbox
source: Remember my decision for all workspaces
uk: Запам'ятати моє рішення для всіх робочих просторів

# openLooseFileWorkspaceDetails
source: You are trying to open untrusted files in a workspace which is trusted.
uk: Ви намагаєтеся відкрити неперевірені файли в робочому просторі, який є надійним.

# openLooseFileWorkspaceMesssage
source: Do you want to allow untrusted files in this workspace?
uk: Ви хочете дозволити неперевірені файли в цьому робочому просторі?

# restrictedModeBannerAriaLabelFolder
source: Restricted Mode is intended for safe code browsing. Trust this folder to enable all features. Use navigation keys to access banner actions.
uk: Режим обмеженого доступу призначений для безпечного перегляду коду. Довірте цю папку, щоб увімкнути всі функції. Використовуйте клавіші навігації для доступу до дій банера.

# restrictedModeBannerAriaLabelWindow
source: Restricted Mode is intended for safe code browsing. Trust this window to enable all features. Use navigation keys to access banner actions.
uk: Обмежений режим призначений для безпечного перегляду коду. Довірте цьому вікну, щоб активувати всі функції. Використовуйте навігаційні клавіші для доступу до дій банера.

# restrictedModeBannerAriaLabelWorkspace
source: Restricted Mode is intended for safe code browsing. Trust this workspace to enable all features. Use navigation keys to access banner actions.
uk: Обмежений режим призначений для безпечного перегляду коду. Довірте цьому робочому простору, щоб увімкнути всі функції. Використовуйте клавіші навігації для доступу до дій банера.

# restrictedModeBannerLearnMore
source: Learn More
uk: Дізнатися більше

# restrictedModeBannerManage
source: Manage
uk: Керувати

# restrictedModeBannerMessageFolder
source: Restricted Mode is intended for safe code browsing. Trust this folder to enable all features.
uk: Обмежений режим призначений для безпечного перегляду коду. Довірте цю папку, щоб увімкнути всі функції.

# restrictedModeBannerMessageWindow
source: Restricted Mode is intended for safe code browsing. Trust this window to enable all features.
uk: Обмежений режим призначений для безпечного перегляду коду. Довірте цьому вікну, щоб увімкнути всі функції.

# restrictedModeBannerMessageWorkspace
source: Restricted Mode is intended for safe code browsing. Trust this workspace to enable all features.
uk: Обмежений режим призначений для безпечного перегляду коду. Довірте цьому робочому простору, щоб увімкнути всі функції.

# startupTrustRequestLearnMore
source: If you don't trust the authors of these files, we recommend to continue in restricted mode as the files may be malicious. See [our docs](https://aka.ms/vscode-workspace-trust) to learn more.
uk: Якщо ви не довіряєте авторам цих файлів, ми рекомендуємо продовжити в обмеженому режимі, оскільки файли можуть бути шкідливими. Дивіться [наші документи](https://aka.ms/vscode-workspace-trust), щоб дізнатися більше.

# status.WorkspaceTrust
source: Workspace Trust
uk: Довіра до робочого простору

# status.ariaUntrustedFolder
source: Restricted Mode: Some features are disabled because this folder is not trusted.
uk: Обмежений режим: Деякі функції вимкнені, оскільки ця папка не є надійною.

# status.ariaUntrustedWindow
source: Restricted Mode: Some features are disabled because this window is not trusted.
uk: Обмежений режим: Деякі функції вимкнені, оскільки це вікно не є надійним.

# status.ariaUntrustedWorkspace
source: Restricted Mode: Some features are disabled because this workspace is not trusted.
uk: Обмежений режим: Деякі функції вимкнені, оскільки цей робочий простір не є надійним.

# status.tooltipUntrustedFolder2
source: Running in Restricted Mode Some [features are disabled]({0}) because this [folder is not trusted]({1}).
uk: Запуск у обмеженому режимі Деякі [функції вимкнені]({0}), оскільки ця [папка не є надійною]({1}).

# status.tooltipUntrustedWindow2
source: Running in Restricted Mode Some [features are disabled]({0}) because this [window is not trusted]({1}).
uk: Запуск у обмеженому режимі Деякі [функції вимкнено]({0}), оскільки це [вікно не є надійним]({1}).

# status.tooltipUntrustedWorkspace2
source: Running in Restricted Mode Some [features are disabled]({0}) because this [workspace is not trusted]({1}).
uk: Запуск у обмеженому режимі Деякі [функції вимкнено]({0}), оскільки цей [робочий простір не є надійним]({1}).

# trustFolderOptionDescription
source: Trust folder and enable all features
uk: Довірити папку та увімкнути всі функції

# trustOption
source: &&Yes, I trust the authors
uk: &&Так, я довіряю авторам

# trustWorkspaceOptionDescription
source: Trust workspace and enable all features
uk: Довірте робочому простору та увімкніть усі функції

# untrusted
source: Restricted Mode
uk: Обмежений режим

# workspace.trust.banner.always
source: Show the banner every time an untrusted workspace is open.
uk: Показувати банер щоразу, коли відкрито ненадійне робоче середовище.

# workspace.trust.banner.description
source: Controls when the restricted mode banner is shown.
uk: Контролює, коли показується банер обмеженого режиму.

# workspace.trust.banner.never
source: Do not show the banner when an untrusted workspace is open.
uk: Не показувати банер, коли відкрито ненадійне робоче середовище.

# workspace.trust.banner.untilDismissed
source: Show the banner when an untrusted workspace is opened until dismissed.
uk: Показати банер, коли відкрито ненадійне робоче місце, поки не буде закрито.

# workspace.trust.description
source: Controls whether or not Workspace Trust is enabled within VS Code.
uk: Контролює, чи ввімкнено довіру до робочого простору у VS Code.

# workspace.trust.emptyWindow.description
source: Controls whether or not the empty window is trusted by default within VS Code. When used with `#{0}#`, you can enable the full functionality of VS Code without prompting in an empty window.
uk: Контролює, чи вважається порожнє вікно довіреним за замовчуванням у VS Code. Коли використовується з `#{0}#`, ви можете активувати повну функціональність VS Code без запитів у порожньому вікні.

# workspace.trust.startupPrompt.always
source: Ask for trust every time an untrusted workspace is opened.
uk: Запитуйте довіру щоразу, коли відкривається ненадійне робоче середовище.

# workspace.trust.startupPrompt.description
source: Controls when the startup prompt to trust a workspace is shown.
uk: Контролює, коли показується запит на довіру до робочого простору під час запуску.

# workspace.trust.startupPrompt.never
source: Do not ask for trust when an untrusted workspace is opened.
uk: Не просіть довіри, коли відкрито ненадійне робоче середовище.

# workspace.trust.startupPrompt.once
source: Ask for trust the first time an untrusted workspace is opened.
uk: Запитуйте довіру при першому відкритті ненадійного робочого простору.

# workspace.trust.untrustedFiles.description
source: Controls how to handle opening untrusted files in a trusted workspace. This setting also applies to opening files in an empty window which is trusted via `#{0}#`.
uk: Контролює, як обробляти відкриття ненадійних файлів у надійному робочому просторі. Ця настройка також застосовується до відкриття файлів у порожньому вікні, яке є надійним через `#{0}#`.

# workspace.trust.untrustedFiles.newWindow
source: Always open untrusted files in a separate window in restricted mode without prompting.
uk: Завжди відкривайте ненадійні файли в окремому вікні в обмеженому режимі без запиту.

# workspace.trust.untrustedFiles.open
source: Always allow untrusted files to be introduced to a trusted workspace without prompting.
uk: Завжди дозволяйте ненадійним файлам бути введеними в надійне робоче середовище без запиту.

# workspace.trust.untrustedFiles.prompt
source: Ask how to handle untrusted files for each workspace. Once untrusted files are introduced to a trusted workspace, you will not be prompted again.
uk: Запитайте, як обробляти ненадійні файли для кожного робочого простору. Як тільки ненадійні файли будуть введені в надійний робочий простір, ви більше не отримаєте запит.

# workspaceStartupTrustDetails
source: {0} provides features that may automatically execute files in this workspace.
uk: {0} надає функції, які можуть автоматично виконувати файли в цьому робочому просторі.

# workspaceTrust
source: Do you trust the authors of the files in this workspace?
uk: Чи довіряєте ви авторам файлів у цьому робочому просторі?

source: Workspace Trust Editor
uk: Редактор довіри робочого простору

# workspacesCategory
source: Workspaces
uk: Робочі простори

# addButton
source: Add Folder
uk: Додати папку

# checkListIcon
source: Icon for the checkmark in the workspace trust editor.
uk: Іконка для галочки в редакторі довіри робочого простору.

# deleteTrustedUri
source: Delete Path
uk: Видалити шлях

# dontTrustButton
source: Don't Trust
uk: Не довіряйте

# editIcon
source: Icon for the edit folder icon in the workspace trust editor.
uk: Іконка для іконки редагування папки в редакторі довіри робочого простору.

# editTrustedUri
source: Edit Path
uk: Редагувати шлях

# folderPickerIcon
source: Icon for the pick folder icon in the workspace trust editor.
uk: Іконка для іконки вибору папки в редакторі довіри робочого простору.

# hostColumnLabel
source: Host
uk: Хост

# invalidTrust
source: You cannot trust individual folders within a repository.
uk: Ви не можете довіряти окремим папкам у репозиторії.

# keyboardShortcut
source: Keyboard Shortcut: {0}
uk: Комбінація клавіш: {0}

# localAuthority
source: Local
uk: Локальний

# no untrustedSettings
source: Workspace settings requiring trust are not applied
uk: Налаштування робочого простору, що вимагають довіри, не застосовуються.

# noTrustedFoldersDescriptions
source: You haven't trusted any folders or workspace files yet.
uk: Ви ще не довіряли жодним папкам або файлам робочого простору.

# pathColumnLabel
source: Path
uk: Шлях

# pickerTrustedUri
source: Open File Picker
uk: Відкрити вибір файлу

# removeIcon
source: Icon for the remove folder icon in the workspace trust editor.
uk: Іконка для видалення папки в редакторі довіри робочої області.

# root element label
source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# selectTrustedUri
source: Select Folder To Trust
uk: Виберіть папку для довіри

# shieldIcon
source: Icon for workspace trust ion the banner.
uk: Іконка для довіри до робочого простору в банері.

# trustAll
source: You will trust all repositories on {0}.
uk: Ви довірятимете всім репозиторіям на {0}.

# trustButton
source: Trust
uk: Довіра

# trustMessage
source: Trust the authors of all files in the current folder or its parent '{0}'.
uk: Довіряйте авторам усіх файлів у поточній папці або її батьківській '{0}'.

# trustOrg
source: You will trust all repositories and forks under '{0}' on {1}.
uk: Ви довірятимете всім репозиторіям та форкам під '{0}' на {1}.

# trustParentButton
source: Trust Parent
uk: Довіртеся батькам

# trustUri
source: Trust Folder
uk: Довірена папка

# trustedDebugging
source: Debugging is enabled
uk: Налагодження увімкнено

# trustedDescription
source: All features are enabled because trust has been granted to the workspace.
uk: Усі функції активовані, оскільки довіра була надана робочому простору.

# trustedExtensions
source: All enabled extensions are activated
uk: Усі увімкнені розширення активовані

# trustedFolder
source: In a Trusted Folder
uk: У надійній папці

# trustedFolderAriaLabel
source: {0}, trusted
uk: {0}, надійний

# trustedFolderSubtitle
source: You trust the authors of the files in the current folder. All features are enabled:
uk: Ви довіряєте авторам файлів у поточній папці. Усі функції увімкнено:

# trustedFolderWithHostAriaLabel
source: {0} on {1}, trusted
uk: {0} на {1}, надійний

# trustedFoldersAndWorkspaces
source: Trusted Folders & Workspaces
uk: Довірені папки та робочі простори

# trustedFoldersDescription
source: You trust the following folders, their subfolders, and workspace files.
uk: Ви довіряєте наступним папкам, їх підпапкам та файлам робочого простору.

# trustedForcedReason
source: This window is trusted by nature of the workspace that is opened.
uk: Це вікно є довіреним завдяки природі відкритого робочого простору.

# trustedHeaderFolder
source: You trust this folder
uk: Ви довіряєте цій папці

# trustedHeaderWindow
source: You trust this window
uk: Ви довіряєте цьому вікну

# trustedHeaderWorkspace
source: You trust this workspace
uk: Ви довіряєте цьому робочому простору.

# trustedSettings
source: All workspace settings are applied
uk: Усі налаштування робочого простору застосовані.

# trustedTasks
source: Tasks are allowed to run
uk: Завдання можуть виконуватися

# trustedUnsettableWindow
source: This window is trusted
uk: Це вікно є надійним

# trustedWindow
source: In a Trusted Window
uk: У надійному вікні

# trustedWindowSubtitle
source: You trust the authors of the files in the current window. All features are enabled:
uk: Ви довіряєте авторам файлів у поточному вікні. Усі функції увімкнені:

# trustedWorkspace
source: In a Trusted Workspace
uk: У надійному робочому середовищі

# trustedWorkspaceSubtitle
source: You trust the authors of the files in the current workspace. All features are enabled:
uk: Ви довіряєте авторам файлів у поточному робочому просторі. Усі функції увімкнені:

# untrustedDebugging
source: Debugging is disabled
uk: Відладка вимкнена

# untrustedDescription
source: {0} is in a restricted mode intended for safe code browsing.
uk: {0} знаходиться в обмеженому режимі, призначеному для безпечного перегляду коду.

# untrustedExtensions
source: [{0} extensions]({1}) are disabled or have limited functionality
uk: [{0} розширення]({1}) вимкнені або мають обмежену функціональність

# untrustedFolderReason
source: This folder is trusted via the bolded entries in the trusted folders below.
uk: Ця папка є довіреною завдяки виділеним жирним шрифтом записам у довірених папках нижче.

# untrustedFolderSubtitle
source: You do not trust the authors of the files in the current folder. The following features are disabled:
uk: Ви не довіряєте авторам файлів у поточній папці. Наступні функції вимкнені:

# untrustedHeader
source: You are in Restricted Mode
uk: Ви в обмеженому режимі

# untrustedSettings
source: [{0} workspace settings]({1}) are not applied
uk: [{0} налаштування робочого простору]({1}) не застосовані

# untrustedTasks
source: Tasks are not allowed to run
uk: Завдання не можуть виконуватись.

# untrustedWindowSubtitle
source: You do not trust the authors of the files in the current window. The following features are disabled:
uk: Ви не довіряєте авторам файлів у поточному вікні. Наступні функції вимкнено:

# untrustedWorkspace
source: In Restricted Mode
uk: У обмеженому режимі

# untrustedWorkspaceReason
source: This workspace is trusted via the bolded entries in the trusted folders below.
uk: Цей робочий простір довіряється через виділені жирним шрифтом записи в довірених папках нижче.

# untrustedWorkspaceSubtitle
source: You do not trust the authors of the files in the current workspace. The following features are disabled:
uk: Ви не довіряєте авторам файлів у поточному робочому просторі. Наступні функції вимкнені:

# workspaceTrustEditorHeaderActions
source: [Configure your settings]({0}) or [learn more](https://aka.ms/vscode-workspace-trust).
uk: [Налаштуйте свої налаштування]({0}) або [дізнайтеся більше](https://aka.ms/vscode-workspace-trust).

# xListIcon
source: Icon for the cross in the workspace trust editor.
uk: Іконка для хреста в редакторі довіри робочого простору.

# workspaceTrustEnabledCtx
source: Whether the workspace trust feature is enabled.
uk: Чи увімкнено функцію довіри до робочого простору.

# workspaceTrustedCtx
source: Whether the current workspace has been trusted by the user.
uk: Чи довіряє користувач поточному робочому простору.
