Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_accessibility.xlf
Languages: uk

# accessibility.voice.autoSynthesize.off
source: Disable the feature.
uk: Вимкнути функцію.

# accessibility.voice.autoSynthesize.on
source: Enable the feature. When a screen reader is enabled, note that this will disable aria updates.
uk: Увімкніть функцію. Коли екранний зчитувач увімкнено, зверніть увагу, що це вимкне оновлення aria.

# accessibility.windowTitleOptimized
source: Controls whether the {0} should be optimized for screen readers when in screen reader mode. When enabled, the window title will have {1} appended to the end.
uk: Контролює, чи повинен {0} бути оптимізований для програм читання з екрану в режимі читання з екрану. Коли увімкнено, до заголовка вікна буде додано {1}.

# accessibilityConfigurationTitle
source: Accessibility
uk: Доступність

# announcement.enabled.auto
source: Enable announcement, will only play when in screen reader optimized mode.
uk: Увімкнути оголошення, буде відтворюватися лише в режимі оптимізації для екранного читача.

# announcement.enabled.off
source: Disable announcement.
uk: Вимкнути оголошення.

# autoSynthesize
source: Whether a textual response should automatically be read out aloud when speech was used as input. For example in a chat session, a response is automatically synthesized when voice was used as chat request.
uk: Чи повинна текстова відповідь автоматично читатися вголос, коли для введення використовувалася мова. Наприклад, у сеансі чату відповідь автоматично синтезується, коли голос використовувався як запит чату.

# dimUnfocusedEnabled
source: Whether to dim unfocused editors and terminals, which makes it more clear where typed input will go to. This works with the majority of editors with the notable exceptions of those that utilize iframes like notebooks and extension webview editors.
uk: Чи зменшити яскравість неактивних редакторів та терміналів, що робить більш зрозумілим, куди буде введено текст. Це працює з більшістю редакторів, за винятком тих, які використовують iframe, таких як блокноти та редактори веб-перегляду розширень.

# dimUnfocusedOpacity
source: The opacity fraction (0.2 to 1.0) to use for unfocused editors and terminals. This will only take effect when {0} is enabled.
uk: Фракція непрозорості (0.2 до 1.0), яку слід використовувати для нефокусованих редакторів і терміналів. Це набуде чинності лише тоді, коли {0} увімкнено.

# replEditor.autoFocusAppendedCell
source: Control whether focus should automatically be sent to the REPL when code is executed.
uk: Контролюйте, чи слід автоматично відправляти фокус на REPL, коли код виконується.

# sound.enabled.auto
source: Enable sound when a screen reader is attached.
uk: Увімкнути звук, коли підключено екранний зчитувач.

# sound.enabled.off
source: Disable sound.
uk: Вимкнути звук.

# sound.enabled.on
source: Enable sound.
uk: Увімкнути звук.

# speechLanguage.auto
source: Auto (Use Display Language)
uk: Авто (Використовувати мову відображення)

# terminal.integrated.accessibleView.closeOnKeyPress
source: On keypress, close the Accessible View and focus the element from which it was invoked.
uk: При натисканні клавіші закрийте Доступний перегляд і сфокусуйте елемент, з якого він був викликаний.

# verbosity.chat.description
source: Provide information about how to access the chat help menu when the chat input is focused.
uk: Надайте інформацію про те, як отримати доступ до меню допомоги чату, коли фокус знаходиться на введенні чату.

# verbosity.comments
source: Provide information about actions that can be taken in the comment widget or in a file which contains comments.
uk: Надайте інформацію про дії, які можна виконати у віджеті коментарів або у файлі, що містить коментарі.

# verbosity.debug
source: Provide information about how to access the debug console accessibility help dialog when the debug console or run and debug viewlet is focused. Note that a reload of the window is required for this to take effect.
uk: Надайте інформацію про те, як отримати доступ до діалогового вікна допомоги з доступності консолі налагодження, коли консоль налагодження або вид консолі запуску та налагодження зосереджені. Зверніть увагу, що для цього потрібно перезавантажити вікно.

# verbosity.diffEditor.description
source: Provide information about how to navigate changes in the diff editor when it is focused.
uk: Надайте інформацію про те, як орієнтуватися в змінах у редакторі відмінностей, коли він має фокус.

# verbosity.diffEditorActive
source: Indicate when a diff editor becomes the active editor.
uk: Вкажіть, коли редактор порівняння стає активним редактором.

# verbosity.emptyEditorHint
source: Provide information about relevant actions in an empty text editor.
uk: Надайте інформацію про відповідні дії в порожньому текстовому редакторі.

# verbosity.hover
source: Provide information about how to open the hover in an Accessible View.
uk: Надайте інформацію про те, як відкрити спливаюче вікно в Доступному вигляді.

# verbosity.inlineCompletions.description
source: Provide information about how to access the inline completions hover and Accessible View.
uk: Надайте інформацію про те, як отримати доступ до спливаючих підказок та Доступного вигляду.

# verbosity.interactiveEditor.description
source: Provide information about how to access the inline editor chat accessibility help menu and alert with hints that describe how to use the feature when the input is focused.
uk: Надайте інформацію про те, як отримати доступ до меню допомоги з доступності чату вбудованого редактора та сповіщення з підказками, які описують, як використовувати цю функцію, коли фокус знаходиться на введенні.

# verbosity.keybindingsEditor.description
source: Provide information about how to change a keybinding in the keybindings editor when a row is focused.
uk: Надайте інформацію про те, як змінити прив'язку клавіші в редакторі прив'язок клавіш, коли рядок є активним.

# verbosity.notebook
source: Provide information about how to focus the cell container or inner editor when a notebook cell is focused.
uk: Надайте інформацію про те, як зосередити контейнер комірки або внутрішній редактор, коли комірка нотатника має фокус.

# verbosity.notification
source: Provide information about how to open the notification in an Accessible View.
uk: Надайте інформацію про те, як відкрити сповіщення в доступному вигляді.

# verbosity.replEditor.description
source: Provide information about how to access the REPL editor accessibility help menu when the REPL editor is focused.
uk: Надайте інформацію про те, як отримати доступ до меню допомоги з доступності редактора REPL, коли редактор REPL має фокус.

# verbosity.scm
source: Provide information about how to access the source control accessibility help menu when the input is focused.
uk: Надайте інформацію про те, як отримати доступ до меню допомоги з доступності контролю версій, коли фокус знаходиться на введенні.

# verbosity.terminal.description
source: Provide information about how to access the terminal accessibility help menu when the terminal is focused.
uk: Надайте інформацію про те, як отримати доступ до меню допомоги з доступності терміналу, коли термінал має фокус.

# verbosity.walkthrough
source: Provide information about how to open the walkthrough in an Accessible View.
uk: Надайте інформацію про те, як відкрити посібник у доступному вигляді.

# voice.ignoreCodeBlocks
source: Whether to ignore code snippets in text-to-speech synthesis.
uk: Чи ігнорувати фрагменти коду в синтезі мовлення з тексту.

# voice.speechLanguage
source: The language that text-to-speech and speech-to-text should use. Select `auto` to use the configured display language if possible. Note that not all display languages maybe supported by speech recognition and synthesizers.
uk: Мова, яку повинні використовувати синтез мови та розпізнавання мови. Виберіть `auto`, щоб використовувати налаштовану мову відображення, якщо це можливо. Зверніть увагу, що не всі мови відображення можуть підтримуватися системами розпізнавання мови та синтезаторами.

# voice.speechTimeout
source: The duration in milliseconds that voice speech recognition remains active after you stop speaking. For example in a chat session, the transcribed text is submitted automatically after the timeout is met. Set to `0` to disable this feature.
uk: Тривалість у мілісекундах, протягом якої розпізнавання голосової мови залишається активним після того, як ви перестанете говорити. Наприклад, у чат-сесії транскрибований текст надсилається автоматично після закінчення тайм-ауту. Встановіть на `0`, щоб вимкнути цю функцію.

# screenReaderDetected
source: Screen Reader Optimized
uk: Оптимізовано для екранних рідерів

# screenReaderDetectedExplanation.answerLearnMore
source: Learn More
uk: Дізнатися більше

# screenReaderDetectedExplanation.answerNo
source: No
uk: Ні

# screenReaderDetectedExplanation.answerYes
source: Yes
uk: Так

# screenReaderDetectedExplanation.question
source: Screen reader usage detected. Do you want to enable {0} to optimize the editor for screen reader usage?
uk: Виявлено використання екранного читача. Чи бажаєте ви увімкнути {0}, щоб оптимізувати редактор для використання з екранним читачем?

# status.editor.screenReaderMode
source: Screen Reader Mode
uk: Режим читача екрану

source: Accessibility Help
uk: Допомога з доступністю

# accessibility-help-hint
source: Accessibility Help, {0}
uk: Допомога з доступністю, {0}

source: Accessible View
uk: Доступний перегляд

# accessible-view-hint
source: Accessible View, {0}
uk: Доступний перегляд, {0}

# accessibleHelpToolbar
source: Accessibility Help
uk: Допомога з доступністю

# accessibleViewNextPreviousHint
source: Show the next item{0} or previous item{1}.
uk: Показати наступний елемент{0} або попередній елемент{1}.

# accessibleViewSymbolQuickPickPlaceholder
source: Type to search symbols
uk: Введіть для пошуку символів

# accessibleViewSymbolQuickPickTitle
source: Go to Symbol Accessible View
uk: Перейти до доступного перегляду символів

# accessibleViewToolbar
source: Accessible View
uk: Доступний перегляд

# acessibleViewDisableHint
source: Disable accessibility verbosity for this feature{0}.
uk: Вимкніть детальність доступності для цієї функції{0}.

# acessibleViewHint
source: Inspect this in the accessible view with {0}
uk: Перегляньте це в доступному вигляді з {0}

# acessibleViewHintNoKbEither
source: Inspect this in the accessible view via the command Open Accessible View which is currently not triggerable via keybinding.
uk: Перегляньте це в доступному вигляді за допомогою команди Відкрити доступний вигляд, яка наразі не може бути активована за допомогою комбінації клавіш.

# ariaAccessibleViewActions
source: Explore actions such as disabling this hint (Shift+Tab).
uk: Досліджуйте дії, такі як вимкнення цього підказки (Shift+Tab).

# ariaAccessibleViewActionsBottom
source: Explore actions such as disabling this hint (Shift+Tab), use Escape to exit this dialog.
uk: Досліджуйте дії, такі як вимкнення цього підказки (Shift+Tab), використовуйте Escape для виходу з цього діалогу.

# configureKb
source: Configure keybindings for commands that lack them {0}.
uk: Налаштуйте комбінації клавіш для команд, яким їх бракує {0}.

# configureKbAssigned
source: Configure keybindings for commands that already have assignments {0}.
uk: Налаштуйте комбінації клавіш для команд, які вже мають призначення {0}.

# disableAccessibilityHelp
source: {0} accessibility verbosity is now disabled
uk: {0} доступність детальної інформації тепер вимкнена

# exit
source: Exit this dialog (Escape).
uk: Вийти з цього діалогу (Escape).

# goToSymbolHint
source: Go to a symbol{0}.
uk: Перейдіть до символу{0}.

# insertAtCursor
source: - Insert the code block at the cursor{0}.
uk: - Вставте блок коду в курсор{0}.

# insertIntoNewFile
source: - Insert the code block into a new file{0}.
uk: - Вставте кодовий блок у новий файл{0}.

# intro
source: In the accessible view, you can:
uk: У доступному вигляді ви можете:

# keybindings
source: Configure keybindings
uk: Налаштувати комбінації клавіш

# openDoc
source: Open a browser window with more information related to accessibility{0}.
uk: Відкрийте вікно браузера з додатковою інформацією, пов'язаною з доступністю{0}.

# runInTerminal
source: - Run the code block in the terminal{0}.
uk: - Запустіть блок коду в терміналі{0}.

# selectKeybinding
source: Select a command ID to configure a keybinding for it
uk: Виберіть ID команди, щоб налаштувати для неї прив'язку клавіші

# toolbar
source: Navigate to the toolbar (Shift+Tab).
uk: Перейдіть до панелі інструментів (Shift+Tab).

# editor.action.accessibilityHelp
source: Open Accessibility Help
uk: Відкрити допомогу з доступності

# editor.action.accessibilityHelpConfigureAssignedKeybindings
source: Accessibility Help Configure Assigned Keybindings
uk: Допомога з доступністю Налаштувати призначені комбінації клавіш

# editor.action.accessibilityHelpConfigureUnassignedKeybindings
source: Accessibility Help Configure Unassigned Keybindings
uk: Допомога з доступністю Налаштувати не призначені комбінації клавіш

# editor.action.accessibilityHelpOpenHelpLink
source: Accessibility Help Open Help Link
uk: Допомога з доступністю Відкрити посилання на допомогу

# editor.action.accessibleView
source: Open Accessible View
uk: Відкрити доступний перегляд

# editor.action.accessibleViewAcceptInlineCompletionAction
source: Accept Inline Completion
uk: Прийняти вбудоване завершення

# editor.action.accessibleViewDisableHint
source: Disable Accessible View Hint
uk: Вимкнути підказку доступного перегляду

# editor.action.accessibleViewGoToSymbol
source: Go To Symbol in Accessible View
uk: Перейти до символу в доступному вигляді

# editor.action.accessibleViewNext
source: Show Next in Accessible View
uk: Показати Наступне в Доступному Перегляді

# editor.action.accessibleViewNextCodeBlock
source: Accessible View: Next Code Block
uk: Доступний вигляд: Наступний кодовий блок

# editor.action.accessibleViewPrevious
source: Show Previous in Accessible View
uk: Показати попереднє в доступному вигляді

# editor.action.accessibleViewPreviousCodeBlock
source: Accessible View: Previous Code Block
uk: Доступний вигляд: Попередній блок коду
