Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminalContrib.xlf
Languages: uk

# autoApprove.description.examples.regexGit
source: Allow {0} and all commands starting with {1}
uk: Дозволити {0} та всі команди, що починаються з {1}

# autoApprove.description.examples.rm
source: Require explicit approval for all commands starting with {0}
uk: Вимагайте явного схвалення для всіх команд, що починаються з {0}

# autoApprove.description.examples.rmUnset
source: Unset the default {0} value for {1}
uk: Скинути значення за замовчуванням {0} для {1}

# autoApprove.description.examples.title
source: Examples:
uk: Приклади:

# autoApprove.description.examples.value
source: Value
uk: Значення

# autoApprove.description.intro
source: A list of commands or regular expressions that control whether the run in terminal tool commands require explicit approval. These will be matched against the start of a command. A regular expression can be provided by wrapping the string in {0} characters followed by optional flags such as {1} for case-insensitivity.
uk: Список команд або регулярних виразів, які контролюють, чи потребують команди інструменту запуску в терміналі явного схвалення. Вони будуть співвіднесені з початком команди. Регулярний вираз можна надати, обгорнувши рядок у символи {0}, за якими можуть слідувати необов'язкові прапорці, такі як {1} для нечутливості до регістру.

# autoApprove.description.subCommands
source: Note that these commands and regular expressions are evaluated for every _sub-command_ within the full _command line_, so {0} for example will need both {1} and {2} to match a {3} entry and must not match a {4} entry in order to auto approve. Inline commands such as {5} (command sustitution) or {6} (process substitution) are currently blocked by default via broad rules that detect these patterns.
uk: Зверніть увагу, що ці команди та регулярні вирази оцінюються для кожного _підкоманди_ в межах повної _командного рядка_, тому {0}, наприклад, потребуватиме як {1}, так і {2} для відповідності запису {3} і не повинно відповідати запису {4}, щоб автоматично затвердити. Вбудовані команди, такі як {5} (заміна команди) або {6} (заміна процесу), наразі заблоковані за замовчуванням через загальні правила, які виявляють ці шаблони.

# autoApprove.description.values
source: Set to {0} to automatically approve commands, {1} to always require explicit approval or {2} to unset the value.
uk: Встановіть {0} для автоматичного схвалення команд, {1} для завжди вимагати явного схвалення або {2} для скидання значення.

# autoApprove.false
source: Require explicit approval for the pattern.
uk: Вимагайте явного затвердження для шаблону.

# autoApprove.key
source: The start of a command to match against. A regular expression can be provided by wrapping the string in `/` characters.
uk: Початок команди для порівняння. Регулярний вираз можна надати, обгорнувши рядок у символи `/`.

# autoApprove.matchCommandLine
source: Whether to match against the full command line, as opposed to splitting by sub-commands and inline commands.
uk: Чи потрібно порівнювати з повною командною строкою, а не розділяти на підкоманди та вбудовані команди.

# autoApprove.matchCommandLine.false
source: Match against sub-commands and inline commands, eg. `foo && bar` will need both `foo` and `bar` to match.
uk: Порівняйте з підкомандами та вбудованими командами, наприклад, `foo && bar` вимагатиме, щоб обидва `foo` і `bar` відповідали.

# autoApprove.matchCommandLine.true
source: Match against the full command line, eg. `foo && bar`.
uk: Порівняти з повною командною рядком, наприклад, `foo && bar`.

# autoApprove.null
source: Ignore the pattern, this is useful for unsetting the same pattern set at a higher scope.
uk: Ігноруйте шаблон, це корисно для скасування того ж шаблону, встановленого на більш високому рівні.

# autoApprove.true
source: Automatically approve the pattern.
uk: Автоматично затвердити шаблон.

# autoReplyToPrompts.key
source: Whether to automatically respond to prompts in the terminal such as `Confirm? y/n`. This is an experimental feature and may not work in all scenarios.
uk: Чи автоматично відповідати на запити в терміналі, такі як `Confirm? y/n`. Це експериментальна функція і може не працювати в усіх сценаріях.

# shellIntegrationTimeout.description
source: Configures the duration in milliseconds to wait for shell integration to be detected when the run in terminal tool launches a new terminal. Set to `0` to wait the minimum time, the default value `-1` means the wait time is variable based on the value of {0} and whether it's a remote window. A large value can be useful if your shell starts very slowly and a low value if you're intentionally not using shell integration.
uk: Налаштовує тривалість у мілісекундах, протягом якої потрібно чекати на виявлення інтеграції оболонки, коли інструмент запуску в терміналі відкриває новий термінал. Встановіть `0`, щоб чекати мінімальний час, значення за замовчуванням `-1` означає, що час очікування змінюється в залежності від значення {0} і того, чи це віддалене вікно. Велике значення може бути корисним, якщо ваша оболонка запускається дуже повільно, а низьке значення, якщо ви навмисно не використовуєте інтеграцію оболонки.

# terminalChatAgentProfile.linux
source: The terminal profile to use on Linux for chat agent's run in terminal tool.
uk: Профіль терміналу, який слід використовувати на Linux для запуску агента чату в інструменті терміналу.

# terminalChatAgentProfile.osx
source: The terminal profile to use on macOS for chat agent's run in terminal tool.
uk: Профіль терміналу, який слід використовувати на macOS для запуску агента чату в інструменті терміналу.

# terminalChatAgentProfile.path
source: A path to a shell executable.
uk: Шлях до виконуваного файлу оболонки.

# terminalChatAgentProfile.windows
source: The terminal profile to use on Windows for chat agent's run in terminal tool.
uk: Профіль терміналу, який слід використовувати на Windows для запуску агента чату в інструменті терміналу.

# workbench.action.terminal.copyAndClearSelection
source: Copy and Clear Selection
uk: Копіювати та очистити вибір

# workbench.action.terminal.copyLastCommand
source: Copy Last Command
uk: Скопіювати останню команду

# workbench.action.terminal.copyLastCommandAndOutput
source: Copy Last Command and Output
uk: Скопіювати останню команду та вихід

# workbench.action.terminal.copyLastCommandOutput
source: Copy Last Command Output
uk: Скопіювати вихід останньої команди

# workbench.action.terminal.copySelection
source: Copy Selection
uk: Копіювати вибір

# workbench.action.terminal.copySelectionAsHtml
source: Copy Selection as HTML
uk: Копіювати вибране як HTML

# workbench.action.terminal.paste
source: Paste into Active Terminal
uk: Вставити в активний термінал

# workbench.action.terminal.pasteSelection
source: Paste Selection into Active Terminal
uk: Вставити вибране в активний термінал

# confirmMoveTrashMessageFilesAndDirectories
source: Are you sure you want to paste {0} lines of text into the terminal?
uk: Ви впевнені, що хочете вставити {0} рядків тексту в термінал?

# doNotAskAgain
source: Do not ask me again
uk: Не питай мене знову.

# multiLinePasteButton
source: &&Paste
uk: &&Вставити

# multiLinePasteButton.oneLine
source: Paste as &&one line
uk: Вставити як &&один рядок

source: Preview:
uk: Попередній перегляд:

# terminalCommandGuide.foreground
source: The foreground color of the terminal command guide that appears to the left of a command and its output on hover.
uk: Колір переднього плану довідника команд терміналу, який з'являється ліворуч від команди та її виходу при наведенні.

# showCommandGuide
source: Whether to show the command guide when hovering over a command in the terminal.
uk: Чи показувати довідку команди при наведенні курсора на команду в терміналі.

# workbench.action.terminal.recordSession
source: Record Terminal Session
uk: Записати сеанс терміналу

# workbench.action.terminal.recordSession.recording
source: Recording terminal session...
uk: Запис сеансу терміналу...

# workbench.action.terminal.restartPtyHost
source: Restart Pty Host
uk: Перезапустити Pty Host

# workbench.action.terminal.showTextureAtlas
source: Show Terminal Texture Atlas
uk: Показати текстурний атлас терміналу

# workbench.action.terminal.writeDataToTerminal
source: Write Data to Terminal
uk: Записати дані в термінал

# workbench.action.terminal.writeDataToTerminal.prompt
source: Enter data to write directly to the terminal, bypassing the pty
uk: Введіть дані для прямого запису в термінал, обминаючи pty.

# ScopedEnvironmentContributionInfo
source: workspace
uk: робоча область

# envChanges
source: Terminal Environment Changes
uk: Зміни середовища терміналу

# extension
source: Extension: {0}
uk: Розширення: {0}

# workbench.action.terminal.showEnvironmentContributions
source: Show Environment Contributions
uk: Показати внески в середовище

# workbench.action.terminal.findNext
source: Find Next
uk: Знайти далі

# workbench.action.terminal.findPrevious
source: Find Previous
uk: Знайти попереднє

# workbench.action.terminal.focusFind
source: Focus Find
uk: Зосередити пошук

# workbench.action.terminal.hideFind
source: Hide Find
uk: Сховати Знайти

# workbench.action.terminal.searchWorkspace
source: Search Workspace
uk: Пошук робочого простору

# workbench.action.terminal.toggleFindCaseSensitive
source: Toggle Find Using Case Sensitive
uk: Перемикати пошук з урахуванням регістру

# workbench.action.terminal.toggleFindRegex
source: Toggle Find Using Regex
uk: Перемикати пошук за допомогою Regex

# workbench.action.terminal.toggleFindWholeWord
source: Toggle Find Using Whole Word
uk: Перемикати пошук за допомогою цілого слова

# goToRecentDirectory.metadata
source: Goes to a recent folder
uk: Перейти до нещодавньої папки

# workbench.action.terminal.clearPreviousSessionHistory
source: Clear Previous Session History
uk: Очистити історію попередньої сесії

# workbench.action.terminal.goToRecentDirectory
source: Go to Recent Directory...
uk: Перейти до останньої директорії...

# workbench.action.terminal.runRecentCommand
source: Run Recent Command...
uk: Виконати останню команду...

# openShellHistoryFile
source: Open File
uk: Відкрити файл

# removeCommand
source: Remove from Command History
uk: Видалити з історії команд

# selectRecentCommand
source: Select a command to run (hold Alt-key to edit the command)
uk: Виберіть команду для виконання (утримуйте клавішу Alt, щоб редагувати команду)

# selectRecentCommandMac
source: Select a command to run (hold Option-key to edit the command)
uk: Виберіть команду для виконання (утримуйте клавішу Option, щоб редагувати команду)

# selectRecentDirectory
source: Select a directory to go to (hold Alt-key to edit the command)
uk: Виберіть каталог, щоб перейти до нього (утримуйте клавішу Alt, щоб редагувати команду)

# selectRecentDirectoryMac
source: Select a directory to go to (hold Option-key to edit the command)
uk: Виберіть каталог, щоб перейти до нього (утримуйте клавішу Option, щоб редагувати команду)

# shellFileHistoryCategory
source: {0} history
uk: {0} історія

source: View Command Output
uk: Переглянути вихідні дані команди

# terminal.integrated.shellIntegration.history
source: Controls the number of recently used commands to keep in the terminal command history. Set to 0 to disable terminal command history.
uk: Контролює кількість нещодавно використаних команд, які зберігатимуться в історії команд терміналу. Встановіть 0, щоб вимкнути історію команд терміналу.

# workbench.action.terminal.openDetectedLink
source: Open Detected Link...
uk: Відкрити виявлене посилання...

# workbench.action.terminal.openLastLocalFileLink
source: Open Last Local File Link
uk: Відкрити останнє локальне посилання на файл

# workbench.action.terminal.openLastUrlLink
source: Open Last URL Link
uk: Відкрити останнє URL посилання

# workbench.action.terminal.openLastUrlLink.description
source: Opens the last detected URL/URI link in the terminal
uk: Відкриває останнє виявлене посилання URL/URI в терміналі

# focusFolder
source: Focus folder in explorer
uk: Сфокусувати папку в провіднику

source: Follow link
uk: Слідуйте за посиланням

# openFile
source: Open file in editor
uk: Відкрити файл в редакторі

# openFolder
source: Open folder in new window
uk: Відкрити папку в новому вікні

source: Search workspace
uk: Пошук робочого простору

# allow
source: Allow {0}
uk: Дозволити {0}

# followForwardedLink
source: Follow link using forwarded port
uk: Слідкуйте за посиланням, використовуючи переадресований порт

# followLinkUrl
source: Link
uk: Посилання

# scheme
source: Opening URIs can be insecure, do you want to allow opening links with the scheme {0}?
uk: Відкриття URI може бути небезпечним, чи хочете ви дозволити відкриття посилань зі схемою {0}?

# terminalLinkHandler.followLinkAlt
source: alt + click
uk: alt + клік

# terminalLinkHandler.followLinkCmd
source: cmd + click
uk: cmd + клік

# terminal.integrated.localFileLinks
source: File
uk: Файл

# terminal.integrated.localFolderLinks
source: Folder
uk: Папка

# terminal.integrated.openDetectedLink
source: Select the link to open, type to filter all links
uk: Виберіть посилання для відкриття, введіть для фільтрації всіх посилань

# terminal.integrated.searchLinks
source: Workspace Search
uk: Пошук у робочому просторі

# quickAccessTerminal
source: Switch Active Terminal
uk: Перемкнути активний термінал

# tasksQuickAccessHelp
source: Show All Opened Terminals
uk: Показати всі відкриті термінали

# tasksQuickAccessPlaceholder
source: Type the name of a terminal to open.
uk: Введіть назву терміналу для відкриття.

source: Rename Terminal
uk: Перейменувати термінал

# workbench.action.terminal.newWithProfilePlus
source: Create New Terminal With Profile...
uk: Створити новий термінал з профілем...

# workbench.action.terminal.newplus
source: Create New Terminal
uk: Створити новий термінал

# codeAction.widget.id.quickfix
source: Quick Fix
uk: Швидке виправлення

# quickFix.command
source: Run: {0}
uk: Запустити: {0}

# quickFix.opener
source: Open: {0}
uk: Відкрито: {0}

# workbench.action.terminal.showQuickFixes
source: Show Terminal Quick Fixes
uk: Показати швидкі виправлення терміналу

# terminal.createPR
source: Create PR {0}
uk: Створити PR {0}

# terminal.freePort
source: Free port {0}
uk: Безкоштовний порт {0}

# vscode.extension.contributes.terminalQuickFixes
source: Contributes terminal quick fixes.
uk: Сприяє швидким виправленням терміналу.

# vscode.extension.contributes.terminalQuickFixes.commandExitResult
source: The command exit result to match on
uk: Команда exit result для співпадіння з

# vscode.extension.contributes.terminalQuickFixes.commandLineMatcher
source: A regular expression or string to test the command line against
uk: Регулярний вираз або рядок для перевірки командного рядка

# vscode.extension.contributes.terminalQuickFixes.id
source: The ID of the quick fix provider
uk: ID постачальника швидкого виправлення

# vscode.extension.contributes.terminalQuickFixes.kind
source: The kind of the resulting quick fix. This changes how the quick fix is presented. Defaults to {0}.
uk: Тип отриманого швидкого виправлення. Це змінює спосіб подання швидкого виправлення. За замовчуванням {0}.

# vscode.extension.contributes.terminalQuickFixes.outputMatcher
source: A regular expression or string to match a single line of the output against, which provides groups to be referenced in terminalCommand and uri. For example: `lineMatcher: /git push --set-upstream origin (?<branchName>[^s]+)/;` `terminalCommand: 'git push --set-upstream origin ${group:branchName}';`
uk: Регулярний вираз або рядок для порівняння з одною лінією виходу, який надає групи для посилання в terminalCommand та uri. Наприклад: `lineMatcher: /git push --set-upstream origin (?<branchName>[^s]+)/;` `terminalCommand: 'git push --set-upstream origin ${group:branchName}';`

source: Send Sequence
uk: Відправити послідовність

# sendSequence.text.desc
source: The sequence of text to send to the terminal
uk: Послідовність тексту для відправки на термінал

# workbench.action.terminal.sendSequence.prompt
source: Enter sequence to send to the terminal
uk: Введіть послідовність для відправлення на термінал

# SIGCONT
source: Continue process
uk: Продовжити процес

# SIGHUP
source: Hangup
uk: Підвісити

# SIGINT
source: Interrupt process (Ctrl+C)
uk: Перервати процес (Ctrl+C)

# SIGKILL
source: Force kill process
uk: Примусове завершення процесу

# SIGQUIT
source: Quit process
uk: Припинити процес

# SIGSTOP
source: Stop process
uk: Зупинити процес

# SIGTERM
source: Terminate process gracefully
uk: Коректно завершити процес

# SIGUSR1
source: User-defined signal 1
uk: Користувацький сигнал 1

# SIGUSR2
source: User-defined signal 2
uk: Користувацький сигнал 2

# enterSignal
source: Enter signal name (e.g., SIGTERM, SIGKILL)
uk: Введіть ім'я сигналу (наприклад, SIGTERM, SIGKILL)

# manualSignal
source: Manually enter signal
uk: Введіть сигнал вручну

# selectSignal
source: Select signal to send to terminal process
uk: Виберіть сигнал для відправки до процесу терміналу

source: Send Signal
uk: Надіслати сигнал

# sendSignal.signal.desc
source: The signal to send to the terminal process (e.g., 'SIGTERM', 'SIGINT', 'SIGKILL')
uk: Сигнал, який потрібно надіслати процесу терміналу (наприклад, 'SIGTERM', 'SIGINT', 'SIGKILL')

# miStickyScroll
source: &&Sticky Scroll
uk: &&Липке прокручування

source: Sticky Scroll
uk: Липке прокручування

# workbench.action.terminal.toggleStickyScroll
source: Toggle Sticky Scroll
uk: Переключити фіксовану прокрутку

# terminalStickyScroll.background
source: The background color of the sticky scroll overlay in the terminal.
uk: Колір фону липкого скролл-оверлею в терміналі.

# terminalStickyScroll.border
source: The border of the sticky scroll overlay in the terminal.
uk: Границя налиплого прокрутки накладки в терміналі.

# terminalStickyScrollHover.background
source: The background color of the sticky scroll overlay in the terminal when hovered.
uk: Колір фону липкого скролл-оверлею в терміналі при наведенні.

# stickyScrollHoverTitle
source: Navigate to Command
uk: Перейдіть до Команди

# stickyScroll.enabled
source: Shows the current command at the top of the terminal. This feature requires [shell integration]({0}) to be activated. See {1}.
uk: Показує поточну команду вгорі терміналу. Ця функція вимагає активації [інтеграції оболонки]({0}). Дивіться {1}.

# stickyScroll.maxLineCount
source: Defines the maximum number of sticky lines to show. Sticky scroll lines will never exceed 40% of the viewport regardless of this setting.
uk: Визначає максимальну кількість закріплених рядків для відображення. Закріплені рядки прокрутки ніколи не перевищать 40% від області перегляду, незалежно від цього налаштування.

# workbench.action.terminal.acceptSelectedSuggestion
source: Insert
uk: Вставити

# workbench.action.terminal.acceptSelectedSuggestionEnter
source: Accept Selected Suggestion (Enter)
uk: Прийняти вибране припущення (Enter)

# workbench.action.terminal.configureSuggestSettings
source: Configure
uk: Налаштувати

# workbench.action.terminal.hideSuggestWidget
source: Hide Suggest Widget
uk: Сховати віджет пропозицій

# workbench.action.terminal.hideSuggestWidgetAndNavigateHistory
source: Hide Suggest Widget and Navigate History
uk: Сховати віджет пропозицій та переглянути історію

# workbench.action.terminal.learnMore
source: Learn More
uk: Дізнатися більше

# workbench.action.terminal.requestCompletions
source: Request Completions
uk: Запит на завершення

# workbench.action.terminal.resetSuggestWidgetSize
source: Reset Suggest Widget Size
uk: Скинути розмір віджета пропозицій

# workbench.action.terminal.selectNextPageSuggestion
source: Select the Next Page Suggestion
uk: Виберіть пропозицію наступної сторінки

# workbench.action.terminal.selectNextSuggestion
source: Select the Next Suggestion
uk: Виберіть наступну пропозицію

# workbench.action.terminal.selectPrevPageSuggestion
source: Select the Previous Page Suggestion
uk: Виберіть пропозицію попередньої сторінки

# workbench.action.terminal.selectPrevSuggestion
source: Select the Previous Suggestion
uk: Виберіть попередню пропозицію

# workbench.action.terminal.suggestToggleDetails
source: Suggest Toggle Details
uk: Пропозиція перемикання деталей

# workbench.action.terminal.suggestToggleDetailsFocus
source: Suggest Toggle Suggestion Focus
uk: Пропозиція Перемикання Фокус пропозиції

# workbench.action.terminal.suggestToggleExplainMode
source: Suggest Toggle Explain Modes
uk: Пропозиція перемикання пояснень режимів

source: Alias
uk: Псевдонім

source: Argument
uk: Аргумент

source: Branch
uk: Гілка

source: Commit
uk: Коміт

source: File
uk: Файл

source: Flag
uk: Прапор

source: Folder
uk: Папка

source: Inline Suggestion
uk: Вбудована пропозиція

# inlineSuggestionAlwaysOnTop
source: Inline Suggestion
uk: Вбудована пропозиція

source: Method
uk: Метод

source: Option
uk: Опція

source: Option Value
uk: Значення опції

source: Pull Request
uk: Запит на злиття

source: Pull Request (Done)
uk: Запит на злиття (Зроблено)

source: Remote
uk: Віддалений

source: Stash
uk: Сховище

source: Symbolic Link File
uk: Символічне посилання файл

source: Symbolic Link Folder
uk: Символічна посилання на папку

source: Tag
uk: Тег

# terminalSymbolAliasIcon
source: Icon for aliases in the terminal suggest widget.
uk: Іконка для псевдонімів у віджеті термінала.

# terminalSymbolArgumentIcon
source: Icon for arguments in the terminal suggest widget.
uk: Іконка для аргументів у віджеті терміналу.

# terminalSymbolBranchIcon
source: Icon for branches in the terminal suggest widget.
uk: Іконка для гілок у віджеті пропозицій терміналу.

# terminalSymbolCommitIcon
source: Icon for commits in the terminal suggest widget.
uk: Іконка для комітів у віджеті терміналу.

# terminalSymbolFileIcon
source: Icon for files in the terminal suggest widget.
uk: Іконка для файлів у віджеті терміналу.

# terminalSymbolFlagIcon
source: Icon for flags in the terminal suggest widget.
uk: Іконка для прапорців у віджеті терміналу.

# terminalSymbolFolderIcon
source: Icon for folders in the terminal suggest widget.
uk: Іконка для папок у віджеті терміналу.

# terminalSymbolIcon.aliasForeground
source: The foreground color for an alias icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка псевдоніма. Ці значки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.argumentForeground
source: The foreground color for an argument icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки аргументу. Ці іконки з'являться у віджеті підказок терміналу.

# terminalSymbolIcon.branchForeground
source: The foreground color for a branch icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки гілки. Ці іконки з'являться у віджеті підказок терміналу.

# terminalSymbolIcon.commitForeground
source: The foreground color for a commit icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки коміту. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.enumMemberForeground
source: The foreground color for an enum member icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для іконки члена enum. Ці іконки з'являться у віджеті пропозицій терміналу.

# terminalSymbolIcon.fileForeground
source: The foreground color for a file icon. These icons will appear in the terminal suggest widget.
uk: Колір переднього плану для значка файлу. Ці значки з'являться у віджеті пропозицій терміналу.
