Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_share.xlf
Languages: uk

source: Close
uk: Закрити

# experimental.share.enabled
source: Controls whether to render the Share action next to the command center when {0} is {1}.
uk: Контролює, чи відображати дію Поділитися поруч із командним центром, коли {0} є {1}.

source: Generating link...
uk: Генерація посилання...

source: Open Link
uk: Відкрити посилання

source: Share...
uk: Поділитися...

# shareSuccess
source: Copied link to clipboard!
uk: Скопійовано посилання в буфер обміну!

# shareTextSuccess
source: Copied text to clipboard!
uk: Скопійовано текст в буфер обміну!

# shareProviderCount
source: The number of available share providers
uk: Кількість доступних постачальників акцій

# toggle.share
source: Share
uk: Поділитися

# toggle.shareDescription
source: Toggle visibility of the Share action in title bar
uk: Перемикати видимість дії "Поділитися" у заголовку

# type to filter
source: Choose how to share {0}
uk: Виберіть, як поділитися {0}
