Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

# interactive.previousFileTree.label
source: Previous File Tree
uk: Попереднє дерево файлів

# chat.export.label
source: Export Chat...
uk: Експортувати чат...

# chat.file.label
source: Chat Session
uk: Чат-сесія

# chat.import.label
source: Import Chat...
uk: Імпорт чату...

# languageModelAuthPlaceholder
source: Choose which extensions can access language models
uk: Виберіть, які розширення можуть отримати доступ до мовних моделей

# languageModelAuthTitle
source: Manage Language Model Access
uk: Керувати доступом до мовної моделі

# manageLanguageModelAuthentication
source: Manage Language Model Access...
uk: Керувати доступом до мовної моделі...

# noAccessDescription
source: No extensions are currently allowed to use models from {0}
uk: Наразі жодні розширення не можуть використовувати моделі з {0}

# noAllowedExtensions
source: No extensions have access
uk: Немає доступу до розширень

# noLanguageModels
source: No language models requiring authentication found.
uk: Не знайдено мовних моделей, що потребують автентифікації.

# noLanguageModelsDetail
source: There are currently no language models that require authentication.
uk: Наразі немає мовних моделей, які потребують аутентифікації.

source: Open Extension
uk: Відкрити розширення

# trustedExtension
source: Trusted by Microsoft
uk: Довіряє Microsoft

# chat.openInEditor.label
source: Open Chat in Editor
uk: Відкрити чат в редакторі

# chat.openInNewWindow.label
source: Open Chat in New Window
uk: Відкрити чат у новому вікні

# interactiveSession.openInPanel.label
source: Open Chat in Panel
uk: Відкрити чат у панелі

# interactiveSession.openInPrimarySidebar.label
source: Open Chat in Primary Side Bar
uk: Відкрити чат у головній бічній панелі

# interactiveSession.openInSecondarySidebar.label
source: Open Chat in Secondary Side Bar
uk: Відкрити чат у бічній панелі вторинного екрану

# interactiveSession.openInSidebar.label
source: Open Chat in Side Bar
uk: Відкрити чат у боковій панелі

# chat.closeQuickChat.label
source: Close Quick Chat
uk: Закрити швидкий чат

# chat.openInChatView.label
source: Open in Chat View
uk: Відкрити в режимі чату

# interactiveSession.open
source: Open Quick Chat
uk: Новий редактор чату

source: Quick Chat
uk: Швидкий чат

# toggle.desc
source: Toggle the quick chat
uk: Перемкнути швидкий чат

# toggle.isPartialQuery
source: Whether the query is partial; it will wait for more user input
uk: Чи є запит частковим; він чекатиме на додатковий ввід користувача

# toggle.query
source: The query to open the quick chat with
uk: Запит на відкриття швидкого чату з

# renameSession
source: Rename
uk: Перейменувати

# renameSession.emptyName
source: Name cannot be empty
uk: Ім'я не може бути порожнім.

# renameSession.error
source: Failed to rename chat session: {0}
uk: Не вдалося перейменувати чат-сесію: {0}

# renameSession.nameTooLong
source: Name is too long (maximum 100 characters)
uk: Ім'я занадто довге (максимум 100 символів)

# renameSession.placeholder
source: Enter new name for chat session
uk: Введіть нову назву для сеансу чату

# chat.retry.confirmation.checkbox
source: Don't ask again
uk: Не питай знову

# chat.retry.confirmation.message2
source: This will undo edits made to {0} since this request.
uk: Це скасує зміни, внесені до {0} з моменту цього запиту.

# chat.retry.confirmation.primaryButton
source: Yes
uk: Так

# chat.retry.label
source: Retry
uk: Спробувати ще раз

# chat.retryLast.confirmation.message2
source: This will undo edits made to {0} files in your working set since this request. Do you want to proceed?
uk: Це скасує редагування, внесені до {0} файлів у вашому робочому наборі з моменту цього запиту. Ви хочете продовжити?

# chat.retryLast.confirmation.title2
source: Do you want to retry your last request?
uk: Ви хочете повторити свій останній запит?

# interactive.helpful.label
source: Helpful
uk: Корисний

# interactive.insertIntoNotebook.label
source: Insert into Notebook
uk: Вставити в Блокнот

# interactive.reportIssueForBug.label
source: Report Issue
uk: Повідомити про проблему

# interactive.unhelpful.label
source: Unhelpful
uk: Непомічний

# chat.accept
source: Accept
uk: Прийняти

# chat.tools.description.mode
source: The selected tools are configured by the '{0}' chat mode. Changes to the tools will be applied to the mode file as well.
uk: Вибрані інструменти налаштовані за допомогою режиму чату '{0}'. Зміни в інструментах також будуть застосовані до файлу режиму.

# chat.tools.description.session
source: The selected tools were configured by a prompt command and only apply to this chat session.
uk: Вибрані інструменти були налаштовані за допомогою команди запиту і застосовуються лише до цієї сесії чату.

# chat.tools.placeholder.global
source: Select tools that are available to chat.
uk: Виберіть інструменти, які доступні для чату.

# chat.tools.placeholder.mode
source: Select tools for this chat mode
uk: Виберіть інструменти для цього режиму чату

# chat.tools.placeholder.session
source: Select tools for this chat session
uk: Виберіть інструменти для цієї чат-сесії

# chatTools.tooManyEnabled
source: More than {0} tools are enabled, you may experience degraded tool calling.
uk: Більше ніж {0} інструментів активовано, ви можете зіткнутися з погіршенням виклику інструментів.

# label
source: Configure Tools...
uk: Налаштувати інструменти...

# addExtensionButton
source: Install Extension...
uk: Встановити розширення...

source: Add MCP Server...
uk: Додати сервер MCP...

# configMcpCol
source: Configure {0}
uk: Налаштувати {0}

# configToolSets
source: Configure Tool Sets...
uk: Налаштувати набори інструментів...

source: Configure Tools
uk: Налаштувати інструменти

# defaultBucketLabel
source: Built-In
uk: Вбудований

# editUserBucket
source: Edit Tool Set
uk: Редагувати набір інструментів

# ext
source: Extension: {0}
uk: Розширення: {0}

# mcpShowOutput
source: Show Output
uk: Показати вихідні дані

# mcplabel
source: MCP Server: {0}
uk: MCP сервер: {0}

# noTools
source: Add tools to chat
uk: Додати інструменти до чату

# toolLimitExceeded
source: {0} tools are enabled. You may experience degraded tool calling above {1} tools.
uk: {0} інструментів увімкнено. Ви можете зіткнутися з погіршенням виклику інструментів понад {1} інструментів.

# userBucket
source: User Defined Tool Sets
uk: Користувацькі набори інструментів

# activeEditor
source: Active editor '{0}'
uk: Активний редактор '{0}'

# applyCodeBlock.error
source: Failed to apply code block: {0}
uk: Не вдалося застосувати кодовий блок: {0}

# applyCodeBlock.errorOpeningFile
source: Failed to open {0} in a code editor.
uk: Не вдалося відкрити {0} в редакторі коду.

# applyCodeBlock.fileWriteError
source: Failed to create file: {0}
uk: Не вдалося створити файл: {0}

# applyCodeBlock.noActiveEditor
source: To apply this code block, open a code or notebook editor.
uk: Щоб застосувати цей кодовий блок, відкрийте редактор коду або нотаток.

# applyCodeBlock.noCodeMapper
source: No code mapper available.
uk: Немає доступного мапера коду.

# applyCodeBlock.progress
source: Applying code block using {0}...
uk: Застосування блоку коду за допомогою {0}...

# applyCodeBlock.readonly
source: Cannot apply code block to read-only file.
uk: Не можна застосувати блок коду до файлу лише для читання.

# applyCodeBlock.readonlyNotebook
source: Cannot apply code block to read-only notebook editor.
uk: Не можна застосувати кодовий блок до редактора нотаток лише для читання.

# createFile
source: New file '{0}'
uk: Новий файл '{0}'

# insertCodeBlock.noActiveEditor
source: To insert the code block, open a code editor or notebook editor and set the cursor at the location where to insert the code block.
uk: Щоб вставити кодовий блок, відкрийте редактор коду або редактор нотаток і встановіть курсор у місці, де потрібно вставити кодовий блок.

# insertCodeBlock.readonly
source: Cannot insert the code block to read-only code editor.
uk: Не вдається вставити кодовий блок у редактор коду тільки для читання.

# insertCodeBlock.readonlyNotebook
source: Cannot insert the code block to read-only notebook editor.
uk: Не вдається вставити кодовий блок у редактор нотаток лише для читання.

# newUntitledFile
source: New untitled editor
uk: Новий безіменний редактор

# selectOption
source: Select where to apply the code block
uk: Виберіть, де застосувати блок коду

source: Manage Language Models...
uk: Керувати мовними моделями...

# cell.lowercase
source: cell
uk: клітина

# chat.fileAttachment
source: Attached {0}, {1}
uk: Прикріплено {0}, {1}

# chat.fileAttachmentWithRange
source: Attached {0}, {1}, line {2} to line {3}
uk: Прикріплено {0}, {1}, рядок {2} до рядка {3}

# disable
source: Disable current {0} context
uk: Вимкнути поточний {0} контекст

# enable
source: Enable current {0} context
uk: Увімкнути поточний {0} контекст

# enableHint
source: Enable current {0} context
uk: Увімкнути поточний {0} контекст

# file.lowercase
source: file
uk: файл

# openEditor
source: Current {0} context
uk: Поточний {0} контекст

source: Chat
uk: Чат

# chat.agent.enabled.description
source: Enable agent mode for {0}. When this is enabled, agent mode can be activated via the dropdown in the view.
uk: Увімкніть режим агента для {0}. Коли це увімкнено, режим агента можна активувати через випадаюче меню у вигляді.

# chat.agent.maxRequests
source: The maximum number of requests to allow Copilot to use per-turn in agent mode. When the limit is reached, Copilot will ask the user to confirm that it should continue.
uk: Максимальна кількість запитів, яку дозволено використовувати Copilot за один хід в режимі агента. Коли ліміт буде досягнуто, Copilot запитає у користувача, чи слід продовжувати.

# chat.agent.showThinking
source: Controls whether to show the thinking process of the model in chat responses.
uk: Контролює, чи показувати процес мислення моделі у відповідях чату.

# chat.checkpoints.enabled
source: Enables checkpoints in chat. Checkpoints allow you to restore the chat to a previous state.
uk: Увімкнення контрольних точок у чаті. Контрольні точки дозволяють відновити чат до попереднього стану.

# chat.checkpoints.showFileChanges
source: Controls whether to show chat checkpoint file changes.
uk: Контролює, чи показувати зміни файлів контрольних точок чату.

# chat.commandCenter.enabled
source: Controls whether the command center shows a menu for actions to control Copilot (requires {0}).
uk: Контролює, чи показує командний центр меню для дій з управління Copilot (вимагає {0}).

# chat.detectParticipant.enabled
source: Enables chat participant autodetection for panel chat.
uk: Увімкнення автодетекції учасників чату для панельного чату.

# chat.disableAIFeatures
source: Disable and hide built-in AI features provided by GitHub Copilot, including Chat, Code Completions and Next Edit Suggestions.
uk: Вимкніть і сховайте вбудовані функції ШІ, надані GitHub Copilot, включаючи Чат, Завершення коду та Пропозиції наступного редагування.

# chat.editRequests
source: Enables editing of requests in the chat. This allows you to change the request content and resubmit it to the model.
uk: Дозволяє редагувати запити в чаті. Це дозволяє змінювати вміст запиту та повторно надсилати його моделі.

# chat.editing.autoAcceptDelay
source: Delay after which changes made by chat are automatically accepted. Values are in seconds, `0` means disabled and `100` seconds is the maximum.
uk: Затримка, після якої зміни, внесені чатом, автоматично приймаються. Значення в секундах, `0` означає вимкнено, а `100` секунд - це максимум.

# chat.editing.confirmEditRequestRemoval
source: Whether to show a confirmation before removing a request and its associated edits.
uk: Чи показувати підтвердження перед видаленням запиту та його асоційованих редагувань.

# chat.editing.confirmEditRequestRetry
source: Whether to show a confirmation before retrying a request and its associated edits.
uk: Чи показувати підтвердження перед повторною спробою запиту та його супутніх редагувань.

# chat.edits2Enabled
source: Enable the new Edits mode that is based on tool-calling. When this is enabled, models that don't support tool-calling are unavailable for Edits mode.
uk: Увімкніть новий режим редагування, який базується на виклику інструментів. Коли це увімкнено, моделі, які не підтримують виклик інструментів, недоступні для режиму редагування.

# chat.emptyChatState
source: Shows a modified empty chat state with hints in the input placeholder text.
uk: Показує змінений порожній стан чату з підказками в тексті плейсхолдера введення.

# chat.experimental.detectParticipant.enabled
source: Enables chat participant autodetection for panel chat.
uk: Увімкнення автоматичного виявлення учасників чату для панельного чату.

# chat.experimental.detectParticipant.enabled.deprecated
source: This setting is deprecated. Please use `chat.detectParticipant.enabled` instead.
uk: Це налаштування застаріло. Будь ласка, використовуйте `chat.detectParticipant.enabled` замість цього.

# chat.extensionToolsEnabled
source: Enable using tools contributed by third-party extensions.
uk: Увімкніть використання інструментів, наданих сторонніми розширеннями.

# chat.extensionToolsPolicy
source: Enable using tools contributed by third-party extensions.
uk: Увімкніть використання інструментів, наданих сторонніми розширеннями.

# chat.implicitContext.enabled.1
source: Enables automatically using the active editor as chat context for specified chat locations.
uk: Дозволяє автоматично використовувати активний редактор як контекст чату для вказаних місць чату.

# chat.implicitContext.suggestedContext
source: Controls whether the new implicit context flow is shown. In Ask and Edit modes, the context will automatically be included. In Agent mode context will be suggested as an attachment. Selections are always included as context.
uk: Контролює, чи буде показано новий імпліцитний потік контексту. У режимах Запит та Редагування контекст буде автоматично включено. У режимі Агента контекст буде запропоновано як вкладення. Вибори завжди включаються як контекст.

# chat.implicitContext.value
source: The value for the implicit context.
uk: Значення для імпліцитного контексту.

# chat.implicitContext.value.always
source: Implicit context is always enabled.
uk: Неявний контекст завжди увімкнено.

# chat.implicitContext.value.first
source: Implicit context is enabled for the first interaction.
uk: Неявний контекст увімкнено для першої взаємодії.

# chat.implicitContext.value.never
source: Implicit context is never enabled.
uk: Неявний контекст ніколи не ввімкнено.

# chat.instructions.config.locations.description
source: Specify location(s) of instructions files (`*{0}`) that can be attached in Chat sessions. [Learn More]({1}). Relative paths are resolved from the root folder(s) of your workspace.
uk: Вкажіть місцезнаходження файлів інструкцій (`*{0}`), які можна прикріпити в чат-сесіях. [Дізнатися більше]({1}). Відносні шляхи визначаються від кореневих папок вашого робочого простору.

# chat.instructions.config.locations.title
source: Instructions File Locations
uk: Інструкції Розташування файлів

# chat.mathEnabled.description
source: Enable math rendering in chat responses using KaTeX.
uk: Увімкніть відображення математичних формул у відповідях чату за допомогою KaTeX.

# chat.mcp.assisted.nuget.enabled.description
source: Enables NuGet packages for AI-assisted MCP server installation. Used to install MCP servers by name from the central registry for .NET packages (NuGet.org).
uk: Увімкнення пакетів NuGet для встановлення сервера MCP з підтримкою ШІ. Використовується для встановлення серверів MCP за назвою з центрального реєстру для пакетів .NET (NuGet.org).

# chat.mcp.autostart
source: Controls whether MCP servers should be automatically started when the chat messages are submitted.
uk: Контролює, чи повинні сервери MCP автоматично запускатися, коли надсилаються повідомлення чату.

# chat.mcp.autostart.never
source: Never automatically start MCP servers.
uk: Ніколи не запускайте сервери MCP автоматично.

# chat.mcp.autostart.newAndOutdated
source: Automatically start new and outdated MCP servers that are not yet running.
uk: Автоматично запускати нові та застарілі сервери MCP, які ще не працюють.

# chat.mcp.autostart.onlyNew
source: Only automatically start new MCP servers that have never been run.
uk: Тільки автоматично запускати нові сервери MCP, які ніколи не були запущені.

# chat.mcp.enabled
source: Enables integration with Model Context Protocol servers to provide additional tools and functionality.
uk: Дозволяє інтеграцію з серверами Model Context Protocol для надання додаткових інструментів та функціональності.

# chat.mcp.serverSampling
source: Configures which models are exposed to MCP servers for sampling (making model requests in the background). This setting can be edited in a graphical way under the `{0}` command.
uk: Налаштовує, які моделі доступні серверам MCP для вибірки (виконання запитів моделей у фоновому режимі). Цю налаштування можна редагувати графічно за допомогою команди `{0}`.

# chat.mcp.serverSampling.allowedDuringChat
source: Whether this server is make sampling requests during its tool calls in a chat session.
uk: Чи цей сервер робить запити на вибірку під час викликів інструментів у сеансі чату.

# chat.mcp.serverSampling.allowedOutsideChat
source: Whether this server is allowed to make sampling requests outside of a chat session.
uk: Чи дозволено цьому серверу робити запити на вибірку поза сеансом чату.

# chat.mcp.serverSampling.model
source: A model the MCP server has access to.
uk: Модель, до якої має доступ сервер MCP.

# chat.mode.config.locations.description
source: Specify location(s) of custom chat mode files (`*{0}`). [Learn More]({1}). Relative paths are resolved from the root folder(s) of your workspace.
uk: Вкажіть місце розташування файлів режиму чату користувача (`*{0}`). [Дізнатися більше]({1}). Відносні шляхи вирішуються від кореневих папок вашого робочого простору.

# chat.mode.config.locations.title
source: Mode File Locations
uk: Розташування файлів режиму

# chat.notifyWindowOnConfirmation
source: Controls whether the Copilot window should notify the user when a confirmation is needed while the window is not in focus. This includes a window badge as well as notification toast.
uk: Контролює, чи повинно вікно Copilot сповіщати користувача, коли потрібне підтвердження, поки вікно не в фокусі. Це включає значок вікна, а також сповіщення у вигляді тосту.

# chat.promptFiles.policy
source: Enables reusable prompt and instruction files in Chat sessions.
uk: Дозволяє використовувати повторно файли запитів та інструкцій у чат-сесіях.

# chat.renderRelatedFiles
source: Controls whether related files should be rendered in the chat input.
uk: Контролює, чи пов'язані файли повинні відображатися в полі вводу чату.

# chat.reusablePrompts.config.enabled.description
source: Enable reusable prompt (`*{0}`) and instruction files (`*{1}`) in Chat sessions. [Learn More]({2}).
uk: Увімкніть повторно використовувані підказки (`*{0}`) та файли інструкцій (`*{1}`) у чат-сесіях. [Дізнатися більше]({2}).

# chat.reusablePrompts.config.enabled.title
source: Prompt Files
uk: Файли запитів

# chat.reusablePrompts.config.locations.description
source: Specify location(s) of reusable prompt files (`*{0}`) that can be run in Chat sessions. [Learn More]({1}). Relative paths are resolved from the root folder(s) of your workspace.
uk: Вкажіть місцезнаходження повторно використовуваних файлів запитів (`*{0}`), які можна запускати в сеансах чату. [Дізнатися більше]({1}). Відносні шляхи вирішуються від кореневих папок вашого робочого простору.

# chat.reusablePrompts.config.locations.title
source: Prompt File Locations
uk: Розташування файлів запитів

# chat.sendElementsToChat.attachCSS
source: Controls whether CSS of the selected element will be added to the chat. {0} must be enabled.
uk: Контролює, чи буде CSS вибраного елемента додано до чату. {0} має бути увімкнено.

# chat.sendElementsToChat.attachImages
source: Controls whether a screenshot of the selected element will be added to the chat. {0} must be enabled.
uk: Контролює, чи буде скріншот вибраного елемента додано до чату. {0} повинен бути увімкнений.

# chat.sendElementsToChat.enabled
source: Controls whether elements can be sent to chat from the Simple Browser.
uk: Контролює, чи можуть елементи бути надіслані в чат з Простого браузера.

# chat.sessionsViewLocation.description
source: Controls where to show the agent sessions menu.
uk: Контролює, де показувати меню сеансів агента.

# chat.signInDialogVariant
source: Control variations of the sign-in dialog.
uk: Керуйте варіаціями діалогового вікна входу.

# chat.todoListTool.enabled
source: Enables todo lists in chat, which the agent uses as a tool for planning, progress tracking, and context management for complex development workflows.
uk: Увімкнення списків справ у чаті, які агент використовує як інструмент для планування, відстеження прогресу та управління контекстом для складних робочих процесів розробки.

# chat.todoListTool.writeOnly
source: When enabled, the todo tool operates in write-only mode, requiring the agent to remember todos in context.
uk: Коли увімкнено, інструмент todo працює в режимі тільки для запису, вимагаючи від агента запам'ятовувати todos у контексті.

# chat.tools.autoApprove.description
source: Controls whether tool use should be automatically approved. Allow all tools to run automatically without user confirmation, overriding any tool-specific settings such as terminal auto-approval. Use with caution: carefully review selected tools and be extra wary of possible sources of prompt injection!
uk: Контролює, чи слід автоматично схвалювати використання інструментів. Дозволяє всім інструментам працювати автоматично без підтвердження користувача, переважаючи будь-які специфічні налаштування інструментів, такі як автоматичне схвалення терміналу. Використовуйте з обережністю: уважно перегляньте вибрані інструменти та будьте особливо обережні щодо можливих джерел ін'єкції запитів!

# chat.tools.autoApprove.edits
source: Controls whether edits made by chat are automatically approved. The default is to approve all edits except those made to certain files which have the potential to cause immediate unintened side-effects, such as `**/.vscode/*.json`. Files are matched against the glob patterns in the order they are specified.
uk: Контролює, чи редагування, внесені чатом, автоматично схвалюються. За замовчуванням схвалюються всі редагування, за винятком тих, що внесені в певні файли, які можуть викликати негайні непередбачені побічні ефекти, такі як `**/.vscode/*.json`. Файли порівнюються з шаблонами glob у порядку їх зазначення.

# chat.tools.autoApprove.markdownDescription
source: Controls whether tool use should be automatically approved. Allows _all_ tools to run automatically without user confirmation, overriding any tool-specific settings such as terminal auto-approval. Use with caution: carefully review selected tools and be extra wary of possible sources of prompt injection!
uk: Контролює, чи слід автоматично затверджувати використання інструментів. Дозволяє _всім_ інструментам працювати автоматично без підтвердження користувача, переважаючи будь-які специфічні налаштування інструментів, такі як автоматичне затвердження терміналу. Використовуйте з обережністю: уважно перегляньте вибрані інструменти та будьте особливо обережні з можливими джерелами ін'єкції запитів!

# chat.undoRequests.restoreInput
source: Controls whether the input of the chat should be restored when an undo request is made. The input will be filled with the text of the request that was restored.
uk: Контролює, чи слід відновити введення чату, коли надсилається запит на скасування. Введення буде заповнене текстом запиту, який було відновлено.
