Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_notebook.xlf
Languages: uk

# notebook.diff.cell.toggleCollapseUnchangedRegions
source: Toggle Collapse Unchanged Regions
uk: Переключити згортання незмінних регіонів

# notebook.diff.ignoreMetadata
source: Hide Metadata Differences
uk: Сховати відмінності метаданих

# notebook.diff.ignoreOutputs
source: Hide Outputs Differences
uk: Сховати різницю виходів

# notebook.diff.inline.toggle.title
source: Toggle Inline View
uk: Перемкнути вбудований вигляд

# notebook.diff.openFile
source: Open File
uk: Відкрити файл

# notebook.diff.revertMetadata
source: Revert Notebook Metadata
uk: Відновити метадані блокнота

# notebook.diff.showMetadata
source: Show Metadata Differences
uk: Показати різниці в метаданих

# notebook.diff.showOutputs
source: Show Outputs Differences
uk: Показати різниці в виходах

# notebook.diff.switchToText
source: Open Text Diff Editor
uk: Відкрити редактор текстових відмінностей

# notebook.diff.toggleInline
source: Enable the command to toggle the experimental notebook inline diff editor.
uk: Увімкніть команду для перемикання експериментального редактора вбудованих відмінностей нотаток.

# notebookTreeAriaLabel
source: Notebook Text Diff
uk: Різниця тексту блокнота

# notebook.diffEditor.allCollapsed
source: Whether all cells in notebook diff editor are collapsed
uk: Чи всі клітини в редакторі різниць блокнота згорнуті

# notebook.diffEditor.hasUnchangedCells
source: Whether there are unchanged cells in the notebook diff editor
uk: Чи є незмінені клітини в редакторі різниць блокнота

# notebook.diffEditor.item.kind
source: The kind of item in the notebook diff editor, Cell, Metadata or Output
uk: Тип елемента в редакторі різниць нотаток: Осередок, Метадані або Вихід

# notebook.diffEditor.item.state
source: The diff state of item in the notebook diff editor, delete, insert, modified or unchanged
uk: Стан відмінностей елемента в редакторі відмінностей блокнота: видалено, вставлено, змінено або без змін.

# notebook.diffEditor.unchangedCellsAreHidden
source: Whether the unchanged cells in the notebook diff editor are hidden
uk: Чи приховані незмінені клітини в редакторі відмінностей нотаток

# notebook.diff.hiddenCells.expandAll
source: Double click to show
uk: Двічі клацніть, щоб показати

# notebookCellLabel
source: Cell {0}
uk: Клітинка {0}

# notebookCellMetadataLabel
source: Metadata
uk: Метадані

# notebookCellOutputLabel
source: Output
uk: Вивід

# insertToolbarLocation.betweenCells
source: A toolbar that appears on hover between cells.
uk: Панель інструментів, яка з'являється при наведенні між комірками.

# insertToolbarLocation.both
source: Both toolbars.
uk: Обидва панелі інструментів.

# insertToolbarLocation.hidden
source: The insert actions don't appear anywhere.
uk: Дії вставки не з'являються ніде.

# insertToolbarLocation.notebookToolbar
source: The toolbar at the top of the notebook editor.
uk: Панель інструментів у верхній частині редактора нотаток.

# notebook.VariablesView.description
source: Enable the experimental notebook variables view within the debug panel.
uk: Увімкніть перегляд змінних експериментального блокнота в панелі налагодження.

# notebook.backup.sizeLimit
source: The limit of notebook output size in kilobytes (KB) where notebook files will no longer be backed up for hot reload. Use 0 for unlimited.
uk: Обмеження розміру виходу нотатника в кілобайтах (KB), при якому файли нотатника більше не будуть резервуватися для гарячого перезавантаження. Використовуйте 0 для безмежного.

# notebook.cellExecutionTimeVerbosity.default.description
source: The cell execution duration is visible, with advanced information in the hover tooltip.
uk: Тривалість виконання осередку видима, з розширеною інформацією у спливаючій підказці.

# notebook.cellExecutionTimeVerbosity.description
source: Controls the verbosity of the cell execution time in the cell status bar.
uk: Контролює детальність часу виконання комірки в панелі стану комірки.

# notebook.cellExecutionTimeVerbosity.verbose.description
source: The cell last execution timestamp and duration are visible, with advanced information in the hover tooltip.
uk: Час останнього виконання клітини та тривалість видимі, з розширеною інформацією у спливаючій підказці.

# notebook.cellFailureDiagnostics
source: Show available diagnostics for cell failures.
uk: Показати доступні діагностики для збоїв у комірках.

# notebook.cellGenerate
source: Enable experimental generate action to create code cell with inline chat enabled.
uk: Увімкніть експериментальну дію генерації для створення кодової клітинки з увімкненим інтегрованим чатом.

# notebook.cellToolbarLocation.description
source: Where the cell toolbar should be shown, or whether it should be hidden.
uk: Де має бути показана панель інструментів комірки, або чи повинна вона бути прихована.

# notebook.cellToolbarLocation.viewType
source: Configure the cell toolbar position for for specific file types
uk: Налаштуйте позицію панелі інструментів комірок для конкретних типів файлів.

# notebook.cellToolbarVisibility.description
source: Whether the cell toolbar should appear on hover or click.
uk: Чи має панель інструментів комірки з'являтися при наведенні курсора чи при кліку.

# notebook.compactView.description
source: Control whether the notebook editor should be rendered in a compact form. For example, when turned on, it will decrease the left margin width.
uk: Контролюйте, чи має редактор нотаток відображатися в компактному вигляді. Наприклад, коли він увімкнений, це зменшить ширину лівого поля.

# notebook.confirmDeleteRunningCell
source: Control whether a confirmation prompt is required to delete a running cell.
uk: Контролюйте, чи потрібен запит на підтвердження для видалення працюючої клітини.

# notebook.consolidatedOutputButton.description
source: Control whether outputs action should be rendered in the output toolbar.
uk: Контролюйте, чи повинні дії виводитися на панелі інструментів виводу.

# notebook.consolidatedRunButton.description
source: Control whether extra actions are shown in a dropdown next to the run button.
uk: Контролюйте, чи додаткові дії відображаються у випадаючому списку поруч із кнопкою запуску.

# notebook.diff.enableOverviewRuler.description
source: Whether to render the overview ruler in the diff editor for notebook.
uk: Чи відображати лінійку огляду в редакторі змін для блокнота.

# notebook.diff.enablePreview.description
source: Whether to use the enhanced text diff editor for notebook.
uk: Чи використовувати покращений редактор текстових відмінностей для блокнота.

# notebook.disableOutputFilePathLinks
source: Control whether to disable filepath links in the output of notebook cells.
uk: Контролюйте, чи потрібно вимкнути посилання на шляхи файлів у виході клітинок блокнота.

# notebook.displayOrder.description
source: Priority list for output mime types
uk: Список пріоритетів для типів виходу mime

# notebook.dragAndDrop.description
source: Control whether the notebook editor should allow moving cells through drag and drop.
uk: Контролюйте, чи повинен редактор нотаток дозволяти переміщення клітинок за допомогою перетягування.

# notebook.editorOptions.experimentalCustomization
source: Settings for code editors used in notebooks. This can be used to customize most editor.* settings.
uk: Налаштування для редакторів коду, що використовуються в нотатках. Це можна використовувати для налаштування більшості параметрів редактора.*

# notebook.findFilters
source: Customize the Find Widget behavior for searching within notebook cells. When both markup source and markup preview are enabled, the Find Widget will search either the source code or preview based on the current state of the cell.
uk: Налаштуйте поведінку віджета пошуку для пошуку в клітинках блокнота. Коли увімкнено як джерело розмітки, так і попередній перегляд розмітки, віджет пошуку шукатиме або в вихідному коді, або в попередньому перегляді залежно від поточного стану клітинки.

# notebook.focusIndicator.description
source: Controls where the focus indicator is rendered, either along the cell borders or on the left gutter.
uk: Контролює, де відображається індикатор фокусу: або вздовж меж клітинки, або на лівій смузі.

# notebook.formatOnCellExecution
source: Format a notebook cell upon execution. A formatter must be available.
uk: Форматувати клітинку нотатника під час виконання. Форматувач повинен бути доступний.

# notebook.formatOnSave
source: Format a notebook on save. A formatter must be available and the editor must not be shutting down. When {0} is set to `afterDelay`, the file will only be formatted when saved explicitly.
uk: Форматувати блокнот при збереженні. Форматер має бути доступним, а редактор не повинен закриватися. Коли {0} встановлено на `afterDelay`, файл буде відформатовано лише при явному збереженні.

# notebook.globalToolbar.description
source: Control whether to render a global toolbar inside the notebook editor.
uk: Контролюйте, чи відображати глобальну панель інструментів всередині редактора блокнота.

# notebook.globalToolbarShowLabel
source: Control whether the actions on the notebook toolbar should render label or not.
uk: Контролюйте, чи дії на панелі інструментів блокнота повинні відображати мітку чи ні.

# notebook.inlineValues.auto
source: Show inline values only when an inline value provider is registered.
uk: Показувати вбудовані значення лише тоді, коли зареєстровано постачальника вбудованих значень.

# notebook.inlineValues.description
source: Control whether to show inline values within notebook code cells after cell execution. Values will remain until the cell is edited, re-executed, or explicitly cleared via the Clear All Outputs toolbar button or the `Notebook: Clear Inline Values` command.
uk: Контролюйте, чи показувати вбудовані значення в кодових клітинках блокнота після виконання клітинки. Значення залишаться до тих пір, поки клітинка не буде відредагована, повторно виконана або явно очищена за допомогою кнопки панелі інструментів "Очистити всі виходи" або команди `Notebook: Clear Inline Values`.

# notebook.inlineValues.off
source: Never show inline values.
uk: Ніколи не показуйте вбудовані значення.

# notebook.inlineValues.on
source: Always show inline values, with a regex fallback if no inline value provider is registered. Note: There may be a performance impact in larger cells if the fallback is used.
uk: Завжди показуйте вбудовані значення, з резервним варіантом regex, якщо жоден постачальник вбудованих значень не зареєстрований. Примітка: Використання резервного варіанту може вплинути на продуктивність у більших клітинках.

# notebook.insertFinalNewline
source: When enabled, insert a final new line into the end of code cells when saving a notebook.
uk: Коли увімкнено, вставте фінальний новий рядок в кінець кодових клітинок при збереженні блокнота.

# notebook.insertToolbarPosition.description
source: Control where the insert cell actions should appear.
uk: Контролюйте, де повинні з'являтися дії вставки комірки.

# notebook.interactiveWindow.collapseCodeCells
source: Controls whether code cells in the interactive window are collapsed by default.
uk: Контролює, чи комірки коду в інтерактивному вікні за замовчуванням згорнуті.

# notebook.markdown.lineHeight
source: Controls the line height in pixels of markdown cells in notebooks. When set to {0}, {1} will be used
uk: Контролює висоту рядка в пікселях для markdown-клітинок у нотатниках. Коли встановлено {0}, буде використано {1}

# notebook.markup.fontFamily
source: Controls the font family of rendered markup in notebooks. When left blank, this will fall back to the default workbench font family.
uk: Контролює сімейство шрифтів відображеного розмітки в нотатниках. Якщо залишити порожнім, буде використано шрифт за замовчуванням для робочої області.

# notebook.markup.fontSize
source: Controls the font size in pixels of rendered markup in notebooks. When set to {0}, 120% of {1} is used.
uk: Контролює розмір шрифту в пікселях для відрендереного розмітки в нотатниках. Коли встановлено {0}, використовується 120% від {1}.

# notebook.minimalErrorRendering
source: Control whether to render error output in a minimal style.
uk: Контролюйте, чи відображати вихідні дані помилки в мінімальному стилі.

# notebook.multiCursor.enabled
source: Experimental. Enables a limited set of multi cursor controls across multiple cells in the notebook editor. Currently supported are core editor actions (typing/cut/copy/paste/composition) and a limited subset of editor commands.
uk: Експериментальний. Дозволяє обмежений набір багатокурсорних керувань у кількох клітинках редактора нотаток. Наразі підтримуються основні дії редактора (набір/вирізання/копіювання/вставка/композиція) та обмежений підмножина команд редактора.

# notebook.outputFontFamily
source: The font family of the output text within notebook cells. When set to empty, the {0} is used.
uk: Сімейство шрифтів вихідного тексту в клітинах блокнота. Якщо встановлено порожнім, використовується {0}.

# notebook.outputFontSize
source: Font size for the output text within notebook cells. When set to 0, {0} is used.
uk: Розмір шрифту для вихідного тексту в клітинках блокнота. Якщо встановлено 0, використовується {0}.

# notebook.outputLineHeight
source: Line height of the output text within notebook cells. - When set to 0, editor line height is used. - Values between 0 and 8 will be used as a multiplier with the font size. - Values greater than or equal to 8 will be used as effective values.
uk: Висота рядка вихідного тексту в клітинах зошита. - Якщо встановлено 0, використовується висота рядка редактора. - Значення від 0 до 8 будуть використані як множник з розміром шрифту. - Значення, що дорівнюють або перевищують 8, будуть використані як ефективні значення.

# notebook.outputScrolling
source: Initially render notebook outputs in a scrollable region when longer than the limit.
uk: Спочатку відображайте виходи ноутбука в прокручуваній області, коли вони довші за ліміт.

# notebook.outputWordWrap
source: Controls whether the lines in output should wrap.
uk: Контролює, чи повинні рядки в виході переноситися.

# notebook.remoteSaving
source: Enables the incremental saving of notebooks between processes and across Remote connections. When enabled, only the changes to the notebook are sent to the extension host, improving performance for large notebooks and slow network connections.
uk: Дозволяє інкрементальне збереження блокнотів між процесами та через віддалені з'єднання. Коли ця функція увімкнена, лише зміни до блокнота надсилаються до хоста розширення, що покращує продуктивність для великих блокнотів та повільних мережевих з'єднань.

# notebook.scrolling.revealNextCellOnExecute.description
source: How far to scroll when revealing the next cell upon running {0}.
uk: Як далеко прокручувати, коли відкривається наступна комірка під час виконання {0}.

# notebook.scrolling.revealNextCellOnExecute.firstLine.description
source: Scroll to reveal the first line of the next cell.
uk: Прокрутіть, щоб відкрити перший рядок наступної комірки.

# notebook.scrolling.revealNextCellOnExecute.fullCell.description
source: Scroll to fully reveal the next cell.
uk: Прокрутіть, щоб повністю відкрити наступну клітинку.

# notebook.scrolling.revealNextCellOnExecute.none.description
source: Do not scroll.
uk: Не прокручуйте.

# notebook.showCellStatusbar.description
source: Whether the cell status bar should be shown.
uk: Чи слід показувати панель стану клітинки.

# notebook.showCellStatusbar.hidden.description
source: The cell Status bar is always hidden.
uk: Панель стану комірки завжди прихована.

# notebook.showCellStatusbar.visible.description
source: The cell Status bar is always visible.
uk: Панель стану комірки завжди видима.

# notebook.showCellStatusbar.visibleAfterExecute.description
source: The cell Status bar is hidden until the cell has executed. Then it becomes visible to show the execution status.
uk: Панель стану комірки прихована, поки комірка не виконається. Потім вона стає видимою, щоб показати статус виконання.

# notebook.showFoldingControls.description
source: Controls when the Markdown header folding arrow is shown.
uk: Контролює, коли показується стрілка згортання заголовка Markdown.

# notebook.stickyScrollEnabled.description
source: Experimental. Control whether to render notebook Sticky Scroll headers in the notebook editor.
uk: Експериментальний. Контролюйте, чи відображати заголовки Sticky Scroll у редакторі блокнотів.

# notebook.stickyScrollMode.description
source: Control whether nested sticky lines appear to stack flat or indented.
uk: Контролюйте, чи з'являються вкладені липкі рядки в горизонтальному або відступленому вигляді.

# notebook.stickyScrollMode.flat
source: Nested sticky lines appear flat.
uk: Вкладені липкі лінії виглядають плоскими.

# notebook.stickyScrollMode.indented
source: Nested sticky lines appear indented.
uk: Вкладені липкі лінії з'являються з відступом.

# notebook.textOutputLineLimit
source: Controls how many lines of text are displayed in a text output. If {0} is enabled, this setting is used to determine the scroll height of the output.
uk: Контролює, скільки рядків тексту відображається в текстовому виводі. Якщо {0} увімкнено, це налаштування використовується для визначення висоти прокрутки виводу.

# notebook.undoRedoPerCell.description
source: Whether to use separate undo/redo stack for each cell.
uk: Чи використовувати окремий стек скасування/повторення для кожної комірки.

# notebookConfigurationTitle
source: Notebook
uk: Блокнот

# notebookFormatter.default
source: Defines a default notebook formatter which takes precedence over all other formatter settings. Must be the identifier of an extension contributing a formatter.
uk: Визначає форматувач нотаток за замовчуванням, який має пріоритет над усіма іншими налаштуваннями форматувача. Має бути ідентифікатором розширення, що надає форматувач.

# showFoldingControls.always
source: The folding controls are always visible.
uk: Управління складанням завжди видимі.

# showFoldingControls.mouseover
source: The folding controls are visible only on mouseover.
uk: Елементи управління складанням видимі лише при наведенні миші.

# showFoldingControls.never
source: Never show the folding controls and reduce the gutter size.
uk: Ніколи не показуйте елементи управління складанням і зменшіть розмір міжстовпцевого простору.

# notebook.cell.edit
source: The Edit Cell command{0} will focus on the cell input.
uk: Команда Редагувати комірку{0} зосередить увагу на введенні в комірку.

# notebook.cell.executeAndFocusContainer
source: The Execute Cell command{0} executes the cell that currently has focus.
uk: Команда Виконати клітинку{0} виконує клітинку, яка наразі має фокус.

# notebook.cell.focusInOutput
source: The Focus Output command{0} will set focus in the cell's output.
uk: Команда Focus Output{0} встановить фокус у виході клітинки.

# notebook.cell.insertCodeCellBelowAndFocusContainer
source: The Insert Cell Above{0} and Below{1} commands will create new empty code cells.
uk: Команди Insert Cell Above{0} та Below{1} створять нові порожні кодові клітини.

# notebook.cell.quitEdit
source: The Quit Edit command{0} will set focus on the cell container. The default (Escape) key may need to be pressed twice first exit the virtual cursor if active.
uk: Команда Вихід з редагування{0} встановить фокус на контейнері комірки. Можливо, потрібно буде натиснути клавішу за замовчуванням (Escape) двічі, щоб спочатку вийти з віртуального курсора, якщо він активний.

# notebook.cellNavigation
source: The up and down arrows will also move focus between cells while focused on the outer cell container.
uk: Стрілки вгору та вниз також переміщуватимуть фокус між клітинками, коли фокус знаходиться на зовнішньому контейнері клітинок.

# notebook.changeCellType
source: The Change Cell to Code/Markdown commands are used to switch between cell types.
uk: Команди Змінити клітинку на Код/Markdown використовуються для перемикання між типами клітинок.

# notebook.focusNextEditor
source: The Focus Next Cell Editor command{0} will set focus in the next cell's editor.
uk: Команда Focus Next Cell Editor{0} встановить фокус у редакторі наступної комірки.

# notebook.focusPreviousEditor
source: The Focus Previous Cell Editor command{0} will set focus in the previous cell's editor.
uk: Команда Focus Previous Cell Editor {0} встановить фокус у редакторі попередньої клітинки.

# notebook.overview
source: The notebook view is a collection of code and markdown cells. Code cells can be executed and will produce output directly below the cell.
uk: Перегляд нотатника - це збірка кодових та markdown-клітинок. Кодові клітинки можна виконувати, і вони будуть генерувати вихідні дані безпосередньо під клітинкою.

# notebookTreeAriaLabel
source: Notebook
uk: Різниця тексту блокнота

# notebookTreeAriaLabelHelp
source: {0} Use {1} for accessibility help
uk: {0} Використовуйте {1} для допомоги з доступністю

# notebookTreeAriaLabelHelpNoKb
source: {0} Run the Open Accessibility Help command for more information
uk: {0} Виконайте команду Open Accessibility Help для отримання додаткової інформації

# replHistoryTreeAriaLabel
source: REPL Editor History
uk: Історія редактора REPL

# fail.noEditor
source: Cannot open resource with notebook editor type '{0}', please check if you have the right extension installed and enabled.
uk: Не вдалося відкрити ресурс з типом редактора нотаток '{0}', будь ласка, перевірте, чи встановлено та активовано правильне розширення.

# fail.noEditor.extensionMissing
source: Cannot open resource with notebook editor type '{0}', please check if you have the right extension installed and enabled.
uk: Не вдається відкрити ресурс з типом редактора нотаток '{0}', будь ласка, перевірте, чи у вас встановлено та активовано правильне розширення.

# notebookOpenAsText
source: Open As Text
uk: Відкрити як текст

# notebookOpenEnableMissingViewType
source: Enable extension for '{0}'
uk: Увімкнути розширення для '{0}'

# notebookOpenInTextEditor
source: Open in Text Editor
uk: Відкрити в текстовому редакторі

# notebookOpenInstallMissingViewType
source: Install extension for '{0}'
uk: Встановіть розширення для '{0}'

# notebookTooLargeForHeapErrorWithSize
source: The notebook is not displayed in the notebook editor because it is very large ({0}).
uk: Блокнот не відображається в редакторі блокнотів, оскільки він дуже великий ({0}).

# notebookTooLargeForHeapErrorWithoutSize
source: The notebook is not displayed in the notebook editor because it is very large.
uk: Блокнот не відображається в редакторі блокнотів, оскільки він дуже великий.

# focusedCellBackground
source: The background color of a cell when the cell is focused.
uk: Колір фону комірки, коли комірка має фокус.

# notebook.cellBorderColor
source: The border color for notebook cells.
uk: Колір межі для клітинок блокнота.

# notebook.cellEditorBackground
source: Cell editor background color.
uk: Колір фону редактора комірки.

# notebook.cellHoverBackground
source: The background color of a cell when the cell is hovered.
uk: Колір фону комірки, коли на комірку наведено курсор.

# notebook.cellInsertionIndicator
source: The color of the notebook cell insertion indicator.
uk: Колір індикатора вставки клітинки блокнота.

# notebook.cellStatusBarItemHoverBackground
source: The background color of notebook cell status bar items.
uk: Колір фону елементів панелі стану клітинок блокнота.

# notebook.cellToolbarSeparator
source: The color of the separator in the cell bottom toolbar
uk: Колір роздільника в нижній панелі інструментів комірки

# notebook.editorBackground
source: Notebook background color.
uk: Колір фону нотатника.

# notebook.focusedCellBorder
source: The color of the cell's focus indicator borders when the cell is focused.
uk: Колір меж індикатора фокусу комірки, коли комірка знаходиться у фокусі.
