Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_extensions.xlf
Languages: uk

source: Show Disabled Extensions
uk: Показати вимкнені розширення

source: Show Enabled Extensions
uk: Показати увімкнені розширення

# showExtensions
source: Extensions
uk: Розширення

source: Show Featured Extensions
uk: Показати рекомендовані розширення

# showLanguageExtensionsShort
source: Language Extensions
uk: Розширення мови

source: Show Popular Extensions
uk: Показати популярні розширення

source: Show Recommended Extensions
uk: Показати рекомендовані розширення

# showRecommendedKeymapExtensionsShort
source: Keymaps
uk: Клавіатурні мапи

# showWorkspaceUnsupportedExtensions
source: Show Extensions Unsupported By Workspace
uk: Показати розширення, які не підтримуються робочим простором

# sort by installs
source: Install Count
uk: Кількість встановлень

# sort by name
source: Name
uk: Ім'я

# sort by published date
source: Published Date
uk: Дата публікації

# sort by rating
source: Rating
uk: Рейтинг

# sort by update date
source: Updated Date
uk: Оновлена дата

# sorty by
source: Sort By
uk: Сортувати за

# trustedPublishers
source: Manage Trusted Extension Publishers
uk: Керувати надійними видавцями розширень

# trustedPublishersPlaceholder
source: Choose which publishers to trust
uk: Виберіть, яким видавцям довіряти

# updateAll
source: Update All Extensions
uk: Оновити всі розширення

# workbench.extensions.action.addExtensionToWorkspaceRecommendations
source: Add to Workspace Recommendations
uk: Додати до рекомендацій робочого простору

# workbench.extensions.action.addToWorkspaceFolderIgnoredRecommendations
source: Add Extension to Workspace Folder Ignored Recommendations
uk: Додати розширення до папки робочого простору ігнорованих рекомендацій

# workbench.extensions.action.addToWorkspaceFolderRecommendations
source: Add Extension to Workspace Folder Recommendations
uk: Додати розширення до рекомендацій папки робочого простору

# workbench.extensions.action.addToWorkspaceIgnoredRecommendations
source: Add Extension to Workspace Ignored Recommendations
uk: Додати розширення до ігнорованих рекомендацій робочого простору

# workbench.extensions.action.addToWorkspaceRecommendations
source: Add Extension to Workspace Recommendations
uk: Додати розширення до рекомендацій робочого простору

# workbench.extensions.action.changeAccountPreference
source: Account Preferences
uk: Налаштування облікового запису

# workbench.extensions.action.configure
source: Settings
uk: Налаштування

# workbench.extensions.action.configureKeybindings
source: Keyboard Shortcuts
uk: Гарячі клавіші

# workbench.extensions.action.copyExtension
source: Copy
uk: Копіювати

# workbench.extensions.action.copyExtensionId
source: Copy Extension ID
uk: Скопіювати ID розширення

# workbench.extensions.action.copyLink
source: Copy Link
uk: Скопіювати посилання

# workbench.extensions.action.ignoreRecommendation
source: Ignore Recommendation
uk: Ігнорувати рекомендацію

# workbench.extensions.action.manageTrustedPublishers
source: Manage Trusted Extension Publishers
uk: Керувати надійними видавцями розширень

# workbench.extensions.action.removeExtensionFromWorkspaceRecommendations
source: Remove from Workspace Recommendations
uk: Видалити з рекомендацій робочого простору

# workbench.extensions.action.toggleApplyToAllProfiles
source: Apply Extension to all Profiles
uk: Застосувати розширення до всіх профілів

# workbench.extensions.action.toggleIgnoreExtension
source: Sync This Extension
uk: Синхронізувати цей розширення

# workbench.extensions.action.undoIgnoredRecommendation
source: Undo Ignored Recommendation
uk: Скасувати проігноровану рекомендацію

# workbench.extensions.installExtension.arg.decription
source: Extension id or VSIX resource uri
uk: Ідентифікатор розширення або URI ресурсу VSIX

# workbench.extensions.installExtension.description
source: Install the given extension
uk: Встановіть вказане розширення

# workbench.extensions.installExtension.option.context
source: Context for the installation. This is a JSON object that can be used to pass any information to the installation handlers. i.e. `{skipWalkthrough: true}` will skip opening the walkthrough upon install.
uk: Контекст для встановлення. Це об'єкт JSON, який можна використовувати для передачі будь-якої інформації обробникам встановлення. Тобто, `{skipWalkthrough: true}` пропустить відкриття посібника під час встановлення.

# workbench.extensions.installExtension.option.donotSync
source: When enabled, VS Code do not sync this extension when Settings Sync is on.
uk: Коли увімкнено, VS Code не синхронізує цей розширення, коли синхронізація налаштувань увімкнена.

# workbench.extensions.installExtension.option.enable
source: When enabled, the extension will be enabled if it is installed but disabled. If the extension is already enabled, this has no effect.
uk: Коли увімкнено, розширення буде активоване, якщо воно встановлене, але вимкнене. Якщо розширення вже активоване, це не матиме жодного ефекту.

source: When enabled, VS Code installs only newly added extensions from the extension pack VSIX. This option is considered only while installing a VSIX.
uk: Коли увімкнено, VS Code встановлює лише нові додані розширення з пакету розширень VSIX. Ця опція враховується лише під час встановлення VSIX.

# workbench.extensions.installExtension.option.installPreReleaseVersion
source: When enabled, VS Code installs the pre-release version of the extension if available.
uk: Коли увімкнено, VS Code встановлює попередню версію розширення, якщо вона доступна.

# workbench.extensions.installExtension.option.justification
source: Justification for installing the extension. This is a string or an object that can be used to pass any information to the installation handlers. i.e. `{reason: 'This extension wants to open a URI', action: 'Open URI'}` will show a message box with the reason and action upon install.
uk: Обґрунтування для встановлення розширення. Це рядок або об'єкт, який можна використовувати для передачі будь-якої інформації обробникам встановлення. Тобто `{reason: 'Це розширення хоче відкрити URI', action: 'Відкрити URI'}` відобразить вікно повідомлення з причиною та дією під час встановлення.

# workbench.extensions.search.arg.name
source: Query to use in search
uk: Запит для використання в пошуку

# workbench.extensions.search.description
source: Search for a specific extension
uk: Шукати конкретне розширення

# workbench.extensions.uninstallExtension.arg.name
source: Id of the extension to uninstall
uk: Ідентифікатор розширення для видалення

# workbench.extensions.uninstallExtension.description
source: Uninstall the given extension
uk: Видаліть вказане розширення

# workspace unsupported filter
source: Workspace Unsupported
uk: Непідтримуване робоче середовище

# runtimeExtension
source: Running Extensions
uk: Запуск розширень

# Cannot be enabled
source: This extension is disabled because it is not supported in {0} for the Web.
uk: Цю розширення вимкнено, оскільки воно не підтримується в {0} для вебу.

# Defined to run in desktop
source: This extension is disabled because it is defined to run only in {0} for the Desktop.
uk: Цю розширення вимкнено, оскільки воно визначено для роботи лише в {0} для настільних комп'ютерів.

# Install in local server to enable
source: This extension is disabled in this workspace because it is defined to run in the Local Extension Host. Please install the extension locally to enable.
uk: Цей розширення вимкнено в цьому робочому просторі, оскільки воно визначено для роботи в локальному хості розширень. Будь ласка, встановіть розширення локально, щоб увімкнути.

# Install in remote server to enable
source: This extension is disabled in this workspace because it is defined to run in the Remote Extension Host. Please install the extension in '{0}' to enable.
uk: Цю розширення вимкнено в цьому робочому просторі, оскільки воно визначено для запуску в Remote Extension Host. Будь ласка, встановіть розширення в '{0}', щоб увімкнути.

# Install language pack also in remote server
source: Install the language pack extension on '{0}' to enable it there also.
uk: Встановіть розширення мовного пакета на '{0}', щоб увімкнути його там також.

# Install language pack also locally
source: Install the language pack extension locally to enable it there also.
uk: Встановіть розширення мовного пакета локально, щоб активувати його там також.

# OpenExtensionsFile.failed
source: Unable to create 'extensions.json' file inside the '.vscode' folder ({0}).
uk: Неможливо створити файл 'extensions.json' у папці '.vscode' ({0}).

# Show alternate extension
source: &&Open {0}
uk: &&Відкрити {0}

source: Uninstalling
uk: Видалення

# VS Code for Web
source: {0} for the Web
uk: {0} для вебу

# auto update message
source: Please [review the extension]({0}) and update it manually.
uk: Будь ласка, [перегляньте розширення]({0}) та оновіть його вручну.

# cannot be installed
source: The '{0}' extension is not available in {1}. Click 'More Information' to learn more.
uk: Розширення '{0}' недоступне в {1}. Натисніть 'Додаткова інформація', щоб дізнатися більше.

# check logs
source: Please check the [log]({0}) for more details.
uk: Будь ласка, перевірте [лог]({0}) для отримання додаткової інформації.

source: Close
uk: Закрити

# configure in settings
source: &&Configure Settings
uk: &&Налаштувати параметри

# configureWorkspaceFolderRecommendedExtensions
source: Configure Recommended Extensions (Workspace Folder)
uk: Налаштувати рекомендовані розширення (папка робочого простору)

# configureWorkspaceRecommendedExtensions
source: Configure Recommended Extensions (Workspace)
uk: Налаштувати рекомендовані розширення (робоча область)

source: current
uk: поточний

# dependencies
source: Show Dependencies
uk: Залежності

# deprecated message
source: This extension is deprecated as it is no longer being maintained.
uk: Ця розширення застаріле, оскільки більше не підтримується.

# deprecated tooltip
source: This extension is deprecated as it is no longer being maintained.
uk: Ця розширення застаріле, оскільки більше не підтримується.

# deprecated with alternate extension message
source: This extension is deprecated. Use the {0} extension instead.
uk: Ця розширення застаріле. Використовуйте замість цього розширення {0}.

# deprecated with alternate extension tooltip
source: This extension is deprecated. Use the {0} extension instead.
uk: Ця розширення застаріло. Використовуйте замість цього розширення {0}.

# deprecated with alternate settings message
source: This extension is deprecated as this functionality is now built-in to VS Code.
uk: Це розширення застаріле, оскільки ця функціональність тепер вбудована в VS Code.

# deprecated with alternate settings tooltip
source: This extension is deprecated as this functionality is now built-in to VS Code. Configure these {0} to use this functionality.
uk: Це розширення застаріле, оскільки ця функціональність тепер вбудована у VS Code. Налаштуйте ці {0}, щоб використовувати цю функціональність.

# disableAutoUpdate
source: Disabled auto updates for
uk: Вимкнути автоматичне оновлення для всіх розширень

# disableForWorkspaceAction
source: Disable (Workspace)
uk: Вимкнути (Робочий простір)

# disableForWorkspaceActionToolTip
source: Disable this extension only in this workspace
uk: Вимкніть це розширення лише в цьому робочому просторі

# disableGloballyAction
source: Disable
uk: Вимкнути

# disableGloballyActionToolTip
source: Disable this extension
uk: Вимкнути це розширення

source: Disabled
uk: Вимкнено

# disabled - not allowed
source: This extension is disabled because {0}
uk: Цю розширення вимкнено через {0}

# disabled because of virtual workspace
source: This extension has been disabled because it does not support virtual workspaces.
uk: Цю розширення було вимкнено, оскільки воно не підтримує віртуальні робочі простори.

# disabled by environment
source: This extension is disabled by the environment.
uk: Цю розширення вимкнено середовищем.

# do not sync
source: Do not sync this extension
uk: Не синхронізувати це розширення

# download
source: Try Downloading Manually...
uk: Спробуйте завантажити вручну...

# enableAutoUpdate
source: Enabled auto updates for
uk: Увімкнути автоматичне оновлення для всіх розширень

# enableAutoUpdateLabel
source: Auto Update
uk: Автооновлення

# enableForWorkspaceAction
source: Enable (Workspace)
uk: Увімкнути (Робочий простір)

# enableForWorkspaceActionToolTip
source: Enable this extension only in this workspace
uk: Увімкніть цей розширення лише в цьому робочому просторі

# enableGloballyAction
source: Enable
uk: Увімкнути

# enableGloballyActionToolTip
source: Enable this extension
uk: Увімкнути це розширення

source: Enabled
uk: Тільки увімкнені розширення

# enabled by environment
source: This extension is enabled because it is required in the current environment.
uk: Ця розширення увімкнено, оскільки воно необхідне в поточному середовищі.

# enabled in web worker
source: This extension is enabled in the Web Worker Extension Host because it prefers to run there.
uk: Ця розширення увімкнено в Web Worker Extension Host, оскільки воно надає перевагу виконанню там.

# enabled locally
source: This extension is enabled in the Local Extension Host because it prefers to run there.
uk: Ця розширення увімкнено в локальному хості розширень, оскільки воно надає перевагу запуску там.

# enabled remotely
source: This extension is enabled in the Remote Extension Host because it prefers to run there.
uk: Ця розширення увімкнено в Remote Extension Host, оскільки воно надає перевагу запуску там.

# extension disabled because of dependency
source: This extension depends on an extension that is disabled.
uk: Ця розширення залежить від розширення, яке вимкнено.

# extension disabled because of trust requirement
source: This extension has been disabled because the current workspace is not trusted.
uk: Цю розширення було вимкнено, оскільки поточне робоче середовище не є надійним.

# extension enabled on remote
source: Extension is enabled on '{0}'
uk: Розширення увімкнено на '{0}'

# extension limited because of trust requirement
source: This extension has limited features because the current workspace is not trusted.
uk: Ця розширення має обмежені функції, оскільки поточний робочий простір не є надійним.

# extension limited because of virtual workspace
source: This extension has limited features because the current workspace is virtual.
uk: Ця розширення має обмежені функції, оскільки поточне робоче середовище є віртуальним.

# extensionButtonBackground
source: Button background color for extension actions.
uk: Колір фону кнопки для дій розширення.

# extensionButtonForeground
source: Button foreground color for extension actions.
uk: Колір переднього плану кнопки для дій розширення.

# extensionButtonHoverBackground
source: Button background hover color for extension actions.
uk: Колір фону кнопки при наведенні для дій розширення.

# extensionButtonProminentBackground
source: Button background color for extension actions that stand out (e.g. install button).
uk: Колір фону кнопки для дій розширення, які виділяються (наприклад, кнопка встановлення).

# extensionButtonProminentForeground
source: Button foreground color for extension actions that stand out (e.g. install button).
uk: Колір переднього плану кнопки для дій розширення, які виділяються (наприклад, кнопка встановлення).

# extensionButtonProminentHoverBackground
source: Button background hover color for extension actions that stand out (e.g. install button).
uk: Колір фону кнопки при наведенні для дій розширення, які виділяються (наприклад, кнопка встановлення).

# extensionButtonSeparator
source: Button separator color for extension actions
uk: Колір роздільника кнопок для дій розширення

# finished installing
source: Successfully installed extensions.
uk: Розширення успішно встановлено.

# globally disabled
source: This extension is disabled globally by the user.
uk: Цю розширення глобально вимкнено користувачем.

# ignoreExtensionRecommendation
source: Do not recommend this extension again
uk: Не рекомендуйте це розширення знову

# ignoreExtensionUpdatePublisher
source: Ignoring updates published by {0}.
uk: Iгнорування оновлень, опублікованих {0}.

# ignored
source: This extension is ignored during sync
uk: Цей розширення ігнорується під час синхронізації

# install another version
source: Install Specific Version...
uk: Встановити конкретну версію...

source: Install Anyway
uk: Встановити все одно

# install browser
source: Install in Browser
uk: Встановити в браузері

# install confirmation
source: Are you sure you want to install '{0}'?
uk: Ви впевнені, що хочете встановити '{0}'?

# install donot verify
source: Install Anyway (Don't Verify Signature)
uk: Встановити все одно (Не перевіряти підпис)

# install in remote
source: Install in {0}
uk: Встановити на {0}

# install local extensions title
source: Install Local Extensions in '{0}'
uk: Встановити локальні розширення в '{0}'

source: Install Locally
uk: Встановити локально

# install operation
source: Error while installing '{0}' extension.
uk: Помилка під час встановлення розширення '{0}'.

source: Install Pre-Release
uk: Встановити попередню версію

source: Install Pre-Release Version
uk: Встановити версію попереднього випуску

source: Install Pre-Release
uk: Встановити попередню версію

# install previous version
source: Install Specific Version of Extension...
uk: Встановити конкретну версію розширення...

source: Install Release Version
uk: Встановити версію релізу

# install remote extensions
source: Install Remote Extensions Locally
uk: Встановити віддалені розширення локально

# install vsix
source: Once downloaded, please manually install the downloaded VSIX of '{0}'.
uk: Після завантаження, будь ласка, вручну встановіть завантажений VSIX '{0}'.

# install workspace version
source: Install Workspace Extension
uk: Встановити розширення Workspace

# installExtensionComplete
source: Installing extension {0} is completed.
uk: Встановлення розширення {0} завершено.

# installExtensionStart
source: Installing extension {0} started. An editor is now open with more details on this extension
uk: Встановлення розширення {0} розпочато. Тепер відкрито редактор з додатковими деталями про це розширення.

source: Install Recommended Extension
uk: Встановити рекомендоване розширення

# installVSIX
source: Install from VSIX...
uk: Встановити розширення VSIX

source: Installed
uk: Встановлено

source: Installing
uk: Встановлення

source: Installing Extensions...
uk: Встановлення розширень...

source: Learn More
uk: Дізнатися більше

# malicious tooltip
source: This extension was reported to be problematic.
uk: Цю розширення було визнано проблемним.

source: Manage
uk: Керувати

source: Manage Access
uk: Керувати доступом

source: Migrate
uk: Міграція

# migrate to
source: Migrate to {0}
uk: Міграція до {0}

# migrateExtension
source: Migrate
uk: Міграція

source: &&More Information
uk: &&Більше інформації

# no local extensions
source: There are no extensions to install.
uk: Немає розширень для встановлення.

# no versions
source: This extension has no other versions.
uk: Ця розширення не має інших версій.

# not signed
source: '{0}' is an extension from an unknown source. Are you sure you want to install?
uk: '{0}' є розширенням з невідомого джерела. Ви впевнені, що хочете встановити?

# not signed detail
source: Extension is not signed.
uk: Розширення не підписано.

# not signed tooltip
source: This extension is not signed by the Extension Marketplace.
uk: Ця розширення не підписано ринком розширень.

source: pre-release
uk: попередній реліз

source: Reload Window
uk: Перезавантажити вікно

source: Restart Extensions
uk: Перезапустити розширення

# restart product
source: Restart to Update
uk: Перезавантажити для оновлення

source: Review
uk: Огляд

# select and install local extensions
source: Install Local Extensions in '{0}'...
uk: Встановити локальні розширення в '{0}'...

# select and install remote extensions
source: Install Remote Extensions Locally...
uk: Встановити віддалені розширення локально...

source: Select Color Theme
uk: Виберіть кольорову тему

source: Select extensions to install
uk: Виберіть розширення для встановлення

source: Select File Icon Theme
uk: Виберіть тему значків файлів

source: Select Product Icon Theme
uk: Виберіть тему значка продукту

source: Select Extension
uk: Вибрати розширення

# selectVersion
source: Select Version to Install
uk: Виберіть версію для встановлення

source: settings
uk: налаштування

source: Show Recommended Extension
uk: Показати рекомендоване розширення

# switchToPreReleaseLabel
source: Switch to Pre-Release Version
uk: Перейти на версію попереднього випуску

# switchToPreReleaseTooltip
source: This will switch to pre-release version and enable updates to latest version always
uk: Це переключить на версію перед випуском і завжди дозволить оновлення до останньої версії

# sync
source: Sync this extension
uk: Синхронізувати це розширення

# synced
source: This extension is synced
uk: Цей розширення синхронізовано

# toggleAutoUpdatesForPublisherLabel
source: Auto Update All (From Publisher)
uk: Автоматичне оновлення всіх (від видавця)

# togglePreRleaseDisableLabel
source: Switch to Release Version
uk: Переключитися на версію релізу

# togglePreRleaseDisableTooltip
source: This will switch and enable updates to release versions
uk: Це перемкне та увімкне оновлення до версій випуску

# togglePreRleaseLabel
source: Pre-Release
uk: Передвипуск

source: Undo
uk: Скасувати

# uninstallAction
source: Uninstall
uk: Видалити

# uninstallExtensionComplete
source: Please reload Visual Studio Code to complete the uninstallation of the extension {0}.
uk: Будь ласка, перезавантажте Visual Studio Code, щоб завершити видалення розширення {0}.

# uninstallExtensionStart
source: Uninstalling extension {0} started.
uk: Видалення розширення {0} розпочато.

source: Uninstalled
uk: Видалено

source: Update
uk: Оновити

# update operation
source: Error while updating '{0}' extension.
uk: Помилка під час оновлення розширення '{0}'.

# update product
source: Update {0}
uk: Оновити {0}

# update to
source: Update to v{0}
uk: Оновити до v{0}

# updateExtensionComplete
source: Updating extension {0} to version {1} completed.
uk: Оновлення розширення {0} до версії {1} завершено.

# updateExtensionConsent
source: {0} Would you like to update the extension?
uk: {0} Чи хочете ви оновити розширення?

# updateExtensionConsentTitle
source: Update {0} Extension
uk: Оновити {0} Розширення

# updateExtensionStart
source: Updating extension {0} to version {1} started.
uk: Оновлення розширення {0} до версії {1} розпочато.

source: Updated
uk: Оновлено

# verification failed
source: Cannot install '{0}' extension because {1} cannot verify the extension signature
uk: Не вдалося встановити розширення '{0}', оскільки {1} не може перевірити підпис розширення

# workbench.extensions.action.clearLanguage
source: Clear Display Language
uk: Очистити мову відображення

# workbench.extensions.action.setColorTheme
source: Set Color Theme
uk: Встановити кольорову тему

# workbench.extensions.action.setDisplayLanguage
source: Set Display Language
uk: Встановити мову відображення

# workbench.extensions.action.setFileIconTheme
source: Set File Icon Theme
uk: Встановити тему значків файлів

# workbench.extensions.action.setProductIconTheme
source: Set Product Icon Theme
uk: Встановити тему значка продукту

# workspace disabled
source: This extension is disabled for this workspace by the user.
uk: Цю розширення вимкнено для цього робочого простору користувачем.

# workspace enabled
source: This extension is enabled for this workspace by the user.
uk: Цю розширення активовано для цього робочого простору користувачем.

# activation
source: Activating Extensions...
uk: Активація
