Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_chat.xlf
Languages: uk

# chat.category
source: Chat
uk: Чат

# chatNotReady
source: Chat interface not ready.
uk: Інтерфейс чату не готовий.

source: Focus Chat Confirmation
uk: Підтвердження чату з фокусом

# noChatSession
source: No active chat session found.
uk: Не знайдено активну сесію чату.

# noConfirmationRequired
source: No chat confirmation required
uk: Необхідне підтвердження чату

# chat.announcement
source: Chat responses will be announced as they come in. A response will indicate the number of code blocks, if any, and then the rest of the response.
uk: Відповіді чату будуть оголошені по мірі їх надходження. Відповідь вказуватиме кількість блоків коду, якщо такі є, а потім решту відповіді.

# chat.differencePanel
source: The panel chat view is a persistent interface that also supports navigating suggested follow-up questions, while the quick chat view is a transient interface for making and viewing requests.
uk: Перегляд панельного чату є постійним інтерфейсом, який також підтримує навігацію по запропонованих запитаннях для подальшого обговорення, тоді як швидкий перегляд чату є тимчасовим інтерфейсом для створення та перегляду запитів.

# chat.differenceQuick
source: The quick chat view is a transient interface for making and viewing requests, while the panel chat view is a persistent interface that also supports navigating suggested follow-up questions.
uk: Швидкий перегляд чату є тимчасовим інтерфейсом для створення та перегляду запитів, тоді як панельний перегляд чату є постійним інтерфейсом, який також підтримує навігацію по запропонованих запитаннях для подальшого обговорення.

# chat.followUp
source: In the input box, navigate to the suggested follow up question (Shift+Tab) and press Enter to run it.
uk: У полі введення перейдіть до запропонованого запитання для подальшого обговорення (Shift+Tab) і натисніть Enter, щоб виконати його.

# chat.inspectResponse
source: In the input box, inspect the last response in the accessible view{0}.
uk: У полі вводу перегляньте останню відповідь у доступному вигляді{0}.

# chat.overview
source: The quick chat view is comprised of an input box and a request/response list. The input box is used to make requests and the list is used to display responses.
uk: Швидкий перегляд чату складається з поля вводу та списку запитів/відповідей. Поле вводу використовується для надсилання запитів, а список - для відображення відповідей.

# chat.requestHistory
source: In the input box, use up and down arrows to navigate your request history. Edit input and use enter or the submit button to run a new request.
uk: У полі введення використовуйте стрілки вгору та вниз, щоб переміщатися по історії запитів. Редагуйте введене та використовуйте клавішу enter або кнопку відправлення, щоб виконати новий запит.

# chat.signals
source: Accessibility Signals can be changed via settings with a prefix of signals.chat. By default, if a request takes more than 4 seconds, you will hear a sound indicating that progress is still occurring.
uk: Сигнали доступності можна змінити через налаштування з префіксом signals.chat. За замовчуванням, якщо запит триває більше 4 секунд, ви почуєте звук, що вказує на те, що процес все ще триває.

# chatAgent.acceptTool
source: To accept a tool action, use the Accept Tool Confirmation command{0}.
uk: Щоб прийняти дію інструмента, використовуйте команду Підтвердження прийняття інструмента{0}.

# chatAgent.autoApprove
source: To automatically approve tool actions without manual confirmation, set chat.tools.autoApprove to true in your settings.
uk: Щоб автоматично схвалювати дії інструментів без ручного підтвердження, встановіть chat.tools.autoApprove на true у ваших налаштуваннях.

# chatAgent.openEditedFilesSetting
source: By default, when edits are made to files, they will be opened. To change this behavior, set accessibility.openChatEditedFiles to false in your settings.
uk: За замовчуванням, коли вносяться зміни до файлів, вони будуть відкриті. Щоб змінити цю поведінку, встановіть accessibility.openChatEditedFiles на false у ваших налаштуваннях.

# chatAgent.overview
source: The chat agent view is used to apply edits across files in your workspace, enable running commands in the terminal, and more.
uk: Перегляд агента чату використовується для внесення змін у файли вашого робочого простору, дозволяє виконувати команди в терміналі та багато іншого.

# chatAgent.runCommand
source: To take the action, use the accept tool command{0}.
uk: Щоб виконати дію, використайте команду інструмента прийняття{0}.

# chatAgent.userActionRequired
source: An alert will indicate when user action is required. For example, if the agent wants to run something in the terminal, you will hear Action Required: Run Command in Terminal.
uk: Сповіщення вказуватиме, коли потрібна дія користувача. Наприклад, якщо агент хоче виконати щось у терміналі, ви почуєте: Дія потрібна: Виконати команду в терміналі.

# chatEditing.acceptAllFiles
source: - Keep All Edits{0}.
uk: - Зберегти всі зміни{0}.

# chatEditing.acceptFile
source: - Keep{0} and Undo File{1}.
uk: - Зберегти{0} та скасувати файл{1}.

# chatEditing.acceptHunk
source: In the editor, Keep{0}, Undo{1}, or Toggle the Diff{2} for the current Change.
uk: У редакторі збережіть{0}, скасуйте{1} або перемикайте різницю{2} для поточної зміни.

# chatEditing.discardAllFiles
source: - Undo All Edits{0}.
uk: - Скасувати всі редагування{0}.

# chatEditing.expectation
source: When a request is made, a progress indicator will play while the edits are being applied.
uk: Коли запит буде надіслано, індикатор прогресу буде відображатися під час застосування змін.

# chatEditing.format
source: It is comprised of an input box and a file working set (Shift+Tab).
uk: Він складається з поля введення та робочого набору файлів (Shift+Tab).

# chatEditing.helpfulCommands
source: Some helpful commands include:
uk: Деякі корисні команди включають:

# chatEditing.openFileInDiff
source: - Open File in Diff{0}.
uk: - Відкрити файл у Diff{0}.

# chatEditing.overview
source: The chat editing view is used to apply edits across files.
uk: Перегляд редагування чату використовується для застосування змін у файлах.

# chatEditing.removeFileFromWorkingSet
source: - Remove File from Working Set{0}.
uk: - Видалити файл з робочого набору{0}.

# chatEditing.review
source: Once the edits are applied, a sound will play to indicate the document has been opened and is ready for review. The sound can be disabled with accessibility.signals.chatEditModifiedFile.
uk: Після застосування редагувань програється звук, щоб вказати, що документ відкрито і готовий до перегляду. Звук можна вимкнути за допомогою accessibility.signals.chatEditModifiedFile.

# chatEditing.saveAllFiles
source: - Save All Files{0}.
uk: - Зберегти всі файли{0}.

# chatEditing.sections
source: Navigate between edits in the editor with navigate previous{0} and next{1}
uk: Переміщуйтеся між редагуваннями в редакторі за допомогою navigate previous{0} та next{1}

# chatEditing.undoKeepSounds
source: Sounds will play when a change is accepted or undone. The sounds can be disabled with accessibility.signals.editsKept and accessibility.signals.editsUndone.
uk: Звуки відтворюватимуться, коли зміна буде прийнята або скасована. Звуки можна вимкнути за допомогою accessibility.signals.editsKept та accessibility.signals.editsUndone.

# chatEditing.viewChanges
source: - View Changes{0}.
uk: - Переглянути зміни{0}.

# chatEditing.viewPreviousEdits
source: - View Previous Edits{0}.
uk: - Переглянути попередні редагування{0}.

# inlineChat.access
source: It can be activated via code actions or directly using the command: Inline Chat: Start Inline Chat{0}.
uk: Його можна активувати за допомогою кодових дій або безпосередньо, використовуючи команду: Inline Chat: Start Inline Chat{0}.

# inlineChat.contextActions
source: Context menu actions may run a request prefixed with a /. Type / to discover such ready-made commands.
uk: Дії контекстного меню можуть виконувати запит, що починається з /. Введіть /, щоб знайти такі готові команди.

# inlineChat.diff
source: Once in the diff editor, enter review mode with{0}. Use up and down arrows to navigate lines with the proposed changes.
uk: Опинившись у редакторі відмінностей, увійдіть у режим огляду з {0}. Використовуйте стрілки вгору та вниз для навігації по рядках з запропонованими змінами.

# inlineChat.fix
source: If a fix action is invoked, a response will indicate the problem with the current code. A diff editor will be rendered and can be reached by tabbing.
uk: Якщо буде викликано дію виправлення, відповідь вказуватиме на проблему з поточним кодом. Буде відображено редактор порівняння, до якого можна дістатися за допомогою клавіші Tab.

# inlineChat.inspectResponse
source: In the input box, inspect the response in the accessible view{0}.
uk: У полі введення перевірте відповідь у доступному вигляді{0}.

# inlineChat.overview
source: Inline chat occurs within a code editor and takes into account the current selection. It is useful for making changes to the current editor. For example, fixing diagnostics, documenting or refactoring code. Keep in mind that AI generated code may be incorrect.
uk: Вбудований чат відбувається в редакторі коду і враховує поточний вибір. Це корисно для внесення змін до поточного редактора. Наприклад, для виправлення діагностики, документування або рефакторингу коду. Майте на увазі, що код, згенерований ШІ, може бути неправильним.

# inlineChat.requestHistory
source: In the input box, use Show Previous{0} and Show Next{1} to navigate your request history. Edit input and use enter or the submit button to run a new request.
uk: У полі введення використовуйте Show Previous{0} та Show Next{1} для навігації в історії запитів. Відредагуйте введення та натисніть enter або кнопку відправлення, щоб виконати новий запит.

# inlineChat.toolbar
source: Use tab to reach conditional parts like commands, status, message responses and more.
uk: Використовуйте табуляцію, щоб перейти до умовних частин, таких як команди, статус, відповіді на повідомлення та інше.

# workbench.action.chat.announceConfirmation
source: To focus pending chat confirmation dialogs, invoke the Focus Chat Confirmation Status command{0}.
uk: Щоб зосередити діалоги підтвердження чату, викличте команду Focus Chat Confirmation Status{0}.

# workbench.action.chat.editing.attachFiles
source: - Attach Files{0}.
uk: - Прикріпити файли{0}.

# workbench.action.chat.focus
source: To focus the chat request/response list, which can be navigated with up and down arrows, invoke the Focus Chat command{0}.
uk: Щоб зосередити список запитів/відповідей чату, яким можна керувати за допомогою стрілок вгору та вниз, викличте команду Зосередити чат{0}.

# workbench.action.chat.focusInput
source: To focus the input box for chat requests, invoke the Focus Chat Input command{0}.
uk: Щоб зосередити поле вводу для запитів чату, виконайте команду Зосередити ввід чату{0}.

# workbench.action.chat.newChat
source: To create a new chat session, invoke the New Chat command{0}.
uk: Щоб створити нову сесію чату, виконайте команду Новий чат{0}.

# workbench.action.chat.nextCodeBlock
source: To focus the next code block within a response, invoke the Chat: Next Code Block command{0}.
uk: Щоб зосередити наступний кодовий блок у відповіді, викличте команду Chat: Next Code Block{0}.

# workbench.action.chat.undoEdits
source: - Undo Edits{0}.
uk: - Скасувати зміни{0}.

# actions.interactiveSession.focus
source: Focus Chat List
uk: Список чатів фокусу

# agent.newSession
source: Start new session?
uk: Почати нову сесію?

# agent.newSession.confirm
source: Yes
uk: Так

# agent.newSessionMessage
source: Changing the chat mode will end your current edit session. Would you like to change the chat mode?
uk: Зміна режиму чату завершить вашу поточну сесію редагування. Ви хочете змінити режим чату?

# ai actions
source: Generate Code
uk: Генерувати код

# chat.clear.label
source: Clear All Workspace Chats
uk: Очистити всі чати робочого простору

# chat.editToolApproval.label
source: Edit Tool Approval
uk: Редагувати затвердження інструменту

# chat.editToolApproval.title
source: Approval setting for {0}
uk: Налаштування затвердження для {0}

# chat.history.label
source: Show Chats...
uk: Показати чати...

# chat.history.recent
source: Recent Chats
uk: Останні чати

# chat.history.rename
source: Rename
uk: Перейменувати

# chat.history.showMore
source: Show more...
uk: Показати більше...

# chat.history.showMoreAgents
source: Show more...
uk: Показати більше...

# chat.openNewChatToTheSide.label
source: Open New Chat Editor to the Side
uk: Відкрити новий редактор чату збоку

# chat.toggleDefaultVisibility.label
source: Show View by Default
uk: Показати вигляд за замовчуванням

# chat.toolApproval.manual
source: Always require manual approval
uk: Завжди вимагати ручного затвердження

# chat.toolApproval.profile
source: Auto-approve globally
uk: Авто-схвалення глобально

# chat.toolApproval.session
source: Auto-approve for this session
uk: Автоматичне схвалення для цієї сесії

# chat.toolApproval.workspace
source: Auto-approve for this workspace
uk: Авто-схвалення для цього робочого простору

# chatAndCompletionsQuotaExceeded
source: You've reached your monthly chat messages and code completions quota.
uk: Ви досягли свого місячного ліміту на чат-повідомлення та завершення коду.

# chatQuotaExceeded
source: You've reached your monthly chat messages quota. You still have free code completions available.
uk: Ви досягли свого місячного ліміту на повідомлення в чаті. У вас ще є безкоштовні завершення коду.

# chatQuotaExceededButton
source: Copilot Free plan chat messages quota reached. Click for details.
uk: Досягнуто квоти повідомлень чату безкоштовного плану Copilot. Натисніть для деталей.

# chatSessions.newChatInSideBar
source: Open New Chat in Side Bar
uk: Відкрити новий чат у бічній панелі

# chatSessions.openNewChatInNewWindow
source: Open New Chat in New Window
uk: Відкрити новий чат у новому вікні

# chatWith
source: Chat with Extension
uk: Чат з Розширенням

# completionsQuotaExceeded
source: You've reached your monthly code completions quota. You still have free chat messages available.
uk: Ви досягли своєї місячної квоти завершень коду. У вас ще є безкоштовні повідомлення для чату.

# config.label
source: Configure Chat...
uk: Налаштувати чат...

# configureCompletions
source: Configure Code Completions...
uk: Налаштувати завершення коду...

source: Copilot Quota Reached
uk: Досягнуто квоти Copilot

# currentChatLabel
source: current
uk: поточний

source: Dismiss
uk: Відхилити

# generateInstructions
source: Generate Workspace Instructions File
uk: Згенерувати файл інструкцій робочого простору

# generateInstructions.short
source: Generate Instructions
uk: Згенерувати інструкції

# interactiveSession.clearHistory.label
source: Clear Input History
uk: Очистити історію введення

# interactiveSession.focusInput.label
source: Focus Chat Input
uk: Фокус вводу чату

# interactiveSession.history.clear
source: Clear All Workspace Chats
uk: Очистити всі чати робочого простору

# interactiveSession.history.delete
source: Delete
uk: Видалити

# interactiveSession.history.editor
source: Open in Editor
uk: Відкрити в редакторі

# interactiveSession.history.pick
source: Switch to chat
uk: Перейти до чату

# interactiveSession.history.title
source: Workspace Chat History
uk: Історія чату робочого простору

# interactiveSession.history.titleAll
source: All Workspace Chat History
uk: Вся історія чатів робочого простору

# interactiveSession.open
source: New Chat Editor
uk: Новий редактор чату

# manageCopilot
source: Manage Chat
uk: Керувати чатом

source: More...
uk: Більше...

source: New chat title
uk: Новий заголовок чату

source: Open Chat
uk: Відкрити чат

# openChatFeatureSettings
source: Chat Settings
uk: Налаштування чату

# openChatFeatureSettings.short
source: Chat Settings
uk: Налаштування чату

# openChatMode
source: Open Chat ({0})
uk: Відкрити чат ({0})

# quotaResetDate
source: The allowance will reset on {0}.
uk: Допомога буде скинута на {0}.

# resetTrustedTools
source: Reset Tool Confirmations
uk: Скидання підтверджень інструментів

# resetTrustedToolsSuccess
source: Tool confirmation preferences have been reset.
uk: Налаштування підтвердження інструментів було скинуто.

# showCopilotUsageExtensions
source: Show Extensions using Copilot
uk: Показати розширення за допомогою Copilot

# signInToChatSetup
source: Sign in to use Copilot...
uk: Увійдіть, щоб використовувати Copilot...

# switchChat.confirmPhrase
source: Switching chats will end your current edit session.
uk: Переключення чатів завершить вашу поточну сесію редагування.

# switchMode.confirmPhrase
source: Switching chat modes will end your current edit session.
uk: Переключення режимів чату завершить вашу поточну сесію редагування.

# title4
source: Copilot
uk: Копілот

# toggle.chatControl
source: Chat Controls
uk: Чат-контролі

# toggle.chatControlsDescription
source: Toggle visibility of the Chat Controls in title bar
uk: Перемикати видимість елементів управління чатом у заголовку.

source: Toggle Chat
uk: Переключити чат

# upgradeChat
source: Upgrade Copilot Plan
uk: Оновити план Copilot

# upgradePlan
source: Upgrade Copilot Plan
uk: Оновити план Copilot

# upgradePro
source: Upgrade to Copilot Pro
uk: Оновити до Copilot Pro

# upgradeToPro
source: Upgrade to Copilot Pro (your first 30 days are free) for: - Unlimited code completions - Unlimited chat messages - Access to premium models
uk: Оновіть до Copilot Pro (перші 30 днів безкоштовно) для: - Безмежних завершень коду - Безмежних повідомлень у чаті - Доступу до преміум моделей

# chat.newChat.label
source: New Chat
uk: Новий чат

# chat.newEdits.label
source: New Chat
uk: Новий чат

# chat.redoEdit.label
source: Redo Last Request
uk: Повторити останній запит

# chat.redoEdit.label2
source: Redo
uk: Переробити

# chat.redoEdit.tooltip
source: Reapply discarded workspace changes and chat
uk: Повторно застосувати скасовані зміни робочого простору та чат

# chat.undoEdit.label
source: Undo Last Request
uk: Скасувати останній запит

# interactive.applyInEditor.label
source: Apply in Editor
uk: Застосувати в редакторі

# interactive.applyInEditorWithURL.label
source: Apply to {0}
uk: Подати заявку на {0}

# interactive.compare.apply
source: Apply Edits
uk: Застосувати зміни

# interactive.compare.discard
source: Discard Edits
uk: Відкинути зміни

# interactive.copyCodeBlock.label
source: Copy
uk: Копіювати

# interactive.insertCodeBlock.label
source: Insert At Cursor
uk: Вставити в курсор

# interactive.insertIntoNewFile.label
source: Insert into New File
uk: Вставити в новий файл

# interactive.nextCodeBlock.label
source: Next Code Block
uk: Наступний кодовий блок

# interactive.previousCodeBlock.label
source: Previous Code Block
uk: Попередній блок коду

# interactive.runInTerminal.label
source: Insert into Terminal
uk: Вставити в Терминал

# chatContext.attachScreenshot.labelElectron.Window
source: Screenshot Window
uk: Скріншот вікна

# chatContext.attachScreenshot.labelWeb
source: Screenshot
uk: Скріншот

# chatContext.editors
source: Open Editors
uk: Відкриті редактори

# chatContext.relatedFiles
source: Related Files
uk: Супутні файли

# chatContext.tools
source: Tools...
uk: Інструменти...

# chatContext.tools.placeholder
source: Select a tool
uk: Виберіть інструмент

source: Image from Clipboard
uk: Зображення з буфера обміну

source: Pasted Image
uk: Вставлене зображення

# relatedFiles
source: Add related files to your working set
uk: Додайте пов'язані файли до вашого робочого набору

# chat.insertSearchResults
source: Add Search Results to Chat
uk: Додати результати пошуку до чату

# chatContext.attach.placeholder
source: Search attachments
uk: Шукати вкладення

source: Go back ↩
uk: Повернутися ↩

# workbench.action.chat.attachContext.label.2
source: Add Context...
uk: Додати контекст...

# workbench.action.chat.attachFile.label
source: Add File to Chat
uk: Додати файл до чату

# workbench.action.chat.attachFolder.label
source: Add Folder to Chat
uk: Додати папку до чату

# workbench.action.chat.attachSelection.label
source: Add Selection to Chat
uk: Додати вибір до чату

# interactive.copyAll.label
source: Copy All
uk: Копіювати все

# interactive.copyItem.label
source: Copy
uk: Копіювати

# workbench.action.chat.logChatIndex.label
source: Log Chat Index
uk: Журнал індексу чату

# workbench.action.chat.logInputHistory.label
source: Log Chat Input History
uk: Журнал історії введення чату

# actions.chat.createRemoteJob
source: Delegate to Coding Agent
uk: Делегувати кодувальному агенту

# actions.chat.submitWithCodebase
source: Send with {0}
uk: Відправити з {0}

source: Analyzing chat history
uk: Аналіз історії чату

# chat.newChat.label
source: Send to New Chat
uk: Новий чат

# chat.remove.confirmation.checkbox
source: Don't ask again
uk: Не питай знову

# chat.remove.confirmation.message2
source: This will remove all subsequent requests and undo edits made to {0}. Do you want to proceed?
uk: Це видалить всі наступні запити та скасує редагування, зроблені до {0}. Ви хочете продовжити?

# chat.remove.confirmation.multipleEdits.message
source: This will remove all subsequent requests and undo edits made to {0} files in your working set. Do you want to proceed?
uk: Це видалить усі наступні запити та скасує зміни, внесені до {0} файлів у вашому робочому наборі. Ви хочете продовжити?

# chat.remove.confirmation.primaryButton
source: Yes
uk: Так

# chat.remove.confirmation.title
source: Do you want to undo {0} edits?
uk: Ви хочете скасувати {0} редагувань?

# chat.removeLast.confirmation.message2
source: This will remove your last request and undo the edits made to {0}. Do you want to proceed?
uk: Це видалить ваш останній запит і скасує зміни, внесені до {0}. Ви хочете продовжити?

# chat.removeLast.confirmation.multipleEdits.message
source: This will remove your last request and undo edits made to {0} files in your working set. Do you want to proceed?
uk: Це видалить ваш останній запит і скасує зміни, внесені до {0} файлів у вашому робочому наборі. Ви хочете продовжити?

# chat.removeLast.confirmation.title
source: Do you want to undo your last edit?
uk: Ви хочете скасувати останнє редагування?

# creatingRemoteJob
source: Delegating to coding agent
uk: Делегування кодувальному агенту

# edits.submit.label
source: Send
uk: Надіслати

# interactive.cancel.label
source: Cancel
uk: Скасувати

# interactive.cancelEdit.label
source: Cancel Edit
uk: Скасувати редагування

# interactive.changeModel.label
source: Change Model
uk: Змінити модель

# interactive.openModePicker.label
source: Open Mode Picker
uk: Відкрити вибір режиму

# interactive.openModelPicker.label
source: Open Model Picker
uk: Відкрити вибір моделі

# interactive.submit.label
source: Send and Dispatch
uk: Відправити та Доставити

# interactive.submitWithoutDispatch.label
source: Send
uk: Відправити

# interactive.switchToNextModel.label
source: Switch to Next Model
uk: Перемкнути на наступну модель

# interactive.toggleAgent.label
source: Set Chat Mode
uk: Встановити режим чату

# remoteAgentError
source: Coding agent session cancelled.
uk: Сесію агента кодування скасовано.

# remoteAgentResponse
source: Coding agent response: {0}
uk: Відповідь агента кодування: {0}

# remoteAgentResponse2
source: Your work will be continued in this pull request.
uk: Ваша робота буде продовжена в цьому запиті на злиття.

# remoteJobCreating
source: Delegating to Coding Agent
uk: Делегування до Кодового Агента

source: Select Coding Agent
uk: Виберіть Кодуючого Агента

# sendToRemoteAgent
source: Send to coding agent
uk: Відправити кодувальному агенту

# setChatMode
source: Set Mode
uk: Встановити режим

# interactive.nextFileTree.label
source: Next File Tree
uk: Наступне дерево файлів
