Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_workingCopy.xlf
Languages: uk

# confirmMakeWriteable
source: '{0}' is marked as read-only. Do you want to save anyway?
uk: '{0}' позначено як тільки для читання. Ви все ж хочете зберегти?

# confirmMakeWriteableDetail
source: Paths can be configured as read-only via settings.
uk: Шляхи можна налаштувати як тільки для читання через налаштування.

# confirmOverwrite
source: '{0}' already exists. Do you want to replace it?
uk: '{0}' вже існує. Ви хочете його замінити?

source: Deleted
uk: Видалено

# fileWorkingCopyCreate.source
source: File Created
uk: Файл створено

source: File Working Copy Decorations
uk: Файл Декорації Робочої Копії

# fileWorkingCopyReplace.source
source: File Replaced
uk: Файл замінено

# makeWriteableButtonLabel
source: &&Save Anyway
uk: &&Зберегти в будь-якому випадку

# overwriteIrreversible
source: A file or folder with the name '{0}' already exists in the folder '{1}'. Replacing it will overwrite its current contents.
uk: Файл або папка з назвою '{0}' вже існує в папці '{1}'. Замінюючи його, ви перезапишете його поточний вміст.

source: Read-only
uk: Тільки для читання

# readonlyAndDeleted
source: Deleted, Read-only
uk: Видалено, Тільки для читання

# replaceButtonLabel
source: &&Replace
uk: &&Замінити

# genericSaveError
source: Failed to save '{0}': {1}
uk: Не вдалося зберегти '{0}': {1}

source: Overwrite
uk: Перезаписати

# overwriteElevated
source: Overwrite as Admin...
uk: Перезаписати як адміністратор...

# overwriteElevatedSudo
source: Overwrite as Sudo...
uk: Перезаписати як Sudo...

# permissionDeniedSaveError
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': Недостатньо прав. Виберіть 'Спробувати знову як адміністратор', щоб спробувати ще раз від імені адміністратора.

# permissionDeniedSaveErrorSudo
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Sudo' to retry as superuser.
uk: Не вдалося зберегти '{0}': Недостатньо прав. Виберіть 'Спробувати знову як Sudo', щоб спробувати ще раз як суперкористувач.

# readonlySaveError
source: Failed to save '{0}': File is read-only. Select 'Overwrite' to attempt to make it writeable.
uk: Не вдалося зберегти '{0}': Файл є тільки для читання. Виберіть 'Перезаписати', щоб спробувати зробити його записуваним.

# readonlySaveErrorAdmin
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': Файл доступний лише для читання. Виберіть 'Перезаписати як адміністратор', щоб спробувати ще раз як адміністратор.

# readonlySaveErrorSudo
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Sudo' to retry as superuser.
uk: Не вдалося зберегти '{0}': Файл доступний лише для читання. Виберіть 'Перезаписати як Sudo', щоб повторити спробу як суперкористувач.

source: Retry
uk: Спробувати ще раз

source: Revert
uk: Повернутися

source: Save As...
uk: Зберегти як...

# saveElevated
source: Retry as Admin...
uk: Спробувати ще раз як адміністратор...

# saveElevatedSudo
source: Retry as Sudo...
uk: Спробуйте ще раз як Sudo...

# saveParticipants
source: Saving '{0}'
uk: Збереження '{0}'

# saveTextFile
source: Writing into file...
uk: Запис у файл...

# staleSaveError
source: Failed to save '{0}': The content of the file is newer. Do you want to overwrite the file with your changes?
uk: Не вдалося зберегти '{0}': Вміст файлу новіший. Ви хочете перезаписати файл своїми змінами?

# join.fileWorkingCopyManager
source: Saving working copies
uk: Збереження робочих копій

# saveParticipants1
source: Running Code Actions and Formatters...
uk: Виконання дій коду та форматувальників...

source: Skip
uk: Пропустити

# default.source
source: File Saved
uk: Файл збережено

# join.workingCopyHistory
source: Saving local history
uk: Збереження місцевої історії

# moved.source
source: File Moved
uk: Файл переміщено

# renamed.source
source: File Renamed
uk: Файл перейменовано

# undoRedo.source
source: Undo / Redo
uk: Скасувати / Повторити

# join.workingCopyBackups
source: Backup working copies
uk: Резервне копіювання робочих копій

# backupBeforeShutdownDetail
source: Click 'Cancel' to stop waiting and to save or revert editors with unsaved changes.
uk: Натисніть 'Скасувати', щоб припинити очікування та зберегти або скасувати редактори з незбереженими змінами.

# backupBeforeShutdownMessage
source: Backing up editors with unsaved changes is taking a bit longer...
uk: Резервне копіювання редакторів з незбереженими змінами займає трохи більше часу...

# backupErrorDetails
source: Try saving or reverting the editors with unsaved changes first and then try again.
uk: Спробуйте спочатку зберегти або скасувати редагування з незбереженими змінами, а потім спробуйте ще раз.

# backupTrackerBackupFailed
source: The following editors with unsaved changes could not be saved to the backup location.
uk: Наступні редактори з незбереженими змінами не змогли бути збережені в резервному місці.

# backupTrackerConfirmFailed
source: The following editors with unsaved changes could not be saved or reverted.
uk: Наступні редактори з незбереженими змінами не можуть бути збережені або скасовані.

# discardBackupsBeforeShutdown
source: Discarding backups is taking a bit longer...
uk: Видалення резервних копій займає трохи більше часу...

source: &&OK
uk: &&Готово

# revertBeforeShutdown
source: Reverting editors with unsaved changes is taking a bit longer...
uk: Повернення редакторів з незбереженими змінами займає трохи більше часу...

# saveBeforeShutdown
source: Saving editors with unsaved changes is taking a bit longer...
uk: Збереження редакторів з незбереженими змінами займає трохи більше часу...

# shutdownForceClose
source: Close Anyway
uk: Закрити все одно

# shutdownForceQuit
source: Quit Anyway
uk: Залишити все одно

# shutdownForceReload
source: Reload Anyway
uk: Перезавантажити все одно
