Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_debug.xlf
Languages: uk

# showBreakpointsInOverviewRuler
source: Controls whether breakpoints should be shown in the overview ruler.
uk: Контролює, чи повинні бути показані точки зупинки в оглядовій лінійці.

# showErrors
source: Show the Problems view and do not start debugging.
uk: Показати перегляд Проблем і не починати налагодження.

# showInStatusBar
source: Controls when the debug Status bar should be visible.
uk: Контролює, коли панель стану налагодження повинна бути видимою.

# showInlineBreakpointCandidates
source: Controls whether inline breakpoints candidate decorations should be shown in the editor while debugging.
uk: Контролює, чи слід показувати кандидатні декорації для вбудованих точок зупинки в редакторі під час налагодження.

# showSubSessionsInToolBar
source: Controls whether the debug sub-sessions are shown in the debug tool bar. When this setting is false the stop command on a sub-session will also stop the parent session.
uk: Контролює, чи відображаються підсесії налагодження в панелі інструментів налагодження. Коли це налаштування є хибним, команда зупинки на підсесії також зупинить батьківську сесію.

# showVariableTypes
source: Show variable type in variable pane during debug session
uk: Показати тип змінної в панелі змінних під час сеансу налагодження

# startDebugPlaceholder
source: Type the name of a launch configuration to run.
uk: Введіть назву конфігурації запуску для виконання.

# startDebuggingHelp
source: Start Debugging
uk: Почати налагодження

# tasksQuickAccessHelp
source: Show All Debug Consoles
uk: Показати всі консолі налагодження

# tasksQuickAccessPlaceholder
source: Type the name of a debug console to open.
uk: Введіть назву консолі налагодження, щоб відкрити.

source: Terminate Thread
uk: Завершити потік

# toolBarLocation
source: Controls the location of the debug toolbar. Either `floating` in all views, `docked` in the debug view, `commandCenter` (requires {0}), or `hidden`.
uk: Контролює розташування панелі налагодження. Може бути `плаваючою` в усіх виглядах, `закріпленою` в режимі налагодження, `центром команд` (вимагає {0}), або `схованою`.

source: Variables
uk: Змінні

# viewMemory
source: View Binary Data
uk: Переглянути бінарні дані

source: Watch
uk: Годинник

# addConfigTo
source: Add Config ({0})...
uk: Додати конфігурацію ({0})...

source: Add Configuration...
uk: Додати конфігурацію...

# commentLabelWithKeybinding
source: {0}, use ({1}) for accessibility help
uk: {0}, використовуйте ({1}) для допомоги з доступністю

# commentLabelWithKeybindingNoKeybinding
source: {0}, run the command Open Accessibility Help which is currently not triggerable via keybinding.
uk: {0}, виконайте команду Відкрити допомогу з доступності, яка наразі не може бути активована за допомогою комбінації клавіш.

source: Debug Launch Configurations
uk: Налаштування запуску для налагодження

source: Debug Session
uk: Сесія налагодження

source: No Configurations
uk: Немає конфігурацій

# CouldNotFindLanguage
source: You don't have an extension for debugging {0}. Should we find a {0} extension in the Marketplace?
uk: У вас немає розширення для налагодження {0}. Чи слід нам знайти розширення {0} на Marketplace?

# debugName
source: Name of configuration; appears in the launch configuration dropdown menu.
uk: Назва конфігурації; з'являється у випадаючому меню конфігурації запуску.

# debugNoType
source: Debugger 'type' can not be omitted and must be of type 'string'.
uk: Дебаггер 'type' не може бути пропущений і повинен бути типу 'string'.

# debugPostDebugTask
source: Task to run after debug session ends.
uk: Завдання, яке потрібно виконати після завершення сеансу налагодження.

# debugPrelaunchTask
source: Task to run before debug session starts.
uk: Завдання, яке потрібно виконати перед початком сеансу налагодження.

# debugServer
source: For debug extension development only: if a port is specified VS Code tries to connect to a debug adapter running in server mode
uk: Тільки для розробки розширення налагодження: якщо вказано порт, VS Code намагається підключитися до адаптера налагодження, що працює в режимі сервера.

# findExtension
source: &&Find {0} extension
uk: &&Знайти {0} розширення

# installExt
source: Install extension...
uk: Встановити розширення...

# installLanguage
source: Install an extension for {0}...
uk: Встановіть розширення для {0}...

# moreOptionsForDebugType
source: More {0} options...
uk: Більше {0} варіантів...

# selectDebug
source: Select debugger
uk: Вибрати налагоджувач

# suggestedDebuggers
source: Suggested
uk: Запропоновано

# suppressMultipleSessionWarning
source: Disable the warning when trying to start the same debug configuration more than once.
uk: Вимкніть попередження при спробі запустити одну й ту ж конфігурацію налагодження більше ніж один раз.

# debugIcon.continueForeground
source: Debug toolbar icon for continue.
uk: Іконка панелі налагодження для продовження.

# debugIcon.disconnectForeground
source: Debug toolbar icon for disconnect.
uk: Іконка панелі налагодження для відключення.

# debugIcon.pauseForeground
source: Debug toolbar icon for pause.
uk: Іконка панелі налагодження для паузи.

# debugIcon.restartForeground
source: Debug toolbar icon for restart.
uk: Іконка панелі налагодження для перезапуску.

# debugIcon.startForeground
source: Debug toolbar icon for start debugging.
uk: Іконка панелі налагодження для початку налагодження.

# debugIcon.stepBackForeground
source: Debug toolbar icon for step back.
uk: Іконка панелі налагодження для кроку назад.

# debugIcon.stepIntoForeground
source: Debug toolbar icon for step into.
uk: Іконка панелі налагодження для переходу всередину.

# debugIcon.stepOutForeground
source: Debug toolbar icon for step over.
uk: Іконка панелі налагодження для переходу через крок.

# debugIcon.stepOverForeground
source: Debug toolbar icon for step over.
uk: Іконка панелі налагодження для переходу через крок.

# debugIcon.stopForeground
source: Debug toolbar icon for stop.
uk: Іконка панелі налагодження для зупинки.

# debugToolBarBackground
source: Debug toolbar background color.
uk: Колір фону панелі налагодження.

# debugToolBarBorder
source: Debug toolbar border color.
uk: Колір межі панелі налагодження.

source: Add Inline Breakpoint
uk: Додати вбудований контрольний пункт

# addToWatchExpressions
source: Add to Watch
uk: Додати до спостереження

# callStackBottom
source: Navigate to Bottom of Call Stack
uk: Перейти до низу стеку викликів

# callStackDown
source: Navigate Down Call Stack
uk: Перейти вниз по стеку викликів

# callStackTop
source: Navigate to Top of Call Stack
uk: Перейти до верху стеку викликів

# callStackUp
source: Navigate Up Call Stack
uk: Перейти вгору по стеку викликів

# chooseLocation
source: Choose the specific location
uk: Виберіть конкретне місце

# continueDebug
source: Continue
uk: Продовжити

source: Copy Address
uk: Скопіювати адресу

source: Copy as Expression
uk: Копіювати як вираз

source: Debug
uk: Виправлення помилок

source: Disconnect
uk: Відключити

# disconnectSuspend
source: Disconnect and Suspend
uk: Відключити та призупинити

# editor.debug.action.stepIntoTargets.none
source: No step targets available
uk: Немає доступних цілей для кроків

source: Focus Session
uk: Сесія фокусування

# nextDebugConsole
source: Focus Next Debug Console
uk: Консоль налагодження наступного фокусу

# noExecutableCode
source: No executable code is associated at the current cursor position.
uk: Немає виконуваного коду, асоційованого з поточною позицією курсора.

# openLaunchJson
source: Open '{0}'
uk: Відкрити '{0}'

source: Open Loaded Script...
uk: Відкрити завантажений скрипт...

# pauseDebug
source: Pause
uk: Пауза

# prevDebugConsole
source: Focus Previous Debug Console
uk: Сконцентруватися на попередній консолі налагодження

# restartDebug
source: Restart
uk: Перезапустити

source: Select and Start Debugging
uk: Виберіть та почніть налагодження

source: Select Debug Console
uk: Вибрати консоль налагодження

source: Select Debug Session
uk: Вибрати сеанс налагодження

# startDebug
source: Start Debugging
uk: Почати налагодження

source: Start Without Debugging
uk: Запустити без налагодження

# stepIntoDebug
source: Step Into
uk: Крок у

# stepIntoTargetDebug
source: Step Into Target
uk: Крокуйте до цілі

# stepOutDebug
source: Step Out
uk: Вийти

# stepOverDebug
source: Step Over
uk: Перейти

source: Stop
uk: Зупинити

# DebugConfig.failed
source: Unable to create 'launch.json' file inside the '.vscode' folder ({0}).
uk: Неможливо створити файл 'launch.json' у папці '.vscode' ({0}).

# editLaunchConfig
source: Edit Debug Configuration in launch.json
uk: Редагувати конфігурацію налагодження в launch.json

# selectConfiguration
source: Select Launch Configuration
uk: Виберіть конфігурацію запуску

source: user settings
uk: налаштування користувача

source: workspace
uk: робоче середовище

# workbench.action.debug.startDebug
source: Start a New Debug Session
uk: Почати нову сесію налагодження

# EditBreakpointEditorAction
source: Debug: Edit Breakpoint
uk: Відладка: Редагувати точку зупинки

source: Add to Watch
uk: Додати до спостереження

source: Close Exception Widget
uk: Закрити віджет винятків

# conditionalBreakpointEditorAction
source: Debug: Add Conditional Breakpoint...
uk: Налагодження: Додати умовну точку зупинки...

# editor.debug.action.stepIntoTargets.notAvailable
source: Step targets are not available here
uk: Цільові кроки тут недоступні

source: Evaluate in Debug Console
uk: Оцінити в консолі налагодження

# goToNextBreakpoint
source: Debug: Go to Next Breakpoint
uk: Відладка: Перейти до наступної точки зупинки

# goToPreviousBreakpoint
source: Debug: Go to Previous Breakpoint
uk: Відладка: Перейти до попереднього контрольного пункту

# logPointEditorAction
source: Debug: Add Logpoint...
uk: Відладка: Додати точку журналювання...

# miConditionalBreakpoint
source: &&Conditional Breakpoint...
uk: &&Умовна точка зупинки...

# miEditBreakpoint
source: &&Edit Breakpoint
uk: &&Редагувати точку зупинки

# miToggleBreakpoint
source: Toggle &&Breakpoint
uk: Перемикання Точки зупинки

# miTriggerByBreakpoint
source: &&Triggered Breakpoint...
uk: &&Позначений точкою зупинки...

# mitogglesource
source: &&ToggleSource
uk: &&Перемкнути джерело

source: Open Disassembly View
uk: Відкрити перегляд розбирання

source: Run to Cursor
uk: Запустити до курсора

# showDebugHover
source: Debug: Show Hover
uk: Налагодження: Показати наведення

# stepIntoTargets
source: Step Into Target
uk: Крок у ціль

# toggleBreakpointAction
source: Debug: Toggle Breakpoint
uk: Налагодження: Перемкнути Точка зупинки

# toggleDisassemblyViewSourceCode
source: Toggle Source Code in Disassembly View
uk: Перемикання вихідного коду у вигляді дизасемблера

# toggleDisassemblyViewSourceCodeDescription
source: Shows or hides source code in disassembly
uk: Показує або приховує вихідний код у дизасемблі

# triggerByBreakpointEditorAction
source: Debug: Add Triggered Breakpoint...
uk: Відладка: Додати спрацьований точку зупинки...

# editor.inlineValuesBackground
source: Color for the debug inline value background.
uk: Колір фону для значення вбудованого налагодження.

# editor.inlineValuesForeground
source: Color for the debug inline value text.
uk: Колір для тексту вбудованого значення налагодження.

# quickTip
source: Hold {0} key to switch to editor language hover
uk: Утримуйте {0} клавішу, щоб переключитися на підказку мови редактора

# treeAriaLabel
source: Debug Hover
uk: Налагодження при наведенні

# variableAriaLabel
source: {0}, value {1}, variables, debug
uk: {0}, значення {1}, змінні, налагодження

# breakpointsActivate
source: Icon for the activate action in the breakpoints view.
uk: Іконка для активації дії в перегляді точок зупинки.

# breakpointsRemoveAll
source: Icon for the Remove All action in the breakpoints view.
uk: Іконка для дії Видалити все у вигляді точок зупинки.

# breakpointsViewIcon
source: View icon of the breakpoints view.
uk: Переглянути значок перегляду точок зупинки.

# callStackViewIcon
source: View icon of the call stack view.
uk: Переглянути значок перегляду стеку викликів.

# callstackViewSession
source: Icon for the session icon in the call stack view.
uk: Іконка для іконки сесії у вигляді стеку викликів.

# debugBreakpoint
source: Icon for breakpoints.
uk: Іконка для брейкпоінтів.

# debugBreakpointConditional
source: Icon for conditional breakpoints.
uk: Іконка для умовних точок зупинки.

# debugBreakpointConditionalDisabled
source: Icon for disabled conditional breakpoints.
uk: Іконка для вимкнених умовних точок зупинки.

# debugBreakpointConditionalUnverified
source: Icon for unverified conditional breakpoints.
uk: Іконка для непідтверджених умовних точок зупинки.

# debugBreakpointData
source: Icon for data breakpoints.
uk: Іконка для точок перерви даних.

# debugBreakpointDataDisabled
source: Icon for disabled data breakpoints.
uk: Іконка для вимкнених точок зупинки даних.

# debugBreakpointDataUnverified
source: Icon for unverified data breakpoints.
uk: Іконка для непідтверджених точок зупинки даних.

# debugBreakpointDisabled
source: Icon for disabled breakpoints.
uk: Іконка для вимкнених точок зупинки.

# debugBreakpointFunction
source: Icon for function breakpoints.
uk: Іконка для функціональних точок зупинки.

# debugBreakpointFunctionDisabled
source: Icon for disabled function breakpoints.
uk: Іконка для вимкнених функціональних точок зупинки.

# debugBreakpointFunctionUnverified
source: Icon for unverified function breakpoints.
uk: Іконка для непідтверджених функціональних точок зупинки.

# debugBreakpointHint
source: Icon for breakpoint hints shown on hover in editor glyph margin.
uk: Іконка для підказок про точки зупинки, що відображаються при наведенні в маржі значків редактора.

# debugBreakpointLog
source: Icon for log breakpoints.
uk: Іконка для лог-брейкпоінтів.

# debugBreakpointLogDisabled
source: Icon for disabled log breakpoint.
uk: Іконка для вимкнення логічної точки зупинки.

# debugBreakpointLogUnverified
source: Icon for unverified log breakpoints.
uk: Іконка для непідтверджених точок зупинки журналу.

# debugBreakpointPendingOnTrigger
source: Icon for breakpoints waiting on another breakpoint.
uk: Іконка для точок зупинки, що чекають на іншу точку зупинки.

# debugBreakpointUnsupported
source: Icon for unsupported breakpoints.
uk: Іконка для непідтримуваних точок зупинки.

# debugBreakpointUnverified
source: Icon for unverified breakpoints.
uk: Іконка для непідтверджених точок зупинки.

# debugCollapseAll
source: Icon for the collapse all action in the debug views.
uk: Іконка для дії згортання всіх у відображеннях налагодження.

# debugConfigure
source: Icon for the debug configure action.
uk: Іконка для дії налаштування налагодження.

# debugConsole
source: Icon for the debug console open action.
uk: Іконка для дії відкриття консолі налагодження.

# debugConsoleClearAll
source: Icon for the clear all action in the debug console.
uk: Іконка для дії очищення всього в консолі налагодження.

# debugConsoleEvaluationInput
source: Icon for the debug evaluation input marker.
uk: Іконка для маркера введення оцінки налагодження.

# debugConsoleEvaluationPrompt
source: Icon for the debug evaluation prompt.
uk: Іконка для запиту оцінки налагодження.

# debugConsoleViewIcon
source: View icon of the debug console view.
uk: Переглянути іконку вікна консолі налагодження.

# debugContinue
source: Icon for the debug continue action.
uk: Іконка для дії продовження налагодження.

# debugDisconnect
source: Icon for the debug disconnect action.
uk: Іконка для дії відключення налагодження.

# debugGripper
source: Icon for the debug bar gripper.
uk: Іконка для захоплення панелі налагодження.

# debugInspectMemory
source: Icon for the inspect memory action.
uk: Іконка для дії перевірки пам'яті.

# debugPause
source: Icon for the debug pause action.
uk: Іконка для дії паузи налагодження.

# debugRemoveConfig
source: Icon for removing debug configurations.
uk: Іконка для видалення конфігурацій налагодження.

# debugRestart
source: Icon for the debug restart action.
uk: Іконка для дії перезапуску налагодження.

# debugRestartFrame
source: Icon for the debug restart frame action.
uk: Іконка для дії перезапуску фрейму налагодження.

# debugReverseContinue
source: Icon for the debug reverse continue action.
uk: Іконка для дії продовження зворотного налагодження.

# debugRun
source: Icon for the run or debug action.
uk: Іконка для дії запуску або налагодження.

# debugStackframe
source: Icon for a stackframe shown in the editor glyph margin.
uk: Іконка для стекового фрейму, показана в полі значків редактора.

# debugStackframeFocused
source: Icon for a focused stackframe shown in the editor glyph margin.
uk: Іконка для фокусованого стекового фрейму, показана в маржі гліфів редактора.

# debugStart
source: Icon for the debug start action.
uk: Іконка для дії початку налагодження.

# debugStepBack
source: Icon for the debug step back action.
uk: Іконка для дії повернення на крок назад у режимі налагодження.

# debugStepInto
source: Icon for the debug step into action.
uk: Іконка для кроку налагодження.

# debugStepOut
source: Icon for the debug step out action.
uk: Іконка для дії виходу з налагодження.

# debugStepOver
source: Icon for the debug step over action.
uk: Іконка для дії пропуску кроку налагодження.

# debugStop
source: Icon for the debug stop action.
uk: Іконка для дії зупинки налагодження.

# loadedScriptsViewIcon
source: View icon of the loaded scripts view.
uk: Переглянути значок завантажених скриптів.

# runViewIcon
source: View icon of the run view.
uk: Переглянути іконку перегляду виконання.

# variablesViewIcon
source: View icon of the variables view.
uk: Переглянути значок перегляду змінних.

# watchExpressionRemove
source: Icon for the Remove action in the watch view.
uk: Іконка для дії Видалити у перегляді спостереження.

# watchExpressionsAdd
source: Icon for the add action in the watch view.
uk: Іконка для дії додавання у перегляді годинника.

# watchExpressionsAddDataBreakpoint
source: Icon for the add data breakpoint action in the breakpoints view.
uk: Іконка для дії додавання точки зупинки даних у вигляді точок зупинки.

# watchExpressionsAddFuncBreakpoint
source: Icon for the add function breakpoint action in the watch view.
uk: Іконка для дії зупинки функції додавання у вигляді спостереження.

# watchExpressionsRemoveAll
source: Icon for the Remove All action in the watch view.
uk: Іконка для дії Видалити все у вигляді спостереження.

# watchViewIcon
source: View icon of the watch view.
uk: Переглянути іконку перегляду годинника.

source: configure
uk: налаштувати

# customizeLaunchConfig
source: Configure Launch Configuration
uk: Налаштувати конфігурацію запуску

source: Most Recent
uk: Найновіший

# noDebugResults
source: No matching launch configurations
uk: Немає відповідних конфігурацій запуску

# providerAriaLabel
source: {0} contributed configurations
uk: {0} надав конфігурації

# removeLaunchConfig
source: Remove Launch Configuration
uk: Видалити конфігурацію запуску

source: 1 active session
uk: 1 активна сесія

# active debug session
source: A debug session is still running that would terminate.
uk: Сесія налагодження все ще працює, що призведе до її завершення.

# breakpointAdded
source: Added breakpoint, line {0}, file {1}
uk: Додано точку зупинки, рядок {0}, файл {1}

# breakpointRemoved
source: Removed breakpoint, line {0}, file {1}
uk: Видалено точку зупинки, рядок {0}, файл {1}

# compoundMustHaveConfigurations
source: Compound must have "configurations" attribute set in order to start multiple configurations.
uk: Комплекс повинен мати встановлений атрибут "configurations", щоб розпочати кілька конфігурацій.

# configMissing
source: Configuration '{0}' is missing in 'launch.json'.
uk: Конфігурація '{0}' відсутня в 'launch.json'.

# debugAdapterCrash
source: Debug adapter process has terminated unexpectedly ({0})
uk: Процес адаптера налагодження завершився несподівано ({0})

# debugRequesMissing
source: Attribute '{0}' is missing from the chosen debug configuration.
uk: Атрибут '{0}' відсутній у вибраній конфігурації налагодження.

# debugRequestNotSupported
source: Attribute '{0}' has an unsupported value '{1}' in the chosen debug configuration.
uk: Атрибут '{0}' має непідтримуване значення '{1}' у вибраній конфігурації налагодження.

# debugTrust
source: Debugging executes build tasks and program code from your workspace.
uk: Відладка виконує завдання збірки та програмний код з вашого робочого простору.

# debugTypeMissing
source: Missing property 'type' for the chosen launch configuration.
uk: Відсутня властивість 'type' для обраної конфігурації запуску.

# debugTypeNotSupported
source: Configured debug type '{0}' is not supported.
uk: Налаштований тип налагодження '{0}' не підтримується.

# debuggingPaused
source: {0}, debugging paused {1}, {2}:{3}
uk: {0}, налагодження призупинено {1}, {2}:{3}

# installAdditionalDebuggers
source: Install {0} Extension
uk: Встановити розширення {0}

# launchJsonDoesNotExist
source: 'launch.json' does not exist for passed workspace folder.
uk: 'launch.json' не існує для переданої папки робочого простору.

# multipleConfigurationNamesInWorkspace
source: There are multiple launch configurations '{0}' in the workspace. Use folder name to qualify the configuration.
uk: У робочому просторі є кілька конфігурацій запуску '{0}'. Використовуйте ім'я папки для уточнення конфігурації.

# multipleSession
source: '{0}' is already running. Do you want to start another instance?
uk: '{0}' вже запущено. Бажаєте запустити ще один екземпляр?

# nActiveSessions
source: {0} active sessions
uk: {0} активних сесій

# noConfigurationNameInWorkspace
source: Could not find launch configuration '{0}' in the workspace.
uk: Не вдалося знайти конфігурацію запуску '{0}' у робочій області.

# noFolderWithName
source: Can not find folder with name '{0}' for configuration '{1}' in compound '{2}'.
uk: Не вдалося знайти папку з назвою '{0}' для конфігурації '{1}' в компаунді '{2}'.

# noFolderWorkspaceDebugError
source: The active file can not be debugged. Make sure it is saved and that you have a debug extension installed for that file type.
uk: Активний файл не може бути налагоджений. Переконайтеся, що він збережений і що у вас встановлено розширення для налагодження цього типу файлів.

# runTrust
source: Running executes build tasks and program code from your workspace.
uk: Запуск виконує завдання збірки та програмний код з вашого робочого простору.

source: Debugging started.
uk: Розпочато налагодження.

# debuggingStartedNoDebug
source: Started running without debugging.
uk: Почав виконувати без налагодження.

source: Debugging stopped.
uk: Відладка зупинена.

# noDebugAdapter
source: No debugger available, can not send '{0}'
uk: Дебаггер недоступний, не можна надіслати '{0}'

# sessionDoesNotSupporBytesBreakpoints
source: Session does not support breakpoints with bytes
uk: Сесія не підтримує точки зупинки з байтами

# sessionNotReadyForBreakpoints
source: Session is not ready for breakpoints
uk: Сесія не готова для точок зупинки

# moveFocusedView.selectView
source: Search debug sessions by name
uk: Шукати сеанси налагодження за назвою

# workbench.action.debug.spawnFrom
source: Session {0} spawned from {1}
uk: Сесія {0} створена з {1}

# debugTarget
source: Debug: {0}
uk: Відладка: {0}

# selectAndStartDebug
source: Select and Start Debug Configuration
uk: Виберіть і запустіть конфігурацію налагодження

# status.debug
source: Debug
uk: Виправлення помилок

# DebugTaskNotFound
source: Could not find the specified task.
uk: Не вдалося знайти вказане завдання.

# DebugTaskNotFoundWithTaskId
source: Could not find the task '{0}'.
uk: Не вдалося знайти завдання '{0}'.

source: Abort
uk: Скасувати

source: Configure Task
uk: Налаштувати завдання
