Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminal.xlf
Languages: uk

# terminal.integrated.fontLigatures.featureSettings
source: Controls what font feature settings are used when ligatures are enabled, in the format of the `font-feature-settings` CSS property. Some examples which may be valid depending on the font:
uk: Контролює, які налаштування шрифтів використовуються, коли лігатури увімкнені, у форматі властивості CSS `font-feature-settings`. Деякі приклади, які можуть бути дійсними в залежності від шрифта:

# terminal.integrated.fontSize
source: Controls the font size in pixels of the terminal.
uk: Контролює розмір шрифту в пікселях терміналу.

# terminal.integrated.fontWeight
source: The font weight to use within the terminal for non-bold text. Accepts "normal" and "bold" keywords or numbers between 1 and 1000.
uk: Вага шрифту, яку слід використовувати в терміналі для нежирного тексту. Приймає ключові слова "normal" та "bold" або числа від 1 до 1000.

# terminal.integrated.fontWeightBold
source: The font weight to use within the terminal for bold text. Accepts "normal" and "bold" keywords or numbers between 1 and 1000.
uk: Вага шрифту, яку слід використовувати в терміналі для жирного тексту. Приймає ключові слова "normal" та "bold" або числа від 1 до 1000.

# terminal.integrated.fontWeightError
source: Only "normal" and "bold" keywords or numbers between 1 and 1000 are allowed.
uk: Дозволені лише ключові слова "нормальний" і "жирний" або числа від 1 до 1000.

# terminal.integrated.gpuAcceleration
source: Controls whether the terminal will leverage the GPU to do its rendering.
uk: Контролює, чи буде термінал використовувати GPU для виконання рендерингу.

# terminal.integrated.gpuAcceleration.auto
source: Let VS Code detect which renderer will give the best experience.
uk: Нехай VS Code визначить, який рендерер забезпечить найкращий досвід.

# terminal.integrated.gpuAcceleration.off
source: Disable GPU acceleration within the terminal. The terminal will render much slower when GPU acceleration is off but it should reliably work on all systems.
uk: Вимкніть апаратне прискорення GPU в терміналі. Термінал буде працювати значно повільніше, коли апаратне прискорення GPU вимкнено, але він має надійно працювати на всіх системах.

# terminal.integrated.gpuAcceleration.on
source: Enable GPU acceleration within the terminal.
uk: Увімкніть прискорення GPU в терміналі.

# terminal.integrated.hideOnLastClosed
source: Whether to hide the terminal view when the last terminal is closed. This will only happen when the terminal is the only visible view in the view container.
uk: Чи приховувати вигляд терміналу, коли останній термінал закрито. Це станеться лише тоді, коли термінал є єдиним видимим виглядом у контейнері виглядів.

# terminal.integrated.hideOnStartup
source: Whether to hide the terminal view on startup, avoiding creating a terminal when there are no persistent sessions.
uk: Чи приховувати вигляд терміналу при запуску, уникаючи створення терміналу, коли немає постійних сесій.

# terminal.integrated.ignoreBracketedPasteMode
source: Controls whether the terminal will ignore bracketed paste mode even if the terminal was put into the mode, omitting the {0} and {1} sequences when pasting. This is useful when the shell is not respecting the mode which can happen in sub-shells for example.
uk: Контролює, чи термінал ігноруватиме режим вставки в дужках, навіть якщо термінал був переведений у цей режим, пропускаючи послідовності {0} та {1} під час вставки. Це корисно, коли оболонка не дотримується режиму, що може статися, наприклад, у підоболонках.

# terminal.integrated.letterSpacing
source: Controls the letter spacing of the terminal. This is an integer value which represents the number of additional pixels to add between characters.
uk: Контролює міжбуквений інтервал терміналу. Це ціле число, яке представляє кількість додаткових пікселів, які потрібно додати між символами.

# terminal.integrated.lineHeight
source: Controls the line height of the terminal. This number is multiplied by the terminal font size to get the actual line-height in pixels.
uk: Контролює висоту рядка терміналу. Це число множиться на розмір шрифту терміналу, щоб отримати фактичну висоту рядка в пікселях.

# terminal.integrated.macOptionClickForcesSelection
source: Controls whether to force selection when using Option+click on macOS. This will force a regular (line) selection and disallow the use of column selection mode. This enables copying and pasting using the regular terminal selection, for example, when mouse mode is enabled in tmux.
uk: Контролює, чи потрібно примусово вибирати при використанні Option+click на macOS. Це примусить звичайний (лінійний) вибір і заборонить використання режиму вибору стовпців. Це дозволяє копіювати та вставляти, використовуючи звичайний вибір терміналу, наприклад, коли режим миші увімкнено в tmux.

# terminal.integrated.macOptionIsMeta
source: Controls whether to treat the option key as the meta key in the terminal on macOS.
uk: Контролює, чи слід розглядати клавішу option як клавішу meta в терміналі на macOS.

# terminal.integrated.middleClickBehavior
source: Controls how terminal reacts to middle click.
uk: Контролює, як термінал реагує на середній клік.

# terminal.integrated.middleClickBehavior.default
source: The platform default to focus the terminal. On Linux this will also paste the selection.
uk: Платформа за замовчуванням фокусується на терміналі. У Linux це також вставить вибране.

# terminal.integrated.middleClickBehavior.paste
source: Paste on middle click.
uk: Вставити при середньому кліку.

# terminal.integrated.minimumContrastRatio
source: When set, the foreground color of each cell will change to try meet the contrast ratio specified. Note that this will not apply to `powerline` characters per #146406. Example values: - 1: Do nothing and use the standard theme colors. - 4.5: [WCAG AA compliance (minimum)](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html) (default). - 7: [WCAG AAA compliance (enhanced)](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast7.html). - 21: White on black or black on white.
uk: Коли встановлено, колір фону кожної комірки зміниться, щоб відповідати вказаному коефіцієнту контрастності. Зверніть увагу, що це не буде застосовуватися до символів `powerline` відповідно до #146406. Приклад значень: - 1: Не робити нічого і використовувати стандартні кольори теми. - 4.5: [Відповідність WCAG AA (мінімум)](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-contrast.html) (за замовчуванням). - 7: [Відповідність WCAG AAA (покращена)](https://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast7.html). - 21: Білий на чорному або чорний на білому.

# terminal.integrated.mouseWheelScrollSensitivity
source: A multiplier to be used on the `deltaY` of mouse wheel scroll events.
uk: Множник, який буде використовуватися для `deltaY` подій прокрутки колеса миші.

# terminal.integrated.persistentSessionReviveProcess
source: When the terminal process must be shut down (for example on window or application close), this determines when the previous terminal session contents/history should be restored and processes be recreated when the workspace is next opened. Caveats: - Restoring of the process current working directory depends on whether it is supported by the shell. - Time to persist the session during shutdown is limited, so it may be aborted when using high-latency remote connections.
uk: Коли процес терміналу потрібно закрити (наприклад, при закритті вікна або програми), це визначає, коли слід відновити вміст/історію попередньої сесії терміналу та відтворити процеси, коли робочий простір буде відкрито наступного разу. Застереження: - Відновлення поточного робочого каталогу процесу залежить від того, чи підтримується це оболонкою. - Час для збереження сесії під час завершення роботи обмежений, тому він може бути перерваний при використанні з'єднань з високою затримкою.

# terminal.integrated.persistentSessionReviveProcess.never
source: Never restore the terminal buffers or recreate the process.
uk: Ніколи не відновлюйте буфери термінала або не відтворюйте процес.

# terminal.integrated.persistentSessionReviveProcess.onExit
source: Revive the processes after the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu).
uk: Відновіть процеси після закриття останнього вікна в Windows/Linux або коли буде викликано команду `workbench.action.quit` (командна палітра, клавіша, меню).

# terminal.integrated.persistentSessionReviveProcess.onExitAndWindowClose
source: Revive the processes after the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu), or when the window is closed.
uk: Відновіть процеси після закриття останнього вікна на Windows/Linux або коли спрацьовує команда `workbench.action.quit` (палета команд, комбінація клавіш, меню), або коли вікно закривається.

# terminal.integrated.rescaleOverlappingGlyphs
source: Whether to rescale glyphs horizontally that are a single cell wide but have glyphs that would overlap following cell(s). This typically happens for ambiguous width characters (eg. the roman numeral characters U+2160+) which aren't featured in monospace fonts. Emoji glyphs are never rescaled.
uk: Чи потрібно горизонтально змінювати масштаб гліфів, які мають ширину в одну клітинку, але містять гліфи, що перекриваються з наступними клітинками. Це зазвичай трапляється для неоднозначних символів ширини (наприклад, римських цифр U+2160+), які не представлені в моноширинних шрифтах. Гліфи емодзі ніколи не змінюються в масштабі.

# terminal.integrated.rightClickBehavior
source: Controls how terminal reacts to right click.
uk: Контролює, як термінал реагує на правий клік.

# terminal.integrated.rightClickBehavior.copyPaste
source: Copy when there is a selection, otherwise paste.
uk: Копіювати, коли є вибір, інакше вставити.

# terminal.integrated.rightClickBehavior.default
source: Show the context menu.
uk: Показати контекстне меню.

# terminal.integrated.rightClickBehavior.nothing
source: Do nothing and pass event to terminal.
uk: Не робіть нічого і передайте подію в термінал.

# terminal.integrated.rightClickBehavior.paste
source: Paste on right click.
uk: Вставити при натисканні правою кнопкою миші.

# terminal.integrated.rightClickBehavior.selectWord
source: Select the word under the cursor and show the context menu.
uk: Виберіть слово під курсором і відобразіть контекстне меню.

# terminal.integrated.scrollback
source: Controls the maximum number of lines the terminal keeps in its buffer. We pre-allocate memory based on this value in order to ensure a smooth experience. As such, as the value increases, so will the amount of memory.
uk: Контролює максимальну кількість рядків, які термінал зберігає у своєму буфері. Ми попередньо виділяємо пам'ять на основі цього значення, щоб забезпечити плавний досвід. Таким чином, з ростом значення зростатиме і обсяг пам'яті.

# terminal.integrated.sendKeybindingsToShell
source: Dispatches most keybindings to the terminal instead of the workbench, overriding {0}, which can be used alternatively for fine tuning.
uk: Відправляє більшість комбінацій клавіш до терміналу замість робочої області, переважаючи {0}, який можна використовувати альтернативно для тонкої настройки.

# terminal.integrated.shellIntegration.decorationsEnabled
source: When shell integration is enabled, adds a decoration for each command.
uk: Коли інтеграція з оболонкою увімкнена, додає оформлення для кожної команди.

# terminal.integrated.shellIntegration.decorationsEnabled.both
source: Show decorations in the gutter (left) and overview ruler (right)
uk: Показати декорації в жолобі (ліворуч) та оглядову лінійку (праворуч)

# terminal.integrated.shellIntegration.decorationsEnabled.gutter
source: Show gutter decorations to the left of the terminal
uk: Показати декорації країв зліва від терміналу

# terminal.integrated.shellIntegration.decorationsEnabled.never
source: Do not show decorations
uk: Не показувати декорації

# terminal.integrated.shellIntegration.decorationsEnabled.overviewRuler
source: Show overview ruler decorations to the right of the terminal
uk: Показати оглядові прикраси лінійки праворуч від терміналу

# terminal.integrated.shellIntegration.enabled
source: Determines whether or not shell integration is auto-injected to support features like enhanced command tracking and current working directory detection. Shell integration works by injecting the shell with a startup script. The script gives VS Code insight into what is happening within the terminal. Supported shells: - Linux/macOS: bash, fish, pwsh, zsh - Windows: pwsh, git bash This setting applies only when terminals are created, so you will need to restart your terminals for it to take effect. Note that the script injection may not work if you have custom arguments defined in the terminal profile, have enabled {1}, have a [complex bash `PROMPT_COMMAND`](https://code.visualstudio.com/docs/editor/integrated-terminal#_complex-bash-promptcommand), or other unsupported setup. To disable decorations, see {0}
uk: Визначає, чи інтеграція оболонки автоматично впроваджується для підтримки таких функцій, як покращене відстеження команд та виявлення поточного робочого каталогу. Інтеграція оболонки працює шляхом впровадження оболонки зі скриптом запуску. Скрипт надає VS Code інформацію про те, що відбувається в терміналі. Підтримувані оболонки: - Linux/macOS: bash, fish, pwsh, zsh - Windows: pwsh, git bash Цей параметр застосовується лише під час створення терміналів, тому вам потрібно буде перезапустити термінали, щоб він набрав чинності. Зверніть увагу, що впровадження скриптів може не працювати, якщо у вас визначені користувацькі аргументи в профілі терміналу, ви ввімкнули {1}, маєте [складний bash `PROMPT_COMMAND`](https://code.visualstudio.com/docs/editor/integrated-terminal#_complex-bash-promptcommand) або іншу несумісну конфігурацію. Щоб вимкнути оформлення, дивіться {0}.

# terminal.integrated.shellIntegration.environmentReporting
source: Controls whether to report the shell environment, enabling its use in features such as {0}. This may cause a slowdown when printing your shell's prompt.
uk: Контролює, чи слід звітувати про середовище оболонки, що дозволяє його використання в таких функціях, як {0}. Це може спричинити уповільнення при друку вашого запиту оболонки.

# terminal.integrated.showExitAlert
source: Controls whether to show the alert "The terminal process terminated with exit code" when exit code is non-zero.
uk: Контролює, чи показувати сповіщення "Процес терміналу завершився з кодом виходу" коли код виходу не нульовий.

# terminal.integrated.smoothScrolling
source: Controls whether the terminal will scroll using an animation.
uk: Контролює, чи буде термінал прокручуватися з використанням анімації.

# terminal.integrated.splitCwd
source: Controls the working directory a split terminal starts with.
uk: Контролює робочий каталог, з якого починає працювати розділений термінал.

# terminal.integrated.splitCwd.inherited
source: On macOS and Linux, a new split terminal will use the working directory of the parent terminal. On Windows, this behaves the same as initial.
uk: На macOS та Linux новий розділений термінал використовуватиме робочий каталог батьківського термінала. На Windows це поводиться так само, як і спочатку.

# terminal.integrated.splitCwd.initial
source: A new split terminal will use the working directory that the parent terminal started with.
uk: Новий розділений термінал використовуватиме робочий каталог, з якого почався батьківський термінал.

# terminal.integrated.splitCwd.workspaceRoot
source: A new split terminal will use the workspace root as the working directory. In a multi-root workspace a choice for which root folder to use is offered.
uk: Новий розділений термінал використовуватиме кореневу директорію робочого простору як робочу директорію. У багатокореневому робочому просторі пропонується вибір, яку кореневу папку використовувати.

# terminal.integrated.tabStopWidth
source: The number of cells in a tab stop.
uk: Кількість комірок у табуляції.

# terminal.integrated.tabs.defaultColor
source: A theme color ID to associate with terminal icons by default.
uk: Ідентифікатор кольору теми, який за замовчуванням асоціюється з іконками терміналу.

# terminal.integrated.tabs.defaultIcon
source: A codicon ID to associate with terminal icons by default.
uk: ID codicon для асоціації з іконками терміналу за замовчуванням.

# terminal.integrated.tabs.enableAnimation
source: Controls whether terminal tab statuses support animation (eg. in progress tasks).
uk: Контролює, чи статуси вкладок терміналу підтримують анімацію (наприклад, завдання в процесі).

# terminal.integrated.tabs.enabled
source: Controls whether terminal tabs display as a list to the side of the terminal. When this is disabled a dropdown will display instead.
uk: Контролює, чи відображаються вкладки термінала у вигляді списку збоку термінала. Коли це вимкнено, замість цього відобразиться випадаюче меню.

# terminal.integrated.tabs.focusMode
source: Controls whether focusing the terminal of a tab happens on double or single click.
uk: Контролює, чи фокусування терміналу вкладки відбувається при подвійному або одиночному кліку.

# terminal.integrated.tabs.focusMode.doubleClick
source: Focus the terminal when double-clicking a terminal tab
uk: Зосередьте термінал при дворазовому клацанні на вкладці термінала

# terminal.integrated.tabs.focusMode.singleClick
source: Focus the terminal when clicking a terminal tab
uk: Зосередьте термінал при натисканні на вкладку термінала

# terminal.integrated.tabs.hideCondition
source: Controls whether the terminal tabs view will hide under certain conditions.
uk: Контролює, чи буде вигляд вкладок терміналу приховано за певних умов.

# terminal.integrated.tabs.hideCondition.never
source: Never hide the terminal tabs view
uk: Ніколи не приховуйте перегляд вкладок терміналу

# terminal.integrated.tabs.hideCondition.singleGroup
source: Hide the terminal tabs view when there is only a single terminal group opened
uk: Сховати перегляд вкладок термінала, коли відкрита лише одна група терміналів

# terminal.integrated.tabs.hideCondition.singleTerminal
source: Hide the terminal tabs view when there is only a single terminal opened
uk: Сховати перегляд вкладок термінала, коли відкрито лише один термінал

# terminal.integrated.tabs.location
source: Controls the location of the terminal tabs, either to the left or right of the actual terminal(s).
uk: Контролює розташування вкладок терміналу, або зліва, або справа від фактичного терміналу(ів).

# terminal.integrated.tabs.location.left
source: Show the terminal tabs view to the left of the terminal
uk: Показати вигляд вкладок терміналу зліва від терміналу

# terminal.integrated.tabs.location.right
source: Show the terminal tabs view to the right of the terminal
uk: Показати вигляд вкладок терміналу праворуч від терміналу

# terminal.integrated.tabs.separator
source: Separator used by {0} and {1}.
uk: Роздільник, що використовується {0} та {1}.

# terminal.integrated.tabs.showActions
source: Controls whether terminal split and kill buttons are displays next to the new terminal button.
uk: Контролює, чи відображаються кнопки розділення та закриття терміналу поряд з кнопкою нового терміналу.

# terminal.integrated.tabs.showActions.always
source: Always show the actions
uk: Завжди показувати дії

# terminal.integrated.tabs.showActions.never
source: Never show the actions
uk: Ніколи не показувати дії

# terminal.integrated.tabs.showActions.singleTerminal
source: Show the actions when it is the only terminal opened
uk: Показати дії, коли відкрито лише один термінал

# terminal.integrated.tabs.showActions.singleTerminalOrNarrow
source: Show the actions when it is the only terminal opened or when the tabs view is in its narrow textless state
uk: Показати дії, коли відкрито лише один термінал або коли вигляд вкладок знаходиться в своєму вузькому безтекстовому стані.

# terminal.integrated.tabs.showActiveTerminal
source: Shows the active terminal information in the view. This is particularly useful when the title within the tabs aren't visible.
uk: Показує інформацію про активний термінал у вигляді. Це особливо корисно, коли заголовки в табах не видимі.

# terminal.integrated.tabs.showActiveTerminal.always
source: Always show the active terminal
uk: Завжди показувати активний термінал

# terminal.integrated.tabs.showActiveTerminal.never
source: Never show the active terminal
uk: Ніколи не показувати активний термінал

# terminal.integrated.tabs.showActiveTerminal.singleTerminal
source: Show the active terminal when it is the only terminal opened
uk: Показати активний термінал, коли він є єдиним відкритим терміналом.

# terminal.integrated.tabs.showActiveTerminal.singleTerminalOrNarrow
source: Show the active terminal when it is the only terminal opened or when the tabs view is in its narrow textless state
uk: Показати активний термінал, коли це єдиний відкритий термінал або коли вигляд вкладок знаходиться в його вузькому безтекстовому стані.

# terminal.integrated.unicodeVersion
source: Controls what version of Unicode to use when evaluating the width of characters in the terminal. If you experience emoji or other wide characters not taking up the right amount of space or backspace either deleting too much or too little then you may want to try tweaking this setting.
uk: Контролює, яку версію Unicode використовувати при оцінці ширини символів у терміналі. Якщо ви помічаєте, що емодзі або інші широкі символи займають неправильну кількість місця, або що клавіша видалення видаляє занадто багато або занадто мало, вам може знадобитися спробувати налаштувати цю опцію.

# terminal.integrated.unicodeVersion.eleven
source: Version 11 of Unicode. This version provides better support on modern systems that use modern versions of Unicode.
uk: Версія 11 Unicode. Ця версія забезпечує кращу підтримку на сучасних системах, які використовують сучасні версії Unicode.

# terminal.integrated.unicodeVersion.six
source: Version 6 of Unicode. This is an older version which should work better on older systems.
uk: Версія 6 Unicode. Це стара версія, яка повинна працювати краще на старих системах.

# terminal.integrated.windowsEnableConpty
source: Whether to use ConPTY for Windows terminal process communication (requires Windows 10 build number 18309+). Winpty will be used if this is false.
uk: Чи використовувати ConPTY для зв'язку процесів терміналу Windows (потрібен номер збірки Windows 10 18309+). Якщо це неправда, буде використано Winpty.

# terminal.integrated.windowsUseConptyDll
source: Whether to use the experimental conpty.dll (v1.22.250204002) shipped with VS Code, instead of the one bundled with Windows.
uk: Чи використовувати експериментальний conpty.dll (v1.22.250204002), що постачається з VS Code, замість того, що входить до складу Windows.

# terminal.integrated.wordSeparators
source: A string containing all characters to be considered word separators when double-clicking to select word and in the fallback 'word' link detection. Since this is used for link detection, including characters such as `:` that are used when detecting links will cause the line and column part of links like `file:10:5` to be ignored.
uk: Рядок, що містить усі символи, які слід вважати роздільниками слів при подвійному клацанні для вибору слова та в резервному виявленні посилань 'слово'. Оскільки це використовується для виявлення посилань, включення символів, таких як `:`, які використовуються при виявленні посилань, призведе до ігнорування частини рядка та стовпця посилань, таких як `file:10:5`.
