Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_scm.xlf
Languages: uk

# scmActiveResourceHasChanges
source: Whether the active resource has changes
uk: Чи має активний ресурс зміни

# scmActiveResourceRepository
source: The active resource's repository
uk: Репозиторій активного ресурсу

# scmPendingChangesBadge
source: {0} pending changes
uk: {0} очікуючих змін

# status.scm
source: Source Control
uk: Контроль версій

# miShare
source: Share
uk: Поділитися

# diffAdded
source: Added lines
uk: Додані рядки

# diffDeleted
source: Removed lines
uk: Видалені рядки

# diffModified
source: Changed lines
uk: Змінені рядки

# change
source: {0} - {1} of {2} change
uk: {0} - {1} з {2} змін

# changes
source: {0} - {1} of {2} changes
uk: {0} - {1} з {2} змін

# label.close
source: Close
uk: Закрити

# miGotoNextChange
source: Next &&Change
uk: Далі &&Змінити

# miGotoPreviousChange
source: Previous &&Change
uk: Попередній &&Змінити

# move to next change
source: Go to Next Change
uk: Перейти до наступної зміни

# move to previous change
source: Go to Previous Change
uk: Перейти до попередньої зміни

# multiChange
source: {0} of {1} change
uk: {0} з {1} зміни

# multiChanges
source: {0} of {1} changes
uk: {0} з {1} змін

# quickDiff.base.switch
source: Switch Quick Diff Base
uk: Переключити базу швидкого порівняння

# remotes
source: Switch quick diff base
uk: Перемкнути базу швидкого порівняння

source: Show Next Change
uk: Показати наступну зміну

source: Show Previous Change
uk: Показати попередню зміну

# alwaysShowActions
source: Controls whether inline actions are always visible in the Source Control view.
uk: Контролює, чи завжди видимі вбудовані дії у вигляді джерела.

# alwaysShowRepository
source: Controls whether repositories should always be visible in the Source Control view.
uk: Контролює, чи повинні репозиторії завжди бути видимими у вигляді контролю джерел.

# autoReveal
source: Controls whether the Source Control view should automatically reveal and select files when opening them.
uk: Контролює, чи повинна панель джерельного контролю автоматично виявляти та вибирати файли під час їх відкриття.

# diffDecorations
source: Controls diff decorations in the editor.
uk: Контролює декорації різниць у редакторі.

# diffDecorationsIgnoreTrimWhitespace
source: Controls whether leading and trailing whitespace is ignored in Source Control diff gutter decorations.
uk: Контролює, чи ігноруються провідні та кінцеві пробіли в декораціях дифу Source Control.

# diffGutterPattern
source: Controls whether a pattern is used for the diff decorations in gutter.
uk: Контролює, чи використовується шаблон для декорацій різниці в бічній панелі.

# diffGutterPatternAdded
source: Use pattern for the diff decorations in gutter for added lines.
uk: Використовуйте шаблон для оформлення відмінностей у бічній панелі для доданих рядків.

# diffGutterPatternModifed
source: Use pattern for the diff decorations in gutter for modified lines.
uk: Використовуйте шаблон для оформлення відмінностей у смузі для змінених рядків.

# diffGutterWidth
source: Controls the width(px) of diff decorations in gutter (added & modified).
uk: Контролює ширину(px) відмінностей декорацій у канавці (додані та змінені).

# inputFontFamily
source: Controls the font for the input message. Use `default` for the workbench user interface font family, `editor` for the `#editor.fontFamily#`'s value, or a custom font family.
uk: Контролює шрифт для вхідного повідомлення. Використовуйте `default` для шрифтів інтерфейсу користувача робочої області, `editor` для значення `#editor.fontFamily#`, або вкажіть власну сім'ю шрифтів.

# inputFontSize
source: Controls the font size for the input message in pixels.
uk: Контролює розмір шрифту для вхідного повідомлення в пікселях.

# inputMaxLines
source: Controls the maximum number of lines that the input will auto-grow to.
uk: Контролює максимальну кількість рядків, до якої введення буде автоматично розширюватися.

# inputMinLines
source: Controls the minimum number of lines that the input will auto-grow from.
uk: Контролює мінімальну кількість рядків, з якої вхід буде автоматично розширюватися.

# manageWorkspaceTrustAction
source: Manage Workspace Trust
uk: Керувати довірою робочого простору

# miViewSCM
source: Source &&Control
uk: Джерело &&Керування

# no history items
source: The selected source control provider does not have any source control history items.
uk: Вибраний постачальник контролю версій не має жодних елементів історії контролю версій.

# no open repo
source: No source control providers registered.
uk: Не зареєстровано жодних постачальників контролю версій.

# no open repo in an untrusted workspace
source: None of the registered source control providers work in Restricted Mode.
uk: Жоден з зареєстрованих постачальників контролю версій не працює в обмеженому режимі.

source: Open in External Terminal
uk: Відкрити в зовнішньому терміналі

source: Open in Integrated Terminal
uk: Відкрити в інтегрованому терміналі

# providersVisible
source: Controls how many repositories are visible in the Source Control Repositories section. Set to 0, to be able to manually resize the view.
uk: Контролює, скільки репозиторіїв видно в розділі Репозиторії контролю джерел. Встановіть на 0, щоб мати можливість вручну змінювати розмір перегляду.

# repositoriesSortOrder
source: Controls the sort order of the repositories in the source control repositories view.
uk: Контролює порядок сортування репозиторіїв у вигляді репозиторіїв системи контролю версій.

# scm accept
source: Source Control: Accept Input
uk: Контроль версій: Прийняти введення

# scm view next commit
source: Source Control: View Next Commit
uk: Контроль версій: Переглянути наступний коміт

# scm view previous commit
source: Source Control: View Previous Commit
uk: Контроль версій: Переглянути попередній коміт

# scm.compactFolders
source: Controls whether the Source Control view should render folders in a compact form. In such a form, single child folders will be compressed in a combined tree element.
uk: Контролює, чи має вигляд джерела контролю відображати папки у компактному вигляді. У такому вигляді окремі дочірні папки будуть стиснуті в комбінований елемент дерева.

# scm.countBadge
source: Controls the count badge on the Source Control icon on the Activity Bar.
uk: Контролює значок лічильника на іконці Контролю версій на панелі активності.

# scm.countBadge.all
source: Show the sum of all Source Control Provider count badges.
uk: Показати суму всіх значків кількості постачальників контролю версій.

# scm.countBadge.focused
source: Show the count badge of the focused Source Control Provider.
uk: Показати значок кількості обраного постачальника контролю версій.

# scm.countBadge.off
source: Disable the Source Control count badge.
uk: Вимкнути значок лічильника контролю версій.

# scm.defaultViewMode
source: Controls the default Source Control repository view mode.
uk: Контролює режим перегляду репозиторію Source Control за замовчуванням.

# scm.defaultViewMode.list
source: Show the repository changes as a list.
uk: Показати зміни репозиторію у вигляді списку.

# scm.defaultViewMode.tree
source: Show the repository changes as a tree.
uk: Показати зміни репозиторію у вигляді дерева.

# scm.defaultViewSortKey
source: Controls the default Source Control repository changes sort order when viewed as a list.
uk: Контролює порядок сортування змін за замовчуванням у репозиторії Source Control, коли він переглядається у вигляді списку.

# scm.defaultViewSortKey.name
source: Sort the repository changes by file name.
uk: Сортувати зміни в репозиторії за назвою файлу.

# scm.defaultViewSortKey.path
source: Sort the repository changes by path.
uk: Сортувати зміни репозиторію за шляхом.

# scm.defaultViewSortKey.status
source: Sort the repository changes by Source Control status.
uk: Сортуйте зміни репозиторію за статусом контролю версій.

# scm.diffDecorations.all
source: Show the diff decorations in all available locations.
uk: Показати декорації різниці у всіх доступних місцях.

# scm.diffDecorations.gutter
source: Show the diff decorations only in the editor gutter.
uk: Показувати декорації відмінностей тільки в бічній панелі редактора.

# scm.diffDecorations.minimap
source: Show the diff decorations only in the minimap.
uk: Показувати лише відмінності в декораціях на міні-карті.

# scm.diffDecorations.none
source: Do not show the diff decorations.
uk: Не показувати декорації різниць.

# scm.diffDecorations.overviewRuler
source: Show the diff decorations only in the overview ruler.
uk: Показувати оформлення різниць тільки в оглядовій лінійці.

# scm.diffDecorationsGutterAction
source: Controls the behavior of Source Control diff gutter decorations.
uk: Контролює поведінку декорацій дифу в бічній панелі контролю версій.

# scm.diffDecorationsGutterAction.diff
source: Show the inline diff Peek view on click.
uk: Показати перегляд вбудованого відмінності Peek при натисканні.

# scm.diffDecorationsGutterAction.none
source: Do nothing.
uk: Не робіть нічого.

# scm.diffDecorationsGutterVisibility
source: Controls the visibility of the Source Control diff decorator in the gutter.
uk: Контролює видимість декоратора різниці джерельного контролю в боковій панелі.

# scm.diffDecorationsGutterVisibility.always
source: Show the diff decorator in the gutter at all times.
uk: Показувати декоратор відмінностей у бічній панелі завжди.

# scm.diffDecorationsGutterVisibility.hover
source: Show the diff decorator in the gutter only on hover.
uk: Показувати декоратор різниці в смузі лише при наведенні.

# scm.diffDecorationsIgnoreTrimWhitespace.false
source: Do not ignore leading and trailing whitespace.
uk: Не ігноруйте провідний та кінцевий пробіли.

# scm.diffDecorationsIgnoreTrimWhitespace.inherit
source: Inherit from `diffEditor.ignoreTrimWhitespace`.
uk: Спадкувати від `diffEditor.ignoreTrimWhitespace`.

# scm.diffDecorationsIgnoreTrimWhitespace.true
source: Ignore leading and trailing whitespace.
uk: Ігноруйте провідні та кінцеві пробіли.

# scm.graph.badges
source: Controls which badges are shown in the Source Control Graph view. The badges are shown on the right side of the graph indicating the names of history item groups.
uk: Контролює, які значки відображаються у вигляді графа контролю версій. Значки відображаються праворуч від графа, вказуючи назви груп елементів історії.

# scm.graph.badges.all
source: Show badges of all history item groups in the Source Control Graph view.
uk: Показати значки всіх груп історії елементів у вигляді графа контролю версій.

# scm.graph.badges.filter
source: Show only the badges of history item groups used as a filter in the Source Control Graph view.
uk: Показати лише значки груп елементів історії, що використовуються як фільтр у вигляді графа контролю версій.

# scm.graph.pageOnScroll
source: Controls whether the Source Control Graph view will load the next page of items when you scroll to the end of the list.
uk: Контролює, чи завантажить вигляд графа контролю джерел наступну сторінку елементів, коли ви прокручуєте до кінця списку.

# scm.graph.pageSize
source: The number of items to show in the Source Control Graph view by default and when loading more items.
uk: Кількість елементів, які потрібно відображати в графічному вигляді контролю версій за замовчуванням та під час завантаження додаткових елементів.

# scm.providerCountBadge
source: Controls the count badges on Source Control Provider headers. These headers appear in the Source Control view when there is more than one provider or when the {0} setting is enabled, and in the Source Control Repositories view.
uk: Контролює кількість значків на заголовках постачальника контролю версій. Ці заголовки з'являються у вигляді контролю версій, коли є більше ніж один постачальник або коли увімкнено налаштування {0}, а також у вигляді репозиторіїв контролю версій.

# scm.providerCountBadge.auto
source: Only show count badge for Source Control Provider when non-zero.
uk: Показувати значок лічильника для постачальника контролю версій тільки коли він не дорівнює нулю.

# scm.providerCountBadge.hidden
source: Hide Source Control Provider count badges.
uk: Сховати значки кількості постачальників контролю версій.

# scm.providerCountBadge.visible
source: Show Source Control Provider count badges.
uk: Показати значки кількості постачальників контролю версій.

# scm.repositoriesSortOrder.discoveryTime
source: Repositories in the Source Control Repositories view are sorted by discovery time. Repositories in the Source Control view are sorted in the order that they were selected.
uk: Репозиторії у вигляді репозиторіїв контролю версій відсортовані за часом виявлення. Репозиторії у вигляді контролю версій відсортовані в порядку, в якому вони були обрані.

# scm.repositoriesSortOrder.name
source: Repositories in the Source Control Repositories and Source Control views are sorted by repository name.
uk: Репозиторії в репозиторіях контролю версій та переглядах контролю версій відсортовані за назвою репозиторія.

# scm.repositoriesSortOrder.path
source: Repositories in the Source Control Repositories and Source Control views are sorted by repository path.
uk: Репозиторії в репозиторіях контролю версій та виглядах контролю версій сортуються за шляхом репозиторію.

# scm.workingSets.default
source: Controls the default working set to use when switching to a source control history item group that does not have a working set.
uk: Контролює набір робочих даних за замовчуванням, який використовується при переході до групи елементів історії контролю версій, що не має набору робочих даних.

# scm.workingSets.default.current
source: Use the current working set when switching to a source control history item group that does not have a working set.
uk: Використовуйте поточний робочий набір при переході до групи елементів історії контролю версій, яка не має робочого набору.

# scm.workingSets.default.empty
source: Use an empty working set when switching to a source control history item group that does not have a working set.
uk: Використовуйте порожню робочу групу при переході до групи елементів історії контролю версій, яка не має робочої групи.

# scm.workingSets.enabled
source: Controls whether to store editor working sets when switching between source control history item groups.
uk: Контролює, чи зберігати робочі набори редактора при перемиканні між групами елементів історії контролю версій.

# scmChanges
source: Changes
uk: Зміни

# scmConfigurationTitle
source: Source Control
uk: Контроль версій

# scmGraph
source: Graph
uk: Граф

# scmRepositories
source: Repositories
uk: Репозиторії

# showActionButton
source: Controls whether an action button can be shown in the Source Control view.
uk: Контролює, чи може кнопка дії бути показана в режимі контролю версій.

# showInputActionButton
source: Controls whether an action button can be shown in the Source Control input.
uk: Контролює, чи може кнопка дії відображатися у полі введення Контролю джерела.

source: Source Control
uk: Контроль версій

source: Source Control Graph
uk: Граф контролю версій

source: Source Control Repositories
uk: Репозиторії контролю версій

# source control view
source: Source Control
uk: Контроль версій

# sourceControlViewIcon
source: View icon of the Source Control view.
uk: Переглянути іконку перегляду контролю версій.

source: disabled
uk: неактивний

source: enabled
uk: увімкнено

# scm-graph-msg1
source: Use the "Source Control: Focus on Source Control Graph View" command to open the Source Control Graph view.
uk: Використовуйте команду "Source Control: Focus on Source Control Graph View", щоб відкрити вигляд графа контролю версій.

# scm-graph-msg2
source: The Source Control Graph view displays a graph history items of the repository. If the workspace contains more than one repository it will list the history items of the active repository.
uk: Вид графіка контролю версій відображає історію графічних елементів репозиторію. Якщо робоча область містить більше ніж один репозиторій, вона відобразить історію елементів активного репозиторію.

# scm-graph-msg3
source: Once the Source Control Graph view is opened you can:
uk: Як тільки відкриється вигляд графа контролю версій, ви можете:

# scm-graph-msg4
source: - Use the up/down arrow keys to navigate the list of history items.
uk: - Використовуйте клавіші стрілок вгору/вниз для навігації в списку історичних елементів.

# scm-graph-msg5
source: - Use the Space key to open the history item details in the multi-file diff editor.
uk: - Використовуйте клавішу Space, щоб відкрити деталі елемента історії в редакторі багатофайлових відмінностей.

# scm-msg1
source: Use the "Source Control: Focus on Source Control View" command to open the Source Control view.
uk: Використайте команду "Source Control: Focus on Source Control View", щоб відкрити вигляд контролю версій.

# scm-msg2
source: The Source Control view displays the resource groups and resources of the repository. If the workspace contains more than one repository it will list the resource groups and resources of the repositories selected in the Source Control Repositories view.
uk: Перегляд контролю версій відображає групи ресурсів та ресурси репозиторію. Якщо робочий простір містить більше ніж один репозиторій, він відобразить групи ресурсів та ресурси вибраних репозиторіїв у перегляді репозиторіїв контролю версій.

# scm-msg3
source: Once the Source Control view is opened you can:
uk: Після відкриття вигляду Контролю Джерел ви можете:

# scm-msg4
source: - Use the up/down arrow keys to navigate the list of repositories, resource groups and resources.
uk: - Використовуйте клавіші стрілок вгору/вниз для навігації у списку репозиторіїв, груп ресурсів та ресурсів.

# scm-msg5
source: - Use the Space key to expand or collapse a resource group.
uk: - Використовуйте клавішу Space для розгортання або згортання групи ресурсів.

# scm-repositories-msg1
source: Use the "Source Control: Focus on Source Control Repositories View" command to open the Source Control Repositories view.
uk: Використовуйте команду "Source Control: Focus on Source Control Repositories View", щоб відкрити вигляд репозиторіїв контролю версій.

# scm-repositories-msg2
source: The Source Control Repositories view lists all repositories from the workspace and is only shown when the workspace contains more than one repository.
uk: Перегляд репозиторіїв контролю версій відображає всі репозиторії з робочого простору і показується лише тоді, коли робочий простір містить більше ніж один репозиторій.

# scm-repositories-msg3
source: Once the Source Control Repositories view is opened you can:
uk: Як тільки відкриється вигляд Сховищ Контролю Джерел, ви можете:

# scm-repositories-msg4
source: - Use the up/down arrow keys to navigate the list of repositories.
uk: - Використовуйте клавіші зі стрілками вгору/вниз для навігації по списку репозиторіїв.

# scm-repositories-msg5
source: - Use the Enter or Space keys to select a repository.
uk: - Використовуйте клавіші Enter або Space, щоб вибрати репозиторій.

# scm-repositories-msg6
source: - Use Shift + up/down keys to select multiple repositories.
uk: - Використовуйте Shift + клавіші вгору/вниз, щоб вибрати кілька репозиторіїв.

# state-msg1
source: Visible repositories: {0}
uk: Видимі репозиторії: {0}

# state-msg2
source: Repository: {0}
uk: Репозиторій: {0}

# state-msg3
source: History item reference: {0}
uk: Посилання на елемент історії: {0}

# state-msg4
source: Commit message: {0}
uk: Повідомлення коміту: {0}

# state-msg5
source: Action button: {0}, {1}
uk: Кнопка дії: {0}, {1}

# state-msg6
source: Resource groups: {0}
uk: Групи ресурсів: {0}

# scmGraph.HistoryItemHoverAdditionsForeground
source: History item hover additions foreground color.
uk: Колір переднього плану додатків при наведенні на елемент історії.

# scmGraph.HistoryItemHoverDeletionsForeground
source: History item hover deletions foreground color.
uk: Колір переднього плану видалень при наведенні на елемент історії.

# scmGraphForeground1
source: Source control graph foreground color (1).
uk: Колір переднього плану графіка контролю джерел (1).

# scmGraphForeground2
source: Source control graph foreground color (2).
uk: Колір переднього плану графіка контролю версій (2).

# scmGraphForeground3
source: Source control graph foreground color (3).
uk: Колір переднього плану графіка контролю версій (3).

# scmGraphForeground4
source: Source control graph foreground color (4).
uk: Колір переднього плану графіка контролю версій (4).

# scmGraphForeground5
source: Source control graph foreground color (5).
uk: Колір переднього плану графіка контролю версій (5).

# scmGraphHistoryItemBaseRefColor
source: History item base reference color.
uk: Базовий колір посилання елемента історії.

# scmGraphHistoryItemHoverDefaultLabelBackground
source: History item hover default label background color.
uk: Колір фону за замовчуванням для підказки елемента історії.

# scmGraphHistoryItemHoverDefaultLabelForeground
source: History item hover default label foreground color.
uk: Колір переднього плану за замовчуванням для підказки елемента історії.

# scmGraphHistoryItemHoverLabelForeground
source: History item hover label foreground color.
uk: Колір переднього плану мітки наведення на елемент історії.

# scmGraphHistoryItemRefColor
source: History item reference color.
uk: Колір посилання на елемент історії.

# scmGraphHistoryItemRemoteRefColor
source: History item remote reference color.
uk: Колір віддаленої посилання на елемент історії.

# activeRepository
source: Show the source control graph for the active repository
uk: Показати графік контролю версій для активного репозиторію

source: All
uk: Усе

# allHistoryItemRefs
source: All history item references
uk: Усі посилання на елементи історії

source: Auto
uk: Авто

# currentHistoryItemRef
source: Current history item reference(s)
uk: Посилання(я) на поточний елемент історії

# deletion
source: {0} deletion{1}
uk: {0} видалення{1}

# deletions
source: {0} deletions{1}
uk: {0} видалень{1}

# emailLinkTitle
source: Email
uk: Електронна пошта

# fileChanged
source: {0} file changed
uk: {0} файл змінено

# filesChanged
source: {0} files changed
uk: {0} файлів змінено

source: Go to Current History Item
uk: Перейти до поточного історичного елемента

# historyItemChangesEditorTitle
source: All Changes ({0} ↔ {1})
uk: Усі зміни ({0} ↔ {1})

# insertion
source: {0} insertion{1}
uk: {0} вставка{1}

# insertions
source: {0} insertions{1}
uk: {0} вставок{1}

# items
source: {0} Items
uk: {0} Товарів

# loadMore
source: {0} Load More...
uk: {0} Завантажити ще...

source: Open Changes
uk: Відкриті зміни

# referencePicker
source: History Item Reference Picker
uk: Вибір посилання на історичний елемент

# refreshGraph
source: Refresh
uk: Оновити

source: Repository Picker
uk: Вибір репозиторію

# scm history
source: Source Control History
uk: Історія контролю версій

# scmGraphHistoryItemRef
source: Select one/more history item references to view, type to filter
uk: Виберіть один/більше посилань на історичні елементи для перегляду, введіть для фільтрації

# scmGraphRepository
source: Select the repository to view, type to filter all repositories
uk: Виберіть репозиторій для перегляду, введіть, щоб відфільтрувати всі репозиторії

# scmGraphViewOutdated
source: Please refresh the graph using the refresh action ($(refresh)).
uk: Будь ласка, оновіть графік, використовуючи дію оновлення ($(refresh)).

# scm
source: Source Control Repositories
uk: Репозиторії контролю версій

# collapse all
source: Collapse All Repositories
uk: Сховати всі репозиторії

# expand all
source: Expand All Repositories
uk: Розгорнути всі репозиторії

source: Repositories
uk: Репозиторії

# repositorySortByDiscoveryTime
source: Sort by Discovery Time
uk: Сортувати за часом виявлення

# repositorySortByName
source: Sort by Name
uk: Сортувати за іменем
