Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_terminal.xlf
Languages: uk

# nonResponsivePtyHost
source: The connection to the terminal's pty host process is unresponsive, terminals may stop working. Click to manually restart the pty host.
uk: З'єднання з процесом хоста pty терміналу не відповідає, термінали можуть перестати працювати. Натисніть, щоб вручну перезапустити хост pty.

source: Pty Host Status
uk: Статус хоста Pty

# ptyHostStatus.ariaLabel
source: Pty Host is unresponsive
uk: Pty Host не відповідає

# ScopedEnvironmentContributionInfo
source: workspace
uk: робоче місце

# extensionEnvironmentContributionInfoActive
source: The following extensions have contributed to this terminal's environment:
uk: Наступні розширення внесли свій внесок у середовище цього терміналу:

# extensionEnvironmentContributionInfoStale
source: The following extensions want to relaunch the terminal to contribute to its environment:
uk: Наступні розширення хочуть перезапустити термінал, щоб зробити внесок у його середовище:

# relaunchTerminalLabel
source: Relaunch Terminal
uk: Перезапустити термінал

source: Show Environment Contributions
uk: Показати внески в навколишнє середовище

# miToggleIntegratedTerminal
source: &&Terminal
uk: &&Термінал

source: Terminal
uk: Термінал

# emptyTerminalNameInfo
source: Providing no name will reset it to the default value
uk: Не вказавши ім'я, ви скинете його до значення за замовчуванням.

# newWithProfile.location
source: Where to create the terminal
uk: Де створити термінал

# newWithProfile.location.editor
source: Create the terminal in the editor
uk: Створіть термінал в редакторі

# newWithProfile.location.view
source: Create the terminal in the terminal view
uk: Створіть термінал у вигляді терміналу

# noUnattachedTerminals
source: There are no unattached terminals to attach to
uk: Немає не підключених терміналів, до яких можна підключитися.

# sendSequence
source: The sequence of text to send to the terminal
uk: Послідовність тексту для відправки на термінал

# showTerminalTabs
source: Show Tabs
uk: Показати вкладки

# terminalLaunchHelp
source: Open Help
uk: Відкрити довідку

# workbench.action.terminal.attachToSession
source: Attach to Session
uk: Прикріпити до сесії

# workbench.action.terminal.clear
source: Clear
uk: Очистити

# workbench.action.terminal.clearSelection
source: Clear Selection
uk: Очистити вибір

# workbench.action.terminal.createTerminalEditor
source: Create New Terminal in Editor Area
uk: Створити новий термінал в області редактора

# workbench.action.terminal.createTerminalEditorSide
source: Create New Terminal in Editor Area to the Side
uk: Створити новий термінал у редакторі поруч

# workbench.action.terminal.detachSession
source: Detach Session
uk: Відключити сесію

# workbench.action.terminal.focus.tabsView
source: Focus Terminal Tabs View
uk: Сфокусувати перегляд вкладок терміналу

# workbench.action.terminal.focusNext
source: Focus Next Terminal Group
uk: Сфокусувати наступну групу терміналів

# workbench.action.terminal.focusNextPane
source: Focus Next Terminal in Terminal Group
uk: Сфокусувати наступний термінал у групі терміналів

# workbench.action.terminal.focusPrevious
source: Focus Previous Terminal Group
uk: Зосередити попередню групу терміналів

# workbench.action.terminal.focusPreviousPane
source: Focus Previous Terminal in Terminal Group
uk: Зосередити попередній термінал у групі терміналів

# workbench.action.terminal.join
source: Join Terminals...
uk: Приєднати термінали...

# workbench.action.terminal.join.insufficientTerminals
source: Insufficient terminals for the join action
uk: Недостатньо терміналів для дії з'єднання

# workbench.action.terminal.join.onlySplits
source: All terminals are joined already
uk: Усі термінали вже з'єднані.

# workbench.action.terminal.joinInstance
source: Join Terminals
uk: Приєднати термінали

# workbench.action.terminal.kill
source: Kill the Active Terminal Instance
uk: Вбити активний термінальний екземпляр

# workbench.action.terminal.killAll
source: Kill All Terminals
uk: Вбити всі термінали

# workbench.action.terminal.killEditor
source: Kill the Active Terminal in Editor Area
uk: Вбити активний термінал в області редактора

# workbench.action.terminal.new
source: Create New Terminal
uk: Створити новий термінал

# workbench.action.terminal.newInActiveWorkspace
source: Create New Terminal (In Active Workspace)
uk: Створити новий термінал (в активному робочому просторі)

# workbench.action.terminal.newWithCwd.cwd
source: The directory to start the terminal at
uk: Каталог для запуску терміналу

# workbench.action.terminal.newWithProfile
source: Create New Terminal (With Profile)
uk: Створити новий термінал (з профілем)

# workbench.action.terminal.newWithProfile.profileName
source: The name of the profile to create
uk: Назва профілю для створення

# workbench.action.terminal.newWorkspacePlaceholder
source: Select current working directory for new terminal
uk: Виберіть поточний робочий каталог для нового терміналу

# workbench.action.terminal.openSettings
source: Configure Terminal Settings
uk: Налаштувати налаштування терміналу

# workbench.action.terminal.overriddenCwdDescription
source: (Overriden) {0}
uk: (Перекрито) {0}

# workbench.action.terminal.relaunch
source: Relaunch Active Terminal
uk: Перезапустити активний термінал

# workbench.action.terminal.rename.prompt
source: Enter terminal name
uk: Введіть ім'я терміналу

# workbench.action.terminal.renameWithArg.name
source: The new name for the terminal
uk: Нова назва для терміналу

# workbench.action.terminal.renameWithArg.noName
source: No name argument provided
uk: Не надано аргументу з ім'ям

# workbench.action.terminal.resizePaneDown
source: Resize Terminal Down
uk: Зменшити розмір терміналу

# workbench.action.terminal.resizePaneLeft
source: Resize Terminal Left
uk: Змінити розмір терміналу зліва

# workbench.action.terminal.resizePaneRight
source: Resize Terminal Right
uk: Змінити розмір терміналу вправо

# workbench.action.terminal.resizePaneUp
source: Resize Terminal Up
uk: Змінити розмір терміналу вгору

# workbench.action.terminal.runActiveFile
source: Run Active File In Active Terminal
uk: Запустити активний файл в активному терміналі

# workbench.action.terminal.runActiveFile.noFile
source: Only files on disk can be run in the terminal
uk: Тільки файли на диску можуть бути виконані в терміналі.

# workbench.action.terminal.runSelectedText
source: Run Selected Text In Active Terminal
uk: Запустити вибраний текст в активному терміналі

# workbench.action.terminal.scrollDown
source: Scroll Down (Line)
uk: Прокрутіть униз (рядок)

# workbench.action.terminal.scrollDownPage
source: Scroll Down (Page)
uk: Прокрутіть вниз (Сторінка)

# workbench.action.terminal.scrollToBottom
source: Scroll to Bottom
uk: Прокрутити до низу

# workbench.action.terminal.scrollToTop
source: Scroll to Top
uk: Прокрутити вгору

# workbench.action.terminal.scrollUp
source: Scroll Up (Line)
uk: Прокрутити вгору (рядок)

# workbench.action.terminal.scrollUpPage
source: Scroll Up (Page)
uk: Прокрутити вгору (Сторінка)

# workbench.action.terminal.selectAll
source: Select All
uk: Вибрати все

# workbench.action.terminal.selectDefaultShell
source: Select Default Profile
uk: Вибрати профіль за замовчуванням

# workbench.action.terminal.selectToNextCommand
source: Select To Next Command
uk: Вибрати для наступної команди

# workbench.action.terminal.selectToNextLine
source: Select To Next Line
uk: Вибрати до наступного рядка

# workbench.action.terminal.selectToPreviousCommand
source: Select To Previous Command
uk: Вибрати попередню команду

# workbench.action.terminal.selectToPreviousLine
source: Select To Previous Line
uk: Вибрати до попереднього рядка

# workbench.action.terminal.setFixedDimensions
source: Set Fixed Dimensions
uk: Встановити фіксовані розміри

# workbench.action.terminal.splitInActiveWorkspace
source: Split Terminal (In Active Workspace)
uk: Розділити термінал (в активному робочому просторі)

# workbench.action.terminal.switchTerminal
source: Switch Terminal
uk: Перемикач терміналу

# confirmDirtyTerminal.button
source: &&Terminate
uk: &&Завершити

# confirmDirtyTerminal.detail
source: Closing will terminate the running processes in this terminal.
uk: Закриття призведе до завершення запущених процесів у цьому терміналі.

# confirmDirtyTerminal.message
source: Do you want to terminate running processes?
uk: Ви хочете завершити запущені процеси?

# confirmDirtyTerminals.detail
source: Closing will terminate the running processes in the terminals.
uk: Закриття завершить запущені процеси в терміналах.

# configureTerminalProfileIcon
source: Icon for creating a new terminal profile.
uk: Іконка для створення нового профілю терміналу.

# killTerminalIcon
source: Icon for killing a terminal instance.
uk: Іконка для завершення термінального екземпляра.

# newTerminalIcon
source: Icon for creating a new terminal instance.
uk: Іконка для створення нового екземпляра термінала.

# renameTerminalIcon
source: Icon for rename in the terminal quick menu.
uk: Іконка для перейменування в швидкому меню терміналу.

# terminalCommandHistoryFuzzySearch
source: Icon for toggling fuzzy search of command history.
uk: Іконка для перемикання нечіткого пошуку історії команд.

# terminalCommandHistoryOpenFile
source: Icon for opening a shell history file.
uk: Іконка для відкриття файлу історії оболонки.

# terminalCommandHistoryOutput
source: Icon for viewing output of a terminal command.
uk: Іконка для перегляду виходу термінальної команди.

# terminalCommandHistoryRemove
source: Icon for removing a terminal command from command history.
uk: Іконка для видалення термінальної команди з історії команд.

# terminalDecorationError
source: Icon for a terminal decoration of a command that errored.
uk: Іконка для термінального оформлення команди, яка завершилася з помилкою.

# terminalDecorationIncomplete
source: Icon for a terminal decoration of a command that was incomplete.
uk: Іконка для термінального оформлення команди, яка була неповною.

# terminalDecorationMark
source: Icon for a terminal decoration mark.
uk: Іконка для позначки декорації терміналу.

# terminalDecorationSuccess
source: Icon for a terminal decoration of a command that was successful.
uk: Іконка для термінального оформлення команди, яка була успішною.

# terminalViewIcon
source: View icon of the terminal view.
uk: Переглянути значок термінального вигляду.

# bellStatus
source: Bell
uk: Дзвінок

# changeColor
source: Select a color for the terminal
uk: Виберіть колір для терміналу

source: Configure Terminal Settings
uk: Налаштувати налаштування терміналу

# disconnectStatus
source: Lost connection to process
uk: Втрата з'єднання з процесом

# keybindingHandling
source: Some keybindings don't go to the terminal by default and are handled by {0} instead.
uk: Деякі комбінації клавіш за замовчуванням не передаються в термінал і обробляються замість цього {0}.

# launchFailed.errorMessage
source: The terminal process failed to launch: {0}.
uk: Процес терміналу не вдалося запустити: {0}.

# launchFailed.exitCodeAndCommandLine
source: The terminal process "{0}" failed to launch (exit code: {1}).
uk: Процес терміналу "{0}" не вдалося запустити (код виходу: {1}).

# launchFailed.exitCodeOnly
source: The terminal process failed to launch (exit code: {0}).
uk: Процес терміналу не вдалося запустити (код виходу: {0}).

# launchFailed.exitCodeOnlyShellIntegration
source: Disabling shell integration in user settings might help.
uk: Вимкнення інтеграції оболонки в налаштуваннях користувача може допомогти.

# setTerminalDimensionsColumn
source: Set Fixed Dimensions: Column
uk: Встановити фіксовані розміри: Стовпець

# setTerminalDimensionsRow
source: Set Fixed Dimensions: Row
uk: Встановити фіксовані розміри: Рядок

# shellIntegration.learnMore
source: Learn more about shell integration
uk: Дізнайтеся більше про інтеграцію оболонки

# shellIntegration.openSettings
source: Open user settings
uk: Відкрити налаштування користувача

# terminal.integrated.a11yPromptLabel
source: Terminal input
uk: Термінальний ввід

# terminal.integrated.useAccessibleBuffer
source: Use the accessible buffer {0} to manually review output
uk: Використовуйте доступний буфер {0} для ручного перегляду виходу.

# terminal.integrated.useAccessibleBufferNoKb
source: Use the Terminal: Focus Accessible Buffer command to manually review output
uk: Використовуйте команду Focus Accessible Buffer у Терминалі для ручного перегляду виходу.

# terminal.requestTrust
source: Creating a terminal process requires executing code
uk: Створення термінального процесу вимагає виконання коду.

# terminalHelpAriaLabel
source: Use {0} for terminal accessibility help
uk: Використовуйте {0} для допомоги з доступністю терміналу

# terminalScreenReaderMode
source: Run the command: Toggle Screen Reader Accessibility Mode for an optimized screen reader experience
uk: Виконайте команду: Перемкнути режим доступності для екранного зчитувача для оптимізованого досвіду роботи з екранним зчитувачем

# terminalStaleTextBoxAriaLabel
source: Terminal {0} environment is stale, run the 'Show Environment Information' command for more information
uk: Термінал {0} має застаріле середовище, виконайте команду 'Показати інформацію про середовище' для отримання додаткової інформації.

# terminalTextBoxAriaLabel
source: Terminal {0}
uk: Термінал {0}

# terminalTextBoxAriaLabelNumberAndTitle
source: Terminal {0}, {1}
uk: Термінал {0}, {1}

# terminated.exitCodeAndCommandLine
source: The terminal process "{0}" terminated with exit code: {1}.
uk: Процес терміналу "{0}" завершився з кодом виходу: {1}.

# terminated.exitCodeOnly
source: The terminal process terminated with exit code: {0}.
uk: Процес терміналу завершився з кодом виходу: {0}.

# workspaceNotTrustedCreateTerminal
source: Cannot launch a terminal process in an untrusted workspace
uk: Не вдається запустити процес терміналу в ненадійному робочому просторі.

# workspaceNotTrustedCreateTerminalCwd
source: Cannot launch a terminal process in an untrusted workspace with cwd {0} and userHome {1}
uk: Не вдається запустити процес терміналу в ненадійному робочому просторі з cwd {0} та userHome {1}

# defaultTerminalProfile
source: {0} (Default)
uk: {0} (За замовчуванням)

source: Launch Profile...
uk: Запустити профіль...

# miNewTerminal
source: &&New Terminal
uk: &&Новий термінал

# miRunActiveFile
source: Run &&Active File
uk: Запустити &&активний файл

# miRunSelectedText
source: Run &&Selected Text
uk: Запустити &&вибраний текст

# miSplitTerminal
source: &&Split Terminal
uk: &&Розділити термінал

source: Split Terminal
uk: Розділений термінал

# workbench.action.tasks.configureTaskRunner
source: Configure Tasks...
uk: Налаштувати завдання...

# workbench.action.tasks.runTask
source: Run Task...
uk: Запустити завдання...

# workbench.action.terminal.changeColor
source: Change Color...
uk: Змінити колір...

# workbench.action.terminal.changeIcon
source: Change Icon...
uk: Змінити значок...

# workbench.action.terminal.clearLong
source: Clear Terminal
uk: Очистити термінал

# workbench.action.terminal.copySelection.short
source: Copy
uk: Копіювати

# workbench.action.terminal.copySelectionAsHtml
source: Copy as HTML
uk: Копіювати як HTML

# workbench.action.terminal.newWithProfile.short
source: New Terminal With Profile...
uk: Новий термінал з профілем...

# workbench.action.terminal.paste.short
source: Paste
uk: Вставити

# workbench.action.terminal.renameInstance
source: Rename...
uk: Перейменувати...

# workbench.action.terminal.runActiveFile
source: Run Active File
uk: Запустити активний файл в активному терміналі

# workbench.action.terminal.runSelectedText
source: Run Selected Text
uk: Запустити вибраний текст в активному терміналі

# workbench.action.terminal.selectDefaultProfile
source: Select Default Profile
uk: Вибрати профіль за замовчуванням

# killportfailure
source: Could not kill process listening on port {0}, command exited with error {1}
uk: Не вдалося завершити процес, що слухає на порту {0}, команда завершилася з помилкою {1}

# ptyHostRelaunch
source: Restarting the terminal because the connection to the shell process was lost...
uk: Перезапуск терміналу, оскільки з'єднання з процесом оболонки було втрачено...

# ICreateContributedTerminalProfileOptions
source: contributed
uk: вніс

source: Cancel
uk: Скасувати

# createQuickLaunchProfile
source: Configure Terminal Profile
uk: Налаштувати профіль терміналу

source: Enter terminal profile name
uk: Введіть ім'я профілю терміналу

# terminal.integrated.chooseDefaultProfile
source: Select your default terminal profile
uk: Виберіть ваш профіль терміналу за замовчуванням

# terminal.integrated.selectProfileToCreate
source: Select the terminal profile to create
uk: Виберіть профіль терміналу для створення

# terminalProfileAlreadyExists
source: A terminal profile already exists with that name
uk: Профіль терміналу з таким ім'ям вже існує.

# terminalProfiles
source: profiles
uk: профілі

# terminalProfiles.detected
source: detected
uk: виявлено

# unsafePathWarning
source: This terminal profile uses a potentially unsafe path that can be modified by another user: {0}. Are you sure you want to use it?
uk: Цей профіль терміналу використовує потенційно небезпечний шлях, який може бути змінений іншим користувачем: {0}. Ви впевнені, що хочете його використовувати?

source: Yes
uk: Так

# localTerminalRemote
source: This shell is running on your {0}local{1} machine, NOT on the connected remote machine
uk: Ця оболонка працює на вашій {0}локальній{1} машині, А НЕ на підключеній віддаленій машині.

# localTerminalVirtualWorkspace
source: This shell is open to a {0}local{1} folder, NOT to the virtual folder
uk: Ця оболонка відкрита для {0}локальної{1} папки, А НЕ для віртуальної папки.

# terminalService.terminalCloseConfirmationPlural
source: Do you want to terminate the {0} active terminal sessions?
uk: Ви хочете завершити {0} активних сеансів терміналу?

# terminalService.terminalCloseConfirmationSingular
source: Do you want to terminate the active terminal session?
uk: Ви хочете завершити активну сесію терміналу?

source: &&Terminate
uk: &&Завершити

source: Hide Tabs
uk: Сховати вкладки

source: Move Tabs Left
uk: Перемістити вкладки вліво

source: Move Tabs Right
uk: Перемістити вкладки вправо

# label
source: Terminal
uk: Термінал

# splitTerminalAriaLabel
source: Terminal {0} {1}, split {2} of {3}
uk: Термінал {0} {1}, розділ {2} з {3}

source: Terminal tabs
uk: Табулятори терміналу

# terminalAriaLabel
source: Terminal {0} {1}
uk: Термінал {0} {1}

# terminalInputAriaLabel
source: Type terminal name. Press Enter to confirm or Escape to cancel.
uk: Введіть ім'я терміналу. Натисніть Enter, щоб підтвердити, або Escape, щоб скасувати.

source: Shell integration
uk: Інтеграція оболонки

# shellIntegration.basic
source: Basic
uk: Основний

# shellIntegration.injectionFailed
source: Injection failed to activate
uk: Впорскування не вдалося активувати

# shellIntegration.no
source: No
uk: Ні

# shellIntegration.rich
source: Rich
uk: Багатий

# shellProcessTooltip.commandLine
source: Command line: {0}
uk: Командний рядок: {0}

# shellProcessTooltip.processId
source: Process ID ({0}): {1}
uk: Ідентифікатор процесу (PID) ({0}): {1}

# terminal.monospaceOnly
source: The terminal only supports monospace fonts. Be sure to restart VS Code if this is a newly installed font.
uk: Термінал підтримує лише моноширинні шрифти. Обов'язково перезапустіть VS Code, якщо це нововстановлений шрифт.

# terminal.useMonospace
source: Use 'monospace'
uk: Використовуйте 'monospace'

# terminalConnectingLabel
source: Starting...
uk: Початок...

# terminals
source: Open Terminals.
uk: Відкрити термінали.

# gutter
source: Gutter command decorations
uk: Декорації команд жолоба

source: No
uk: Ні

# overviewRuler
source: Overview ruler command decorations
uk: Огляд команди правителя декорацій

# rerun
source: Do you want to run the command: {0}
uk: Ви хочете виконати команду: {0}

# terminal.copyCommand
source: Copy Command
uk: Копіювати команду

# terminal.copyCommandAndOutput
source: Copy Command and Output
uk: Скопіювати команду та вихід

# terminal.copyOutput
source: Copy Output
uk: Скопіювати вихідні дані

# terminal.copyOutputAsHtml
source: Copy Output as HTML
uk: Скопіювати вихід як HTML

# terminal.learnShellIntegration
source: Learn About Shell Integration
uk: Дізнайтеся про інтеграцію Shell

# terminal.rerunCommand
source: Rerun Command
uk: Перезапустити команду

source: Toggle visibility
uk: Перемкнути видимість

# workbench.action.terminal.goToRecentDirectory
source: Go To Recent Directory
uk: Перейти до останньої директорії

# workbench.action.terminal.runRecentCommand
source: Run Recent Command
uk: Виконати останню команду

# workbench.action.terminal.toggleVisibility
source: Toggle Visibility
uk: Переключити видимість

# terminalPromptCommandFailed
source: Command executed {0} and failed
uk: Команда виконана {0} і не вдалася

# terminalPromptCommandFailed.duration
source: Command executed {0}, took {1} and failed
uk: Команда виконана {0}, зайняла {1} і завершилася невдачею

# terminalPromptCommandFailedWithExitCode
source: Command executed {0} and failed (Exit Code {1})
uk: Команда виконана {0} і не вдалася (Код виходу {1})

# terminalPromptCommandFailedWithExitCode.duration
source: Command executed {0}, took {1} and failed (Exit Code {2})
uk: Команда виконана {0}, зайняла {1} і не вдалася (Код виходу {2})

# terminalPromptCommandSuccess
source: Command executed {0}
uk: Команда виконана {0}

# terminalPromptCommandSuccess.duration
source: Command executed {0} and took {1}
uk: Команда виконана {0} і зайняла {1}

# terminalPromptContextMenu
source: Show Command Actions
uk: Показати дії команди

# terminal.integrated.copySelection.noSelection
source: The terminal has no selection to copy
uk: Термінал не має вибору для копіювання.

# vscode.extension.contributes.terminal
source: Contributes terminal functionality.
uk: Сприяє функціональності терміналу.

# vscode.extension.contributes.terminal.profiles
source: Defines additional terminal profiles that the user can create.
uk: Визначає додаткові профілі терміналів, які користувач може створити.

# vscode.extension.contributes.terminal.profiles.id
source: The ID of the terminal profile provider.
uk: Ідентифікатор постачальника профілю терміналу.

# vscode.extension.contributes.terminal.profiles.title
source: Title for this terminal profile.
uk: Назва для цього термінального профілю.

# vscode.extension.contributes.terminal.types.icon
source: A codicon, URI, or light and dark URIs to associate with this terminal type.
uk: Кодикон, URI або світлі та темні URI для асоціації з цим типом терміналу.

# vscode.extension.contributes.terminal.types.icon.dark
source: Icon path when a dark theme is used
uk: Шлях до іконки, коли використовується темна тема

# vscode.extension.contributes.terminal.types.icon.light
source: Icon path when a light theme is used
uk: Шлях до іконки, коли використовується світла тема

# terminal.ansiColor
source: '{0}' ANSI color in the terminal.
uk: '{0}' ANSI колір у терміналі.

# terminal.background
source: The background color of the terminal, this allows coloring the terminal differently to the panel.
uk: Колір фону терміналу, це дозволяє фарбувати термінал по-іншому, ніж панель.

# terminal.border
source: The color of the border that separates split panes within the terminal. This defaults to panel.border.
uk: Колір межі, що відділяє розділені панелі в терміналі. За замовчуванням це panel.border.

# terminal.dragAndDropBackground
source: Background color when dragging on top of terminals. The color should have transparency so that the terminal contents can still shine through.
uk: Колір фону під час перетягування над терміналами. Колір повинен мати прозорість, щоб вміст терміналу все ще був видимим.
