Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_dialogs.xlf
Languages: uk

source: All Files
uk: Усі файли

source: Do&&n't Save
uk: Не&& зберігати

# filterName.workspace
source: Workspace
uk: Робоча область

# noExt
source: No Extension
uk: Без розширення

# openFile.title
source: Open File
uk: Відкрити файл

# openFileOrFolder.title
source: Open File or Folder
uk: Відкрити файл або папку

# openFolder.title
source: Open Folder
uk: Відкрити папку

# openWorkspace.title
source: Open Workspace from File
uk: Відкрити робочий простір з файлу

source: &&Save
uk: &&Зберегти

source: &&Save All
uk: &&Зберегти все

# saveAsTitle
source: Save As
uk: Зберегти як

# saveChangesDetail
source: Your changes will be lost if you don't save them.
uk: Ваші зміни будуть втрачені, якщо ви їх не збережете.

# saveChangesMessage
source: Do you want to save the changes you made to {0}?
uk: Ви хочете зберегти зміни, які ви внесли до {0}?

# saveChangesMessages
source: Do you want to save the changes to the following {0} files?
uk: Ви хочете зберегти зміни до наступних {0} файлів?

# saveFileAs.title
source: Save As
uk: Зберегти як

source: &&Learn More
uk: &&Дізнатися більше

source: Open &&Files...
uk: Відкрити &&Файли...

source: &&Open Remote...
uk: &&Відкрити віддалене...

# pickFolderAndOpen
source: Can't open folders, try adding a folder to the workspace instead.
uk: Не вдається відкрити папки, спробуйте замість цього додати папку до робочого простору.

# pickWorkspaceAndOpen
source: Can't open workspaces, try adding a folder to the workspace instead.
uk: Не вдається відкрити робочі простори, спробуйте замість цього додати папку до робочого простору.

# unsupportedBrowserDetail
source: Your browser doesn't support opening local folders. You can either open single files or open a remote repository.
uk: Ваш браузер не підтримує відкриття локальних папок. Ви можете або відкрити окремі файли, або відкрити віддалений репозиторій.

# unsupportedBrowserMessage
source: Opening Local Folders is Unsupported
uk: Відкриття локальних папок не підтримується

source: Open Local File...
uk: Відкрити локальний файл...

# openLocalFileFolder
source: Open Local...
uk: Відкрити локальний...

source: Open Local Folder...
uk: Відкрити локальну папку...

# remoteFileDialog.badPath
source: The path does not exist. Use ~ to go to your home directory.
uk: Шлях не існує. Використовуйте ~, щоб перейти до вашого домашнього каталогу.

# remoteFileDialog.cancel
source: Cancel
uk: Скасувати

# remoteFileDialog.hideDotFiles
source: Hide dot files
uk: Сховати файли з крапкою

# remoteFileDialog.invalidPath
source: Please enter a valid path.
uk: Будь ласка, введіть дійсний шлях.

# remoteFileDialog.local
source: Show Local
uk: Показати локально

# remoteFileDialog.notConnectedToRemote
source: File system provider for {0} is not available.
uk: Провайдер файлової системи для {0} недоступний.

# remoteFileDialog.showDotFiles
source: Show dot files
uk: Показати файли з крапкою

# remoteFileDialog.validateBadFilename
source: Please enter a valid file name.
uk: Будь ласка, введіть дійсну назву файлу.

# remoteFileDialog.validateCreateDirectory
source: The folder {0} does not exist. Would you like to create it?
uk: Тека {0} не існує. Бажаєте її створити?

# remoteFileDialog.validateExisting
source: {0} already exists. Are you sure you want to overwrite it?
uk: {0} вже існує. Ви впевнені, що хочете перезаписати його?

# remoteFileDialog.validateFileOnly
source: Please select a file.
uk: Будь ласка, виберіть файл.

# remoteFileDialog.validateFolder
source: The folder already exists. Please use a new file name.
uk: Така папка вже існує. Будь ласка, використайте нову назву файлу.

# remoteFileDialog.validateFolderOnly
source: Please select a folder.
uk: Будь ласка, виберіть папку.

# remoteFileDialog.validateNonexistentDir
source: Please enter a path that exists.
uk: Будь ласка, введіть шлях, який існує.

# remoteFileDialog.validateReadonlyFolder
source: This folder cannot be used as a save destination. Please choose another folder
uk: Цю папку не можна використовувати як місце для збереження. Будь ласка, виберіть іншу папку.

# remoteFileDialog.windowsDriveLetter
source: Please start the path with a drive letter.
uk: Будь ласка, почніть шлях з літери диска.

source: Save Local File...
uk: Зберегти локальний файл...
