Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_tasks.xlf
Languages: uk

# TerminalTaskSystem.nonWatchingMatcher
source: Task {0} is a background task but uses a problem matcher without a background pattern
uk: Завдання {0} є фоновим завданням, але використовує матчер проблем без фонової патерни.

# TerminalTaskSystem.taskLoadReporting
source: There are issues with task "{0}". See the output for more details.
uk: Є проблеми з завданням "{0}". Дивіться вихідні дані для отримання додаткової інформації.

# TerminalTaskSystem.unknownError
source: A unknown error has occurred while executing a task. See task output log for details.
uk: Сталася невідома помилка під час виконання завдання. Дивіться журнал виводу завдання для отримання деталей.

# closeTerminal
source: Press any key to close the terminal.
uk: Натисніть будь-яку клавішу, щоб закрити термінал.

# dependencyCycle
source: There is a dependency cycle. See task "{0}".
uk: Є цикл залежностей. Дивіться завдання "{0}".

# dependencyFailed
source: Couldn't resolve dependent task '{0}' in workspace folder '{1}'
uk: Не вдалося вирішити залежне завдання '{0}' у папці робочого простору '{1}'

source: Rerun Task
uk: Перезапустити завдання

# reuseTerminal
source: Terminal will be reused by tasks, press any key to close it.
uk: Термінал буде повторно використаний завданнями, натисніть будь-яку клавішу, щоб закрити його.

# task.executing
source: Executing task: {0}
uk: Виконання задачі: {0}

# task.executing.shell-integration
source: Executing task: {0}
uk: Виконання завдання: {0}

# task.executing.shellIntegration
source: Executing task: {0}
uk: Виконання завдання: {0}

# task.executingInFolder
source: Executing task in folder {0}: {1}
uk: Виконання завдання в папці {0}: {1}

# unknownProblemMatcher
source: Problem matcher {0} can't be resolved. The matcher will be ignored
uk: Проблемний матчер {0} не може бути вирішений. Матчер буде проігнорований.

# JsonSchema.args
source: Additional arguments passed to the command.
uk: Додаткові аргументи, передані команді.

# JsonSchema.background
source: Whether the executed task is kept alive and is running in the background.
uk: Чи виконавши завдання, воно залишається активним і працює у фоновому режимі.

# JsonSchema.command
source: The command to be executed. Can be an external program or a shell command.
uk: Команда, яка буде виконана. Може бути зовнішньою програмою або командою оболонки.

# JsonSchema.echoCommand
source: Controls whether the executed command is echoed to the output. Default is false.
uk: Контролює, чи виконана команда відображається виводу. За замовчуванням - false.

# JsonSchema.matchers
source: The problem matcher(s) to use. Can either be a string or a problem matcher definition or an array of strings and problem matchers.
uk: Проблемний матчер(и), які потрібно використовувати. Може бути або рядком, або визначенням проблемного матчера, або масивом рядків і проблемних матчерів.

# JsonSchema.options
source: Additional command options
uk: Додаткові параметри команди

# JsonSchema.options.cwd
source: The current working directory of the executed program or script. If omitted Code's current workspace root is used.
uk: Поточний робочий каталог виконуваної програми або скрипту. Якщо пропущено, використовується корінь поточного робочого простору Code.

# JsonSchema.options.env
source: The environment of the executed program or shell. If omitted the parent process' environment is used.
uk: Середовище виконаної програми або оболонки. Якщо пропущено, використовується середовище батьківського процесу.

# JsonSchema.promptOnClose
source: Whether the user is prompted when VS Code closes with a running background task.
uk: Чи буде користувачеві запропоновано, коли VS Code закривається з активним фоновим завданням.

# JsonSchema.shell.args
source: The shell arguments.
uk: Аргументи оболонки.

# JsonSchema.shell.executable
source: The shell to be used.
uk: Оболонка, яка буде використовуватися.

# JsonSchema.shellConfiguration
source: Configures the shell to be used.
uk: Налаштовує оболонку, яка буде використовуватися.

# JsonSchema.showOutput
source: Controls whether the output of the running task is shown or not. If omitted 'always' is used.
uk: Контролює, чи виводити результат виконуваного завдання. Якщо пропущено, використовується 'завжди'.

# JsonSchema.suppressTaskName
source: Controls whether the task name is added as an argument to the command. Default is false.
uk: Контролює, чи ім'я завдання додається як аргумент до команди. За замовчуванням - false.

# JsonSchema.taskSelector
source: Prefix to indicate that an argument is task.
uk: Префікс, що вказує на те, що аргумент є завданням.

# JsonSchema.tasks
source: The task configurations. Usually these are enrichments of task already defined in the external task runner.
uk: Конфігурації завдань. Зазвичай це є доповненнями до завдань, вже визначених у зовнішньому виконавці завдань.

# JsonSchema.tasks.args
source: Arguments passed to the command when this task is invoked.
uk: Аргументи, передані команді, коли це завдання викликається.

# JsonSchema.tasks.background
source: Whether the executed task is kept alive and is running in the background.
uk: Чи виконавши завдання залишається активним і працює у фоновому режимі.

# JsonSchema.tasks.build
source: Maps this task to Code's default build command.
uk: Відображає це завдання на стандартну команду збірки Code.

# JsonSchema.tasks.linux
source: Linux specific command configuration
uk: Конфігурація команд, специфічних для Linux

# JsonSchema.tasks.mac
source: Mac specific command configuration
uk: Конфігурація команд, специфічних для Mac

# JsonSchema.tasks.matcherError
source: Unrecognized problem matcher. Is the extension that contributes this problem matcher installed?
uk: Невпізнаний матчер проблем. Чи встановлено розширення, яке додає цей матчер проблем?

# JsonSchema.tasks.matchers
source: The problem matcher(s) to use. Can either be a string or a problem matcher definition or an array of strings and problem matchers.
uk: Проблемний матчер(и), які потрібно використовувати. Може бути або рядком, або визначенням проблемного матчера, або масивом рядків та проблемних матчерів.

# JsonSchema.tasks.promptOnClose
source: Whether the user is prompted when VS Code closes with a running task.
uk: Чи буде користувача запитано, коли VS Code закривається з активним завданням.

# JsonSchema.tasks.showOutput
source: Controls whether the output of the running task is shown or not. If omitted the globally defined value is used.
uk: Контролює, чи показується вихід виконуваного завдання. Якщо пропущено, використовується глобально визначене значення.

# JsonSchema.tasks.suppressTaskName
source: Controls whether the task name is added as an argument to the command. If omitted the globally defined value is used.
uk: Контролює, чи ім'я завдання додається як аргумент до команди. Якщо пропущено, використовується глобально визначене значення.

# JsonSchema.tasks.taskName
source: The task's name
uk: Назва завдання

# JsonSchema.tasks.test
source: Maps this task to Code's default test command.
uk: Відображає це завдання на стандартну команду тестування Code.

# JsonSchema.tasks.watching
source: Whether the executed task is kept alive and is watching the file system.
uk: Чи виконавши завдання, воно залишається активним і спостерігає за файловою системою.

# JsonSchema.tasks.watching.deprecation
source: Deprecated. Use isBackground instead.
uk: Відміненo. Використовуйте isBackground замість цього.

# JsonSchema.tasks.windows
source: Windows specific command configuration
uk: Конфігурація команд, специфічних для Windows

# JsonSchema.watching
source: Whether the executed task is kept alive and is watching the file system.
uk: Чи виконавши завдання, воно залишається активним і спостерігає за файловою системою.

# JsonSchema.watching.deprecation
source: Deprecated. Use isBackground instead.
uk: Застаріло. Використовуйте isBackground замість цього.

# JsonSchema._runner
source: The runner has graduated. Use the official runner property
uk: Бігун закінчив навчання. Використовуйте офіційну властивість бігуна.

# JsonSchema.linux
source: Linux specific command configuration
uk: Конфігурація команд, специфічних для Linux

# JsonSchema.mac
source: Mac specific command configuration
uk: Конфігурація команд для Mac

# JsonSchema.runner
source: Defines whether the task is executed as a process and the output is shown in the output window or inside the terminal.
uk: Визначає, чи виконується задача як процес, а вихідні дані відображаються у вікні виводу або всередині терміналу.

# JsonSchema.shell
source: Specifies whether the command is a shell command or an external program. Defaults to false if omitted.
uk: Вказує, чи є команда командою оболонки, чи зовнішньою програмою. За замовчуванням дорівнює false, якщо пропущено.

# JsonSchema.version
source: The config's version number
uk: Версія номера конфігурації

# JsonSchema.version.deprecated
source: Task version 0.1.0 is deprecated. Please use 2.0.0
uk: Версія завдання 0.1.0 застаріла. Будь ласка, використовуйте 2.0.0.

# JsonSchema.windows
source: Windows specific command configuration
uk: Конфігурація команд, специфічних для Windows

# JsonSchema.args.quotedString.value
source: The actual argument value
uk: Фактичне значення аргументу

# JsonSchema.args.quotesString.quote
source: How the argument value should be quoted.
uk: Як значення аргументу повинно бути вказане в лапках.

# JsonSchema.command.quotedString.value
source: The actual command value
uk: Фактичне значення команди

# JsonSchema.command.quotesString.quote
source: How the command value should be quoted.
uk: Як слід цитувати значення команди.

# JsonSchema.commandArray
source: The shell command to be executed. Array items will be joined using a space character
uk: Команда оболонки, яка буде виконана. Елементи масиву будуть об'єднані за допомогою пробільного символу.

# JsonSchema.customizations.customizes.type
source: The task type to customize
uk: Тип завдання для налаштування

# JsonSchema.hide
source: Hide this task from the run task quick pick
uk: Сховати це завдання з швидкого вибору запуску завдань

# JsonSchema.tasks.customize.deprecated
source: The customize property is deprecated. See the 1.14 release notes on how to migrate to the new task customization approach
uk: Властивість customize застаріла. Дивіться примітки до релізу 1.14 про те, як перейти на новий підхід до налаштування завдань.

# JsonSchema.tasks.dependsOn
source: Either a string representing another task or an array of other tasks that this task depends on.
uk: Або рядок, що представляє інше завдання, або масив інших завдань, від яких залежить це завдання.

# JsonSchema.tasks.dependsOn.array
source: The other tasks this task depends on.
uk: Інші завдання, від яких залежить це завдання.

# JsonSchema.tasks.dependsOn.identifier
source: The task identifier.
uk: Ідентифікатор завдання.

# JsonSchema.tasks.dependsOn.string
source: Another task this task depends on.
uk: Інше завдання, від якого залежить це завдання.

# JsonSchema.tasks.dependsOrder
source: Determines the order of the dependsOn tasks for this task. Note that this property is not recursive.
uk: Визначає порядок завдань dependsOn для цього завдання. Зверніть увагу, що ця властивість не є рекурсивною.

# JsonSchema.tasks.dependsOrder.parallel
source: Run all dependsOn tasks in parallel.
uk: Запустіть всі завдання dependsOn паралельно.

# JsonSchema.tasks.dependsOrder.sequence
source: Run all dependsOn tasks in sequence.
uk: Запустіть всі завдання dependsOn послідовно.

# JsonSchema.tasks.detail
source: An optional description of a task that shows in the Run Task quick pick as a detail.
uk: Необов'язковий опис завдання, який відображається в швидкому виборі "Запустити завдання" як деталь.

# JsonSchema.tasks.echoCommand.deprecated
source: The property echoCommand is deprecated. Use the echo property inside the presentation property instead. See also the 1.14 release notes.
uk: Властивість echoCommand застаріла. Використовуйте властивість echo всередині властивості presentation замість цього. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.group
source: Defines to which execution group this task belongs to. It supports "build" to add it to the build group and "test" to add it to the test group.
uk: Визначає, до якої групи виконання належить це завдання. Підтримує "build", щоб додати його до групи збірки, та "test", щоб додати його до групи тестування.

# JsonSchema.tasks.group.build
source: Marks the task as a build task accessible through the 'Run Build Task' command.
uk: Позначає задачу як задачу збірки, доступну через команду 'Запустити задачу збірки'.

# JsonSchema.tasks.group.defaultBuild
source: Marks the task as the default build task.
uk: Позначає задачу як задачу за замовчуванням для збірки.

# JsonSchema.tasks.group.defaultTest
source: Marks the task as the default test task.
uk: Позначає завдання як завдання тестування за замовчуванням.

# JsonSchema.tasks.group.isDefault
source: Defines if this task is the default task in the group, or a glob to match the file which should trigger this task.
uk: Визначає, чи є це завдання за замовчуванням у групі, або шаблон для відповідності файлу, який має активувати це завдання.

# JsonSchema.tasks.group.kind
source: The task's execution group.
uk: Група виконання завдання.

# JsonSchema.tasks.group.none
source: Assigns the task to no group
uk: Призначає завдання жодній групі

# JsonSchema.tasks.group.test
source: Marks the task as a test task accessible through the 'Run Test Task' command.
uk: Позначає задачу як тестову задачу, доступну через команду 'Запустити тестову задачу'.

# JsonSchema.tasks.icon
source: An optional icon for the task
uk: Додаткова іконка для завдання

# JsonSchema.tasks.icon.color
source: An optional color of the icon
uk: Додатковий колір іконки

# JsonSchema.tasks.icon.id
source: An optional codicon ID to use
uk: Необов'язковий ідентифікатор codicon для використання

# JsonSchema.tasks.identifier
source: A user defined identifier to reference the task in launch.json or a dependsOn clause.
uk: Ідентифікатор, визначений користувачем, для посилання на задачу в launch.json або в клаузі dependsOn.

# JsonSchema.tasks.identifier.deprecated
source: User defined identifiers are deprecated. For custom task use the name as a reference and for tasks provided by extensions use their defined task identifier.
uk: Користувацькі ідентифікатори застаріли. Для користувацьких завдань використовуйте ім'я як посилання, а для завдань, наданих розширеннями, використовуйте їх визначений ідентифікатор завдання.

# JsonSchema.tasks.instanceLimit
source: The number of instances of the task that are allowed to run simultaneously.
uk: Кількість екземплярів завдання, які можуть виконуватись одночасно.

# JsonSchema.tasks.isBuildCommand.deprecated
source: The property isBuildCommand is deprecated. Use the group property instead. See also the 1.14 release notes.
uk: Властивість isBuildCommand застаріла. Використовуйте замість неї властивість group. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.isShellCommand.deprecated
source: The property isShellCommand is deprecated. Use the type property of the task and the shell property in the options instead. See also the 1.14 release notes.
uk: Властивість isShellCommand застаріла. Замість цього використовуйте властивість type завдання та властивість shell в опціях. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.isTestCommand.deprecated
source: The property isTestCommand is deprecated. Use the group property instead. See also the 1.14 release notes.
uk: Властивість isTestCommand застаріла. Замість цього використовуйте властивість group. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.label
source: The task's user interface label
uk: Мітка інтерфейсу користувача завдання

# JsonSchema.tasks.presentation
source: Configures the panel that is used to present the task's output and reads its input.
uk: Налаштовує панель, яка використовується для відображення виходу завдання та зчитування його вводу.

# JsonSchema.tasks.presentation.clear
source: Controls whether the terminal is cleared before executing the task.
uk: Контролює, чи очищується термінал перед виконанням завдання.

# JsonSchema.tasks.presentation.close
source: Controls whether the terminal the task runs in is closed when the task exits.
uk: Контролює, чи закривається термінал, в якому виконується завдання, коли завдання завершується.

# JsonSchema.tasks.presentation.echo
source: Controls whether the executed command is echoed to the panel. Default is true.
uk: Контролює, чи виконана команда відображається на панелі. За замовчуванням - true.

# JsonSchema.tasks.presentation.focus
source: Controls whether the panel takes focus. Default is false. If set to true the panel is revealed as well.
uk: Контролює, чи панель отримує фокус. За замовчуванням - false. Якщо встановлено true, панель також відображається.

# JsonSchema.tasks.presentation.group
source: Controls whether the task is executed in a specific terminal group using split panes.
uk: Контролює, чи виконується завдання в конкретній групі терміналів, використовуючи розділені панелі.

# JsonSchema.tasks.presentation.instance
source: Controls if the panel is shared between tasks, dedicated to this task or a new one is created on every run.
uk: Контролює, чи панель спільна між завданнями, присвячена цьому завданню, чи нова створюється при кожному запуску.

# JsonSchema.tasks.presentation.reveal
source: Controls whether the terminal running the task is revealed or not. May be overridden by option "revealProblems". Default is "always".
uk: Контролює, чи термінал, що виконує завдання, буде показано чи ні. Може бути переважено опцією "revealProblems". За замовчуванням - "завжди".

# JsonSchema.tasks.presentation.reveal.always
source: Always reveals the terminal when this task is executed.
uk: Завжди відкриває термінал, коли це завдання виконується.

# JsonSchema.tasks.presentation.reveal.never
source: Never reveals the terminal when this task is executed.
uk: Ніколи не показує термінал, коли це завдання виконується.

# JsonSchema.tasks.presentation.reveal.silent
source: Only reveals the terminal if the task exits with an error or the problem matcher finds an error.
uk: Відображає термінал лише у випадку, якщо задача завершується з помилкою або якщо матчер проблем знаходить помилку.

# JsonSchema.tasks.presentation.revealProblems
source: Controls whether the problems panel is revealed when running this task or not. Takes precedence over option "reveal". Default is "never".
uk: Контролює, чи панель проблем відображається під час виконання цього завдання. Має пріоритет над опцією "показати". За замовчуванням - "ніколи".

# JsonSchema.tasks.presentation.revealProblems.always
source: Always reveals the problems panel when this task is executed.
uk: Завжди показує панель проблем, коли це завдання виконується.

# JsonSchema.tasks.presentation.revealProblems.never
source: Never reveals the problems panel when this task is executed.
uk: Ніколи не показує панель проблем, коли це завдання виконується.

# JsonSchema.tasks.presentation.revealProblems.onProblem
source: Only reveals the problems panel if a problem is found.
uk: Відображає панель проблем лише у разі виявлення проблеми.

# JsonSchema.tasks.presentation.showReuseMessage
source: Controls whether to show the `Terminal will be reused by tasks, press any key to close it` message.
uk: Контролює, чи показувати повідомлення `Термінал буде повторно використано завданнями, натисніть будь-яку клавішу, щоб закрити його`.

# JsonSchema.tasks.quoting.escape
source: Escapes characters using the shell's escape character (e.g. ` under PowerShell and \ under bash).
uk: Екранує символи, використовуючи символ екранування оболонки (наприклад, ` під PowerShell та \ під bash).

# JsonSchema.tasks.quoting.strong
source: Quotes the argument using the shell's strong quote character (e.g. ' under PowerShell and bash).
uk: Цитує аргумент, використовуючи символ сильних лапок оболонки (наприклад, ' в PowerShell та bash).

# JsonSchema.tasks.quoting.weak
source: Quotes the argument using the shell's weak quote character (e.g. " under PowerShell and bash).
uk: Цитує аргумент, використовуючи слабкий символ цитування оболонки (наприклад, " під PowerShell та bash).

# JsonSchema.tasks.reevaluateOnRerun
source: Whether to reevaluate task variables on rerun.
uk: Чи потрібно переоцінювати змінні завдання при повторному запуску.

# JsonSchema.tasks.runOn
source: Configures when the task should be run. If set to folderOpen, then the task will be run automatically when the folder is opened.
uk: Налаштовує, коли завдання має бути виконано. Якщо встановлено folderOpen, то завдання буде виконано автоматично, коли папка буде відкрита.

# JsonSchema.tasks.runOptions
source: The task's run related options
uk: Опції, пов'язані з виконанням завдання

# JsonSchema.tasks.showOutput.deprecated
source: The property showOutput is deprecated. Use the reveal property inside the presentation property instead. See also the 1.14 release notes.
uk: Властивість showOutput застаріла. Замість цього використовуйте властивість reveal всередині властивості presentation. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.suppressTaskName.deprecated
source: The property suppressTaskName is deprecated. Inline the command with its arguments into the task instead. See also the 1.14 release notes.
uk: Властивість suppressTaskName застаріла. Включіть команду з її аргументами безпосередньо в завдання. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.taskLabel
source: The task's label
uk: Мітка завдання

# JsonSchema.tasks.taskName.deprecated
source: The task's name property is deprecated. Use the label property instead.
uk: Властивість name завдання застаріла. Замість цього використовуйте властивість label.

# JsonSchema.tasks.taskSelector.deprecated
source: The property taskSelector is deprecated. Inline the command with its arguments into the task instead. See also the 1.14 release notes.
uk: Властивість taskSelector застаріла. Включіть команду з її аргументами безпосередньо в задачу. Дивіться також примітки до випуску 1.14.

# JsonSchema.tasks.terminal
source: The terminal property is deprecated. Use presentation instead
uk: Властивість terminal застаріла. Використовуйте presentation замість цього.

# JsonSchema.tasks.type
source: Defines whether the task is run as a process or as a command inside a shell.
uk: Визначає, чи виконується завдання як процес або як команда всередині оболонки.

# JsonSchema.version
source: The config's version number.
uk: Версія номера конфігурації

# LegacyProblemMatcherSchema.watchedBegin
source: A regular expression signaling that a watched tasks begins executing triggered through file watching.
uk: Регулярний вираз, що сигналізує про початок виконання спостережуваного завдання, яке було ініційоване через моніторинг файлів.

# LegacyProblemMatcherSchema.watchedBegin.deprecated
source: This property is deprecated. Use the watching property instead.
uk: Ця властивість застаріла. Використовуйте замість неї властивість watching.

# LegacyProblemMatcherSchema.watchedEnd
source: A regular expression signaling that a watched tasks ends executing.
uk: Регулярний вираз, що сигналізує про завершення виконання спостережуваного завдання.

# LegacyProblemMatcherSchema.watchedEnd.deprecated
source: This property is deprecated. Use the watching property instead.
uk: Ця властивість застаріла. Замість неї використовуйте властивість watching.

# NamedMultiLineProblemPatternSchema.name
source: The name of the problem multi line problem pattern.
uk: Назва проблеми - шаблон багаторядкової проблеми.

# NamedMultiLineProblemPatternSchema.patterns
source: The actual patterns.
uk: Фактичні шаблони.
