Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_contrib_userDataProfile.xlf
Languages: uk

# New Profile Window
source: New Window with Profile
uk: Новий вікно з профілем

# change profile
source: Switch to {0} profile
uk: Переключитися на профіль {0}

# create profile
source: New Profile...
uk: Новий профіль...

source: Current
uk: Поточний

source: Delete Profile...
uk: Видалити профіль...

# delete specific profile
source: Delete Profile...
uk: Видалити профіль...

source: Export Profile...
uk: Експорт профілю...

# export profile in share
source: Export Profile ({0})...
uk: Експорт профілю ({0})...

# manage profiles
source: Profiles
uk: Профілі

# miOpenProfiles
source: &&Profiles
uk: &&Профілі

source: New Window with Profile
uk: Новий вікно з профілем

source: New Window with Profile...
uk: Новий вікно з профілем...

# open
source: Open {0} Profile
uk: Відкрити профіль {0}

# open profile
source: Open New Window with {0} Profile
uk: Відкрити нове вікно з профілем {0}

# open profiles
source: Open Profiles (UI)
uk: Відкриті профілі (UI)

# pick profile
source: Select Profile
uk: Вибрати профіль

# pick profile to delete
source: Select Profiles to Delete
uk: Виберіть профілі для видалення

# profiles
source: Profile ({0})
uk: Профіль ({0})

# save profile as
source: Save Current Profile As...
uk: Зберегти поточний профіль як...

source: Select Profile
uk: Вибрати профіль

source: Switch Profile...
uk: Переключити профіль...

# userdataprofilesEditor
source: Profiles Editor
uk: Редактор профілів

# cleanup profile
source: Cleanup Profiles
uk: Очищення профілів

# create temporary profile
source: Create a Temporary Profile
uk: Створити тимчасовий профіль

# reset workspaces
source: Reset Workspace Profiles Associations
uk: Скинути асоціації профілів робочого простору

# activeProfile
source: Active
uk: Активний

# addButton
source: Add Folder
uk: Додати папку

source: Add Folder
uk: Додати папку

# addFolderTitle
source: Select Folders To Add
uk: Виберіть папки для додавання

source: Change Profile
uk: Переключитися на профіль {0}

# changeIcon
source: Click to change icon
uk: Натисніть, щоб змінити значок

source: Contents
uk: Зміст

# contents source description
source: Configure source of contents for this profile
uk: Налаштуйте джерело вмісту для цього профілю

# copy description
source: Copy
uk: Копіювати

# copy from default
source: {0} (Copy)
uk: {0} (Копіювати)

# copy from description
source: Select the profile source from which you want to copy contents
uk: Виберіть джерело профілю, з якого ви хочете скопіювати вміст.

# copy from profile description
source: Copy {0} from the {1} profile
uk: Скопіювати {0} з профілю {1}

# copy info
source: - *{0}:* Copy contents from the {1} profile
uk: - *{0}:* Скопіювати вміст з профілю {1}

source: Copy profile from
uk: Скопіювати профіль з

# create from
source: Copy from
uk: Скопіювати з

# current description
source: Use {0} from the {1} profile
uk: Використовуйте {0} з профілю {1}

source: Default
uk: За замовчуванням

# default description
source: Use {0} from the Default profile
uk: Використовуйте {0} з профілю за замовчуванням

# default info
source: - *Default:* Use contents from the Default profile
uk: - *За замовчуванням:* Використовуйте вміст з профілю за замовчуванням

# default profile contents description
source: Browse contents of this profile
uk: Переглянути вміст цього профілю

# defaultProfileIcon
source: Icon cannot be changed for the default profile
uk: Іконку не можна змінити для профілю за замовчуванням.

# defaultProfileName
source: Name cannot be changed for the default profile
uk: Ім'я не може бути змінене для профілю за замовчуванням.

# deleteTrustedUri
source: Delete Path
uk: Видалити шлях

# editIcon
source: Icon for the edit folder icon in the profiles editor.
uk: Іконка для іконки редагування папки в редакторі профілів.

# empty profile
source: None
uk: Немає

# enable for current window
source: Use this profile for the current window
uk: Використовуйте цей профіль для поточного вікна

# enable for new windows
source: Use this profile as the default for new windows
uk: Використовуйте цей профіль як стандартний для нових вікон

source: Extensions
uk: Розширення

source: Folders & Workspaces
uk: Папки та Робочі простори

# folders_workspaces_description
source: Following folders and workspaces are using this profile
uk: Наступні папки та робочі простори використовують цей профіль.

# from existing profiles
source: Existing Profiles
uk: Існуючі профілі

source: From Template
uk: З Шаблону

# from templates
source: Profile Templates
uk: Шаблони профілю

# hostColumnLabel
source: Host
uk: Хост

# icon
source: Profile Icon
uk: Іконка профілю

# icon-description
source: Profile icon to be shown in the activity bar
uk: Іконка профілю, яка буде показана в панелі активності

# icon-label
source: Icon
uk: Іконка

# import from file
source: Select File...
uk: Вибрати файл...

source: Import from URL
uk: Імпортувати з URL

# import profile dialog
source: Select Profile Template File
uk: Виберіть файл шаблону профілю

# import profile placeholder
source: Provide Profile Template URL
uk: Надайте URL шаблону профілю

# import profile quick pick title
source: Import from Profile Template...
uk: Імпортувати з шаблону профілю...

source: Import Profile...
uk: Імпорт профілю...

# keybindings
source: Keyboard Shortcuts
uk: Комбінації клавіш

# localAuthority
source: Local
uk: Локальний

source: Name
uk: Ім'я

# name required
source: Profile name is required and must be a non-empty value.
uk: Ім'я профілю є обов'язковим і повинно бути непорожнім значенням.

# new from template
source: New Profile From Template
uk: Новий профіль з шаблону

source: New Profile
uk: Новий профіль

# no_folder_description
source: No folders or workspaces are using this profile
uk: Немає папок або робочих просторів, які використовують цей профіль.

source: None
uk: Ні

# none description
source: Create empty {0}
uk: Створити порожній {0}

# none info
source: - *None:* Create empty contents
uk: - *Немає:* Створити порожній вміст

# open
source: Open in New Window
uk: Відкрити профіль {0}

# options
source: Source
uk: Джерело

# pathColumnLabel
source: Path
uk: Шлях

# profileExists
source: Profile with name {0} already exists.
uk: Профіль з ім'ям {0} вже існує.

source: Profile Name
uk: Ім'я профілю

source: Profiles
uk: Профіль ({0})

# profilesSashBorder
source: The color of the Profiles editor splitview sash border.
uk: Колір межі роздільника перегляду редактора Профілів.

# removeIcon
source: Icon for the remove folder icon in the profiles editor.
uk: Іконка для видалення папки в редакторі профілів.

source: Settings
uk: Налаштування

source: Snippets
uk: Фрагменти

source: Tasks
uk: Завдання

# trustedFolderAriaLabel
source: {0}, trusted
uk: {0}, надійний

# trustedFolderWithHostAriaLabel
source: {0} on {1}, trusted
uk: {0} на {1}, надійний

# trustedFoldersAndWorkspaces
source: Trusted Folders & Workspaces
uk: Довірені папки та робочі простори

# use for curren window
source: Use for Current Window
uk: Використовувати для поточного вікна

source: Use for New Windows
uk: Використовуйте для нових вікон

# userDataProfiles
source: Profiles
uk: Профілі

# active
source: Use this Profile for Current Window
uk: Використовуйте цей профіль для поточного вікна

# applyToAllProfiles
source: Apply Extension to all Profiles
uk: Застосувати розширення до всіх профілів

source: Cancel
uk: Скасувати

# copy from
source: {0} (Copy)
uk: {0} (Копіювати)

# copyFromProfile
source: Duplicate...
uk: Дублювати...

source: Create
uk: Створити

source: Delete
uk: Видалити

# deleteProfile
source: Are you sure you want to delete the profile '{0}'?
uk: Ви впевнені, що хочете видалити профіль '{0}'?

# discard
source: Discard & Create
uk: Видалити та створити

source: Export...
uk: Експорт...

# import in desktop
source: Create in {0}
uk: Створити в {0}

# invalid configurations
source: The profile should contain at least one configuration.
uk: Профіль повинен містити принаймні одну конфігурацію.

# new profile exists
source: A new profile is already being created. Do you want to discard it and create a new one?
uk: Новий профіль вже створюється. Ви хочете скасувати його і створити новий?

# open
source: Open to the Side
uk: Відкрити профіль {0}

# open new window
source: Open New Window with this Profile
uk: Відкрити нове вікно з цим профілем

source: Preview
uk: Попередній перегляд

source: Replace
uk: Замінити

source: Untitled
uk: Без назви
