Repository: mrkaktuz/vscode-language-pack-uk
Catalog: vscode-workbench/*/vs_workbench_services_editor.xlf
Languages: uk

# editorResolver.configureDefault
source: Configure Default
uk: Налаштувати за замовчуванням

# editorResolver.conflictingDefaults
source: There are multiple default editors available for the resource.
uk: Існує кілька редакторів за замовчуванням, доступних для ресурсу.

# editorResolver.keepDefault
source: Keep {0}
uk: Залишити {0}

# promptOpenWith.configureDefault
source: Configure default editor for '{0}'...
uk: Налаштуйте редактор за замовчуванням для '{0}'...

# promptOpenWith.currentDefault
source: Default
uk: За замовчуванням

# promptOpenWith.currentDefaultAndActive
source: Active and Default
uk: Активний та за замовчуванням

# promptOpenWith.currentlyActive
source: Active
uk: Активний

# promptOpenWith.placeHolder
source: Select editor for '{0}'
uk: Виберіть редактор для '{0}'

# promptOpenWith.updateDefaultPlaceHolder
source: Select new default editor for '{0}'
uk: Виберіть новий редактор за замовчуванням для '{0}'

# editor.editorAssociations
source: Configure [glob patterns](https://aka.ms/vscode-glob-patterns) to editors (for example `"*.hex": "hexEditor.hexedit"`). These have precedence over the default behavior.
uk: Налаштуйте [глобальні шаблони](https://aka.ms/vscode-glob-patterns) для редакторів (наприклад, `"*.hex": "hexEditor.hexedit"`). Вони мають пріоритет над стандартною поведінкою.
